{
    "title": "How to Ride a Horse in the Winter",
    "url": "https://www.wikihow.com/Ride-a-Horse-in-the-Winter",
    "category_hierarchy": [
        "Pets and Animals",
        "Horses",
        "Buying and Owning a Horse",
        "Seasonal Horse Care"
    ],
    "methods": [
        {
            "name": "Choosing the Right Terrain",
            "steps": [
                {
                    "headline": "Pick a trail or pasture that doesn't have ice, mud, and other hazards.",
                    "description": "The biggest dangers for your horse during winter riding include slipping on ice, falling into unseen holes or dips, getting stuck in deep mud, and tripping over hidden obstacles. Make sure your trail is free of these risks before you take your horse out for a ride. It’s best to stick to familiar trails for winter rides, as you’ll know what to expect. You might walk the area if you're riding in your pasture or on a trail near your stables. If walking the area is not an option, talk to other riders to find out where they're riding, as well as the condition of the trails."
                },
                {
                    "headline": "Apply de-icing agents like salt or sawdust to icy or slippery areas.",
                    "description": "Ash, sand, and grit also make great de-icing agents. Use a wheel barrow or cart to carry the de-icing agent to your stable area, pasture, or trail to treat the ice. Sprinkle the agent over icy surfaces before your ride to help provide traction over the ice. Use your best judgement. If your area is very icy, only ride on the land you treated with a de-icing agent. As another option, you might carry de-icing agent in your saddle bags during your ride just in case you encounter an unexpected patch of ice. Don’t just treat the path where you plan to ride your horse. Put your de-icing agent around the stable, doorway, and tacking area, as well. If your horse will walk there, make sure it’s treated."
                },
                {
                    "headline": "Avoid areas that may have holes, roots, or branches hidden by snow.",
                    "description": "Deep snow is dangerous for your horse because it can hide hazards. Additionally, it’s hard for your horse to walk through because it takes a lot of effort. Stick to areas that have a light layer of snow or are free of snow. A light layer of snow is usually safe to ride through. If you’re not sure how deep the snow is, push a stick down into it to see how far it goes. Choose a trail you know well so it’s easier for you to estimate how much snow is on the ground. Stick to trails that other riders have already passed over during the winter, since the snow in those areas will already be packed down and safer to ride on."
                },
                {
                    "headline": "Choose flat trails during icy and wet conditions.",
                    "description": "Riding up and down slopes that may be icy or wet is very dangerous, as they may become slippery, especially as the water freezes. Your horse may lose its footing and fall down, which can injure you or your horse. Keep in mind that riding up the slope is often much easier than coming back down. It's best just to avoid them altogether."
                },
                {
                    "headline": "Avoid areas with deep mud.",
                    "description": "Don’t ride your horse over terrain that's very muddy, as your horse will sink into the mud. Your horse can become stuck and may struggle to walk with mud clumped around its hooves. A thin layer of mud is usually okay. Just pay attention to how your horse is walking to see if it's struggling with the mud. If deep mud is everywhere, you can ride early in the morning when the top layer is hardest. After the sun warms it up, however, riding can be dangerous."
                },
                {
                    "headline": "Ride in an arena if you have trouble finding safe trails.",
                    "description": "An arena offers you a safe, warm riding opportunity. This helps you keep your horse fit throughout the winter. It’s a great option if you can rent time at a nearby arena. To make your rides more interesting, you can set up obstacles for your horse. For example, you might navigate your horse around barrels set up in the arena."
                }
            ]
        },
        {
            "name": "Preparing Your Horse for a Winter Ride",
            "steps": [
                {
                    "headline": "Warm up your horse’s bit before you tack up for your ride.",
                    "description": "Take the bit out of the bridle and hold it under a stream of hot water. Remove it from the water once it feels warm to the touch. Then, put it back in the bridle and tack up. If you can, keep your horse’s bit in your home during the winter. As another option, you can rub non-toxic hand warmer onto the bit or place the bit in your pocket against your skin."
                },
                {
                    "headline": "Cover your horse’s back with a waterproof wool or fleece quarter sheet.",
                    "description": "Your quarter sheet will go either between the saddle pad and saddle or over the saddle, depending on the type you have. This will keep your horse’s back and hindquarters warm and dry. If your horse gets wet, it will become very cold because the wetness will freeze."
                },
                {
                    "headline": "Put on hoof boots to protect the hooves from the icy ground, if you have them.",
                    "description": "Choose boots that are made of neoprene or PVC, which protect your horse from moisture. Don’t use fabric boots, as the wetness from ice and snow will soak into them and then freeze. As an alternative, you can put pads beneath the hooves for added protection. If you don’t have boots or pads, apply a thin layer of nonstick cooking spray or petroleum jelly to your horse’s hooves to repel ice buildup. However, keep in mind that this won't protect your horse as well as boots and pads will."
                }
            ]
        },
        {
            "name": "Handling Your Horse in Winter Conditions",
            "steps": [
                {
                    "headline": "Allow your horse to warm up slowly.",
                    "description": "Walk it around for a few minutes before you mount. Then, start your trail at a very slow pace. This lets its muscles warm up before your horse starts working hard. To speed up the process, put on gloves and vigorously rub your horse’s legs and back before you tack up."
                },
                {
                    "headline": "Shorten the length of your rides, since your horse is working harder.",
                    "description": "Cold weather makes your horse expend more energy, especially if it’s walking through snow or mud. That means it will tire out more quickly, so don’t ride for as long as you usually do. Use your best judgement when deciding how long to ride. It’s best to stay close to the stables so you can stop if you notice your horse panting or huffing."
                },
                {
                    "headline": "Avoid brushing against snow-covered vegetation, which may cause chill.",
                    "description": "Snow can transfer from bushes, trees, shrubs, and other foliage onto your horse as you’re traveling past it. This can cause your horse to develop a chill. Steer clear of these types of obstacles during your ride. This will also help you stay warm! Another good reason to avoid brushing snowy branches is that the falling snow might spook your horse."
                },
                {
                    "headline": "Go slowly so your horse sweats less, which limits the risk of chill.",
                    "description": "Even though it’s cold, your horse may sweat during your ride because it’s getting a lot of exercise. Unfortunately, this sweat can start to freeze, which may make your horse feel a chill. Slowing your pace can reduce how hard your horse is working, making it sweat less. Blanketing your horse can also help you prevent chill, even if your horse is sweating."
                },
                {
                    "headline": "Watch your horse for tiredness, as walking in winter requires more effort.",
                    "description": "Notice if your horse is panting, huffing, or struggling to get through the terrain. Even a fit horse will tire out more quickly during a winter ride. Don’t overwork your horse. It’s dangerous for both you and your horse if you push it too hard during a ride. You don’t want to get stranded out on a trail."
                }
            ]
        },
        {
            "name": "Tending to Your Horse After a Ride",
            "steps": [
                {
                    "headline": "Cool down your horse for 10-15 minutes after your ride.",
                    "description": "Your horse still needs to cool down after a workout. Start the cool down by walking your horse slowly over the last few minutes of your ride. Then, dismount and loosen the girth without removing it, which would allow the cold air to chill the horse too quickly. Next, switch out the saddle for a wool or fleece breathable sheet or cooler, which will wick away the wetness and warm the horse. Wetness on your horse’s coat will chill your horse, even after it’s back in its stable."
                },
                {
                    "headline": "Use a hoof pick to remove ice and mud from the hooves, if necessary.",
                    "description": "Knock any built-up ice or mud off of your horse’s hooves. Then, use the end of the pick to gently clean out any crevices, such as around the horse’s shoes. Ice and mud that remain on the hooves can make it harder for your horse to walk. They can also undermine your horse’s health by increasing your horse’s risk of developing an infection."
                },
                {
                    "headline": "Brush your horse to remove ice, dirt, and mud from the coat.",
                    "description": "This also helps prevent dirt and debris from building up on the horse’s skin. As your brush your horse, check for wetness so you can dry off your horse if necessary. You don’t want it to catch a chill. Put warm, breathable blankets made from wool or fleece on your horse to keep it warm as you groom it. You might also apply leg wraps."
                },
                {
                    "headline": "Give your horse water heated to 50 °F (10 °C) to replenish lost fluids.",
                    "description": "Your horse may easily get dehydrated during the winter. It will still be working hard, plus it may be less likely to drink if the water freezes. Using a water heater will encourage your horse to drink. Warming the water also lowers the amount of calories your horse needs to eat. That’s because your horse’s body will need to warm up cold water to its body temperature, which takes energy. If you give your horse warm water, its body won’t have to warm it."
                },
                {
                    "headline": "Provide your horse with fresh hay to meet its higher energy needs.",
                    "description": "Hay is the best feed for your horse. Feed it at least as much as you typically feed it during warmer months. However, you may need to provide additional hay to meet your horse’s winter needs. Ask your equine vet for advice on how much extra hay your horse needs during winter. You can also provide grain-mix supplementation if you normally do. Ask your vet if your horse needs grains."
                }
            ]
        }
    ],
    "tyn": [
        "Salt, sawdust, ash, sand, or grit",
        "Hot water",
        "Hand warmer (optional)",
        "Waterproof wool or fleece quarter sheet",
        "Neoprene or PVC hoof boots",
        "Hoof pads (optional)",
        "Non-stick cooking spray or petroleum jelly (optional)",
        "Wool or fleece breathable sheet or cooler",
        "Hoof pick",
        "Brush",
        "Water heater",
        "Fresh drinking water",
        "Hay"
    ],
    "text": " Choosing the Right Terrain Pick a trail or pasture that doesn't have ice, mud, and other hazards. The biggest dangers for your horse during winter riding include slipping on ice, falling into unseen holes or dips, getting stuck in deep mud, and tripping over hidden obstacles. Make sure your trail is free of these risks before you take your horse out for a ride. It’s best to stick to familiar trails for winter rides, as you’ll know what to expect. You might walk the area if you're riding in your pasture or on a trail near your stables. If walking the area is not an option, talk to other riders to find out where they're riding, as well as the condition of the trails. Apply de-icing agents like salt or sawdust to icy or slippery areas. Ash, sand, and grit also make great de-icing agents. Use a wheel barrow or cart to carry the de-icing agent to your stable area, pasture, or trail to treat the ice. Sprinkle the agent over icy surfaces before your ride to help provide traction over the ice. Use your best judgement. If your area is very icy, only ride on the land you treated with a de-icing agent. As another option, you might carry de-icing agent in your saddle bags during your ride just in case you encounter an unexpected patch of ice. Don’t just treat the path where you plan to ride your horse. Put your de-icing agent around the stable, doorway, and tacking area, as well. If your horse will walk there, make sure it’s treated. Avoid areas that may have holes, roots, or branches hidden by snow. Deep snow is dangerous for your horse because it can hide hazards. Additionally, it’s hard for your horse to walk through because it takes a lot of effort. Stick to areas that have a light layer of snow or are free of snow. A light layer of snow is usually safe to ride through. If you’re not sure how deep the snow is, push a stick down into it to see how far it goes. Choose a trail you know well so it’s easier for you to estimate how much snow is on the ground. Stick to trails that other riders have already passed over during the winter, since the snow in those areas will already be packed down and safer to ride on. Choose flat trails during icy and wet conditions. Riding up and down slopes that may be icy or wet is very dangerous, as they may become slippery, especially as the water freezes. Your horse may lose its footing and fall down, which can injure you or your horse. Keep in mind that riding up the slope is often much easier than coming back down. It's best just to avoid them altogether. Avoid areas with deep mud. Don’t ride your horse over terrain that's very muddy, as your horse will sink into the mud. Your horse can become stuck and may struggle to walk with mud clumped around its hooves. A thin layer of mud is usually okay. Just pay attention to how your horse is walking to see if it's struggling with the mud. If deep mud is everywhere, you can ride early in the morning when the top layer is hardest. After the sun warms it up, however, riding can be dangerous. Ride in an arena if you have trouble finding safe trails. An arena offers you a safe, warm riding opportunity. This helps you keep your horse fit throughout the winter. It’s a great option if you can rent time at a nearby arena. To make your rides more interesting, you can set up obstacles for your horse. For example, you might navigate your horse around barrels set up in the arena. Preparing Your Horse for a Winter Ride Warm up your horse’s bit before you tack up for your ride. Take the bit out of the bridle and hold it under a stream of hot water. Remove it from the water once it feels warm to the touch. Then, put it back in the bridle and tack up. If you can, keep your horse’s bit in your home during the winter. As another option, you can rub non-toxic hand warmer onto the bit or place the bit in your pocket against your skin. Cover your horse’s back with a waterproof wool or fleece quarter sheet. Your quarter sheet will go either between the saddle pad and saddle or over the saddle, depending on the type you have. This will keep your horse’s back and hindquarters warm and dry. If your horse gets wet, it will become very cold because the wetness will freeze. Put on hoof boots to protect the hooves from the icy ground, if you have them. Choose boots that are made of neoprene or PVC, which protect your horse from moisture. Don’t use fabric boots, as the wetness from ice and snow will soak into them and then freeze. As an alternative, you can put pads beneath the hooves for added protection. If you don’t have boots or pads, apply a thin layer of nonstick cooking spray or petroleum jelly to your horse’s hooves to repel ice buildup. However, keep in mind that this won't protect your horse as well as boots and pads will. Handling Your Horse in Winter Conditions Allow your horse to warm up slowly. Walk it around for a few minutes before you mount. Then, start your trail at a very slow pace. This lets its muscles warm up before your horse starts working hard. To speed up the process, put on gloves and vigorously rub your horse’s legs and back before you tack up. Shorten the length of your rides, since your horse is working harder. Cold weather makes your horse expend more energy, especially if it’s walking through snow or mud. That means it will tire out more quickly, so don’t ride for as long as you usually do. Use your best judgement when deciding how long to ride. It’s best to stay close to the stables so you can stop if you notice your horse panting or huffing. Avoid brushing against snow-covered vegetation, which may cause chill. Snow can transfer from bushes, trees, shrubs, and other foliage onto your horse as you’re traveling past it. This can cause your horse to develop a chill. Steer clear of these types of obstacles during your ride. This will also help you stay warm! Another good reason to avoid brushing snowy branches is that the falling snow might spook your horse. Go slowly so your horse sweats less, which limits the risk of chill. Even though it’s cold, your horse may sweat during your ride because it’s getting a lot of exercise. Unfortunately, this sweat can start to freeze, which may make your horse feel a chill. Slowing your pace can reduce how hard your horse is working, making it sweat less. Blanketing your horse can also help you prevent chill, even if your horse is sweating. Watch your horse for tiredness, as walking in winter requires more effort. Notice if your horse is panting, huffing, or struggling to get through the terrain. Even a fit horse will tire out more quickly during a winter ride. Don’t overwork your horse. It’s dangerous for both you and your horse if you push it too hard during a ride. You don’t want to get stranded out on a trail. Tending to Your Horse After a Ride Cool down your horse for 10-15 minutes after your ride. Your horse still needs to cool down after a workout. Start the cool down by walking your horse slowly over the last few minutes of your ride. Then, dismount and loosen the girth without removing it, which would allow the cold air to chill the horse too quickly. Next, switch out the saddle for a wool or fleece breathable sheet or cooler, which will wick away the wetness and warm the horse. Wetness on your horse’s coat will chill your horse, even after it’s back in its stable. Use a hoof pick to remove ice and mud from the hooves, if necessary. Knock any built-up ice or mud off of your horse’s hooves. Then, use the end of the pick to gently clean out any crevices, such as around the horse’s shoes. Ice and mud that remain on the hooves can make it harder for your horse to walk. They can also undermine your horse’s health by increasing your horse’s risk of developing an infection. Brush your horse to remove ice, dirt, and mud from the coat. This also helps prevent dirt and debris from building up on the horse’s skin. As your brush your horse, check for wetness so you can dry off your horse if necessary. You don’t want it to catch a chill. Put warm, breathable blankets made from wool or fleece on your horse to keep it warm as you groom it. You might also apply leg wraps. Give your horse water heated to 50 °F (10 °C) to replenish lost fluids. Your horse may easily get dehydrated during the winter. It will still be working hard, plus it may be less likely to drink if the water freezes. Using a water heater will encourage your horse to drink. Warming the water also lowers the amount of calories your horse needs to eat. That’s because your horse’s body will need to warm up cold water to its body temperature, which takes energy. If you give your horse warm water, its body won’t have to warm it. Provide your horse with fresh hay to meet its higher energy needs. Hay is the best feed for your horse. Feed it at least as much as you typically feed it during warmer months. However, you may need to provide additional hay to meet your horse’s winter needs. Ask your equine vet for advice on how much extra hay your horse needs during winter. You can also provide grain-mix supplementation if you normally do. Ask your vet if your horse needs grains.",
    "sentences": [
        " Choosing the Right Terrain Pick a trail or pasture that doesn't have ice, mud, and other hazards.",
        "The biggest dangers for your horse during winter riding include slipping on ice, falling into unseen holes or dips, getting stuck in deep mud, and tripping over hidden obstacles.",
        "Make sure your trail is free of these risks before you take your horse out for a ride.",
        "It’s best to stick to familiar trails for winter rides, as you’ll know what to expect.",
        "You might walk the area if you're riding in your pasture or on a trail near your stables.",
        "If walking the area is not an option, talk to other riders to find out where they're riding, as well as the condition of the trails.",
        "Apply de-icing agents like salt or sawdust to icy or slippery areas.",
        "Ash, sand, and grit also make great de-icing agents.",
        "Use a wheel barrow or cart to carry the de-icing agent to your stable area, pasture, or trail to treat the ice.",
        "Sprinkle the agent over icy surfaces before your ride to help provide traction over the ice.",
        "Use your best judgement.",
        "If your area is very icy, only ride on the land you treated with a de-icing agent.",
        "As another option, you might carry de-icing agent in your saddle bags during your ride just in case you encounter an unexpected patch of ice.",
        "Don’t just treat the path where you plan to ride your horse.",
        "Put your de-icing agent around the stable, doorway, and tacking area, as well.",
        "If your horse will walk there, make sure it’s treated.",
        "Avoid areas that may have holes, roots, or branches hidden by snow.",
        "Deep snow is dangerous for your horse because it can hide hazards.",
        "Additionally, it’s hard for your horse to walk through because it takes a lot of effort.",
        "Stick to areas that have a light layer of snow or are free of snow.",
        "A light layer of snow is usually safe to ride through.",
        "If you’re not sure how deep the snow is, push a stick down into it to see how far it goes.",
        "Choose a trail you know well so it’s easier for you to estimate how much snow is on the ground.",
        "Stick to trails that other riders have already passed over during the winter, since the snow in those areas will already be packed down and safer to ride on.",
        "Choose flat trails during icy and wet conditions.",
        "Riding up and down slopes that may be icy or wet is very dangerous, as they may become slippery, especially as the water freezes.",
        "Your horse may lose its footing and fall down, which can injure you or your horse.",
        "Keep in mind that riding up the slope is often much easier than coming back down.",
        "It's best just to avoid them altogether.",
        "Avoid areas with deep mud.",
        "Don’t ride your horse over terrain that's very muddy, as your horse will sink into the mud.",
        "Your horse can become stuck and may struggle to walk with mud clumped around its hooves.",
        "A thin layer of mud is usually okay.",
        "Just pay attention to how your horse is walking to see if it's struggling with the mud.",
        "If deep mud is everywhere, you can ride early in the morning when the top layer is hardest.",
        "After the sun warms it up, however, riding can be dangerous.",
        "Ride in an arena if you have trouble finding safe trails.",
        "An arena offers you a safe, warm riding opportunity.",
        "This helps you keep your horse fit throughout the winter.",
        "It’s a great option if you can rent time at a nearby arena.",
        "To make your rides more interesting, you can set up obstacles for your horse.",
        "For example, you might navigate your horse around barrels set up in the arena.",
        "Preparing Your Horse for a Winter Ride Warm up your horse’s bit before you tack up for your ride.",
        "Take the bit out of the bridle and hold it under a stream of hot water.",
        "Remove it from the water once it feels warm to the touch.",
        "Then, put it back in the bridle and tack up.",
        "If you can, keep your horse’s bit in your home during the winter.",
        "As another option, you can rub non-toxic hand warmer onto the bit or place the bit in your pocket against your skin.",
        "Cover your horse’s back with a waterproof wool or fleece quarter sheet.",
        "Your quarter sheet will go either between the saddle pad and saddle or over the saddle, depending on the type you have.",
        "This will keep your horse’s back and hindquarters warm and dry.",
        "If your horse gets wet, it will become very cold because the wetness will freeze.",
        "Put on hoof boots to protect the hooves from the icy ground, if you have them.",
        "Choose boots that are made of neoprene or PVC, which protect your horse from moisture.",
        "Don’t use fabric boots, as the wetness from ice and snow will soak into them and then freeze.",
        "As an alternative, you can put pads beneath the hooves for added protection.",
        "If you don’t have boots or pads, apply a thin layer of nonstick cooking spray or petroleum jelly to your horse’s hooves to repel ice buildup.",
        "However, keep in mind that this won't protect your horse as well as boots and pads will.",
        "Handling Your Horse in Winter Conditions Allow your horse to warm up slowly.",
        "Walk it around for a few minutes before you mount.",
        "Then, start your trail at a very slow pace.",
        "This lets its muscles warm up before your horse starts working hard.",
        "To speed up the process, put on gloves and vigorously rub your horse’s legs and back before you tack up.",
        "Shorten the length of your rides, since your horse is working harder.",
        "Cold weather makes your horse expend more energy, especially if it’s walking through snow or mud.",
        "That means it will tire out more quickly, so don’t ride for as long as you usually do.",
        "Use your best judgement when deciding how long to ride.",
        "It’s best to stay close to the stables so you can stop if you notice your horse panting or huffing.",
        "Avoid brushing against snow-covered vegetation, which may cause chill.",
        "Snow can transfer from bushes, trees, shrubs, and other foliage onto your horse as you’re traveling past it.",
        "This can cause your horse to develop a chill.",
        "Steer clear of these types of obstacles during your ride.",
        "This will also help you stay warm!",
        "Another good reason to avoid brushing snowy branches is that the falling snow might spook your horse.",
        "Go slowly so your horse sweats less, which limits the risk of chill.",
        "Even though it’s cold, your horse may sweat during your ride because it’s getting a lot of exercise.",
        "Unfortunately, this sweat can start to freeze, which may make your horse feel a chill.",
        "Slowing your pace can reduce how hard your horse is working, making it sweat less.",
        "Blanketing your horse can also help you prevent chill, even if your horse is sweating.",
        "Watch your horse for tiredness, as walking in winter requires more effort.",
        "Notice if your horse is panting, huffing, or struggling to get through the terrain.",
        "Even a fit horse will tire out more quickly during a winter ride.",
        "Don’t overwork your horse.",
        "It’s dangerous for both you and your horse if you push it too hard during a ride.",
        "You don’t want to get stranded out on a trail.",
        "Tending to Your Horse After a Ride Cool down your horse for 10-15 minutes after your ride.",
        "Your horse still needs to cool down after a workout.",
        "Start the cool down by walking your horse slowly over the last few minutes of your ride.",
        "Then, dismount and loosen the girth without removing it, which would allow the cold air to chill the horse too quickly.",
        "Next, switch out the saddle for a wool or fleece breathable sheet or cooler, which will wick away the wetness and warm the horse.",
        "Wetness on your horse’s coat will chill your horse, even after it’s back in its stable.",
        "Use a hoof pick to remove ice and mud from the hooves, if necessary.",
        "Knock any built-up ice or mud off of your horse’s hooves.",
        "Then, use the end of the pick to gently clean out any crevices, such as around the horse’s shoes.",
        "Ice and mud that remain on the hooves can make it harder for your horse to walk.",
        "They can also undermine your horse’s health by increasing your horse’s risk of developing an infection.",
        "Brush your horse to remove ice, dirt, and mud from the coat.",
        "This also helps prevent dirt and debris from building up on the horse’s skin.",
        "As your brush your horse, check for wetness so you can dry off your horse if necessary.",
        "You don’t want it to catch a chill.",
        "Put warm, breathable blankets made from wool or fleece on your horse to keep it warm as you groom it.",
        "You might also apply leg wraps.",
        "Give your horse water heated to 50 °F (10 °C) to replenish lost fluids.",
        "Your horse may easily get dehydrated during the winter.",
        "It will still be working hard, plus it may be less likely to drink if the water freezes.",
        "Using a water heater will encourage your horse to drink.",
        "Warming the water also lowers the amount of calories your horse needs to eat.",
        "That’s because your horse’s body will need to warm up cold water to its body temperature, which takes energy.",
        "If you give your horse warm water, its body won’t have to warm it.",
        "Provide your horse with fresh hay to meet its higher energy needs.",
        "Hay is the best feed for your horse.",
        "Feed it at least as much as you typically feed it during warmer months.",
        "However, you may need to provide additional hay to meet your horse’s winter needs.",
        "Ask your equine vet for advice on how much extra hay your horse needs during winter.",
        "You can also provide grain-mix supplementation if you normally do.",
        "Ask your vet if your horse needs grains."
    ]
}