{
    "title": "How to Do Well in a Ballet Exam",
    "url": "https://www.wikihow.com/Do-Well-in-a-Ballet-Exam",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Performing Arts",
        "Dancing",
        "Ballet"
    ],
    "parts": [
        {
            "name": "Presenting Yourself Well",
            "steps": [
                {
                    "headline": "Keep your hair neat.",
                    "description": "If it's short, comb through it. If it's long, put your hair in a bun. Use hairspray on flyaway hair, to keep it looking neat. Use pins and a hairnet, unless otherwise specified by your examiner. Do use hairspray or gel if needed."
                },
                {
                    "headline": "Abide by the dress code.",
                    "description": "Ballet examiners don't like it when you have anything underneath your leotard (other than a bra) or on top. This includes t-shirts, leg warmers, pants, shorts, skirts, or other warm ups. Remove all jewelry except for small stud earrings, and take off any nail polish."
                },
                {
                    "headline": "Ensure that your attire is neat and clean.",
                    "description": "This includes clean tights that are free of holes, a clean leotard (or bodysuit), immaculate ballet slippers or pointe shoes (if necessary)––no fraying ribbons, and any other ballet wear in its absolute best condition, as specified by your examiner."
                }
            ]
        },
        {
            "name": "Starting the Exam",
            "steps": [
                {
                    "headline": "Stretch before you start the exam.",
                    "description": "Stretching will help prevent injury while dancing, and is also very important for high extensions. You will need to stretch you arms and legs for at least 10 minutes before you perform for the examiner."
                },
                {
                    "headline": "Smile.",
                    "description": "Show the examiner that you are willing to enjoy the exam, even if you're nervous. Sometimes smiling can actually make you feel more confident."
                },
                {
                    "headline": "Stand in first position while waiting.",
                    "description": "This will show the examiner that you care, and that you are bringing you ballet technique with you. Stand and walk like a proper dancer."
                },
                {
                    "headline": "Greet and be polite to the examiner.",
                    "description": "Don't be embarrassed to say \"Good morning\" or \"Good afternoon\". They'll appreciate your respect and it can also help them to warm to you."
                }
            ]
        },
        {
            "name": "During the Exam",
            "steps": [
                {
                    "headline": "Make sure you know every exercise perfectly.",
                    "description": "If you skip this step or are unsure of any of your exercises, you will not do as well as you could. If it helps, buy the music for your pieces. This way, you can run through the dances at home. Practice till you are confident with it, and tell yourself that you can do it!"
                },
                {
                    "headline": "Use lots of expression in your dances.",
                    "description": "When the music comes on, think about how it makes you feel inside. Is it sharp, swift, and quick? Or is it smooth and free flowing? Perhaps it is slow, gentle and soft. Use these feelings in your movements. Let your expression come out and don't be afraid to show it - if you are, you will appear as stiff and nervous! Practicing expressions at home beforehand will help your expressions to come out more smoothly."
                },
                {
                    "headline": "Use your head.",
                    "description": "Find a focus during the exam. Do not stare at the examiner, but make sure you do sometimes look at them. Otherwise, they will see how nervous you are. Be confident. Stand up straight, keep your eyes up, and try not to watch the other girls."
                },
                {
                    "headline": "Be polite when the examiner talks to you.",
                    "description": "Keep a good, positive attitude and don't turn him/her off with a snotty, proud air. If you appear as vain and snobby, the examiner will not have a very good impression of you. Be well mannered."
                },
                {
                    "headline": "Have fun, smile and enjoy throughout the performance (no matter how nervous you are).",
                    "description": ""
                },
                {
                    "headline": "Say thank you at the end.",
                    "description": "Always thank the teacher, examiners, and pianist. Again, this helps keep a lasting impression, and also shows that you are respectful, which is an important trait to being a dancer."
                }
            ]
        }
    ],
    "tyn": [
        "Leotard",
        "Clean, hole-free tights",
        "Good, clean, neat ballet shoes (Note: The RAD only allow full sole leather flats for Intermediate Foundation and below)",
        "Gel and hairspray",
        "Sewing kit",
        "Hair bands and/or bobby pins"
    ],
    "text": " Presenting Yourself Well Keep your hair neat. If it's short, comb through it. If it's long, put your hair in a bun. Use hairspray on flyaway hair, to keep it looking neat. Use pins and a hairnet, unless otherwise specified by your examiner. Do use hairspray or gel if needed. Abide by the dress code. Ballet examiners don't like it when you have anything underneath your leotard (other than a bra) or on top. This includes t-shirts, leg warmers, pants, shorts, skirts, or other warm ups. Remove all jewelry except for small stud earrings, and take off any nail polish. Ensure that your attire is neat and clean. This includes clean tights that are free of holes, a clean leotard (or bodysuit), immaculate ballet slippers or pointe shoes (if necessary)––no fraying ribbons, and any other ballet wear in its absolute best condition, as specified by your examiner. Starting the Exam Stretch before you start the exam. Stretching will help prevent injury while dancing, and is also very important for high extensions. You will need to stretch you arms and legs for at least 10 minutes before you perform for the examiner. Smile. Show the examiner that you are willing to enjoy the exam, even if you're nervous. Sometimes smiling can actually make you feel more confident. Stand in first position while waiting. This will show the examiner that you care, and that you are bringing you ballet technique with you. Stand and walk like a proper dancer. Greet and be polite to the examiner. Don't be embarrassed to say \"Good morning\" or \"Good afternoon\". They'll appreciate your respect and it can also help them to warm to you. During the Exam Make sure you know every exercise perfectly. If you skip this step or are unsure of any of your exercises, you will not do as well as you could. If it helps, buy the music for your pieces. This way, you can run through the dances at home. Practice till you are confident with it, and tell yourself that you can do it! Use lots of expression in your dances. When the music comes on, think about how it makes you feel inside. Is it sharp, swift, and quick? Or is it smooth and free flowing? Perhaps it is slow, gentle and soft. Use these feelings in your movements. Let your expression come out and don't be afraid to show it - if you are, you will appear as stiff and nervous! Practicing expressions at home beforehand will help your expressions to come out more smoothly. Use your head. Find a focus during the exam. Do not stare at the examiner, but make sure you do sometimes look at them. Otherwise, they will see how nervous you are. Be confident. Stand up straight, keep your eyes up, and try not to watch the other girls. Be polite when the examiner talks to you. Keep a good, positive attitude and don't turn him/her off with a snotty, proud air. If you appear as vain and snobby, the examiner will not have a very good impression of you. Be well mannered. Have fun, smile and enjoy throughout the performance (no matter how nervous you are).  Say thank you at the end. Always thank the teacher, examiners, and pianist. Again, this helps keep a lasting impression, and also shows that you are respectful, which is an important trait to being a dancer.",
    "sentences": [
        " Presenting Yourself Well Keep your hair neat.",
        "If it's short, comb through it.",
        "If it's long, put your hair in a bun.",
        "Use hairspray on flyaway hair, to keep it looking neat.",
        "Use pins and a hairnet, unless otherwise specified by your examiner.",
        "Do use hairspray or gel if needed.",
        "Abide by the dress code.",
        "Ballet examiners don't like it when you have anything underneath your leotard (other than a bra) or on top.",
        "This includes t-shirts, leg warmers, pants, shorts, skirts, or other warm ups.",
        "Remove all jewelry except for small stud earrings, and take off any nail polish.",
        "Ensure that your attire is neat and clean.",
        "This includes clean tights that are free of holes, a clean leotard (or bodysuit), immaculate ballet slippers or pointe shoes (if necessary)––no fraying ribbons, and any other ballet wear in its absolute best condition, as specified by your examiner.",
        "Starting the Exam Stretch before you start the exam.",
        "Stretching will help prevent injury while dancing, and is also very important for high extensions.",
        "You will need to stretch you arms and legs for at least 10 minutes before you perform for the examiner.",
        "Smile.",
        "Show the examiner that you are willing to enjoy the exam, even if you're nervous.",
        "Sometimes smiling can actually make you feel more confident.",
        "Stand in first position while waiting.",
        "This will show the examiner that you care, and that you are bringing you ballet technique with you.",
        "Stand and walk like a proper dancer.",
        "Greet and be polite to the examiner.",
        "Don't be embarrassed to say \"Good morning\" or \"Good afternoon\".",
        "They'll appreciate your respect and it can also help them to warm to you.",
        "During the Exam Make sure you know every exercise perfectly.",
        "If you skip this step or are unsure of any of your exercises, you will not do as well as you could.",
        "If it helps, buy the music for your pieces.",
        "This way, you can run through the dances at home.",
        "Practice till you are confident with it, and tell yourself that you can do it!",
        "Use lots of expression in your dances.",
        "When the music comes on, think about how it makes you feel inside.",
        "Is it sharp, swift, and quick?",
        "Or is it smooth and free flowing?",
        "Perhaps it is slow, gentle and soft.",
        "Use these feelings in your movements.",
        "Let your expression come out and don't be afraid to show it - if you are, you will appear as stiff and nervous!",
        "Practicing expressions at home beforehand will help your expressions to come out more smoothly.",
        "Use your head.",
        "Find a focus during the exam.",
        "Do not stare at the examiner, but make sure you do sometimes look at them.",
        "Otherwise, they will see how nervous you are.",
        "Be confident.",
        "Stand up straight, keep your eyes up, and try not to watch the other girls.",
        "Be polite when the examiner talks to you.",
        "Keep a good, positive attitude and don't turn him/her off with a snotty, proud air.",
        "If you appear as vain and snobby, the examiner will not have a very good impression of you.",
        "Be well mannered.",
        "Have fun, smile and enjoy throughout the performance (no matter how nervous you are).",
        "Say thank you at the end.",
        "Always thank the teacher, examiners, and pianist.",
        "Again, this helps keep a lasting impression, and also shows that you are respectful, which is an important trait to being a dancer."
    ]
}