{
    "title": "How to Polish an Aluminum Trailer",
    "url": "https://www.wikihow.com/Polish-an-Aluminum-Trailer",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Trailers"
    ],
    "steps": [
        {
            "headline": "Clean all the dirt and debris from the exterior using soap and water.",
            "description": ""
        },
        {
            "headline": "Mask or remove any painted surfaces, lights, plastic pieces or any other items from the exterior of the trailer that may be damaged by the following steps.",
            "description": ""
        },
        {
            "headline": "Remove the old clear coat finish (if your trailer has a clear coat finish) with a paint stripper.",
            "description": "Follow the instructions on the paint stripper can."
        },
        {
            "headline": "Wash the trailer again to remove any residual chemicals.",
            "description": ""
        },
        {
            "headline": "Remove any heavy oxidation with 600 grit wet sandpaper.",
            "description": "Sand the rough areas with the 600 grit paper rinsing with soapy water as you go."
        },
        {
            "headline": "\"Compound\" the trailer using a wool bonnet on a 7\" angle grinder.",
            "description": "Use a relatively coarse grit Nuvite polishing compound for this step. (This will give your trailer a pretty good shine, but will leave swirl marks)."
        },
        {
            "headline": "Start on the top of your trailer and work your way down.",
            "description": ""
        },
        {
            "headline": "\"Medium Polish\" the trailer using a less coarse grade of Rolite polish using a new wool bonnet on the angle grinder.",
            "description": "(This will give you a much better polish but will still leave swirl marks)."
        },
        {
            "headline": "\"Fine Polish\" the trailer using a dual head random orbital polishing machine wrapped with sweatshirt material using a fine grade of Rolite polish.",
            "description": "(This will remove swirls and provide an almost mirror-like finish.)"
        }
    ],
    "tyn": [
        "600 grit wet sanding paper",
        "Rolite polishing compound",
        "Makita 7\" grinder (or equivalent) with wool bonnet pads (several)",
        "Cyclo dual random orbital polishing machine"
    ],
    "text": " Clean all the dirt and debris from the exterior using soap and water.  Mask or remove any painted surfaces, lights, plastic pieces or any other items from the exterior of the trailer that may be damaged by the following steps.  Remove the old clear coat finish (if your trailer has a clear coat finish) with a paint stripper. Follow the instructions on the paint stripper can. Wash the trailer again to remove any residual chemicals.  Remove any heavy oxidation with 600 grit wet sandpaper. Sand the rough areas with the 600 grit paper rinsing with soapy water as you go. \"Compound\" the trailer using a wool bonnet on a 7\" angle grinder. Use a relatively coarse grit Nuvite polishing compound for this step. (This will give your trailer a pretty good shine, but will leave swirl marks). Start on the top of your trailer and work your way down.  \"Medium Polish\" the trailer using a less coarse grade of Rolite polish using a new wool bonnet on the angle grinder. (This will give you a much better polish but will still leave swirl marks). \"Fine Polish\" the trailer using a dual head random orbital polishing machine wrapped with sweatshirt material using a fine grade of Rolite polish. (This will remove swirls and provide an almost mirror-like finish.)",
    "sentences": [
        " Clean all the dirt and debris from the exterior using soap and water.",
        "Mask or remove any painted surfaces, lights, plastic pieces or any other items from the exterior of the trailer that may be damaged by the following steps.",
        "Remove the old clear coat finish (if your trailer has a clear coat finish) with a paint stripper.",
        "Follow the instructions on the paint stripper can.",
        "Wash the trailer again to remove any residual chemicals.",
        "Remove any heavy oxidation with 600 grit wet sandpaper.",
        "Sand the rough areas with the 600 grit paper rinsing with soapy water as you go.",
        "\"Compound\" the trailer using a wool bonnet on a 7\" angle grinder.",
        "Use a relatively coarse grit Nuvite polishing compound for this step.",
        "(This will give your trailer a pretty good shine, but will leave swirl marks).",
        "Start on the top of your trailer and work your way down.",
        "\"Medium Polish\" the trailer using a less coarse grade of Rolite polish using a new wool bonnet on the angle grinder.",
        "(This will give you a much better polish but will still leave swirl marks).",
        "\"Fine Polish\" the trailer using a dual head random orbital polishing machine wrapped with sweatshirt material using a fine grade of Rolite polish.",
        "(This will remove swirls and provide an almost mirror-like finish.)"
    ]
}