{
    "title": "How to Harden a Sand Dollar",
    "url": "https://www.wikihow.com/Harden-a-Sand-Dollar",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Craft for Kids"
    ],
    "parts": [
        {
            "name": "Cleaning and Bleaching Sand Dollars",
            "steps": [
                {
                    "headline": "Soak the sand dollars in fresh water for 2-3 hours.",
                    "description": "Use a bucket or sink to soak them in, checking back after they’ve been soaking for a few hours.The water should be discolored from the sand and grime leaving the sand dollars. If it is, dump it and fill up the bucket or sink with new water. Repeat this process until the water stays clear and doesn’t discolor."
                },
                {
                    "headline": "Prepare a mixture of bleach and water to soak the sand dollars in.",
                    "description": "Make the mixture with 3 parts water to every 1 part bleach. Pour the mixture into a bucket or dish and soak the sand dollars in it for around 3 minutes. Sand dollars get bleached naturally by the sun when they wash up on shore. Skip this step if you’re satisfied with the level of whiteness of your sand dollars."
                },
                {
                    "headline": "Remove the sand dollars from the water and bleach solution.",
                    "description": "Dispose of the solution and rinse the sand dollars with fresh water. Rinse them thoroughly so all of the bleach is washed off."
                },
                {
                    "headline": "Let the sand dollars fully dry.",
                    "description": "Lay them out in a single layer on a wax sheet or a baking rack. Check back in an hour to see if they’re dry. Place the sand dollars outside in the sun to help them dry faster."
                }
            ]
        },
        {
            "name": "Hardening Sand Dollars with Glue",
            "steps": [
                {
                    "headline": "Prepare a mixture of white school glue and water to coat the sand dollars.",
                    "description": "Make the mixture with 1 part white glue to 1 part water. Mix the glue and water together in a dish until it is thoroughly blended."
                },
                {
                    "headline": "Cover the sand dollars with the glue and water mixture using a brush.",
                    "description": "Buy a cheap paint brush or sponge brush at your local crafts store. Dip the brush into the glue and water mixture and paint over the entire surface of each sand dollar."
                },
                {
                    "headline": "Place the sand dollars on a wax sheet to dry.",
                    "description": "Lay down chopsticks, toothpicks, or pencils on the wax sheet to slightly elevate the sand dollars so the bottoms can dry faster."
                },
                {
                    "headline": "Use the hardened sand dollars to make crafts and decorations.",
                    "description": "Fill up jars with the sand dollars or use them to make necklaces and earrings. You can also paint hardened sand dollars and display them on tiny easels."
                }
            ]
        }
    ],
    "tyn": [
        "Sand dollars",
        "Bleach",
        "Water",
        "A brush",
        "Wax paper",
        "White school glue",
        "Toothpicks, chopsticks, or pencils (optional)"
    ],
    "text": " Cleaning and Bleaching Sand Dollars Soak the sand dollars in fresh water for 2-3 hours. Use a bucket or sink to soak them in, checking back after they’ve been soaking for a few hours.The water should be discolored from the sand and grime leaving the sand dollars. If it is, dump it and fill up the bucket or sink with new water. Repeat this process until the water stays clear and doesn’t discolor. Prepare a mixture of bleach and water to soak the sand dollars in. Make the mixture with 3 parts water to every 1 part bleach. Pour the mixture into a bucket or dish and soak the sand dollars in it for around 3 minutes. Sand dollars get bleached naturally by the sun when they wash up on shore. Skip this step if you’re satisfied with the level of whiteness of your sand dollars. Remove the sand dollars from the water and bleach solution. Dispose of the solution and rinse the sand dollars with fresh water. Rinse them thoroughly so all of the bleach is washed off. Let the sand dollars fully dry. Lay them out in a single layer on a wax sheet or a baking rack. Check back in an hour to see if they’re dry. Place the sand dollars outside in the sun to help them dry faster. Hardening Sand Dollars with Glue Prepare a mixture of white school glue and water to coat the sand dollars. Make the mixture with 1 part white glue to 1 part water. Mix the glue and water together in a dish until it is thoroughly blended. Cover the sand dollars with the glue and water mixture using a brush. Buy a cheap paint brush or sponge brush at your local crafts store. Dip the brush into the glue and water mixture and paint over the entire surface of each sand dollar. Place the sand dollars on a wax sheet to dry. Lay down chopsticks, toothpicks, or pencils on the wax sheet to slightly elevate the sand dollars so the bottoms can dry faster. Use the hardened sand dollars to make crafts and decorations. Fill up jars with the sand dollars or use them to make necklaces and earrings. You can also paint hardened sand dollars and display them on tiny easels.",
    "sentences": [
        " Cleaning and Bleaching Sand Dollars Soak the sand dollars in fresh water for 2-3 hours.",
        "Use a bucket or sink to soak them in, checking back after they’ve been soaking for a few hours.The water should be discolored from the sand and grime leaving the sand dollars.",
        "If it is, dump it and fill up the bucket or sink with new water.",
        "Repeat this process until the water stays clear and doesn’t discolor.",
        "Prepare a mixture of bleach and water to soak the sand dollars in.",
        "Make the mixture with 3 parts water to every 1 part bleach.",
        "Pour the mixture into a bucket or dish and soak the sand dollars in it for around 3 minutes.",
        "Sand dollars get bleached naturally by the sun when they wash up on shore.",
        "Skip this step if you’re satisfied with the level of whiteness of your sand dollars.",
        "Remove the sand dollars from the water and bleach solution.",
        "Dispose of the solution and rinse the sand dollars with fresh water.",
        "Rinse them thoroughly so all of the bleach is washed off.",
        "Let the sand dollars fully dry.",
        "Lay them out in a single layer on a wax sheet or a baking rack.",
        "Check back in an hour to see if they’re dry.",
        "Place the sand dollars outside in the sun to help them dry faster.",
        "Hardening Sand Dollars with Glue Prepare a mixture of white school glue and water to coat the sand dollars.",
        "Make the mixture with 1 part white glue to 1 part water.",
        "Mix the glue and water together in a dish until it is thoroughly blended.",
        "Cover the sand dollars with the glue and water mixture using a brush.",
        "Buy a cheap paint brush or sponge brush at your local crafts store.",
        "Dip the brush into the glue and water mixture and paint over the entire surface of each sand dollar.",
        "Place the sand dollars on a wax sheet to dry.",
        "Lay down chopsticks, toothpicks, or pencils on the wax sheet to slightly elevate the sand dollars so the bottoms can dry faster.",
        "Use the hardened sand dollars to make crafts and decorations.",
        "Fill up jars with the sand dollars or use them to make necklaces and earrings.",
        "You can also paint hardened sand dollars and display them on tiny easels."
    ]
}