{
    "title": "How to Make Chai Tea",
    "url": "https://www.wikihow.com/Make-Chai-Tea",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Tea",
        "Milk Tea"
    ],
    "methods": [
        {
            "name": "Making Chai Tea from Scratch",
            "steps": [
                {
                    "headline": "Use a skillet to crush cardamom, cloves, and peppercorns.",
                    "description": "Put 8 green cardamom pods, 8 cloves, and 4 whole black peppercorns into a sealable plastic bag and press the air out. Seal the bag and press a heavy skillet or rolling pin on it to crush the spices. If you have a mortar, put the spices into it and use the pestle to crush the spices until the pods open."
                },
                {
                    "headline": "Peel a 1 in (2.5 cm) piece of ginger and slice it into ⁄4 inch (0.64 cm) pieces.",
                    "description": "Use the edge of a spoon to scrape the peel from a piece of fresh ginger. Carefully cut it into thin slices that are ⁄4 inch (0.64 cm) thick. If you can't find fresh ginger, substitute 1 teaspoon (2 g) of ground ginger."
                },
                {
                    "headline": "Place the spices, cinnamon sticks, and ginger in a saucepan.",
                    "description": "Put the crushed spices into a medium saucepan on the stove. Add two 2 to 3 in (5.1 to 7.6 cm) cinnamon sticks and the sliced ginger.Tip: Experiment with your spice mixture until you develop your own preferred flavor. For example, try adding a pinch of ground nutmeg or allspice. There's no need to crush the cinnamon sticks since you'll strain them out along with the spices. They'll add a strong, spicy flavor to your tea."
                },
                {
                    "headline": "Add 2 cups (470 ml) of milk and 2 cups (470 ml) of water.",
                    "description": "Pour the whole milk and water into the saucepan with the spices. Although you can use low-fat milk, using whole milk gives your tea a richer, creamier taste. Feel free to substitute alternative milk, such as soy, oat, or almond milk."
                },
                {
                    "headline": "Bring the mixture to a boil over medium heat.",
                    "description": "Turn the burner on and keep the lid off of the saucepan. This helps you see when the mixture begins to boil. You can stir it occasionally to distribute the spices. Heating the spices in the milk will make the tea more flavorful."
                },
                {
                    "headline": "Add 4 tea bags and turn off the heat.",
                    "description": "As soon as the liquid reaches a boil, turn off the burner. Open 4 black tea bags and place them into the saucepan with the liquid. Press down on each tea bag with the back of a spoon to submerge it completely."
                },
                {
                    "headline": "Cover the saucepan and steep the tea for 10 minutes.",
                    "description": "Put the lid on the pan so the tea doesn't cool and set a timer. Steep the tea until the liquid becomes a deep, pinkish-tan color. You can stir the tea occasionally to prevent the spices from settling as the tea steeps."
                },
                {
                    "headline": "Strain the tea and sweeten it according to your taste.",
                    "description": "Set a fine-mesh strainer over a teapot or large measuring jug. Slowly pour the chai tea through the strainer and discard the solids. Then, taste the tea and stir in as much sugar as you like. Put the lid on the saucepan and refrigerate leftover chai tea for up to 3 days. Use your favorite sweetener. You could try honey, agave, or stevia, for instance."
                }
            ]
        },
        {
            "name": "Brewing Chai Tea Bags",
            "steps": [
                {
                    "headline": "Bring ⁄4 cup (180 ml) of water to a boil.",
                    "description": "Fill a kettle or saucepan with water that hasn't been boiled before and set it on the stove. Using fresh water gives your tea the best flavor. Then, turn the burner to high so the water comes to a boil. If you prefer, heat the water in an electric kettle."
                },
                {
                    "headline": "Put 1 chai tea bag in a mug and pour in the boiling water.",
                    "description": "Open 1 chai tea bag and put it in a large serving mug. Carefully pour ⁄4 cup (180 ml) of the boiling water into the mug so the tea bag is saturated. Try your favorite variety of storebought chai tea bags. You could use decaffeinated, chai green tea, or herbal chai tea, for instance."
                },
                {
                    "headline": "Steep the tea for 4 to 6 minutes before you remove the bag.",
                    "description": "Stir the tea occasionally to distribute the chai tea seasonings in the water and set a timer for at least 4 minutes. The longer you steep the tea, the more flavorful the chai will be. Remove the tea bag once the tea has brewed as long as you like. For even stronger chai tea, leave the tea to steep for up to 10 minutes."
                },
                {
                    "headline": "Stir in the honey and sugar.",
                    "description": "Pour in 1 1/2 teaspoons (10 g) of honey along with 1 teaspoon (4 g) of sugar. Stir the sweeteners well so they dissolve into the tea. Then, taste the tea and add more honey or sugar if you want the tea even sweeter. You could substitute agave, stevia, or low-calorie sweetener for the honey and sugar."
                },
                {
                    "headline": "Pour in ⁄4 cup (180 ml) of milk.",
                    "description": "If you don't mind your chai tea cooling off a little, stir in the milk while it's cold. For hot chai tea, warm the milk in a saucepan on the stove or microwave it for about 30 seconds before you add it to your mug of tea.Tip: Use your favorite type of milk. Whole milk makes the chai creamy, but you could use low-fat or alternative milk, such as oat, almond, or soy milk."
                }
            ]
        },
        {
            "name": "Making Chai Mix Powder",
            "steps": [
                {
                    "headline": "Put all of the spices into a large bowl.",
                    "description": "If your spices are over 6 months old, buy new spices so they have a bolder flavor. Measure each of the following spices and add them to the bowl:\n2 ½ teaspoons (4.5 g) of ground ginger\n2 teaspoons (4 g) of ground cinnamon\n¾ teaspoon (1.5 g) of ground cloves\n¾ teaspoon (1.5 g) of ground cardamom\n1 teaspoon (2 g) of ground allspice\n1 teaspoon (2 g) of ground nutmeg\n½ teaspoon (1 g) of finely-ground black pepper"
                },
                {
                    "headline": "Whisk in instant tea, sugar, milk powder, and the nondairy creamers.",
                    "description": "Use 1 ½ cups (187 g) of unsweetened or decaffeinated black tea and add between 1 ½ and 2 cups (300 to 400 g) of sugar, depending on how sweet you like your chai. To make your chai mix milky, whisk in 1 cup (125 g) of nonfat dry milk powder, 1 cup (125 g) of powdered nondairy creamer, and 1 cup (125 g) of French vanilla-flavored powdered nondairy creamer.Variation: To add a chocolate taste to your chai, stir 1/2 cup (59 g) of unsweetened cocoa powder into the chai mix. If you don't want to buy 3 different powdered products, use a total of 3 cups (375 g) of any 1 of these ingredients."
                },
                {
                    "headline": "Store the mix in an airtight container until you’re ready to drink it.",
                    "description": "Your chai mix is good to use for up to 6 months. Keep it in your pantry in an airtight container, like a jar or a sealable bag, for maximum freshness. Remember to label the container so you know when to use the mix by."
                },
                {
                    "headline": "Dissolve 2 tablespoons (29.6 ml) (16 g) of mix in 1 cup (240 ml) of boiling water to make a mug of tea.",
                    "description": "To make a quick cup of chai tea, carefully pour the boiling water into a large mug. Then, stir in the powdered mix until it's completely dissolved. If you'd like even creamier chai tea, use milk or a combination of milk and water. If you added cocoa powder to the mix, use hot milk instead of water."
                }
            ]
        }
    ],
    "tyn": [
        "Chai Tea from Scratch",
        "Sealable plastic bag",
        "Heavy skillet or rolling pin",
        "Spoon",
        "Knife and cutting board",
        "Saucepan with lid",
        "Fine-mesh strainer",
        "Serving mugs",
        "Brewing Chai Tea Bags",
        "Kettle or saucepan",
        "Measuring cups and spoons",
        "Large serving mug",
        "Small saucepan, optional",
        "Homemade Chai Mix",
        "Large bowl",
        "Airtight container",
        "Mug"
    ],
    "text": " Making Chai Tea from Scratch Use a skillet to crush cardamom, cloves, and peppercorns. Put 8 green cardamom pods, 8 cloves, and 4 whole black peppercorns into a sealable plastic bag and press the air out. Seal the bag and press a heavy skillet or rolling pin on it to crush the spices. If you have a mortar, put the spices into it and use the pestle to crush the spices until the pods open. Peel a 1 in (2.5 cm) piece of ginger and slice it into ⁄4 inch (0.64 cm) pieces. Use the edge of a spoon to scrape the peel from a piece of fresh ginger. Carefully cut it into thin slices that are ⁄4 inch (0.64 cm) thick. If you can't find fresh ginger, substitute 1 teaspoon (2 g) of ground ginger. Place the spices, cinnamon sticks, and ginger in a saucepan. Put the crushed spices into a medium saucepan on the stove. Add two 2 to 3 in (5.1 to 7.6 cm) cinnamon sticks and the sliced ginger.Tip: Experiment with your spice mixture until you develop your own preferred flavor. For example, try adding a pinch of ground nutmeg or allspice. There's no need to crush the cinnamon sticks since you'll strain them out along with the spices. They'll add a strong, spicy flavor to your tea. Add 2 cups (470 ml) of milk and 2 cups (470 ml) of water. Pour the whole milk and water into the saucepan with the spices. Although you can use low-fat milk, using whole milk gives your tea a richer, creamier taste. Feel free to substitute alternative milk, such as soy, oat, or almond milk. Bring the mixture to a boil over medium heat. Turn the burner on and keep the lid off of the saucepan. This helps you see when the mixture begins to boil. You can stir it occasionally to distribute the spices. Heating the spices in the milk will make the tea more flavorful. Add 4 tea bags and turn off the heat. As soon as the liquid reaches a boil, turn off the burner. Open 4 black tea bags and place them into the saucepan with the liquid. Press down on each tea bag with the back of a spoon to submerge it completely. Cover the saucepan and steep the tea for 10 minutes. Put the lid on the pan so the tea doesn't cool and set a timer. Steep the tea until the liquid becomes a deep, pinkish-tan color. You can stir the tea occasionally to prevent the spices from settling as the tea steeps. Strain the tea and sweeten it according to your taste. Set a fine-mesh strainer over a teapot or large measuring jug. Slowly pour the chai tea through the strainer and discard the solids. Then, taste the tea and stir in as much sugar as you like. Put the lid on the saucepan and refrigerate leftover chai tea for up to 3 days. Use your favorite sweetener. You could try honey, agave, or stevia, for instance. Brewing Chai Tea Bags Bring ⁄4 cup (180 ml) of water to a boil. Fill a kettle or saucepan with water that hasn't been boiled before and set it on the stove. Using fresh water gives your tea the best flavor. Then, turn the burner to high so the water comes to a boil. If you prefer, heat the water in an electric kettle. Put 1 chai tea bag in a mug and pour in the boiling water. Open 1 chai tea bag and put it in a large serving mug. Carefully pour ⁄4 cup (180 ml) of the boiling water into the mug so the tea bag is saturated. Try your favorite variety of storebought chai tea bags. You could use decaffeinated, chai green tea, or herbal chai tea, for instance. Steep the tea for 4 to 6 minutes before you remove the bag. Stir the tea occasionally to distribute the chai tea seasonings in the water and set a timer for at least 4 minutes. The longer you steep the tea, the more flavorful the chai will be. Remove the tea bag once the tea has brewed as long as you like. For even stronger chai tea, leave the tea to steep for up to 10 minutes. Stir in the honey and sugar. Pour in 1 1/2 teaspoons (10 g) of honey along with 1 teaspoon (4 g) of sugar. Stir the sweeteners well so they dissolve into the tea. Then, taste the tea and add more honey or sugar if you want the tea even sweeter. You could substitute agave, stevia, or low-calorie sweetener for the honey and sugar. Pour in ⁄4 cup (180 ml) of milk. If you don't mind your chai tea cooling off a little, stir in the milk while it's cold. For hot chai tea, warm the milk in a saucepan on the stove or microwave it for about 30 seconds before you add it to your mug of tea.Tip: Use your favorite type of milk. Whole milk makes the chai creamy, but you could use low-fat or alternative milk, such as oat, almond, or soy milk. Making Chai Mix Powder Put all of the spices into a large bowl. If your spices are over 6 months old, buy new spices so they have a bolder flavor. Measure each of the following spices and add them to the bowl:\n2 ½ teaspoons (4.5 g) of ground ginger\n2 teaspoons (4 g) of ground cinnamon\n¾ teaspoon (1.5 g) of ground cloves\n¾ teaspoon (1.5 g) of ground cardamom\n1 teaspoon (2 g) of ground allspice\n1 teaspoon (2 g) of ground nutmeg\n½ teaspoon (1 g) of finely-ground black pepper Whisk in instant tea, sugar, milk powder, and the nondairy creamers. Use 1 ½ cups (187 g) of unsweetened or decaffeinated black tea and add between 1 ½ and 2 cups (300 to 400 g) of sugar, depending on how sweet you like your chai. To make your chai mix milky, whisk in 1 cup (125 g) of nonfat dry milk powder, 1 cup (125 g) of powdered nondairy creamer, and 1 cup (125 g) of French vanilla-flavored powdered nondairy creamer.Variation: To add a chocolate taste to your chai, stir 1/2 cup (59 g) of unsweetened cocoa powder into the chai mix. If you don't want to buy 3 different powdered products, use a total of 3 cups (375 g) of any 1 of these ingredients. Store the mix in an airtight container until you’re ready to drink it. Your chai mix is good to use for up to 6 months. Keep it in your pantry in an airtight container, like a jar or a sealable bag, for maximum freshness. Remember to label the container so you know when to use the mix by. Dissolve 2 tablespoons (29.6 ml) (16 g) of mix in 1 cup (240 ml) of boiling water to make a mug of tea. To make a quick cup of chai tea, carefully pour the boiling water into a large mug. Then, stir in the powdered mix until it's completely dissolved. If you'd like even creamier chai tea, use milk or a combination of milk and water. If you added cocoa powder to the mix, use hot milk instead of water.",
    "sentences": [
        " Making Chai Tea from Scratch Use a skillet to crush cardamom, cloves, and peppercorns.",
        "Put 8 green cardamom pods, 8 cloves, and 4 whole black peppercorns into a sealable plastic bag and press the air out.",
        "Seal the bag and press a heavy skillet or rolling pin on it to crush the spices.",
        "If you have a mortar, put the spices into it and use the pestle to crush the spices until the pods open.",
        "Peel a 1 in (2.5 cm) piece of ginger and slice it into ⁄4 inch (0.64 cm) pieces.",
        "Use the edge of a spoon to scrape the peel from a piece of fresh ginger.",
        "Carefully cut it into thin slices that are ⁄4 inch (0.64 cm) thick.",
        "If you can't find fresh ginger, substitute 1 teaspoon (2 g) of ground ginger.",
        "Place the spices, cinnamon sticks, and ginger in a saucepan.",
        "Put the crushed spices into a medium saucepan on the stove.",
        "Add two 2 to 3 in (5.1 to 7.6 cm) cinnamon sticks and the sliced ginger.Tip: Experiment with your spice mixture until you develop your own preferred flavor.",
        "For example, try adding a pinch of ground nutmeg or allspice.",
        "There's no need to crush the cinnamon sticks since you'll strain them out along with the spices.",
        "They'll add a strong, spicy flavor to your tea.",
        "Add 2 cups (470 ml) of milk and 2 cups (470 ml) of water.",
        "Pour the whole milk and water into the saucepan with the spices.",
        "Although you can use low-fat milk, using whole milk gives your tea a richer, creamier taste.",
        "Feel free to substitute alternative milk, such as soy, oat, or almond milk.",
        "Bring the mixture to a boil over medium heat.",
        "Turn the burner on and keep the lid off of the saucepan.",
        "This helps you see when the mixture begins to boil.",
        "You can stir it occasionally to distribute the spices.",
        "Heating the spices in the milk will make the tea more flavorful.",
        "Add 4 tea bags and turn off the heat.",
        "As soon as the liquid reaches a boil, turn off the burner.",
        "Open 4 black tea bags and place them into the saucepan with the liquid.",
        "Press down on each tea bag with the back of a spoon to submerge it completely.",
        "Cover the saucepan and steep the tea for 10 minutes.",
        "Put the lid on the pan so the tea doesn't cool and set a timer.",
        "Steep the tea until the liquid becomes a deep, pinkish-tan color.",
        "You can stir the tea occasionally to prevent the spices from settling as the tea steeps.",
        "Strain the tea and sweeten it according to your taste.",
        "Set a fine-mesh strainer over a teapot or large measuring jug.",
        "Slowly pour the chai tea through the strainer and discard the solids.",
        "Then, taste the tea and stir in as much sugar as you like.",
        "Put the lid on the saucepan and refrigerate leftover chai tea for up to 3 days.",
        "Use your favorite sweetener.",
        "You could try honey, agave, or stevia, for instance.",
        "Brewing Chai Tea Bags Bring ⁄4 cup (180 ml) of water to a boil.",
        "Fill a kettle or saucepan with water that hasn't been boiled before and set it on the stove.",
        "Using fresh water gives your tea the best flavor.",
        "Then, turn the burner to high so the water comes to a boil.",
        "If you prefer, heat the water in an electric kettle.",
        "Put 1 chai tea bag in a mug and pour in the boiling water.",
        "Open 1 chai tea bag and put it in a large serving mug.",
        "Carefully pour ⁄4 cup (180 ml) of the boiling water into the mug so the tea bag is saturated.",
        "Try your favorite variety of storebought chai tea bags.",
        "You could use decaffeinated, chai green tea, or herbal chai tea, for instance.",
        "Steep the tea for 4 to 6 minutes before you remove the bag.",
        "Stir the tea occasionally to distribute the chai tea seasonings in the water and set a timer for at least 4 minutes.",
        "The longer you steep the tea, the more flavorful the chai will be.",
        "Remove the tea bag once the tea has brewed as long as you like.",
        "For even stronger chai tea, leave the tea to steep for up to 10 minutes.",
        "Stir in the honey and sugar.",
        "Pour in 1 1/2 teaspoons (10 g) of honey along with 1 teaspoon (4 g) of sugar.",
        "Stir the sweeteners well so they dissolve into the tea.",
        "Then, taste the tea and add more honey or sugar if you want the tea even sweeter.",
        "You could substitute agave, stevia, or low-calorie sweetener for the honey and sugar.",
        "Pour in ⁄4 cup (180 ml) of milk.",
        "If you don't mind your chai tea cooling off a little, stir in the milk while it's cold.",
        "For hot chai tea, warm the milk in a saucepan on the stove or microwave it for about 30 seconds before you add it to your mug of tea.Tip: Use your favorite type of milk.",
        "Whole milk makes the chai creamy, but you could use low-fat or alternative milk, such as oat, almond, or soy milk.",
        "Making Chai Mix Powder Put all of the spices into a large bowl.",
        "If your spices are over 6 months old, buy new spices so they have a bolder flavor.",
        "Measure each of the following spices and add them to the bowl:\n2 ½ teaspoons (4.5 g) of ground ginger\n2 teaspoons (4 g) of ground cinnamon\n¾ teaspoon (1.5 g) of ground cloves\n¾ teaspoon (1.5 g) of ground cardamom\n1 teaspoon (2 g) of ground allspice\n1 teaspoon (2 g) of ground nutmeg\n½ teaspoon (1 g) of finely-ground black pepper Whisk in instant tea, sugar, milk powder, and the nondairy creamers.",
        "Use 1 ½ cups (187 g) of unsweetened or decaffeinated black tea and add between 1 ½ and 2 cups (300 to 400 g) of sugar, depending on how sweet you like your chai.",
        "To make your chai mix milky, whisk in 1 cup (125 g) of nonfat dry milk powder, 1 cup (125 g) of powdered nondairy creamer, and 1 cup (125 g) of French vanilla-flavored powdered nondairy creamer.Variation: To add a chocolate taste to your chai, stir 1/2 cup (59 g) of unsweetened cocoa powder into the chai mix.",
        "If you don't want to buy 3 different powdered products, use a total of 3 cups (375 g) of any 1 of these ingredients.",
        "Store the mix in an airtight container until you’re ready to drink it.",
        "Your chai mix is good to use for up to 6 months.",
        "Keep it in your pantry in an airtight container, like a jar or a sealable bag, for maximum freshness.",
        "Remember to label the container so you know when to use the mix by.",
        "Dissolve 2 tablespoons (29.6 ml) (16 g) of mix in 1 cup (240 ml) of boiling water to make a mug of tea.",
        "To make a quick cup of chai tea, carefully pour the boiling water into a large mug.",
        "Then, stir in the powdered mix until it's completely dissolved.",
        "If you'd like even creamier chai tea, use milk or a combination of milk and water.",
        "If you added cocoa powder to the mix, use hot milk instead of water."
    ]
}