{
    "title": "How to Put on Sterile Gloves",
    "url": "https://www.wikihow.com/Put-on-Sterile-Gloves",
    "category_hierarchy": [
        "Health",
        "Medical Equipment"
    ],
    "parts": [
        {
            "name": "Ensuring Your Hands are Clean",
            "steps": [
                {
                    "headline": "Choose the proper glove size for you.",
                    "description": "Sterile gloves come in a wide range of sizes. These can vary by company. Try on several different pairs of sterile gloves until you find the right fit. Once you've found the right fit, you will have to discard the gloves you tried on and put a new, fully-sterile pair on. Feel for the following to identify when you have the right size for your hand:\nAbility to move your hands comfortably\nNo friction on your skin\nLittle to no sweating\nLittle or no hand muscle fatigue"
                },
                {
                    "headline": "Remove your jewelry.",
                    "description": "Although not necessary, consider taking off any rings, bracelets or other jewelry on your hands. These could contaminate your gloves or make them difficult to put on and uncomfortable to wear. Removing your jewelry also minimizes the risk of your glove tearing. Put your jewelry in a safe place where you can easily find it when you’re done with your gloves."
                },
                {
                    "headline": "Wash your hands thoroughly.",
                    "description": "Before you touch your gloves or slide on your sterile gloves, wash your own hands. Lather up your hands with soap and water. Rub your hands under the water flow for at least 20 seconds. Rinse your hands and wrists thoroughly and then dry them. Use an alcohol-based hand sanitizer if you don’t have soap and water. Some types of sterile procedures require a different type of soap and a different amount of scrubbing type."
                },
                {
                    "headline": "Keep your hands above your waist.",
                    "description": "Once you’re hands are thoroughly clean, avoid letting them fall below your waistline. Holding them above this level can minimize the risk of contaminating them. If your hands do fall below your waist, repeat the hand washing process before putting on your gloves. Standing up may help keep your arms above your waist."
                }
            ]
        },
        {
            "name": "Sliding on Your Gloves",
            "steps": [
                {
                    "headline": "Open the sterile glove package.",
                    "description": "Inspect the package for rips, discoloring, or dampness, and discard if the package is compromised. Open the outer wrap of the pack. Make sure to open from top then bottom and then on the side. Remember, you only have a 1 inch margin you can touch. This will expose the sterile inner package that contains your gloves. Note that sterile gloves also have a shelf-life. Before putting on your gloves, ensure that they're not expired."
                },
                {
                    "headline": "Remove the inner wrap.",
                    "description": "Take out the inner wrap and place it on a clean surface. Make sure you can see both sterile gloves through the packaging to ensure that you’ve opened the package properly."
                },
                {
                    "headline": "Pick up your dominant hand glove.",
                    "description": "Using the hand you don’t use to write, grab the glove for your dominant hand. Touch only the inside of the glove cuff (the side of the cuff that will be touching your skin). Putting on your dominant hand glove first can minimize the risk of ripping or contamination to the hand you’re likely using most."
                },
                {
                    "headline": "Place the glove onto your dominant hand.",
                    "description": "Let the glove hang with the fingers pointing downward. Make sure your hands are not below the waist and above the shoulders to ensure the sterility. Then slide your dominant hand into the glove with your palm facing up and fingers open. Remember to touch only the inside of the glove to prevent any potential contamination. Make adjustments only once the other glove is on."
                },
                {
                    "headline": "Slip on the second glove.",
                    "description": "Put the fingers of your gloved hand into the folded cuff of the other glove and lift it up. Keeping your second hand flat and palm facing up, place the glove over your fingers. Then pull the second glove over your hand. Hold your gloved hand up to prevent touching your bare palm or wrist."
                },
                {
                    "headline": "Adjust your gloves.",
                    "description": "Once both gloves are on, you can adjust them. Reach under the cuffed part of each glove to pull them up or make any other adjustments you may need. Do not reach between the skin and the cuff. Smooth each glove out on your hands. They should feel snug without cutting off your circulation or feeling uncomfortable."
                },
                {
                    "headline": "Check the gloves for rips.",
                    "description": "Look over each hand and glove thoroughly. If you notice any visible rips, tears, or other issues, re-wash your hands and put on new gloves."
                }
            ]
        }
    ],
    "tyn": [
        "Clean working space",
        "Soap or alcohol-based hand sanitizer",
        "Sterile gloves"
    ],
    "text": " Ensuring Your Hands are Clean Choose the proper glove size for you. Sterile gloves come in a wide range of sizes. These can vary by company. Try on several different pairs of sterile gloves until you find the right fit. Once you've found the right fit, you will have to discard the gloves you tried on and put a new, fully-sterile pair on. Feel for the following to identify when you have the right size for your hand:\nAbility to move your hands comfortably\nNo friction on your skin\nLittle to no sweating\nLittle or no hand muscle fatigue Remove your jewelry. Although not necessary, consider taking off any rings, bracelets or other jewelry on your hands. These could contaminate your gloves or make them difficult to put on and uncomfortable to wear. Removing your jewelry also minimizes the risk of your glove tearing. Put your jewelry in a safe place where you can easily find it when you’re done with your gloves. Wash your hands thoroughly. Before you touch your gloves or slide on your sterile gloves, wash your own hands. Lather up your hands with soap and water. Rub your hands under the water flow for at least 20 seconds. Rinse your hands and wrists thoroughly and then dry them. Use an alcohol-based hand sanitizer if you don’t have soap and water. Some types of sterile procedures require a different type of soap and a different amount of scrubbing type. Keep your hands above your waist. Once you’re hands are thoroughly clean, avoid letting them fall below your waistline. Holding them above this level can minimize the risk of contaminating them. If your hands do fall below your waist, repeat the hand washing process before putting on your gloves. Standing up may help keep your arms above your waist. Sliding on Your Gloves Open the sterile glove package. Inspect the package for rips, discoloring, or dampness, and discard if the package is compromised. Open the outer wrap of the pack. Make sure to open from top then bottom and then on the side. Remember, you only have a 1 inch margin you can touch. This will expose the sterile inner package that contains your gloves. Note that sterile gloves also have a shelf-life. Before putting on your gloves, ensure that they're not expired. Remove the inner wrap. Take out the inner wrap and place it on a clean surface. Make sure you can see both sterile gloves through the packaging to ensure that you’ve opened the package properly. Pick up your dominant hand glove. Using the hand you don’t use to write, grab the glove for your dominant hand. Touch only the inside of the glove cuff (the side of the cuff that will be touching your skin). Putting on your dominant hand glove first can minimize the risk of ripping or contamination to the hand you’re likely using most. Place the glove onto your dominant hand. Let the glove hang with the fingers pointing downward. Make sure your hands are not below the waist and above the shoulders to ensure the sterility. Then slide your dominant hand into the glove with your palm facing up and fingers open. Remember to touch only the inside of the glove to prevent any potential contamination. Make adjustments only once the other glove is on. Slip on the second glove. Put the fingers of your gloved hand into the folded cuff of the other glove and lift it up. Keeping your second hand flat and palm facing up, place the glove over your fingers. Then pull the second glove over your hand. Hold your gloved hand up to prevent touching your bare palm or wrist. Adjust your gloves. Once both gloves are on, you can adjust them. Reach under the cuffed part of each glove to pull them up or make any other adjustments you may need. Do not reach between the skin and the cuff. Smooth each glove out on your hands. They should feel snug without cutting off your circulation or feeling uncomfortable. Check the gloves for rips. Look over each hand and glove thoroughly. If you notice any visible rips, tears, or other issues, re-wash your hands and put on new gloves.",
    "sentences": [
        " Ensuring Your Hands are Clean Choose the proper glove size for you.",
        "Sterile gloves come in a wide range of sizes.",
        "These can vary by company.",
        "Try on several different pairs of sterile gloves until you find the right fit.",
        "Once you've found the right fit, you will have to discard the gloves you tried on and put a new, fully-sterile pair on.",
        "Feel for the following to identify when you have the right size for your hand:\nAbility to move your hands comfortably\nNo friction on your skin\nLittle to no sweating\nLittle or no hand muscle fatigue Remove your jewelry.",
        "Although not necessary, consider taking off any rings, bracelets or other jewelry on your hands.",
        "These could contaminate your gloves or make them difficult to put on and uncomfortable to wear.",
        "Removing your jewelry also minimizes the risk of your glove tearing.",
        "Put your jewelry in a safe place where you can easily find it when you’re done with your gloves.",
        "Wash your hands thoroughly.",
        "Before you touch your gloves or slide on your sterile gloves, wash your own hands.",
        "Lather up your hands with soap and water.",
        "Rub your hands under the water flow for at least 20 seconds.",
        "Rinse your hands and wrists thoroughly and then dry them.",
        "Use an alcohol-based hand sanitizer if you don’t have soap and water.",
        "Some types of sterile procedures require a different type of soap and a different amount of scrubbing type.",
        "Keep your hands above your waist.",
        "Once you’re hands are thoroughly clean, avoid letting them fall below your waistline.",
        "Holding them above this level can minimize the risk of contaminating them.",
        "If your hands do fall below your waist, repeat the hand washing process before putting on your gloves.",
        "Standing up may help keep your arms above your waist.",
        "Sliding on Your Gloves Open the sterile glove package.",
        "Inspect the package for rips, discoloring, or dampness, and discard if the package is compromised.",
        "Open the outer wrap of the pack.",
        "Make sure to open from top then bottom and then on the side.",
        "Remember, you only have a 1 inch margin you can touch.",
        "This will expose the sterile inner package that contains your gloves.",
        "Note that sterile gloves also have a shelf-life.",
        "Before putting on your gloves, ensure that they're not expired.",
        "Remove the inner wrap.",
        "Take out the inner wrap and place it on a clean surface.",
        "Make sure you can see both sterile gloves through the packaging to ensure that you’ve opened the package properly.",
        "Pick up your dominant hand glove.",
        "Using the hand you don’t use to write, grab the glove for your dominant hand.",
        "Touch only the inside of the glove cuff (the side of the cuff that will be touching your skin).",
        "Putting on your dominant hand glove first can minimize the risk of ripping or contamination to the hand you’re likely using most.",
        "Place the glove onto your dominant hand.",
        "Let the glove hang with the fingers pointing downward.",
        "Make sure your hands are not below the waist and above the shoulders to ensure the sterility.",
        "Then slide your dominant hand into the glove with your palm facing up and fingers open.",
        "Remember to touch only the inside of the glove to prevent any potential contamination.",
        "Make adjustments only once the other glove is on.",
        "Slip on the second glove.",
        "Put the fingers of your gloved hand into the folded cuff of the other glove and lift it up.",
        "Keeping your second hand flat and palm facing up, place the glove over your fingers.",
        "Then pull the second glove over your hand.",
        "Hold your gloved hand up to prevent touching your bare palm or wrist.",
        "Adjust your gloves.",
        "Once both gloves are on, you can adjust them.",
        "Reach under the cuffed part of each glove to pull them up or make any other adjustments you may need.",
        "Do not reach between the skin and the cuff.",
        "Smooth each glove out on your hands.",
        "They should feel snug without cutting off your circulation or feeling uncomfortable.",
        "Check the gloves for rips.",
        "Look over each hand and glove thoroughly.",
        "If you notice any visible rips, tears, or other issues, re-wash your hands and put on new gloves."
    ]
}