{
    "title": "How to Sew a Handbag",
    "url": "https://www.wikihow.com/Sew-a-Handbag",
    "category_hierarchy": [
        "Personal Care and Style",
        "Bags"
    ],
    "steps": [
        {
            "headline": "Cut out four square pieces of fabric the exact same size.",
            "description": "Make sure that if you are making a small messenger bag that it's around 12 inches (30.5 cm) in length and 10 inches (25.4 cm) in width."
        },
        {
            "headline": "Two pieces are for your lining one for the out side of the bag.",
            "description": "If you want extra body try using a fusible product such as craft fuse, décor bond or form-flex. This gets fused with an iron to the lining of the bag before you sew it."
        },
        {
            "headline": "Sew the side seams with a ⁄2 inch (1.3 cm) seam.",
            "description": ""
        },
        {
            "headline": "Sew the bottom with a ⁄2 inch (1.3 cm) seam.",
            "description": ""
        },
        {
            "headline": "If you want you can box the bottom by measuring up 2 inches (5.1 cm) and creating a triangle measure in 2 inches (5.1 cm) sew across the diagonal.",
            "description": ""
        },
        {
            "headline": "Do this to both the lining and the outer bag.",
            "description": ""
        },
        {
            "headline": "To sew the bag and the lining together turn the outer bag right side out.",
            "description": "keep the lining right side in. place the outer bag into the lining and sew a ⁄2 inch (1.3 cm) seam around the top of the bag to secure the two pieces together. at the bottom of the lining open the bottom of the seam about 4 inches (10.2 cm) so that you can birth the outer bag through the lining opening."
        },
        {
            "headline": "Sew the lining back up by top-stitching the opening closed",
            "description": ""
        },
        {
            "headline": "Cut 2 handles at least 2 1/2 inches (5.1 cm) wide by however long you want your strap.",
            "description": "For a handbag you can cut the handles 2 1/2 x 21 inches or if you want it to cross your body at least 2 1/2 x 40 inches."
        },
        {
            "headline": "Sew handles right sides together using a ⁄4 inch (0.6 cm) seam down the length of the fabric.",
            "description": ""
        },
        {
            "headline": "Fold in the top and the bottom and top-stitch 1/8 around the handles and the bag.",
            "description": ""
        },
        {
            "headline": "Attach to the purse by measuring 2 1/4 inches (10.2 cm) down and 2 inches (5.1 cm) from the side.",
            "description": "this is where you mark to add your straps."
        },
        {
            "headline": "Sew a box around the handle edges and then sew an x across to really secure the straps.",
            "description": ""
        },
        {
            "headline": "Enjoy you bag!",
            "description": ""
        }
    ],
    "tyn": [
        "Fabric ",
        "1⁄2",
        "1",
        "⁄",
        "2",
        " yard (0.5 m)",
        "Lining ",
        "Pins",
        "Scissors",
        "Machine in good working order"
    ],
    "text": " Cut out four square pieces of fabric the exact same size. Make sure that if you are making a small messenger bag that it's around 12 inches (30.5 cm) in length and 10 inches (25.4 cm) in width. Two pieces are for your lining one for the out side of the bag. If you want extra body try using a fusible product such as craft fuse, décor bond or form-flex. This gets fused with an iron to the lining of the bag before you sew it. Sew the side seams with a ⁄2 inch (1.3 cm) seam.  Sew the bottom with a ⁄2 inch (1.3 cm) seam.  If you want you can box the bottom by measuring up 2 inches (5.1 cm) and creating a triangle measure in 2 inches (5.1 cm) sew across the diagonal.  Do this to both the lining and the outer bag.  To sew the bag and the lining together turn the outer bag right side out. keep the lining right side in. place the outer bag into the lining and sew a ⁄2 inch (1.3 cm) seam around the top of the bag to secure the two pieces together. at the bottom of the lining open the bottom of the seam about 4 inches (10.2 cm) so that you can birth the outer bag through the lining opening. Sew the lining back up by top-stitching the opening closed  Cut 2 handles at least 2 1/2 inches (5.1 cm) wide by however long you want your strap. For a handbag you can cut the handles 2 1/2 x 21 inches or if you want it to cross your body at least 2 1/2 x 40 inches. Sew handles right sides together using a ⁄4 inch (0.6 cm) seam down the length of the fabric.  Fold in the top and the bottom and top-stitch 1/8 around the handles and the bag.  Attach to the purse by measuring 2 1/4 inches (10.2 cm) down and 2 inches (5.1 cm) from the side. this is where you mark to add your straps. Sew a box around the handle edges and then sew an x across to really secure the straps.  Enjoy you bag! ",
    "sentences": [
        " Cut out four square pieces of fabric the exact same size.",
        "Make sure that if you are making a small messenger bag that it's around 12 inches (30.5 cm) in length and 10 inches (25.4 cm) in width.",
        "Two pieces are for your lining one for the out side of the bag.",
        "If you want extra body try using a fusible product such as craft fuse, décor bond or form-flex.",
        "This gets fused with an iron to the lining of the bag before you sew it.",
        "Sew the side seams with a ⁄2 inch (1.3 cm) seam.",
        "Sew the bottom with a ⁄2 inch (1.3 cm) seam.",
        "If you want you can box the bottom by measuring up 2 inches (5.1 cm) and creating a triangle measure in 2 inches (5.1 cm) sew across the diagonal.",
        "Do this to both the lining and the outer bag.",
        "To sew the bag and the lining together turn the outer bag right side out.",
        "keep the lining right side in.",
        "place the outer bag into the lining and sew a ⁄2 inch (1.3 cm) seam around the top of the bag to secure the two pieces together.",
        "at the bottom of the lining open the bottom of the seam about 4 inches (10.2 cm) so that you can birth the outer bag through the lining opening.",
        "Sew the lining back up by top-stitching the opening closed  Cut 2 handles at least 2 1/2 inches (5.1 cm) wide by however long you want your strap.",
        "For a handbag you can cut the handles 2 1/2 x 21 inches or if you want it to cross your body at least 2 1/2 x 40 inches.",
        "Sew handles right sides together using a ⁄4 inch (0.6 cm) seam down the length of the fabric.",
        "Fold in the top and the bottom and top-stitch 1/8 around the handles and the bag.",
        "Attach to the purse by measuring 2 1/4 inches (10.2 cm) down and 2 inches (5.1 cm) from the side.",
        "this is where you mark to add your straps.",
        "Sew a box around the handle edges and then sew an x across to really secure the straps.",
        "Enjoy you bag!"
    ]
}