{
    "title": "How to Get Tight Abs",
    "url": "https://www.wikihow.com/Get-Tight-Abs",
    "category_hierarchy": [
        "Sports and Fitness",
        "Personal Fitness",
        "Building Muscle & Strength"
    ],
    "parts": [
        {
            "name": "Burning Fat",
            "steps": [
                {
                    "headline": "Eat well.",
                    "description": "Before you start thinking of tightening your abs, you've got to work on shedding the fat above them. One of most important ways to do this is to make sure you keep a healthy diet. You don't have to count calories, but you should focus on eating three healthy meals a day and cutting down on foods that are high in fat and sugar. Here's how to do it:. Replace the foods you eat that are high in fat and sugar, like fast food, deep-fried food, and ice cream, with healthier foods, like frozen yogurt, meat, vegetables, and fruits. Choose high-protein foods like fish, poultry, lentils, and beans. If you're not burning enough fat by eating 3 healthy meals a day, try eating 4-5 smaller meals a day, which can help make you less hungry throughout the day. Don't skip meals. This will make you feel unbalanced and much more likely to binge eat. Tone down your alcohol intake. Alcohol is full of unnecessary calories that can be stored as fat."
                },
                {
                    "headline": "Get cardiovascular exercise.",
                    "description": "Another important part of shedding tummy fat is regular cardiovascular exercise. Anything that speeds up your heart rate and gives you a workout will burn calories. This doesn't mean you have to run everyday—if running isn't your thing, you can try walking, dancing, cycling, or swimming. You can also go for long fast-paced walks, climb stairs, go hiking, or even do circuit training at your local gym. Hula hooping or jump roping are other great ways to get some cardiovascular exercise. Jumping jacks are another great way to speed up your heart rate."
                },
                {
                    "headline": "Dance.",
                    "description": "Dancing is not only fun and a great way to pass time with your friends or your significant other, but it can burn some serious calories while getting your body moving. You'll be having so much fun dancing that you won't even notice that you're burning fat. Here are some ways to dance:\nTake a salsa class. You'll burn calories by moving your hips in no time. Take a Zumba class. Zumba is a fast-paced full-body workout that is guaranteed to make you shed some some pounds. Go dancing at a club. Have some fun just dancing with your friends. You won't even notice when you've been dancing for an hour because you'll be having such a great time."
                }
            ]
        },
        {
            "name": "Strengthening Your Core",
            "steps": [
                {
                    "headline": "Learn to breathe.",
                    "description": "Even if you don't have time to work out, you can give your abs a little exercise by breathing. Place your hand on your stomach and feel your muscles tighten. Be sure not to suck in or push out very much—breathing should still be easy and even. You can improve your breathing by meditating as well."
                },
                {
                    "headline": "Maintain good posture.",
                    "description": "Even something as simple as keeping a good posture will help strengthen your core. While this alone will not give you tight abs, every little bit helps. Make sure to check your posture from time to time, whether you're sitting on the bus or at your desk."
                },
                {
                    "headline": "Do balance exercises.",
                    "description": "Balance exercises are a great way to strengthen your core, and they can help you burn calories. Some simple balance exercises you can do are:\nSquatting while standing on the balls of your feet. Walking on a balance board. Balancing on 1 leg for as long as you can. Practicing tandem walking."
                },
                {
                    "headline": "Do power yoga.",
                    "description": "Yoga is a fantastic way to strengthen your core while burning some calories. Yoga improves your breathing and gives you a workout that strengthens your entire body, especially the core, which is the key to hitting many yoga poses. Take a yoga class just two or three times a week and you'll notice the difference on your body and abs. The vinyasa, a yoga cycle consisting of three poses used to rejuvenate the body between poses, works your core tremendously. An hour-long yoga class can consist of at least twenty or thirty Vinyasas, and you will feel the difference. Many power yoga classes even incorporate specific ab exercises into the practice, such as the bicycle."
                }
            ]
        },
        {
            "name": "Working Out Your Abs",
            "steps": [
                {
                    "headline": "Plan your abdominal workout routine.",
                    "description": "You can do the exercises in the comfort of your own home with only a mat and a swiss ball. You should start working out your abs for just 20-25 minutes twice a week, and work up to doing the exercises three times a week. When you begin your series of exercises, remember that quality is better than quantity, and that you should do each exercise just 2 or 3 times for a series of 15-20 reps each time. Save your ab workouts for the end of your routine if you'll be doing other kinds of exercises as well."
                },
                {
                    "headline": "Stretch well.",
                    "description": "It's important to stretch after you do any form of exercise to keep your elasticity, loosen up your muscles, and to get the most benefit from your workout. Do active stretches before your workouts, and static stretches after. Here are some great stretches to try for your back, abs, and arms:\nStretch your back and abs with some yoga poses. Start off with some simple yoga poses, such as the camel pose, bow pose,  or cobra pose. You can also stand up and touch your toes. Stretch out over a swiss ball like you're doing a backbend to feel a deep stretch in your abs. If you can do a backbend or a bridge, this is another great way to stretch out your abs and back."
                },
                {
                    "headline": "Do a crunch with your legs in the air.",
                    "description": "Cross your arms over your chest and keep your feet lifted but close together. Then lift your head, and then your shoulders toward your bent knees. Hold the position and lower back to the ground. Do a series of ten or twenty crunches before resting. Repeat three to five times."
                },
                {
                    "headline": "Do the reverse crunch.",
                    "description": "Lie on the floor and put your knees together at a 90 degree angle. Put your hands by your sides, or behind your head if you feel particularly strong. Contract your abs to lift your hips up towards your rib cage. Be careful not to use momentum from your legs here—you should be mostly using your abs. Breathe out as you contract your muscles and in as you lower your legs. Do 1-3 sets of 10-20 reps."
                },
                {
                    "headline": "Do the bent-elbow plank.",
                    "description": "Lie on your stomach with your elbows in line with your shoulders. Lift yourself onto your toes and forearms. Contract your abs and make sure that your back stays in a straight line. Hold this pose for at least 5 seconds—ideally you'll be able to hold it for 60-90 seconds without rest. For an added challenge, drop one hip towards the floor. Hold for a bit, then return to the basic plank position. Repeat with the other hip. This can also be done with an exercise ball—put the ball under your feet before you assume plank position. Then, use controlled motions to keep the ball in place under your legs. Gradually work up to doing 3, 60-second bent-elbow planks. Once you're able to do that, you can add in different variations."
                },
                {
                    "headline": "Do the bicycle.",
                    "description": "Lie on your back and bend your knees at 90 degrees. Put your fingertips behind your ears. Lift your upper back off the ground while staring up at around 45 degrees from the floor. Extend your left leg and bring your right knee in towards you chest. Keep your arms still and your upper back off the ground. Make sure that each moment is highly controlled—you don't want to move your hips. Once you find your rhythm, you'll feel like your legs are really cycling a bicycle in the air. Do the bicycle for one minute at a time before resting. Repeat 2 or 3 times."
                },
                {
                    "headline": "Do the high knees exercise.",
                    "description": "Just stand in place with your arms at your sides and your back straight. Then put your hands on your hips as you raise your right knee without changing your posture. Put your left knee down and raise your right knee. Alternate lifting your right and left knee 10 times each, or focus on holding your knees up for 30-60 seconds. Then rest and do two more sets. Keep your abs tightened and your spine straight."
                },
                {
                    "headline": "Do stability ball crunches.",
                    "description": "Sit on a stability ball and walk your legs forward until the ball is pressing into your back. Your torso should be at a 45-degree angle from the floor. When you're ready, crunch forward and then lower your back into the starting position."
                },
                {
                    "headline": "Rest.",
                    "description": "Just like any muscle, your abs need time to recover between workouts. Working them too much will not give them the time to rebuild, and you're less likely to get the desired result."
                },
                {
                    "headline": "Don't get discouraged if you're not getting the results you want.",
                    "description": "The older you get, the more difficult it will be to get a six pack. Women also have a hard time getting six packs, because their bodies store more fat than men's bodies. Don't get obsessed with the idea of a six pack—just work on getting tighter abs and you'll feel great."
                }
            ]
        }
    ],
    "tyn": [
        "An open space",
        "Comfy clothes",
        "Swiss ball",
        "A mat"
    ],
    "text": " Burning Fat Eat well. Before you start thinking of tightening your abs, you've got to work on shedding the fat above them. One of most important ways to do this is to make sure you keep a healthy diet. You don't have to count calories, but you should focus on eating three healthy meals a day and cutting down on foods that are high in fat and sugar. Here's how to do it:. Replace the foods you eat that are high in fat and sugar, like fast food, deep-fried food, and ice cream, with healthier foods, like frozen yogurt, meat, vegetables, and fruits. Choose high-protein foods like fish, poultry, lentils, and beans. If you're not burning enough fat by eating 3 healthy meals a day, try eating 4-5 smaller meals a day, which can help make you less hungry throughout the day. Don't skip meals. This will make you feel unbalanced and much more likely to binge eat. Tone down your alcohol intake. Alcohol is full of unnecessary calories that can be stored as fat. Get cardiovascular exercise. Another important part of shedding tummy fat is regular cardiovascular exercise. Anything that speeds up your heart rate and gives you a workout will burn calories. This doesn't mean you have to run everyday—if running isn't your thing, you can try walking, dancing, cycling, or swimming. You can also go for long fast-paced walks, climb stairs, go hiking, or even do circuit training at your local gym. Hula hooping or jump roping are other great ways to get some cardiovascular exercise. Jumping jacks are another great way to speed up your heart rate. Dance. Dancing is not only fun and a great way to pass time with your friends or your significant other, but it can burn some serious calories while getting your body moving. You'll be having so much fun dancing that you won't even notice that you're burning fat. Here are some ways to dance:\nTake a salsa class. You'll burn calories by moving your hips in no time. Take a Zumba class. Zumba is a fast-paced full-body workout that is guaranteed to make you shed some some pounds. Go dancing at a club. Have some fun just dancing with your friends. You won't even notice when you've been dancing for an hour because you'll be having such a great time. Strengthening Your Core Learn to breathe. Even if you don't have time to work out, you can give your abs a little exercise by breathing. Place your hand on your stomach and feel your muscles tighten. Be sure not to suck in or push out very much—breathing should still be easy and even. You can improve your breathing by meditating as well. Maintain good posture. Even something as simple as keeping a good posture will help strengthen your core. While this alone will not give you tight abs, every little bit helps. Make sure to check your posture from time to time, whether you're sitting on the bus or at your desk. Do balance exercises. Balance exercises are a great way to strengthen your core, and they can help you burn calories. Some simple balance exercises you can do are:\nSquatting while standing on the balls of your feet. Walking on a balance board. Balancing on 1 leg for as long as you can. Practicing tandem walking. Do power yoga. Yoga is a fantastic way to strengthen your core while burning some calories. Yoga improves your breathing and gives you a workout that strengthens your entire body, especially the core, which is the key to hitting many yoga poses. Take a yoga class just two or three times a week and you'll notice the difference on your body and abs. The vinyasa, a yoga cycle consisting of three poses used to rejuvenate the body between poses, works your core tremendously. An hour-long yoga class can consist of at least twenty or thirty Vinyasas, and you will feel the difference. Many power yoga classes even incorporate specific ab exercises into the practice, such as the bicycle. Working Out Your Abs Plan your abdominal workout routine. You can do the exercises in the comfort of your own home with only a mat and a swiss ball. You should start working out your abs for just 20-25 minutes twice a week, and work up to doing the exercises three times a week. When you begin your series of exercises, remember that quality is better than quantity, and that you should do each exercise just 2 or 3 times for a series of 15-20 reps each time. Save your ab workouts for the end of your routine if you'll be doing other kinds of exercises as well. Stretch well. It's important to stretch after you do any form of exercise to keep your elasticity, loosen up your muscles, and to get the most benefit from your workout. Do active stretches before your workouts, and static stretches after. Here are some great stretches to try for your back, abs, and arms:\nStretch your back and abs with some yoga poses. Start off with some simple yoga poses, such as the camel pose, bow pose,  or cobra pose. You can also stand up and touch your toes. Stretch out over a swiss ball like you're doing a backbend to feel a deep stretch in your abs. If you can do a backbend or a bridge, this is another great way to stretch out your abs and back. Do a crunch with your legs in the air. Cross your arms over your chest and keep your feet lifted but close together. Then lift your head, and then your shoulders toward your bent knees. Hold the position and lower back to the ground. Do a series of ten or twenty crunches before resting. Repeat three to five times. Do the reverse crunch. Lie on the floor and put your knees together at a 90 degree angle. Put your hands by your sides, or behind your head if you feel particularly strong. Contract your abs to lift your hips up towards your rib cage. Be careful not to use momentum from your legs here—you should be mostly using your abs. Breathe out as you contract your muscles and in as you lower your legs. Do 1-3 sets of 10-20 reps. Do the bent-elbow plank. Lie on your stomach with your elbows in line with your shoulders. Lift yourself onto your toes and forearms. Contract your abs and make sure that your back stays in a straight line. Hold this pose for at least 5 seconds—ideally you'll be able to hold it for 60-90 seconds without rest. For an added challenge, drop one hip towards the floor. Hold for a bit, then return to the basic plank position. Repeat with the other hip. This can also be done with an exercise ball—put the ball under your feet before you assume plank position. Then, use controlled motions to keep the ball in place under your legs. Gradually work up to doing 3, 60-second bent-elbow planks. Once you're able to do that, you can add in different variations. Do the bicycle. Lie on your back and bend your knees at 90 degrees. Put your fingertips behind your ears. Lift your upper back off the ground while staring up at around 45 degrees from the floor. Extend your left leg and bring your right knee in towards you chest. Keep your arms still and your upper back off the ground. Make sure that each moment is highly controlled—you don't want to move your hips. Once you find your rhythm, you'll feel like your legs are really cycling a bicycle in the air. Do the bicycle for one minute at a time before resting. Repeat 2 or 3 times. Do the high knees exercise. Just stand in place with your arms at your sides and your back straight. Then put your hands on your hips as you raise your right knee without changing your posture. Put your left knee down and raise your right knee. Alternate lifting your right and left knee 10 times each, or focus on holding your knees up for 30-60 seconds. Then rest and do two more sets. Keep your abs tightened and your spine straight. Do stability ball crunches. Sit on a stability ball and walk your legs forward until the ball is pressing into your back. Your torso should be at a 45-degree angle from the floor. When you're ready, crunch forward and then lower your back into the starting position. Rest. Just like any muscle, your abs need time to recover between workouts. Working them too much will not give them the time to rebuild, and you're less likely to get the desired result. Don't get discouraged if you're not getting the results you want. The older you get, the more difficult it will be to get a six pack. Women also have a hard time getting six packs, because their bodies store more fat than men's bodies. Don't get obsessed with the idea of a six pack—just work on getting tighter abs and you'll feel great.",
    "sentences": [
        " Burning Fat Eat well.",
        "Before you start thinking of tightening your abs, you've got to work on shedding the fat above them.",
        "One of most important ways to do this is to make sure you keep a healthy diet.",
        "You don't have to count calories, but you should focus on eating three healthy meals a day and cutting down on foods that are high in fat and sugar.",
        "Here's how to do it:.",
        "Replace the foods you eat that are high in fat and sugar, like fast food, deep-fried food, and ice cream, with healthier foods, like frozen yogurt, meat, vegetables, and fruits.",
        "Choose high-protein foods like fish, poultry, lentils, and beans.",
        "If you're not burning enough fat by eating 3 healthy meals a day, try eating 4-5 smaller meals a day, which can help make you less hungry throughout the day.",
        "Don't skip meals.",
        "This will make you feel unbalanced and much more likely to binge eat.",
        "Tone down your alcohol intake.",
        "Alcohol is full of unnecessary calories that can be stored as fat.",
        "Get cardiovascular exercise.",
        "Another important part of shedding tummy fat is regular cardiovascular exercise.",
        "Anything that speeds up your heart rate and gives you a workout will burn calories.",
        "This doesn't mean you have to run everyday—if running isn't your thing, you can try walking, dancing, cycling, or swimming.",
        "You can also go for long fast-paced walks, climb stairs, go hiking, or even do circuit training at your local gym.",
        "Hula hooping or jump roping are other great ways to get some cardiovascular exercise.",
        "Jumping jacks are another great way to speed up your heart rate.",
        "Dance.",
        "Dancing is not only fun and a great way to pass time with your friends or your significant other, but it can burn some serious calories while getting your body moving.",
        "You'll be having so much fun dancing that you won't even notice that you're burning fat.",
        "Here are some ways to dance:\nTake a salsa class.",
        "You'll burn calories by moving your hips in no time.",
        "Take a Zumba class.",
        "Zumba is a fast-paced full-body workout that is guaranteed to make you shed some some pounds.",
        "Go dancing at a club.",
        "Have some fun just dancing with your friends.",
        "You won't even notice when you've been dancing for an hour because you'll be having such a great time.",
        "Strengthening Your Core Learn to breathe.",
        "Even if you don't have time to work out, you can give your abs a little exercise by breathing.",
        "Place your hand on your stomach and feel your muscles tighten.",
        "Be sure not to suck in or push out very much—breathing should still be easy and even.",
        "You can improve your breathing by meditating as well.",
        "Maintain good posture.",
        "Even something as simple as keeping a good posture will help strengthen your core.",
        "While this alone will not give you tight abs, every little bit helps.",
        "Make sure to check your posture from time to time, whether you're sitting on the bus or at your desk.",
        "Do balance exercises.",
        "Balance exercises are a great way to strengthen your core, and they can help you burn calories.",
        "Some simple balance exercises you can do are:\nSquatting while standing on the balls of your feet.",
        "Walking on a balance board.",
        "Balancing on 1 leg for as long as you can.",
        "Practicing tandem walking.",
        "Do power yoga.",
        "Yoga is a fantastic way to strengthen your core while burning some calories.",
        "Yoga improves your breathing and gives you a workout that strengthens your entire body, especially the core, which is the key to hitting many yoga poses.",
        "Take a yoga class just two or three times a week and you'll notice the difference on your body and abs.",
        "The vinyasa, a yoga cycle consisting of three poses used to rejuvenate the body between poses, works your core tremendously.",
        "An hour-long yoga class can consist of at least twenty or thirty Vinyasas, and you will feel the difference.",
        "Many power yoga classes even incorporate specific ab exercises into the practice, such as the bicycle.",
        "Working Out Your Abs Plan your abdominal workout routine.",
        "You can do the exercises in the comfort of your own home with only a mat and a swiss ball.",
        "You should start working out your abs for just 20-25 minutes twice a week, and work up to doing the exercises three times a week.",
        "When you begin your series of exercises, remember that quality is better than quantity, and that you should do each exercise just 2 or 3 times for a series of 15-20 reps each time.",
        "Save your ab workouts for the end of your routine if you'll be doing other kinds of exercises as well.",
        "Stretch well.",
        "It's important to stretch after you do any form of exercise to keep your elasticity, loosen up your muscles, and to get the most benefit from your workout.",
        "Do active stretches before your workouts, and static stretches after.",
        "Here are some great stretches to try for your back, abs, and arms:\nStretch your back and abs with some yoga poses.",
        "Start off with some simple yoga poses, such as the camel pose, bow pose,  or cobra pose.",
        "You can also stand up and touch your toes.",
        "Stretch out over a swiss ball like you're doing a backbend to feel a deep stretch in your abs.",
        "If you can do a backbend or a bridge, this is another great way to stretch out your abs and back.",
        "Do a crunch with your legs in the air.",
        "Cross your arms over your chest and keep your feet lifted but close together.",
        "Then lift your head, and then your shoulders toward your bent knees.",
        "Hold the position and lower back to the ground.",
        "Do a series of ten or twenty crunches before resting.",
        "Repeat three to five times.",
        "Do the reverse crunch.",
        "Lie on the floor and put your knees together at a 90 degree angle.",
        "Put your hands by your sides, or behind your head if you feel particularly strong.",
        "Contract your abs to lift your hips up towards your rib cage.",
        "Be careful not to use momentum from your legs here—you should be mostly using your abs.",
        "Breathe out as you contract your muscles and in as you lower your legs.",
        "Do 1-3 sets of 10-20 reps. Do the bent-elbow plank.",
        "Lie on your stomach with your elbows in line with your shoulders.",
        "Lift yourself onto your toes and forearms.",
        "Contract your abs and make sure that your back stays in a straight line.",
        "Hold this pose for at least 5 seconds—ideally you'll be able to hold it for 60-90 seconds without rest.",
        "For an added challenge, drop one hip towards the floor.",
        "Hold for a bit, then return to the basic plank position.",
        "Repeat with the other hip.",
        "This can also be done with an exercise ball—put the ball under your feet before you assume plank position.",
        "Then, use controlled motions to keep the ball in place under your legs.",
        "Gradually work up to doing 3, 60-second bent-elbow planks.",
        "Once you're able to do that, you can add in different variations.",
        "Do the bicycle.",
        "Lie on your back and bend your knees at 90 degrees.",
        "Put your fingertips behind your ears.",
        "Lift your upper back off the ground while staring up at around 45 degrees from the floor.",
        "Extend your left leg and bring your right knee in towards you chest.",
        "Keep your arms still and your upper back off the ground.",
        "Make sure that each moment is highly controlled—you don't want to move your hips.",
        "Once you find your rhythm, you'll feel like your legs are really cycling a bicycle in the air.",
        "Do the bicycle for one minute at a time before resting.",
        "Repeat 2 or 3 times.",
        "Do the high knees exercise.",
        "Just stand in place with your arms at your sides and your back straight.",
        "Then put your hands on your hips as you raise your right knee without changing your posture.",
        "Put your left knee down and raise your right knee.",
        "Alternate lifting your right and left knee 10 times each, or focus on holding your knees up for 30-60 seconds.",
        "Then rest and do two more sets.",
        "Keep your abs tightened and your spine straight.",
        "Do stability ball crunches.",
        "Sit on a stability ball and walk your legs forward until the ball is pressing into your back.",
        "Your torso should be at a 45-degree angle from the floor.",
        "When you're ready, crunch forward and then lower your back into the starting position.",
        "Rest.",
        "Just like any muscle, your abs need time to recover between workouts.",
        "Working them too much will not give them the time to rebuild, and you're less likely to get the desired result.",
        "Don't get discouraged if you're not getting the results you want.",
        "The older you get, the more difficult it will be to get a six pack.",
        "Women also have a hard time getting six packs, because their bodies store more fat than men's bodies.",
        "Don't get obsessed with the idea of a six pack—just work on getting tighter abs and you'll feel great."
    ]
}