{
    "title": "How to Brew Green Tea",
    "url": "https://www.wikihow.com/Brew-Green-Tea",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Tea",
        "Green Tea"
    ],
    "methods": [
        {
            "name": "Choosing your green tea",
            "steps": [
                {
                    "headline": "Decide which green tea you'd like to drink.",
                    "description": "This isn't as easy as brewing it because there's a lot of choice! You will also need to decide between loose green tea and green tea teabags; while teabags are more convenient and there's nothing wrong with using them for flavor or strength, the loose tea may feel more authentic for a full experience of enjoying your green tea. Here are some green tea types to consider:\nGunpowder – the Chinese also call this \"Pearl Tea\". The tea resembles tiny gunpowder pellets. When water is added, the little pellets or pearls unfurl. This one stays freshest longest. Hyson – This has a very pungent taste, and has thick, yellow-green leaves twisted into thin and long shapes. Dragonwell – This variety is very popular in China. It tastes mellow and has a light green flavor. The leaves open to reveal a bud when water is added. Agarwood - mild traditional green tea taste. Make sure you use whole leaf tea vs tea made from the wood which is illegal to purchase. Pi Lo Chun – In Chinese this name translates to \"Green Snail Spring\". A rare tea, the little rolled leaves look like snails. Owing to the fact that the tea bushes are grown amid orchards, this tea tends to have the flavors of plums, peaches, and apricots embedded in the leaves. Matcha – This is powdered green tea leaves. It appears a bright green when water is added. Gu Zhang Mao Jian – This tea only uses the silvery-tipped young leaves picked within a set 10 day period during spring. While darker than other green teas, it has a smooth and sweet taste. Sencha – This is a common Japanese green tea. Jewel green matcha is a good choice for those who find other green tea too \"grass\" tasting. Gen Mai Cha (genmaicha) – This is sencha tea leaves mixed with fire-roasted rice. The taste is savory and earthy. Also Japanese in origin. Gyokuro – This Japanese green tea has leaves that look like pine needles, with a sweet and smooth taste. The tea looks green. Hojicha – A tea with large, unrolled leaves. It tastes nutty."
                },
                {
                    "headline": "Store purchased tea in an airtight, dark container to avoid loss of its qualities; the aromatic oils evaporate if not stored this way.",
                    "description": "Purchase small amounts only, and keep it in a cool spot. Green tea over six months old is no longer fresh."
                },
                {
                    "headline": "Consider keeping a separate teapot for your green tea.",
                    "description": "While this isn't necessary, it's a common practice for tea drinkers who regularly enjoy green tea because it prevents cross flavoring from black or herbal teas. If this doesn't bother you (indeed, you might not even notice the difference), just be sure to wash your regular teapot well. Green tea should only be brewed in ceramic, clay, china, glass, or stainless steel teapots. Do not use plastic or aluminum teapots."
                }
            ]
        },
        {
            "name": "Brewing loose green tea with a tea ball",
            "steps": [
                {
                    "headline": "Add the loose green tea to a tea ball (a spoonful is adequate).",
                    "description": "A tea ball can also be dropped into a teapot for one or two if easier. Just be sure that the tea ball has the capacity for the amount of cups you're planning on brewing."
                },
                {
                    "headline": "Drop the tea ball into a cup or mug of freshly boiled hot water.",
                    "description": "The boiled water should be \"first boil\" (see the boiling instructions under \"Brewing loose green tea in a teapot\" for more details). The water should be allowed to sit for a moment as the ideal temperature for water for green tea is 180 °F (82 °C), 80C."
                },
                {
                    "headline": "Put a lid or plate over the cup or mug (unless you're already using a tea ball container equipped with a lid, also known as an \"infuser basket\").",
                    "description": "Leave the tea to steep for a few minutes (3 to 5 minutes is usually enough, unless the tea instructions advise otherwise)."
                },
                {
                    "headline": "Remove the tea ball.",
                    "description": ""
                },
                {
                    "headline": "Serve.",
                    "description": "Enjoy it with some matcha and chocolate swirl cake."
                }
            ]
        },
        {
            "name": "Brewing loose green tea in a teapot or kettle",
            "steps": [
                {
                    "headline": "Preheat the teapot or kettle.",
                    "description": "Empty the heating water just before adding the brewing water."
                },
                {
                    "headline": "Boil the water to \"first boil\".",
                    "description": "This is when the water begins to boil but has not yet begun to simmer. The temperature at this stage will be 160ºF (71ºC). Bitter brews come from too high a temperature of water on green tea; prefer a longer steeping time at a cooler temperature instead."
                },
                {
                    "headline": "Place one rounded teaspoon of loose green tea or one teabag per cup into the teapot.",
                    "description": ""
                },
                {
                    "headline": "Pour over the boiling water.",
                    "description": "Let it steep for three to five minutes. Three minutes steeping results in  light flavor, while five minutes will give you a robust, full flavor. The longer the green tea is left in, the stronger the taste, so you might like to experiment as to which taste works best for you. For high grade tea such as \"gunpowder\" types, steeping time may be as few as 10 seconds on first brew. You can reuse the leaves several times, steeping slightly longer with each batch. It is advisable to allow the leaves to rest for a few minutes after the first two brews so as not to burn or overwork them. Always time the brewing and taste the tea rather than relying on color changes. Some green teas turn dark quickly but are not ready, while some stay light but are ready sooner than you may think."
                },
                {
                    "headline": "Pour into a sieve (to catch any loose tea, if you don't want it in your drink) over cups, mugs, or glasses.",
                    "description": "It is now ready to be enjoyed. In addition, Chinese green tea connoisseurs will also use a snifter cup to enhance the tea drinking experience. These cups are much smaller in diameter but longer in length to allow the scent to waft into the nostrils as you sip out of your main cup."
                }
            ]
        },
        {
            "name": "Brewing green tea teabags",
            "steps": [
                {
                    "headline": "Take out the green tea teabag.",
                    "description": ""
                },
                {
                    "headline": "Boil water and pour water into a mug.",
                    "description": "Or you can just microwave a cup of water. The boiled water should be \"first boil\" (see the boiling instructions under \"Brewing loose green tea in a teapot\" for more details)."
                },
                {
                    "headline": "Add the green tea bag to the cup of boiling water.",
                    "description": ""
                },
                {
                    "headline": "Allow the tea bag to steep in the hot water for 3-5 minutes.",
                    "description": ""
                },
                {
                    "headline": "Remove the teabag.",
                    "description": "Or, if preferred, you can leave the tea bag in the mug or you can remove the tea bag before enjoying your drink. It's your choice."
                },
                {
                    "headline": "Serve.",
                    "description": "Green tea is not usually sweetened, but if you wish to, then add sugar or honey to suit your taste. Now you're ready to enjoy green tea."
                }
            ]
        }
    ],
    "tyn": [
        "Teapot",
        "Tea strainer"
    ],
    "text": " Choosing your green tea Decide which green tea you'd like to drink. This isn't as easy as brewing it because there's a lot of choice! You will also need to decide between loose green tea and green tea teabags; while teabags are more convenient and there's nothing wrong with using them for flavor or strength, the loose tea may feel more authentic for a full experience of enjoying your green tea. Here are some green tea types to consider:\nGunpowder – the Chinese also call this \"Pearl Tea\". The tea resembles tiny gunpowder pellets. When water is added, the little pellets or pearls unfurl. This one stays freshest longest. Hyson – This has a very pungent taste, and has thick, yellow-green leaves twisted into thin and long shapes. Dragonwell – This variety is very popular in China. It tastes mellow and has a light green flavor. The leaves open to reveal a bud when water is added. Agarwood - mild traditional green tea taste. Make sure you use whole leaf tea vs tea made from the wood which is illegal to purchase. Pi Lo Chun – In Chinese this name translates to \"Green Snail Spring\". A rare tea, the little rolled leaves look like snails. Owing to the fact that the tea bushes are grown amid orchards, this tea tends to have the flavors of plums, peaches, and apricots embedded in the leaves. Matcha – This is powdered green tea leaves. It appears a bright green when water is added. Gu Zhang Mao Jian – This tea only uses the silvery-tipped young leaves picked within a set 10 day period during spring. While darker than other green teas, it has a smooth and sweet taste. Sencha – This is a common Japanese green tea. Jewel green matcha is a good choice for those who find other green tea too \"grass\" tasting. Gen Mai Cha (genmaicha) – This is sencha tea leaves mixed with fire-roasted rice. The taste is savory and earthy. Also Japanese in origin. Gyokuro – This Japanese green tea has leaves that look like pine needles, with a sweet and smooth taste. The tea looks green. Hojicha – A tea with large, unrolled leaves. It tastes nutty. Store purchased tea in an airtight, dark container to avoid loss of its qualities; the aromatic oils evaporate if not stored this way. Purchase small amounts only, and keep it in a cool spot. Green tea over six months old is no longer fresh. Consider keeping a separate teapot for your green tea. While this isn't necessary, it's a common practice for tea drinkers who regularly enjoy green tea because it prevents cross flavoring from black or herbal teas. If this doesn't bother you (indeed, you might not even notice the difference), just be sure to wash your regular teapot well. Green tea should only be brewed in ceramic, clay, china, glass, or stainless steel teapots. Do not use plastic or aluminum teapots. Brewing loose green tea with a tea ball Add the loose green tea to a tea ball (a spoonful is adequate). A tea ball can also be dropped into a teapot for one or two if easier. Just be sure that the tea ball has the capacity for the amount of cups you're planning on brewing. Drop the tea ball into a cup or mug of freshly boiled hot water. The boiled water should be \"first boil\" (see the boiling instructions under \"Brewing loose green tea in a teapot\" for more details). The water should be allowed to sit for a moment as the ideal temperature for water for green tea is 180 °F (82 °C), 80C. Put a lid or plate over the cup or mug (unless you're already using a tea ball container equipped with a lid, also known as an \"infuser basket\"). Leave the tea to steep for a few minutes (3 to 5 minutes is usually enough, unless the tea instructions advise otherwise). Remove the tea ball.  Serve. Enjoy it with some matcha and chocolate swirl cake. Brewing loose green tea in a teapot or kettle Preheat the teapot or kettle. Empty the heating water just before adding the brewing water. Boil the water to \"first boil\". This is when the water begins to boil but has not yet begun to simmer. The temperature at this stage will be 160ºF (71ºC). Bitter brews come from too high a temperature of water on green tea; prefer a longer steeping time at a cooler temperature instead. Place one rounded teaspoon of loose green tea or one teabag per cup into the teapot.  Pour over the boiling water. Let it steep for three to five minutes. Three minutes steeping results in  light flavor, while five minutes will give you a robust, full flavor. The longer the green tea is left in, the stronger the taste, so you might like to experiment as to which taste works best for you. For high grade tea such as \"gunpowder\" types, steeping time may be as few as 10 seconds on first brew. You can reuse the leaves several times, steeping slightly longer with each batch. It is advisable to allow the leaves to rest for a few minutes after the first two brews so as not to burn or overwork them. Always time the brewing and taste the tea rather than relying on color changes. Some green teas turn dark quickly but are not ready, while some stay light but are ready sooner than you may think. Pour into a sieve (to catch any loose tea, if you don't want it in your drink) over cups, mugs, or glasses. It is now ready to be enjoyed. In addition, Chinese green tea connoisseurs will also use a snifter cup to enhance the tea drinking experience. These cups are much smaller in diameter but longer in length to allow the scent to waft into the nostrils as you sip out of your main cup. Brewing green tea teabags Take out the green tea teabag.  Boil water and pour water into a mug. Or you can just microwave a cup of water. The boiled water should be \"first boil\" (see the boiling instructions under \"Brewing loose green tea in a teapot\" for more details). Add the green tea bag to the cup of boiling water.  Allow the tea bag to steep in the hot water for 3-5 minutes.  Remove the teabag. Or, if preferred, you can leave the tea bag in the mug or you can remove the tea bag before enjoying your drink. It's your choice. Serve. Green tea is not usually sweetened, but if you wish to, then add sugar or honey to suit your taste. Now you're ready to enjoy green tea.",
    "sentences": [
        " Choosing your green tea Decide which green tea you'd like to drink.",
        "This isn't as easy as brewing it because there's a lot of choice!",
        "You will also need to decide between loose green tea and green tea teabags; while teabags are more convenient and there's nothing wrong with using them for flavor or strength, the loose tea may feel more authentic for a full experience of enjoying your green tea.",
        "Here are some green tea types to consider:\nGunpowder – the Chinese also call this \"Pearl Tea\".",
        "The tea resembles tiny gunpowder pellets.",
        "When water is added, the little pellets or pearls unfurl.",
        "This one stays freshest longest.",
        "Hyson – This has a very pungent taste, and has thick, yellow-green leaves twisted into thin and long shapes.",
        "Dragonwell – This variety is very popular in China.",
        "It tastes mellow and has a light green flavor.",
        "The leaves open to reveal a bud when water is added.",
        "Agarwood - mild traditional green tea taste.",
        "Make sure you use whole leaf tea vs tea made from the wood which is illegal to purchase.",
        "Pi Lo Chun – In Chinese this name translates to \"Green Snail Spring\".",
        "A rare tea, the little rolled leaves look like snails.",
        "Owing to the fact that the tea bushes are grown amid orchards, this tea tends to have the flavors of plums, peaches, and apricots embedded in the leaves.",
        "Matcha – This is powdered green tea leaves.",
        "It appears a bright green when water is added.",
        "Gu Zhang Mao Jian – This tea only uses the silvery-tipped young leaves picked within a set 10 day period during spring.",
        "While darker than other green teas, it has a smooth and sweet taste.",
        "Sencha – This is a common Japanese green tea.",
        "Jewel green matcha is a good choice for those who find other green tea too \"grass\" tasting.",
        "Gen Mai Cha (genmaicha) – This is sencha tea leaves mixed with fire-roasted rice.",
        "The taste is savory and earthy.",
        "Also Japanese in origin.",
        "Gyokuro – This Japanese green tea has leaves that look like pine needles, with a sweet and smooth taste.",
        "The tea looks green.",
        "Hojicha – A tea with large, unrolled leaves.",
        "It tastes nutty.",
        "Store purchased tea in an airtight, dark container to avoid loss of its qualities; the aromatic oils evaporate if not stored this way.",
        "Purchase small amounts only, and keep it in a cool spot.",
        "Green tea over six months old is no longer fresh.",
        "Consider keeping a separate teapot for your green tea.",
        "While this isn't necessary, it's a common practice for tea drinkers who regularly enjoy green tea because it prevents cross flavoring from black or herbal teas.",
        "If this doesn't bother you (indeed, you might not even notice the difference), just be sure to wash your regular teapot well.",
        "Green tea should only be brewed in ceramic, clay, china, glass, or stainless steel teapots.",
        "Do not use plastic or aluminum teapots.",
        "Brewing loose green tea with a tea ball Add the loose green tea to a tea ball (a spoonful is adequate).",
        "A tea ball can also be dropped into a teapot for one or two if easier.",
        "Just be sure that the tea ball has the capacity for the amount of cups you're planning on brewing.",
        "Drop the tea ball into a cup or mug of freshly boiled hot water.",
        "The boiled water should be \"first boil\" (see the boiling instructions under \"Brewing loose green tea in a teapot\" for more details).",
        "The water should be allowed to sit for a moment as the ideal temperature for water for green tea is 180 °F (82 °C), 80C.",
        "Put a lid or plate over the cup or mug (unless you're already using a tea ball container equipped with a lid, also known as an \"infuser basket\").",
        "Leave the tea to steep for a few minutes (3 to 5 minutes is usually enough, unless the tea instructions advise otherwise).",
        "Remove the tea ball.",
        "Serve.",
        "Enjoy it with some matcha and chocolate swirl cake.",
        "Brewing loose green tea in a teapot or kettle Preheat the teapot or kettle.",
        "Empty the heating water just before adding the brewing water.",
        "Boil the water to \"first boil\".",
        "This is when the water begins to boil but has not yet begun to simmer.",
        "The temperature at this stage will be 160ºF (71ºC).",
        "Bitter brews come from too high a temperature of water on green tea; prefer a longer steeping time at a cooler temperature instead.",
        "Place one rounded teaspoon of loose green tea or one teabag per cup into the teapot.",
        "Pour over the boiling water.",
        "Let it steep for three to five minutes.",
        "Three minutes steeping results in  light flavor, while five minutes will give you a robust, full flavor.",
        "The longer the green tea is left in, the stronger the taste, so you might like to experiment as to which taste works best for you.",
        "For high grade tea such as \"gunpowder\" types, steeping time may be as few as 10 seconds on first brew.",
        "You can reuse the leaves several times, steeping slightly longer with each batch.",
        "It is advisable to allow the leaves to rest for a few minutes after the first two brews so as not to burn or overwork them.",
        "Always time the brewing and taste the tea rather than relying on color changes.",
        "Some green teas turn dark quickly but are not ready, while some stay light but are ready sooner than you may think.",
        "Pour into a sieve (to catch any loose tea, if you don't want it in your drink) over cups, mugs, or glasses.",
        "It is now ready to be enjoyed.",
        "In addition, Chinese green tea connoisseurs will also use a snifter cup to enhance the tea drinking experience.",
        "These cups are much smaller in diameter but longer in length to allow the scent to waft into the nostrils as you sip out of your main cup.",
        "Brewing green tea teabags Take out the green tea teabag.",
        "Boil water and pour water into a mug.",
        "Or you can just microwave a cup of water.",
        "The boiled water should be \"first boil\" (see the boiling instructions under \"Brewing loose green tea in a teapot\" for more details).",
        "Add the green tea bag to the cup of boiling water.",
        "Allow the tea bag to steep in the hot water for 3-5 minutes.",
        "Remove the teabag.",
        "Or, if preferred, you can leave the tea bag in the mug or you can remove the tea bag before enjoying your drink.",
        "It's your choice.",
        "Serve.",
        "Green tea is not usually sweetened, but if you wish to, then add sugar or honey to suit your taste.",
        "Now you're ready to enjoy green tea."
    ]
}