{
    "title": "How to Make a Bug Terrarium",
    "url": "https://www.wikihow.com/Make-a-Bug-Terrarium",
    "category_hierarchy": [
        "Pets and Animals",
        "Bugs",
        "Creating Insect Habitats"
    ],
    "parts": [
        {
            "name": "Assembling the Terrarium",
            "steps": [
                {
                    "headline": "Get a glass or plastic container.",
                    "description": "Plastic bug containers can be bought at pet supply stores. They come with lids that have air holes and a handle for easy transportation. You may also use glass objects such as a mason jar, an aquarium, or a fish bowl. Swap out solid lids for cheesecloth or mesh netting so you don’t need to drill or hammer air holes into them. Other containers, like cardboard boxes, should be avoided. Over time they’ll fall apart due to moisture. For larger insects like walking sticks and praying mantises, make sure the container is at least twice as big as their body width and three times as big as their height. Multiple small insects will fit into a regular-sized container. For larger insects, double the space per insect. As long as your insects have room to run and hide, they’ll be happy."
                },
                {
                    "headline": "Cover the bottom of the container with sand or gravel.",
                    "description": "A thin layer of either substance helps drain water from the soil. This prevents the soil from getting too damp and rotting any plants you include in your terrarium. Look for bags of sand or pebbles near the reptile and fish sections of pet stores. You may also cover this layer with a half an inch (1.3 cm) of activated charcoal. Charcoal can be found at pet supply stores. It reduces the smell in terrariums with growing plants."
                },
                {
                    "headline": "Fill the terrarium with dirt.",
                    "description": "It’ll be fun to watch your bugs explore, so make the dirt deep enough to hide in. Add between two to four inches (five to ten cm) of soil. Get your hands dirty by using soil from outside. Ask your parent's permission first before digging up their garden bed! You may use potting soil, but outdoor soil is familiar to bugs. Potting soil has chemicals that may harm some critters."
                }
            ]
        },
        {
            "name": "Adding Bugs and Plants",
            "steps": [
                {
                    "headline": "Plant some weeds in the soil.",
                    "description": "An easy way to get plants for the terrarium is to go outside and dig up unwanted weeds. Weeds are best since parents will be happy to see them gone. Gently remove them from the soil. Take off the roots and leaves. Make a hole in the terrarium and set the plant in it. One small plant or a couple of weeds is usually enough greenery. Leave most of the space open so you can see the bugs moving. Green, healthy plants are the ones that serve as the best food. Keep in mind that some bugs, such as walking sticks, only eat fresh leaves."
                },
                {
                    "headline": "Decorate with some sticks and other hiding spots.",
                    "description": "Bugs love hiding spots. Explore near your home for places where bugs like to hide. Small branches, rocks, or pieces of bark form perfect bug homes within your terrarium. Again, you have too much when the terrarium is filled with decorations. Leave most of the space open and have a couple of places for the bugs to climb and hide."
                },
                {
                    "headline": "Catch some critters for your terrarium.",
                    "description": "Have fun overturning your yard in search of bugs. They’ll be in the places you thought of earlier, such as under branches, rocks, and flower pots. You can also dig a hole and find buried bugs. Anything you catch can go in your terrarium. Make sure there is plenty of room left for your bugs to move around\nMealworms and crickets are common starter bugs. You’ll also come across other bugs, such as roly polys (pill bugs) and beetles. Sometimes you’ll even find critters like snails. Be aware of poisonous or biting insects. It's best to avoid spiders, centipedes, fire ants, and carpenter ants (large black ants). If you’re looking for critters that move a lot, try crickets and snails."
                },
                {
                    "headline": "Feed the new residents with fruit and vegetables.",
                    "description": "Keep your terrarium stocked with food. Add small slices of whatever fruits and vegetables you have around the house. Carrots, for example, are a vegetable that many bugs and snails enjoy. The food keeps them happy and healthy. Plants and worms use the soil for food. Decomposing food, like banana peels and eggshells, or compost, keeps the soil filled with nutrients. Fish flakes from the pet store will also be popular with the bugs."
                }
            ]
        },
        {
            "name": "Maintaining Your Terrarium",
            "steps": [
                {
                    "headline": "Keep the terrarium covered.",
                    "description": "An uncovered terrarium can lead to escaped bugs. Critters like snails can also climb and push their way out of loose covering. If your container has a lid, make sure it’s on tight. Otherwise, cover the opening with cheesecloth or mesh netting. Secure it against the container with a strong rubber band. You can use a lid, such as the lid on a mason jar. Use a drill or hammer a nail into it to make small holes. Scatter the holes around. Make a few of them, maybe five or six. Remember to make sure there are air holes at the top of the container. Bugs need to breathe too!"
                },
                {
                    "headline": "Make sure the soil is damp.",
                    "description": "You don’t need to set out a bowl of water, but the bugs will appreciate a damp environment. Every day, check the terrarium for dampness. Use a spray bottle to mist inside it. You don’t want the soil to be soaked, but it should be kept moist enough for the bugs to dig in it. You can also try setting a dampened paper towel or cotton ball on top of the soil for extra humidity. Consider getting a hygrometer from the pet store. It’ll indicate the humidity in the terrarium. Try to keep the humidity above 75%."
                },
                {
                    "headline": "Store the terrarium in a safe location.",
                    "description": "One great thing about your bugs is that they won’t need extra heat or sunlight. However, the hands of a younger sibling or paws of a pet can knock over your bug's home. Keep it up high on a flat surface out of direct sunlight."
                },
                {
                    "headline": "Remove uneaten food.",
                    "description": "You won’t want decaying fruits and vegetables lying around the terrarium. Once you see that they’re going bad, throw them away or else they’ll get stinky and moldy. Replace them with small portions of fresh food."
                },
                {
                    "headline": "Replace the soil every week.",
                    "description": "Ideally, it’s best to keep your bugs safe by replacing the soil once a week. Look out for droppings or signs of mold. Those are indicators that it's time to freshen up the terrarium. Any yellowed plants or moldy hiding spots should also be swapped out. Catch the bugs before you begin cleaning. Scoop them up and move them to a second terrarium or sealed container with air holes. Terrariums with large bugs and critters will need to be cleaned weekly. If you only have a few small bugs, you may be able to leave the terrarium alone for longer without noticing bad smells or mold."
                }
            ]
        }
    ],
    "tyn": [
        "Glass or plastic container",
        "Sand or gravel",
        "Soil",
        "Small plants",
        "Hygrometer",
        "Misting bottle",
        "Water",
        "Rocks and twigs"
    ],
    "text": " Assembling the Terrarium Get a glass or plastic container. Plastic bug containers can be bought at pet supply stores. They come with lids that have air holes and a handle for easy transportation. You may also use glass objects such as a mason jar, an aquarium, or a fish bowl. Swap out solid lids for cheesecloth or mesh netting so you don’t need to drill or hammer air holes into them. Other containers, like cardboard boxes, should be avoided. Over time they’ll fall apart due to moisture. For larger insects like walking sticks and praying mantises, make sure the container is at least twice as big as their body width and three times as big as their height. Multiple small insects will fit into a regular-sized container. For larger insects, double the space per insect. As long as your insects have room to run and hide, they’ll be happy. Cover the bottom of the container with sand or gravel. A thin layer of either substance helps drain water from the soil. This prevents the soil from getting too damp and rotting any plants you include in your terrarium. Look for bags of sand or pebbles near the reptile and fish sections of pet stores. You may also cover this layer with a half an inch (1.3 cm) of activated charcoal. Charcoal can be found at pet supply stores. It reduces the smell in terrariums with growing plants. Fill the terrarium with dirt. It’ll be fun to watch your bugs explore, so make the dirt deep enough to hide in. Add between two to four inches (five to ten cm) of soil. Get your hands dirty by using soil from outside. Ask your parent's permission first before digging up their garden bed! You may use potting soil, but outdoor soil is familiar to bugs. Potting soil has chemicals that may harm some critters. Adding Bugs and Plants Plant some weeds in the soil. An easy way to get plants for the terrarium is to go outside and dig up unwanted weeds. Weeds are best since parents will be happy to see them gone. Gently remove them from the soil. Take off the roots and leaves. Make a hole in the terrarium and set the plant in it. One small plant or a couple of weeds is usually enough greenery. Leave most of the space open so you can see the bugs moving. Green, healthy plants are the ones that serve as the best food. Keep in mind that some bugs, such as walking sticks, only eat fresh leaves. Decorate with some sticks and other hiding spots. Bugs love hiding spots. Explore near your home for places where bugs like to hide. Small branches, rocks, or pieces of bark form perfect bug homes within your terrarium. Again, you have too much when the terrarium is filled with decorations. Leave most of the space open and have a couple of places for the bugs to climb and hide. Catch some critters for your terrarium. Have fun overturning your yard in search of bugs. They’ll be in the places you thought of earlier, such as under branches, rocks, and flower pots. You can also dig a hole and find buried bugs. Anything you catch can go in your terrarium. Make sure there is plenty of room left for your bugs to move around\nMealworms and crickets are common starter bugs. You’ll also come across other bugs, such as roly polys (pill bugs) and beetles. Sometimes you’ll even find critters like snails. Be aware of poisonous or biting insects. It's best to avoid spiders, centipedes, fire ants, and carpenter ants (large black ants). If you’re looking for critters that move a lot, try crickets and snails. Feed the new residents with fruit and vegetables. Keep your terrarium stocked with food. Add small slices of whatever fruits and vegetables you have around the house. Carrots, for example, are a vegetable that many bugs and snails enjoy. The food keeps them happy and healthy. Plants and worms use the soil for food. Decomposing food, like banana peels and eggshells, or compost, keeps the soil filled with nutrients. Fish flakes from the pet store will also be popular with the bugs. Maintaining Your Terrarium Keep the terrarium covered. An uncovered terrarium can lead to escaped bugs. Critters like snails can also climb and push their way out of loose covering. If your container has a lid, make sure it’s on tight. Otherwise, cover the opening with cheesecloth or mesh netting. Secure it against the container with a strong rubber band. You can use a lid, such as the lid on a mason jar. Use a drill or hammer a nail into it to make small holes. Scatter the holes around. Make a few of them, maybe five or six. Remember to make sure there are air holes at the top of the container. Bugs need to breathe too! Make sure the soil is damp. You don’t need to set out a bowl of water, but the bugs will appreciate a damp environment. Every day, check the terrarium for dampness. Use a spray bottle to mist inside it. You don’t want the soil to be soaked, but it should be kept moist enough for the bugs to dig in it. You can also try setting a dampened paper towel or cotton ball on top of the soil for extra humidity. Consider getting a hygrometer from the pet store. It’ll indicate the humidity in the terrarium. Try to keep the humidity above 75%. Store the terrarium in a safe location. One great thing about your bugs is that they won’t need extra heat or sunlight. However, the hands of a younger sibling or paws of a pet can knock over your bug's home. Keep it up high on a flat surface out of direct sunlight. Remove uneaten food. You won’t want decaying fruits and vegetables lying around the terrarium. Once you see that they’re going bad, throw them away or else they’ll get stinky and moldy. Replace them with small portions of fresh food. Replace the soil every week. Ideally, it’s best to keep your bugs safe by replacing the soil once a week. Look out for droppings or signs of mold. Those are indicators that it's time to freshen up the terrarium. Any yellowed plants or moldy hiding spots should also be swapped out. Catch the bugs before you begin cleaning. Scoop them up and move them to a second terrarium or sealed container with air holes. Terrariums with large bugs and critters will need to be cleaned weekly. If you only have a few small bugs, you may be able to leave the terrarium alone for longer without noticing bad smells or mold.",
    "sentences": [
        " Assembling the Terrarium Get a glass or plastic container.",
        "Plastic bug containers can be bought at pet supply stores.",
        "They come with lids that have air holes and a handle for easy transportation.",
        "You may also use glass objects such as a mason jar, an aquarium, or a fish bowl.",
        "Swap out solid lids for cheesecloth or mesh netting so you don’t need to drill or hammer air holes into them.",
        "Other containers, like cardboard boxes, should be avoided.",
        "Over time they’ll fall apart due to moisture.",
        "For larger insects like walking sticks and praying mantises, make sure the container is at least twice as big as their body width and three times as big as their height.",
        "Multiple small insects will fit into a regular-sized container.",
        "For larger insects, double the space per insect.",
        "As long as your insects have room to run and hide, they’ll be happy.",
        "Cover the bottom of the container with sand or gravel.",
        "A thin layer of either substance helps drain water from the soil.",
        "This prevents the soil from getting too damp and rotting any plants you include in your terrarium.",
        "Look for bags of sand or pebbles near the reptile and fish sections of pet stores.",
        "You may also cover this layer with a half an inch (1.3 cm) of activated charcoal.",
        "Charcoal can be found at pet supply stores.",
        "It reduces the smell in terrariums with growing plants.",
        "Fill the terrarium with dirt.",
        "It’ll be fun to watch your bugs explore, so make the dirt deep enough to hide in.",
        "Add between two to four inches (five to ten cm) of soil.",
        "Get your hands dirty by using soil from outside.",
        "Ask your parent's permission first before digging up their garden bed!",
        "You may use potting soil, but outdoor soil is familiar to bugs.",
        "Potting soil has chemicals that may harm some critters.",
        "Adding Bugs and Plants Plant some weeds in the soil.",
        "An easy way to get plants for the terrarium is to go outside and dig up unwanted weeds.",
        "Weeds are best since parents will be happy to see them gone.",
        "Gently remove them from the soil.",
        "Take off the roots and leaves.",
        "Make a hole in the terrarium and set the plant in it.",
        "One small plant or a couple of weeds is usually enough greenery.",
        "Leave most of the space open so you can see the bugs moving.",
        "Green, healthy plants are the ones that serve as the best food.",
        "Keep in mind that some bugs, such as walking sticks, only eat fresh leaves.",
        "Decorate with some sticks and other hiding spots.",
        "Bugs love hiding spots.",
        "Explore near your home for places where bugs like to hide.",
        "Small branches, rocks, or pieces of bark form perfect bug homes within your terrarium.",
        "Again, you have too much when the terrarium is filled with decorations.",
        "Leave most of the space open and have a couple of places for the bugs to climb and hide.",
        "Catch some critters for your terrarium.",
        "Have fun overturning your yard in search of bugs.",
        "They’ll be in the places you thought of earlier, such as under branches, rocks, and flower pots.",
        "You can also dig a hole and find buried bugs.",
        "Anything you catch can go in your terrarium.",
        "Make sure there is plenty of room left for your bugs to move around\nMealworms and crickets are common starter bugs.",
        "You’ll also come across other bugs, such as roly polys (pill bugs) and beetles.",
        "Sometimes you’ll even find critters like snails.",
        "Be aware of poisonous or biting insects.",
        "It's best to avoid spiders, centipedes, fire ants, and carpenter ants (large black ants).",
        "If you’re looking for critters that move a lot, try crickets and snails.",
        "Feed the new residents with fruit and vegetables.",
        "Keep your terrarium stocked with food.",
        "Add small slices of whatever fruits and vegetables you have around the house.",
        "Carrots, for example, are a vegetable that many bugs and snails enjoy.",
        "The food keeps them happy and healthy.",
        "Plants and worms use the soil for food.",
        "Decomposing food, like banana peels and eggshells, or compost, keeps the soil filled with nutrients.",
        "Fish flakes from the pet store will also be popular with the bugs.",
        "Maintaining Your Terrarium Keep the terrarium covered.",
        "An uncovered terrarium can lead to escaped bugs.",
        "Critters like snails can also climb and push their way out of loose covering.",
        "If your container has a lid, make sure it’s on tight.",
        "Otherwise, cover the opening with cheesecloth or mesh netting.",
        "Secure it against the container with a strong rubber band.",
        "You can use a lid, such as the lid on a mason jar.",
        "Use a drill or hammer a nail into it to make small holes.",
        "Scatter the holes around.",
        "Make a few of them, maybe five or six.",
        "Remember to make sure there are air holes at the top of the container.",
        "Bugs need to breathe too!",
        "Make sure the soil is damp.",
        "You don’t need to set out a bowl of water, but the bugs will appreciate a damp environment.",
        "Every day, check the terrarium for dampness.",
        "Use a spray bottle to mist inside it.",
        "You don’t want the soil to be soaked, but it should be kept moist enough for the bugs to dig in it.",
        "You can also try setting a dampened paper towel or cotton ball on top of the soil for extra humidity.",
        "Consider getting a hygrometer from the pet store.",
        "It’ll indicate the humidity in the terrarium.",
        "Try to keep the humidity above 75%.",
        "Store the terrarium in a safe location.",
        "One great thing about your bugs is that they won’t need extra heat or sunlight.",
        "However, the hands of a younger sibling or paws of a pet can knock over your bug's home.",
        "Keep it up high on a flat surface out of direct sunlight.",
        "Remove uneaten food.",
        "You won’t want decaying fruits and vegetables lying around the terrarium.",
        "Once you see that they’re going bad, throw them away or else they’ll get stinky and moldy.",
        "Replace them with small portions of fresh food.",
        "Replace the soil every week.",
        "Ideally, it’s best to keep your bugs safe by replacing the soil once a week.",
        "Look out for droppings or signs of mold.",
        "Those are indicators that it's time to freshen up the terrarium.",
        "Any yellowed plants or moldy hiding spots should also be swapped out.",
        "Catch the bugs before you begin cleaning.",
        "Scoop them up and move them to a second terrarium or sealed container with air holes.",
        "Terrariums with large bugs and critters will need to be cleaned weekly.",
        "If you only have a few small bugs, you may be able to leave the terrarium alone for longer without noticing bad smells or mold."
    ]
}