{
    "title": "How to Clean Pet Vomit from Carpet",
    "url": "https://www.wikihow.com/Clean-Pet-Vomit-from-Carpet",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Floors and Stairs",
        "Carpets and Rugs"
    ],
    "parts": [
        {
            "name": "Using Homemade Cleaner",
            "steps": [
                {
                    "headline": "Use paper towels to remove as much of the vomit as possible.",
                    "description": "Pick up the bulk of the vomit with a couple of dry, folded paper towels, but take care not to squash the vomit particles down into the carpet."
                },
                {
                    "headline": "Clean the carpeted area with cold water.",
                    "description": "Fill a spray bottle with cold water, and spray down the carpeted area. Using a towel, start blotting and dabbing the vomit until the chunks and moisture are mostly gone. With each blot and dab, be sure to use a clean section of the towel; you may need more than one towel if the carpeted area is large."
                },
                {
                    "headline": "Mix 2 cups of warm water and 1 tbsp of table salt together.",
                    "description": "Now that the vomit is mostly gone, prepare homemade carpet cleaner to finish cleaning the carpeted area. Warm up about 2 cups of water in a large microwave-safe bowl or cup. Stir in 1 tbsp of salt, and continue stirring until the salt is dissolved."
                },
                {
                    "headline": "Add ½ cup of white vinegar, 1 tbsp detergent, and 2 tbsp rubbing alcohol.",
                    "description": "Add these ingredients to the water and salt mixture. Mix all of these ingredients together in the bowl or cup."
                },
                {
                    "headline": "Wet a clean kitchen sponge with the solution.",
                    "description": "Dip a clean sponge repeatedly in the cleaning solution to saturate it with the cleaning substance. You will use this to continue cleaning the carpeted area. Again, if the area is large, you may need more than one sponge."
                },
                {
                    "headline": "Use the sponge to wipe the rest of the vomit away.",
                    "description": "Using small strokes, remove the rest of the vomit and any stains with the damp kitchen sponge. Just like before, with every stroke and dab, use a clean area of the sponge. Each time you stroke the area with the sponge, you will be removing vomit. Rinse the sponge in the sink with warm water if it becomes completely dirty. You will likely want to throw the sponge you use away."
                },
                {
                    "headline": "Sprinkle the carpeted area with baking soda.. Now that the vomit is cleaned up, sprinkle the carpeted area with baking soda, completely covering the area you just cleaned.",
                    "description": "This will rid the carpet of any smells and will help the carpet dry."
                },
                {
                    "headline": "Vacuum the baking soda once dry.",
                    "description": "It may take several hours for the baking soda on the carpet to dry, and it will likely become clumpy. Keep your pets away from the carpeted area during this time. Once the area is completely dry, use a vacuum cleaner to completely suck up the baking soda."
                }
            ]
        },
        {
            "name": "Using a Store-bought Carpet Cleaner",
            "steps": [
                {
                    "headline": "Use paper towels to remove as much of the vomit as possible.",
                    "description": "Pick up the bulk of the vomit with a couple of dry, folded paper towels, but take care not to squash the vomit particles down into the carpet. Using a spoon or knife may help."
                },
                {
                    "headline": "Using paper towels or an old rag, absorb any remaining moisture.",
                    "description": "Start blotting and dabbing the vomit until the chunks and moisture are mostly gone. With each blot and dab, be sure to use a clean section of the towel; you may need more than one towel if the carpeted area is large."
                },
                {
                    "headline": "Sprinkle the area with baking soda or corn starch.",
                    "description": "This will absorb the rest of the moisture that remains below the surface of the carpet. Cover the entire carpeted area with baking soda or corn starch."
                },
                {
                    "headline": "Vacuum up the baking soda or corn starch once dry.",
                    "description": "The baking soda or corn starch will likely dry within 2 hours, and they may become clumpy. Once the baking soda or corn starch is dry, use a vacuum to completely suck up the remaining particles."
                },
                {
                    "headline": "Apply an enzyme based carpet cleaner.",
                    "description": "These cleaners are readily available in the cleaning aisle of your local store, or in the pet supplies aisle. Check the container before buying the cleaner to make sure it is enzyme based; this means the cleaner will break down the odor-causing proteins so they can be removed - a good example is Nature's Miracle. They are effective in removing stains, too. Spray the area with the cleaner until it is very damp."
                },
                {
                    "headline": "Let the cleaner sit for 1-2 hours.",
                    "description": "The cleaner container may say that the cleaner needs to sit for a longer or shorter period of time. Read the back of the container for specific instructions. Generally, 1-2 hours will allow the product to remove stains and odor."
                },
                {
                    "headline": "Keep your pet away from the area until it dries.",
                    "description": "You may even want to keep your pet in a different room for the time being. Once the cleaner completely dries, it can be walked on again."
                }
            ]
        },
        {
            "name": "Using a Commercial Carpet Cleaner",
            "steps": [
                {
                    "headline": "Rent a commercial carpet cleaner.",
                    "description": "Some stains are too deep to remove with ordinary homemade or store bought cleaner solutions. Using a professional carpet cleaner will remove the toughest of stains. You can simply hire carpet cleaners, or rent the carpet cleaner and clean the stained areas yourself. Carpet cleaners are available at grocery stores or rental centers. Rentals can be as cheap as $24.99 for 24 hours. If you do not feel comfortable operating a carpet cleaner, hire professionals. Ask a friend for help, since you will have to move furniture and operate a somewhat heavy carpet cleaning machine."
                },
                {
                    "headline": "Purchase the recommended cleaner solution.",
                    "description": "Most manufacturers will recommend a brand of cleaner solution to fill the machine with. Purchase the recommended cleaner when you rent the machine. If you are unsure what to fill the machine with, ask the salesperson you rented it from."
                },
                {
                    "headline": "Clear the area of any furniture or obstructions.",
                    "description": "Once you take the machine home, clear the area you will be cleaning of any furniture. Remember, you will need to let the carpet dry for around 24 hours, so the furniture will need to remain off the carpet during this entire time."
                },
                {
                    "headline": "Fill the carpet cleaner with the cleaning formula.",
                    "description": "Most home carpet cleaning systems are water extraction units, or steam cleaners. They work by injecting a solution into the carpet, then extracting dirty solution back into the machine. You will need to fill a tank on the machine with solution. There may even be a second tank that holds clean water. Every carpet cleaner machine will be slightly different, so be sure to read all instructions before operating the cleaning machine. You may need to replace the dirty solution if you are cleaning a large area."
                },
                {
                    "headline": "Test a small patch of carpet for colorfastness.",
                    "description": "On a small, inconspicuous location, test the carpet cleaner by using turning it on and making one small stroke. Now, turn the machine off, and make sure the carpet does not change color. Wait a few minutes; if the carpet does not change color, the cleaner is safe to use."
                },
                {
                    "headline": "Use the carpet cleaner to thoroughly remove stains and odors.",
                    "description": "Plug in the machine in the room you will be cleaning, and turn it on. In a pattern of straight lines, move up and down the room. Move at a pace of about two feet per second. Usually, only one pass over the carpet is necessary to remove stains, and moving over the carpeted area more than once is not recommended."
                },
                {
                    "headline": "Refill the clean solution tank and empty the dirty solution as necessary.",
                    "description": "If the solution tank looks especially dirty, remove the tank and discard the dirty solution. Refill the tank with clean solution, and continue cleaning. You may not need to do this if the room you are cleaning is small."
                },
                {
                    "headline": "Empty both clean and dirty solution tanks once you are done.",
                    "description": "Once you’ve gone over every stained area once, turn off and the unplug the machine. Then, empty any water or solution tanks."
                },
                {
                    "headline": "Open windows or doors to speed up the drying process.",
                    "description": "If it is summer, you can also  turn the air-conditioning; if it is winter, turning on the heater will help. It usually takes 24 hours for carpets to dry."
                },
                {
                    "headline": "Return the machine to the store.",
                    "description": "Since you are done with the cleaning machine, you can now return it to the store or rental place."
                }
            ]
        }
    ],
    "tyn": [
        "Baking soda",
        "A roll of paper towels",
        "Vinegar",
        "Rubbing alcohol",
        "Table salt",
        "Spray bottle",
        "Water",
        "Professional carpet cleaning machine",
        "Carpet cleaning solution"
    ],
    "text": " Using Homemade Cleaner Use paper towels to remove as much of the vomit as possible. Pick up the bulk of the vomit with a couple of dry, folded paper towels, but take care not to squash the vomit particles down into the carpet. Clean the carpeted area with cold water. Fill a spray bottle with cold water, and spray down the carpeted area. Using a towel, start blotting and dabbing the vomit until the chunks and moisture are mostly gone. With each blot and dab, be sure to use a clean section of the towel; you may need more than one towel if the carpeted area is large. Mix 2 cups of warm water and 1 tbsp of table salt together. Now that the vomit is mostly gone, prepare homemade carpet cleaner to finish cleaning the carpeted area. Warm up about 2 cups of water in a large microwave-safe bowl or cup. Stir in 1 tbsp of salt, and continue stirring until the salt is dissolved. Add ½ cup of white vinegar, 1 tbsp detergent, and 2 tbsp rubbing alcohol. Add these ingredients to the water and salt mixture. Mix all of these ingredients together in the bowl or cup. Wet a clean kitchen sponge with the solution. Dip a clean sponge repeatedly in the cleaning solution to saturate it with the cleaning substance. You will use this to continue cleaning the carpeted area. Again, if the area is large, you may need more than one sponge. Use the sponge to wipe the rest of the vomit away. Using small strokes, remove the rest of the vomit and any stains with the damp kitchen sponge. Just like before, with every stroke and dab, use a clean area of the sponge. Each time you stroke the area with the sponge, you will be removing vomit. Rinse the sponge in the sink with warm water if it becomes completely dirty. You will likely want to throw the sponge you use away. Sprinkle the carpeted area with baking soda.. Now that the vomit is cleaned up, sprinkle the carpeted area with baking soda, completely covering the area you just cleaned. This will rid the carpet of any smells and will help the carpet dry. Vacuum the baking soda once dry. It may take several hours for the baking soda on the carpet to dry, and it will likely become clumpy. Keep your pets away from the carpeted area during this time. Once the area is completely dry, use a vacuum cleaner to completely suck up the baking soda. Using a Store-bought Carpet Cleaner Use paper towels to remove as much of the vomit as possible. Pick up the bulk of the vomit with a couple of dry, folded paper towels, but take care not to squash the vomit particles down into the carpet. Using a spoon or knife may help. Using paper towels or an old rag, absorb any remaining moisture. Start blotting and dabbing the vomit until the chunks and moisture are mostly gone. With each blot and dab, be sure to use a clean section of the towel; you may need more than one towel if the carpeted area is large. Sprinkle the area with baking soda or corn starch. This will absorb the rest of the moisture that remains below the surface of the carpet. Cover the entire carpeted area with baking soda or corn starch. Vacuum up the baking soda or corn starch once dry. The baking soda or corn starch will likely dry within 2 hours, and they may become clumpy. Once the baking soda or corn starch is dry, use a vacuum to completely suck up the remaining particles. Apply an enzyme based carpet cleaner. These cleaners are readily available in the cleaning aisle of your local store, or in the pet supplies aisle. Check the container before buying the cleaner to make sure it is enzyme based; this means the cleaner will break down the odor-causing proteins so they can be removed - a good example is Nature's Miracle. They are effective in removing stains, too. Spray the area with the cleaner until it is very damp. Let the cleaner sit for 1-2 hours. The cleaner container may say that the cleaner needs to sit for a longer or shorter period of time. Read the back of the container for specific instructions. Generally, 1-2 hours will allow the product to remove stains and odor. Keep your pet away from the area until it dries. You may even want to keep your pet in a different room for the time being. Once the cleaner completely dries, it can be walked on again. Using a Commercial Carpet Cleaner Rent a commercial carpet cleaner. Some stains are too deep to remove with ordinary homemade or store bought cleaner solutions. Using a professional carpet cleaner will remove the toughest of stains. You can simply hire carpet cleaners, or rent the carpet cleaner and clean the stained areas yourself. Carpet cleaners are available at grocery stores or rental centers. Rentals can be as cheap as $24.99 for 24 hours. If you do not feel comfortable operating a carpet cleaner, hire professionals. Ask a friend for help, since you will have to move furniture and operate a somewhat heavy carpet cleaning machine. Purchase the recommended cleaner solution. Most manufacturers will recommend a brand of cleaner solution to fill the machine with. Purchase the recommended cleaner when you rent the machine. If you are unsure what to fill the machine with, ask the salesperson you rented it from. Clear the area of any furniture or obstructions. Once you take the machine home, clear the area you will be cleaning of any furniture. Remember, you will need to let the carpet dry for around 24 hours, so the furniture will need to remain off the carpet during this entire time. Fill the carpet cleaner with the cleaning formula. Most home carpet cleaning systems are water extraction units, or steam cleaners. They work by injecting a solution into the carpet, then extracting dirty solution back into the machine. You will need to fill a tank on the machine with solution. There may even be a second tank that holds clean water. Every carpet cleaner machine will be slightly different, so be sure to read all instructions before operating the cleaning machine. You may need to replace the dirty solution if you are cleaning a large area. Test a small patch of carpet for colorfastness. On a small, inconspicuous location, test the carpet cleaner by using turning it on and making one small stroke. Now, turn the machine off, and make sure the carpet does not change color. Wait a few minutes; if the carpet does not change color, the cleaner is safe to use. Use the carpet cleaner to thoroughly remove stains and odors. Plug in the machine in the room you will be cleaning, and turn it on. In a pattern of straight lines, move up and down the room. Move at a pace of about two feet per second. Usually, only one pass over the carpet is necessary to remove stains, and moving over the carpeted area more than once is not recommended. Refill the clean solution tank and empty the dirty solution as necessary. If the solution tank looks especially dirty, remove the tank and discard the dirty solution. Refill the tank with clean solution, and continue cleaning. You may not need to do this if the room you are cleaning is small. Empty both clean and dirty solution tanks once you are done. Once you’ve gone over every stained area once, turn off and the unplug the machine. Then, empty any water or solution tanks. Open windows or doors to speed up the drying process. If it is summer, you can also  turn the air-conditioning; if it is winter, turning on the heater will help. It usually takes 24 hours for carpets to dry. Return the machine to the store. Since you are done with the cleaning machine, you can now return it to the store or rental place.",
    "sentences": [
        " Using Homemade Cleaner Use paper towels to remove as much of the vomit as possible.",
        "Pick up the bulk of the vomit with a couple of dry, folded paper towels, but take care not to squash the vomit particles down into the carpet.",
        "Clean the carpeted area with cold water.",
        "Fill a spray bottle with cold water, and spray down the carpeted area.",
        "Using a towel, start blotting and dabbing the vomit until the chunks and moisture are mostly gone.",
        "With each blot and dab, be sure to use a clean section of the towel; you may need more than one towel if the carpeted area is large.",
        "Mix 2 cups of warm water and 1 tbsp of table salt together.",
        "Now that the vomit is mostly gone, prepare homemade carpet cleaner to finish cleaning the carpeted area.",
        "Warm up about 2 cups of water in a large microwave-safe bowl or cup.",
        "Stir in 1 tbsp of salt, and continue stirring until the salt is dissolved.",
        "Add ½ cup of white vinegar, 1 tbsp detergent, and 2 tbsp rubbing alcohol.",
        "Add these ingredients to the water and salt mixture.",
        "Mix all of these ingredients together in the bowl or cup.",
        "Wet a clean kitchen sponge with the solution.",
        "Dip a clean sponge repeatedly in the cleaning solution to saturate it with the cleaning substance.",
        "You will use this to continue cleaning the carpeted area.",
        "Again, if the area is large, you may need more than one sponge.",
        "Use the sponge to wipe the rest of the vomit away.",
        "Using small strokes, remove the rest of the vomit and any stains with the damp kitchen sponge.",
        "Just like before, with every stroke and dab, use a clean area of the sponge.",
        "Each time you stroke the area with the sponge, you will be removing vomit.",
        "Rinse the sponge in the sink with warm water if it becomes completely dirty.",
        "You will likely want to throw the sponge you use away.",
        "Sprinkle the carpeted area with baking soda.. Now that the vomit is cleaned up, sprinkle the carpeted area with baking soda, completely covering the area you just cleaned.",
        "This will rid the carpet of any smells and will help the carpet dry.",
        "Vacuum the baking soda once dry.",
        "It may take several hours for the baking soda on the carpet to dry, and it will likely become clumpy.",
        "Keep your pets away from the carpeted area during this time.",
        "Once the area is completely dry, use a vacuum cleaner to completely suck up the baking soda.",
        "Using a Store-bought Carpet Cleaner Use paper towels to remove as much of the vomit as possible.",
        "Pick up the bulk of the vomit with a couple of dry, folded paper towels, but take care not to squash the vomit particles down into the carpet.",
        "Using a spoon or knife may help.",
        "Using paper towels or an old rag, absorb any remaining moisture.",
        "Start blotting and dabbing the vomit until the chunks and moisture are mostly gone.",
        "With each blot and dab, be sure to use a clean section of the towel; you may need more than one towel if the carpeted area is large.",
        "Sprinkle the area with baking soda or corn starch.",
        "This will absorb the rest of the moisture that remains below the surface of the carpet.",
        "Cover the entire carpeted area with baking soda or corn starch.",
        "Vacuum up the baking soda or corn starch once dry.",
        "The baking soda or corn starch will likely dry within 2 hours, and they may become clumpy.",
        "Once the baking soda or corn starch is dry, use a vacuum to completely suck up the remaining particles.",
        "Apply an enzyme based carpet cleaner.",
        "These cleaners are readily available in the cleaning aisle of your local store, or in the pet supplies aisle.",
        "Check the container before buying the cleaner to make sure it is enzyme based; this means the cleaner will break down the odor-causing proteins so they can be removed - a good example is Nature's Miracle.",
        "They are effective in removing stains, too.",
        "Spray the area with the cleaner until it is very damp.",
        "Let the cleaner sit for 1-2 hours.",
        "The cleaner container may say that the cleaner needs to sit for a longer or shorter period of time.",
        "Read the back of the container for specific instructions.",
        "Generally, 1-2 hours will allow the product to remove stains and odor.",
        "Keep your pet away from the area until it dries.",
        "You may even want to keep your pet in a different room for the time being.",
        "Once the cleaner completely dries, it can be walked on again.",
        "Using a Commercial Carpet Cleaner Rent a commercial carpet cleaner.",
        "Some stains are too deep to remove with ordinary homemade or store bought cleaner solutions.",
        "Using a professional carpet cleaner will remove the toughest of stains.",
        "You can simply hire carpet cleaners, or rent the carpet cleaner and clean the stained areas yourself.",
        "Carpet cleaners are available at grocery stores or rental centers.",
        "Rentals can be as cheap as $24.99 for 24 hours.",
        "If you do not feel comfortable operating a carpet cleaner, hire professionals.",
        "Ask a friend for help, since you will have to move furniture and operate a somewhat heavy carpet cleaning machine.",
        "Purchase the recommended cleaner solution.",
        "Most manufacturers will recommend a brand of cleaner solution to fill the machine with.",
        "Purchase the recommended cleaner when you rent the machine.",
        "If you are unsure what to fill the machine with, ask the salesperson you rented it from.",
        "Clear the area of any furniture or obstructions.",
        "Once you take the machine home, clear the area you will be cleaning of any furniture.",
        "Remember, you will need to let the carpet dry for around 24 hours, so the furniture will need to remain off the carpet during this entire time.",
        "Fill the carpet cleaner with the cleaning formula.",
        "Most home carpet cleaning systems are water extraction units, or steam cleaners.",
        "They work by injecting a solution into the carpet, then extracting dirty solution back into the machine.",
        "You will need to fill a tank on the machine with solution.",
        "There may even be a second tank that holds clean water.",
        "Every carpet cleaner machine will be slightly different, so be sure to read all instructions before operating the cleaning machine.",
        "You may need to replace the dirty solution if you are cleaning a large area.",
        "Test a small patch of carpet for colorfastness.",
        "On a small, inconspicuous location, test the carpet cleaner by using turning it on and making one small stroke.",
        "Now, turn the machine off, and make sure the carpet does not change color.",
        "Wait a few minutes; if the carpet does not change color, the cleaner is safe to use.",
        "Use the carpet cleaner to thoroughly remove stains and odors.",
        "Plug in the machine in the room you will be cleaning, and turn it on.",
        "In a pattern of straight lines, move up and down the room.",
        "Move at a pace of about two feet per second.",
        "Usually, only one pass over the carpet is necessary to remove stains, and moving over the carpeted area more than once is not recommended.",
        "Refill the clean solution tank and empty the dirty solution as necessary.",
        "If the solution tank looks especially dirty, remove the tank and discard the dirty solution.",
        "Refill the tank with clean solution, and continue cleaning.",
        "You may not need to do this if the room you are cleaning is small.",
        "Empty both clean and dirty solution tanks once you are done.",
        "Once you’ve gone over every stained area once, turn off and the unplug the machine.",
        "Then, empty any water or solution tanks.",
        "Open windows or doors to speed up the drying process.",
        "If it is summer, you can also  turn the air-conditioning; if it is winter, turning on the heater will help.",
        "It usually takes 24 hours for carpets to dry.",
        "Return the machine to the store.",
        "Since you are done with the cleaning machine, you can now return it to the store or rental place."
    ]
}