{
    "title": "How to Apply a Lace Front Wig",
    "url": "https://www.wikihow.com/Apply-a-Lace-Front-Wig",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Artificial Hair Integrations",
        "Wigs"
    ],
    "parts": [
        {
            "name": "Getting Ready for the Wig",
            "steps": [
                {
                    "headline": "Do a skin test.",
                    "description": "Some people are allergic to the chemicals used to keep a wig in place. Do a skin test to determine whether or not you are allergic. First, dab a small amount of liquid adhesive or double-sided wig tape onto the back of your hand. Next, observe the adhesive for at least twenty four hours. If the skin becomes red or irritated, purchase a hypoallergenic wig tape or adhesive to use instead. If the skin is unaffected, you can safely wear the wig."
                },
                {
                    "headline": "Flatten your hair.",
                    "description": "The flatter your hair is against your head, the better the wig will look. You can braid short hair into corn rows or mold it against your head using gel and bobby pins. For long hair, first tie your hair in a low ponytail. Next, wrap the ponytail into a flat bun and secure it with bobby pins. Allow any gel or hairspray to dry before continuing. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPatrick Evan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOwner, Patrick Evan Salon\t\t\t\t\t\t\t\tPatrick Evan is the Owner of Patrick Evan Salon, a hair salon in San Francisco, California. He has been a hairstylist for over 25 years and is a Thermal Reconditioning Specialist, dedicated to transforming difficult curls and waves into sleek, straight hair. Patrick Evan Salon was rated the Best Hair Salon in San Francisco by Allure magazine, and Patrick's work has been featured in Woman’s Day, The Examiner, and 7x7. Patrick Evan\t\t\tOwner, Patrick Evan Salon\t\t\t\tExpert Trick: If you have a lot of hair, put it into two french braids and wrap these tightly against your head."
                },
                {
                    "headline": "Put on a stocking cap.",
                    "description": "Stocking caps, or wig caps, are soft caps that flatten your hair and help the wig stay in place. Gently pull on the stocking cap, being careful not to disturb your flattened hair. Adjust the cap so that it barely covers your hairline. If you have little to no hair, skip this step. Otherwise, the cap will slide around your head and bunch up under your wig. Make sure all of your hairs are tucked into this cap, even the hairs on the nape of your neck."
                },
                {
                    "headline": "Prepare your skin.",
                    "description": "Wash your skin with a gentle cleanser and blot it dry with a towel. Next, dab some rubbing alcohol on cotton ball and wipe it along your hairline. This will remove the excess oils on your skin. If you have sensitive skin, you can apply a scalp-protecting serum after using the rubbing alcohol. Allow the serum to dry completely before continuing. Scalp-protecting serums can be bought at wig supply shops and online."
                }
            ]
        },
        {
            "name": "Putting On the Wig",
            "steps": [
                {
                    "headline": "Test the fit of the wig.",
                    "description": "Before you apply any adhesives, you need to make sure the wig fits properly. To do so, place the wig on your head and line it up with your natural hairline. If the wig has tightening straps on the inside, you may need to adjust these for a proper fit. If the wig doesn’t fit and it doesn’t have any tightening straps, contact the manufacturer for help. If you can feel a strong ring of pressure around your scalp, the wig is too tight. Loosen the straps slightly. If the wig slides around when you move your head, the wig is too loose. Tighten the straps."
                },
                {
                    "headline": "Trim the lace.",
                    "description": "Once your wig fits properly, you need to trim the lace. Use a few clips to pull the hair away from your face. Next, using sharp pinking shears, trim the lace along your natural hairline. You should leave about 1/8 inch (3 mm) of lace. This will only have to be done the first time you wear the wig. Some wigs don’t need to be trimmed before wearing. These wigs have little to no excess lace at the front of the wig. You can buy pinking shears at sewing supply stores."
                },
                {
                    "headline": "Remove the wig and set it aside.",
                    "description": "Carefully pull the wig off, leaving all the clips in, and set the wig on a clean flat surface. Arrange the wig so that it’s easy to see what part goes on the hairline and what part goes on the nape of the neck. If you have to loosen any straps to get the wig off, your wig is too tight."
                },
                {
                    "headline": "Apply wig tape.",
                    "description": "Cut six to ten small pieces of wig tape. Next, line your hairline with the small pieces of tape by pressing the sticky side against your skin. Use a mirror while you do this to create an even hairline. Once the tape is applied, remove the thick foam padding to reveal the other side of the tape. Make sure all of the pieces are touching. Otherwise, you may have loose gaps in your hairline. Wig tape can be bought at wig supply stores or online."
                },
                {
                    "headline": "Use a liquid adhesive.",
                    "description": "If you don’t want to use wig tape, you can use a liquid lace adhesive instead. Use a clean makeup brush to apply the adhesive in thin line along your entire hairline. Depending on the type of adhesive, you may need to wait a few minutes before wearing your wig. If you use a soft bond adhesive, allow the glue to dry long enough to become tacky before applying the wig. If you use a hard bond adhesive, you can apply the wig immediately."
                },
                {
                    "headline": "Apply the wig.",
                    "description": "Carefully pull the wig on. First, adjust the edge of the wig so that the hairlines match. Next, adjust the back of the wig so that it hangs naturally over your hair. Lastly, press the lace of the wig into your adhesive or wig tape. Once you press the lace into the adhesive or wig tape, it’s very hard to remove. Be sure that the wig is perfectly aligned before doing so."
                },
                {
                    "headline": "Style your hair.",
                    "description": "If your wig is made of human hair, you can use regular brushes, hot styling tools, and hair products. If your wig is synthetic, avoid using regular brushes and hot styling tools. Instead, use a wide-toothed comb or wig brush to adjust your hair."
                }
            ]
        },
        {
            "name": "Maintaining Your Wig",
            "steps": [
                {
                    "headline": "Take off your wig.",
                    "description": "First, remove any adhesives or tape with a commercial wig adhesive remover or regular baby oil. To do so, rub the remover along your hairline where the lace meets the adhesive. Continue rubbing gently until the lace lifts away from your scalp. Do not pull the lace to remove it you will damage the wig."
                },
                {
                    "headline": "Wash the wig regularly.",
                    "description": "Depending on the manufacturer recommendations, your wig will need to be washed after 8-12 wears. First, brush any tangles from the wig. Next, shampoo and condition the wig in a sink filled with warm water. Place it on wig stand and let it dry completely before brushing or combing it. This will help wig last for months instead of weeks. Human hair can be washed with regular shampoo and conditioner. However, synthetic wigs require their own specialized shampoo and conditioner. Specialized shampoos and conditioners can be purchased at beauty supply stores or directly from the wig manufacturer."
                },
                {
                    "headline": "Store the wig properly.",
                    "description": "Proper storage will prolong the life of the wig. Keep the wig on a wig stand when it’s not in use. If you’re in between washings, make sure the wig is free of any adhesives or tape before storing it. You can buy a wig stand at wig supply stores or online."
                }
            ]
        }
    ],
    "tyn": [
        "Cotton Ball",
        "Isopropyl Rubbing Alcohol",
        "Skin Protector (optional)",
        "Wig tape or liquid adhesive",
        "Lace Front Wig",
        "Styling tools (optional)"
    ],
    "text": " Getting Ready for the Wig Do a skin test. Some people are allergic to the chemicals used to keep a wig in place. Do a skin test to determine whether or not you are allergic. First, dab a small amount of liquid adhesive or double-sided wig tape onto the back of your hand. Next, observe the adhesive for at least twenty four hours. If the skin becomes red or irritated, purchase a hypoallergenic wig tape or adhesive to use instead. If the skin is unaffected, you can safely wear the wig. Flatten your hair. The flatter your hair is against your head, the better the wig will look. You can braid short hair into corn rows or mold it against your head using gel and bobby pins. For long hair, first tie your hair in a low ponytail. Next, wrap the ponytail into a flat bun and secure it with bobby pins. Allow any gel or hairspray to dry before continuing. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPatrick Evan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOwner, Patrick Evan Salon\t\t\t\t\t\t\t\tPatrick Evan is the Owner of Patrick Evan Salon, a hair salon in San Francisco, California. He has been a hairstylist for over 25 years and is a Thermal Reconditioning Specialist, dedicated to transforming difficult curls and waves into sleek, straight hair. Patrick Evan Salon was rated the Best Hair Salon in San Francisco by Allure magazine, and Patrick's work has been featured in Woman’s Day, The Examiner, and 7x7. Patrick Evan\t\t\tOwner, Patrick Evan Salon\t\t\t\tExpert Trick: If you have a lot of hair, put it into two french braids and wrap these tightly against your head. Put on a stocking cap. Stocking caps, or wig caps, are soft caps that flatten your hair and help the wig stay in place. Gently pull on the stocking cap, being careful not to disturb your flattened hair. Adjust the cap so that it barely covers your hairline. If you have little to no hair, skip this step. Otherwise, the cap will slide around your head and bunch up under your wig. Make sure all of your hairs are tucked into this cap, even the hairs on the nape of your neck. Prepare your skin. Wash your skin with a gentle cleanser and blot it dry with a towel. Next, dab some rubbing alcohol on cotton ball and wipe it along your hairline. This will remove the excess oils on your skin. If you have sensitive skin, you can apply a scalp-protecting serum after using the rubbing alcohol. Allow the serum to dry completely before continuing. Scalp-protecting serums can be bought at wig supply shops and online. Putting On the Wig Test the fit of the wig. Before you apply any adhesives, you need to make sure the wig fits properly. To do so, place the wig on your head and line it up with your natural hairline. If the wig has tightening straps on the inside, you may need to adjust these for a proper fit. If the wig doesn’t fit and it doesn’t have any tightening straps, contact the manufacturer for help. If you can feel a strong ring of pressure around your scalp, the wig is too tight. Loosen the straps slightly. If the wig slides around when you move your head, the wig is too loose. Tighten the straps. Trim the lace. Once your wig fits properly, you need to trim the lace. Use a few clips to pull the hair away from your face. Next, using sharp pinking shears, trim the lace along your natural hairline. You should leave about 1/8 inch (3 mm) of lace. This will only have to be done the first time you wear the wig. Some wigs don’t need to be trimmed before wearing. These wigs have little to no excess lace at the front of the wig. You can buy pinking shears at sewing supply stores. Remove the wig and set it aside. Carefully pull the wig off, leaving all the clips in, and set the wig on a clean flat surface. Arrange the wig so that it’s easy to see what part goes on the hairline and what part goes on the nape of the neck. If you have to loosen any straps to get the wig off, your wig is too tight. Apply wig tape. Cut six to ten small pieces of wig tape. Next, line your hairline with the small pieces of tape by pressing the sticky side against your skin. Use a mirror while you do this to create an even hairline. Once the tape is applied, remove the thick foam padding to reveal the other side of the tape. Make sure all of the pieces are touching. Otherwise, you may have loose gaps in your hairline. Wig tape can be bought at wig supply stores or online. Use a liquid adhesive. If you don’t want to use wig tape, you can use a liquid lace adhesive instead. Use a clean makeup brush to apply the adhesive in thin line along your entire hairline. Depending on the type of adhesive, you may need to wait a few minutes before wearing your wig. If you use a soft bond adhesive, allow the glue to dry long enough to become tacky before applying the wig. If you use a hard bond adhesive, you can apply the wig immediately. Apply the wig. Carefully pull the wig on. First, adjust the edge of the wig so that the hairlines match. Next, adjust the back of the wig so that it hangs naturally over your hair. Lastly, press the lace of the wig into your adhesive or wig tape. Once you press the lace into the adhesive or wig tape, it’s very hard to remove. Be sure that the wig is perfectly aligned before doing so. Style your hair. If your wig is made of human hair, you can use regular brushes, hot styling tools, and hair products. If your wig is synthetic, avoid using regular brushes and hot styling tools. Instead, use a wide-toothed comb or wig brush to adjust your hair. Maintaining Your Wig Take off your wig. First, remove any adhesives or tape with a commercial wig adhesive remover or regular baby oil. To do so, rub the remover along your hairline where the lace meets the adhesive. Continue rubbing gently until the lace lifts away from your scalp. Do not pull the lace to remove it you will damage the wig. Wash the wig regularly. Depending on the manufacturer recommendations, your wig will need to be washed after 8-12 wears. First, brush any tangles from the wig. Next, shampoo and condition the wig in a sink filled with warm water. Place it on wig stand and let it dry completely before brushing or combing it. This will help wig last for months instead of weeks. Human hair can be washed with regular shampoo and conditioner. However, synthetic wigs require their own specialized shampoo and conditioner. Specialized shampoos and conditioners can be purchased at beauty supply stores or directly from the wig manufacturer. Store the wig properly. Proper storage will prolong the life of the wig. Keep the wig on a wig stand when it’s not in use. If you’re in between washings, make sure the wig is free of any adhesives or tape before storing it. You can buy a wig stand at wig supply stores or online.",
    "sentences": [
        " Getting Ready for the Wig Do a skin test.",
        "Some people are allergic to the chemicals used to keep a wig in place.",
        "Do a skin test to determine whether or not you are allergic.",
        "First, dab a small amount of liquid adhesive or double-sided wig tape onto the back of your hand.",
        "Next, observe the adhesive for at least twenty four hours.",
        "If the skin becomes red or irritated, purchase a hypoallergenic wig tape or adhesive to use instead.",
        "If the skin is unaffected, you can safely wear the wig.",
        "Flatten your hair.",
        "The flatter your hair is against your head, the better the wig will look.",
        "You can braid short hair into corn rows or mold it against your head using gel and bobby pins.",
        "For long hair, first tie your hair in a low ponytail.",
        "Next, wrap the ponytail into a flat bun and secure it with bobby pins.",
        "Allow any gel or hairspray to dry before continuing.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPatrick Evan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOwner, Patrick Evan Salon\t\t\t\t\t\t\t\tPatrick Evan is the Owner of Patrick Evan Salon, a hair salon in San Francisco, California.",
        "He has been a hairstylist for over 25 years and is a Thermal Reconditioning Specialist, dedicated to transforming difficult curls and waves into sleek, straight hair.",
        "Patrick Evan Salon was rated the Best Hair Salon in San Francisco by Allure magazine, and Patrick's work has been featured in Woman’s Day, The Examiner, and 7x7.",
        "Patrick Evan\t\t\tOwner, Patrick Evan Salon\t\t\t\tExpert Trick: If you have a lot of hair, put it into two french braids and wrap these tightly against your head.",
        "Put on a stocking cap.",
        "Stocking caps, or wig caps, are soft caps that flatten your hair and help the wig stay in place.",
        "Gently pull on the stocking cap, being careful not to disturb your flattened hair.",
        "Adjust the cap so that it barely covers your hairline.",
        "If you have little to no hair, skip this step.",
        "Otherwise, the cap will slide around your head and bunch up under your wig.",
        "Make sure all of your hairs are tucked into this cap, even the hairs on the nape of your neck.",
        "Prepare your skin.",
        "Wash your skin with a gentle cleanser and blot it dry with a towel.",
        "Next, dab some rubbing alcohol on cotton ball and wipe it along your hairline.",
        "This will remove the excess oils on your skin.",
        "If you have sensitive skin, you can apply a scalp-protecting serum after using the rubbing alcohol.",
        "Allow the serum to dry completely before continuing.",
        "Scalp-protecting serums can be bought at wig supply shops and online.",
        "Putting On the Wig Test the fit of the wig.",
        "Before you apply any adhesives, you need to make sure the wig fits properly.",
        "To do so, place the wig on your head and line it up with your natural hairline.",
        "If the wig has tightening straps on the inside, you may need to adjust these for a proper fit.",
        "If the wig doesn’t fit and it doesn’t have any tightening straps, contact the manufacturer for help.",
        "If you can feel a strong ring of pressure around your scalp, the wig is too tight.",
        "Loosen the straps slightly.",
        "If the wig slides around when you move your head, the wig is too loose.",
        "Tighten the straps.",
        "Trim the lace.",
        "Once your wig fits properly, you need to trim the lace.",
        "Use a few clips to pull the hair away from your face.",
        "Next, using sharp pinking shears, trim the lace along your natural hairline.",
        "You should leave about 1/8 inch (3 mm) of lace.",
        "This will only have to be done the first time you wear the wig.",
        "Some wigs don’t need to be trimmed before wearing.",
        "These wigs have little to no excess lace at the front of the wig.",
        "You can buy pinking shears at sewing supply stores.",
        "Remove the wig and set it aside.",
        "Carefully pull the wig off, leaving all the clips in, and set the wig on a clean flat surface.",
        "Arrange the wig so that it’s easy to see what part goes on the hairline and what part goes on the nape of the neck.",
        "If you have to loosen any straps to get the wig off, your wig is too tight.",
        "Apply wig tape.",
        "Cut six to ten small pieces of wig tape.",
        "Next, line your hairline with the small pieces of tape by pressing the sticky side against your skin.",
        "Use a mirror while you do this to create an even hairline.",
        "Once the tape is applied, remove the thick foam padding to reveal the other side of the tape.",
        "Make sure all of the pieces are touching.",
        "Otherwise, you may have loose gaps in your hairline.",
        "Wig tape can be bought at wig supply stores or online.",
        "Use a liquid adhesive.",
        "If you don’t want to use wig tape, you can use a liquid lace adhesive instead.",
        "Use a clean makeup brush to apply the adhesive in thin line along your entire hairline.",
        "Depending on the type of adhesive, you may need to wait a few minutes before wearing your wig.",
        "If you use a soft bond adhesive, allow the glue to dry long enough to become tacky before applying the wig.",
        "If you use a hard bond adhesive, you can apply the wig immediately.",
        "Apply the wig.",
        "Carefully pull the wig on.",
        "First, adjust the edge of the wig so that the hairlines match.",
        "Next, adjust the back of the wig so that it hangs naturally over your hair.",
        "Lastly, press the lace of the wig into your adhesive or wig tape.",
        "Once you press the lace into the adhesive or wig tape, it’s very hard to remove.",
        "Be sure that the wig is perfectly aligned before doing so.",
        "Style your hair.",
        "If your wig is made of human hair, you can use regular brushes, hot styling tools, and hair products.",
        "If your wig is synthetic, avoid using regular brushes and hot styling tools.",
        "Instead, use a wide-toothed comb or wig brush to adjust your hair.",
        "Maintaining Your Wig Take off your wig.",
        "First, remove any adhesives or tape with a commercial wig adhesive remover or regular baby oil.",
        "To do so, rub the remover along your hairline where the lace meets the adhesive.",
        "Continue rubbing gently until the lace lifts away from your scalp.",
        "Do not pull the lace to remove it you will damage the wig.",
        "Wash the wig regularly.",
        "Depending on the manufacturer recommendations, your wig will need to be washed after 8-12 wears.",
        "First, brush any tangles from the wig.",
        "Next, shampoo and condition the wig in a sink filled with warm water.",
        "Place it on wig stand and let it dry completely before brushing or combing it.",
        "This will help wig last for months instead of weeks.",
        "Human hair can be washed with regular shampoo and conditioner.",
        "However, synthetic wigs require their own specialized shampoo and conditioner.",
        "Specialized shampoos and conditioners can be purchased at beauty supply stores or directly from the wig manufacturer.",
        "Store the wig properly.",
        "Proper storage will prolong the life of the wig.",
        "Keep the wig on a wig stand when it’s not in use.",
        "If you’re in between washings, make sure the wig is free of any adhesives or tape before storing it.",
        "You can buy a wig stand at wig supply stores or online."
    ]
}