{
    "title": "How to Pay an Electricity Bill Online",
    "url": "https://www.wikihow.com/Pay-an-Electricity-Bill-Online",
    "category_hierarchy": [
        "Finance and Business",
        "Managing Your Money",
        "Budgeting",
        "Managing and Paying Bills"
    ],
    "methods": [
        {
            "name": "Paying on an Electricity Company Website",
            "steps": [
                {
                    "headline": "Find your last statement from the electric company.",
                    "description": "If you have signed up for paperless statements, it should arrive in your email inbox, rather than in the mail."
                },
                {
                    "headline": "Read the statement and find your account number and the company’s website.",
                    "description": "You may even find instructions about how to pay online"
                },
                {
                    "headline": "Go to the company’s website.",
                    "description": "Click on the Billing or Payment section. Most websites have a dedicated tab for these procedures."
                },
                {
                    "headline": "Look for a button that says “Pay Online” or “Pay your Bill.”",
                    "description": ""
                },
                {
                    "headline": "Read the instructions.",
                    "description": "In most cases, the site will tell you that you need to sign up for an online account before you can pay a bill online. If so, enter your account details and confirm the account through your email address. Write down your username and password in a booklet. Keep it safe and access it if you forget your login in the future."
                },
                {
                    "headline": "Grab your checkbook.",
                    "description": "If you don’t have a checkbook, grab your bank’s account information. You will need this to make your payment."
                },
                {
                    "headline": "Sign into your account on the electric company’s website.",
                    "description": "Click the button to pay your bill."
                },
                {
                    "headline": "Enter the details of your bill and your bank account.",
                    "description": "Verify the information is correct before submitting your payment. You may also have the option to pay with a credit or debit card; however, in most cases this is available only with a fee to a third-party bank."
                },
                {
                    "headline": "Submit your payment.",
                    "description": "Look for a confirmation in your inbox."
                },
                {
                    "headline": "Look for an option to set up a recurring payment each month.",
                    "description": "You will need the same bank account information to set up a recurring transfer as you did for a one-time payment. Many utility companies allow an option to average your high and low payments so that you pay the same amount all year round. You should research this option if you want to set up monthly automatic payments."
                }
            ]
        },
        {
            "name": "Using a Bank’s Bill Pay Feature",
            "steps": [
                {
                    "headline": "Find your last electric utility statement.",
                    "description": "You will need the account number and the payee information to set up payments with your bank."
                },
                {
                    "headline": "Sign on to your online banking account.",
                    "description": "If you don’t have one and you want to access your account online, you should set one up. You may need to contact the bank if you’ve never had access before."
                },
                {
                    "headline": "Look for a Bill Pay feature through your bank.",
                    "description": "Most banks and credit unions make this service available to their clients free of charge. Click on this section of the website."
                },
                {
                    "headline": "Find the instructions to add a Payee.",
                    "description": "Enter the account information from your most recent bill. Submit the new payee."
                },
                {
                    "headline": "Find the link that says, “Make a Payment.” Click on it.",
                    "description": "Enter the amount that you want to pay and the date on which you want to pay it. Your bank will submit it on the date you requested; however, if you submit it late, they are not considered responsible for this error. Ensure you give several business days of extra time for the payment to go through."
                },
                {
                    "headline": "Verify the amount and click “Submit” when you are done.",
                    "description": "Look for a list of scheduled payments to ensure that it has been listed under your account. Also, ensure you have enough funds in your account to cover the payment or it will not be made."
                },
                {
                    "headline": "Check back after the payment was scheduled to be sent.",
                    "description": "It is important to verify that it went through if you are using this feature for the first time. Your bank should contact you if there is a problem with sending the payment through their bill pay system."
                }
            ]
        }
    ],
    "tyn": [
        "Electricity utility bill"
    ],
    "text": " Paying on an Electricity Company Website Find your last statement from the electric company. If you have signed up for paperless statements, it should arrive in your email inbox, rather than in the mail. Read the statement and find your account number and the company’s website. You may even find instructions about how to pay online Go to the company’s website. Click on the Billing or Payment section. Most websites have a dedicated tab for these procedures. Look for a button that says “Pay Online” or “Pay your Bill.”  Read the instructions. In most cases, the site will tell you that you need to sign up for an online account before you can pay a bill online. If so, enter your account details and confirm the account through your email address. Write down your username and password in a booklet. Keep it safe and access it if you forget your login in the future. Grab your checkbook. If you don’t have a checkbook, grab your bank’s account information. You will need this to make your payment. Sign into your account on the electric company’s website. Click the button to pay your bill. Enter the details of your bill and your bank account. Verify the information is correct before submitting your payment. You may also have the option to pay with a credit or debit card; however, in most cases this is available only with a fee to a third-party bank. Submit your payment. Look for a confirmation in your inbox. Look for an option to set up a recurring payment each month. You will need the same bank account information to set up a recurring transfer as you did for a one-time payment. Many utility companies allow an option to average your high and low payments so that you pay the same amount all year round. You should research this option if you want to set up monthly automatic payments. Using a Bank’s Bill Pay Feature Find your last electric utility statement. You will need the account number and the payee information to set up payments with your bank. Sign on to your online banking account. If you don’t have one and you want to access your account online, you should set one up. You may need to contact the bank if you’ve never had access before. Look for a Bill Pay feature through your bank. Most banks and credit unions make this service available to their clients free of charge. Click on this section of the website. Find the instructions to add a Payee. Enter the account information from your most recent bill. Submit the new payee. Find the link that says, “Make a Payment.” Click on it. Enter the amount that you want to pay and the date on which you want to pay it. Your bank will submit it on the date you requested; however, if you submit it late, they are not considered responsible for this error. Ensure you give several business days of extra time for the payment to go through. Verify the amount and click “Submit” when you are done. Look for a list of scheduled payments to ensure that it has been listed under your account. Also, ensure you have enough funds in your account to cover the payment or it will not be made. Check back after the payment was scheduled to be sent. It is important to verify that it went through if you are using this feature for the first time. Your bank should contact you if there is a problem with sending the payment through their bill pay system.",
    "sentences": [
        " Paying on an Electricity Company Website Find your last statement from the electric company.",
        "If you have signed up for paperless statements, it should arrive in your email inbox, rather than in the mail.",
        "Read the statement and find your account number and the company’s website.",
        "You may even find instructions about how to pay online Go to the company’s website.",
        "Click on the Billing or Payment section.",
        "Most websites have a dedicated tab for these procedures.",
        "Look for a button that says “Pay Online” or “Pay your Bill.”  Read the instructions.",
        "In most cases, the site will tell you that you need to sign up for an online account before you can pay a bill online.",
        "If so, enter your account details and confirm the account through your email address.",
        "Write down your username and password in a booklet.",
        "Keep it safe and access it if you forget your login in the future.",
        "Grab your checkbook.",
        "If you don’t have a checkbook, grab your bank’s account information.",
        "You will need this to make your payment.",
        "Sign into your account on the electric company’s website.",
        "Click the button to pay your bill.",
        "Enter the details of your bill and your bank account.",
        "Verify the information is correct before submitting your payment.",
        "You may also have the option to pay with a credit or debit card; however, in most cases this is available only with a fee to a third-party bank.",
        "Submit your payment.",
        "Look for a confirmation in your inbox.",
        "Look for an option to set up a recurring payment each month.",
        "You will need the same bank account information to set up a recurring transfer as you did for a one-time payment.",
        "Many utility companies allow an option to average your high and low payments so that you pay the same amount all year round.",
        "You should research this option if you want to set up monthly automatic payments.",
        "Using a Bank’s Bill Pay Feature Find your last electric utility statement.",
        "You will need the account number and the payee information to set up payments with your bank.",
        "Sign on to your online banking account.",
        "If you don’t have one and you want to access your account online, you should set one up.",
        "You may need to contact the bank if you’ve never had access before.",
        "Look for a Bill Pay feature through your bank.",
        "Most banks and credit unions make this service available to their clients free of charge.",
        "Click on this section of the website.",
        "Find the instructions to add a Payee.",
        "Enter the account information from your most recent bill.",
        "Submit the new payee.",
        "Find the link that says, “Make a Payment.” Click on it.",
        "Enter the amount that you want to pay and the date on which you want to pay it.",
        "Your bank will submit it on the date you requested; however, if you submit it late, they are not considered responsible for this error.",
        "Ensure you give several business days of extra time for the payment to go through.",
        "Verify the amount and click “Submit” when you are done.",
        "Look for a list of scheduled payments to ensure that it has been listed under your account.",
        "Also, ensure you have enough funds in your account to cover the payment or it will not be made.",
        "Check back after the payment was scheduled to be sent.",
        "It is important to verify that it went through if you are using this feature for the first time.",
        "Your bank should contact you if there is a problem with sending the payment through their bill pay system."
    ]
}