{
    "title": "How to Make Country Bacon Gravy",
    "url": "https://www.wikihow.com/Make-Country-Bacon-Gravy",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Jams Preserves and Condiments",
        "Gravies"
    ],
    "methods": [
        {
            "name": "Simple Country Bacon Gravy",
            "steps": [
                {
                    "headline": "Place a deep skillet over medium-high heat.",
                    "description": "Add 1/2 cup of bacon grease to the skillet while you do this. The bacon grease should come from the bacon that you previously cooked."
                },
                {
                    "headline": "Add 2 cups of flour to the skillet.",
                    "description": "Stir around the flour into the bacon grease until it's like a paste. It should take about a minute to fully combine the ingredients."
                },
                {
                    "headline": "Continue to stir the mixture for 5 minutes.",
                    "description": "Keep going until the mixture is nice and brown. This combination will 'bind' your gravy together."
                },
                {
                    "headline": "Add 7 cups of milk.",
                    "description": "Carefully pour in the milk and let it come to a simmer. Stir it occasionally to continue to combine the ingredients."
                },
                {
                    "headline": "Cook the gravy for 3-5 more minutes.",
                    "description": "Keep cooking it until it's as thick as you want it to be. Then, turn off the stove and pour the gravy into a dish you can easily use to pour it onto your food."
                },
                {
                    "headline": "Serve.",
                    "description": "Garnish the gravy with crumbled bacon and pour it over toasted black bread, biscuits, mashed potatoes, or any other tasty food."
                }
            ]
        },
        {
            "name": "Creamy Country Bacon Gravy",
            "steps": [
                {
                    "headline": "Place a large skillet over medium-high heat.",
                    "description": ""
                },
                {
                    "headline": "Cook 6 slices of bacon in the skillet.",
                    "description": "Cook the bacon with 1/4 cup of butter on the skillet until it's just a bit under crispy. When it's done, remove it from the skillet, drain it while keeping 4 tablespoon (59.1 ml). of the bacon grease, and set it aside."
                },
                {
                    "headline": "Whisk the flour and grease together in the skillet.",
                    "description": "Place 4 tbsp. of flour and the 4 tbsp. of grease in the skillet and stir the ingredients together for at least a minute, until they are thoroughly combined. Make sure not to burn the flour; if it has started to burn a little early, it's time to add the milk."
                },
                {
                    "headline": "Combine the milk into the mixture.",
                    "description": "Add 2 1/2 cups of milk to the mixture and continue to stir the ingredients together."
                },
                {
                    "headline": "Add 1 minced glove of garlic and 1 chicken bouillon cube to the mixture.",
                    "description": "This will add extra delicious flavor to the country bacon gravy. Stir the ingredients to combine."
                },
                {
                    "headline": "Heat the mixture until it bubbles.",
                    "description": "Then, let it simmer for about 5-10 minutes, until the sauce thickens."
                },
                {
                    "headline": "Crumble the bacon over the mixture while it's cooking.",
                    "description": "Stir it in to the mixture a little bit. Let the mixture simmer until it reaches the consistency you want."
                },
                {
                    "headline": "Season the mixture to taste.",
                    "description": "Add salt and pepper to the gravy to taste."
                },
                {
                    "headline": "Serve.",
                    "description": "Serve this creamy country bacon gravy over crispy biscuits."
                }
            ]
        }
    ],
    "tyn": [
        "A large bowl",
        "A spatula",
        "1 deep skillet pan"
    ],
    "text": " Simple Country Bacon Gravy Place a deep skillet over medium-high heat. Add 1/2 cup of bacon grease to the skillet while you do this. The bacon grease should come from the bacon that you previously cooked. Add 2 cups of flour to the skillet. Stir around the flour into the bacon grease until it's like a paste. It should take about a minute to fully combine the ingredients. Continue to stir the mixture for 5 minutes. Keep going until the mixture is nice and brown. This combination will 'bind' your gravy together. Add 7 cups of milk. Carefully pour in the milk and let it come to a simmer. Stir it occasionally to continue to combine the ingredients. Cook the gravy for 3-5 more minutes. Keep cooking it until it's as thick as you want it to be. Then, turn off the stove and pour the gravy into a dish you can easily use to pour it onto your food. Serve. Garnish the gravy with crumbled bacon and pour it over toasted black bread, biscuits, mashed potatoes, or any other tasty food. Creamy Country Bacon Gravy Place a large skillet over medium-high heat.  Cook 6 slices of bacon in the skillet. Cook the bacon with 1/4 cup of butter on the skillet until it's just a bit under crispy. When it's done, remove it from the skillet, drain it while keeping 4 tablespoon (59.1 ml). of the bacon grease, and set it aside. Whisk the flour and grease together in the skillet. Place 4 tbsp. of flour and the 4 tbsp. of grease in the skillet and stir the ingredients together for at least a minute, until they are thoroughly combined. Make sure not to burn the flour; if it has started to burn a little early, it's time to add the milk. Combine the milk into the mixture. Add 2 1/2 cups of milk to the mixture and continue to stir the ingredients together. Add 1 minced glove of garlic and 1 chicken bouillon cube to the mixture. This will add extra delicious flavor to the country bacon gravy. Stir the ingredients to combine. Heat the mixture until it bubbles. Then, let it simmer for about 5-10 minutes, until the sauce thickens. Crumble the bacon over the mixture while it's cooking. Stir it in to the mixture a little bit. Let the mixture simmer until it reaches the consistency you want. Season the mixture to taste. Add salt and pepper to the gravy to taste. Serve. Serve this creamy country bacon gravy over crispy biscuits.",
    "sentences": [
        " Simple Country Bacon Gravy Place a deep skillet over medium-high heat.",
        "Add 1/2 cup of bacon grease to the skillet while you do this.",
        "The bacon grease should come from the bacon that you previously cooked.",
        "Add 2 cups of flour to the skillet.",
        "Stir around the flour into the bacon grease until it's like a paste.",
        "It should take about a minute to fully combine the ingredients.",
        "Continue to stir the mixture for 5 minutes.",
        "Keep going until the mixture is nice and brown.",
        "This combination will 'bind' your gravy together.",
        "Add 7 cups of milk.",
        "Carefully pour in the milk and let it come to a simmer.",
        "Stir it occasionally to continue to combine the ingredients.",
        "Cook the gravy for 3-5 more minutes.",
        "Keep cooking it until it's as thick as you want it to be.",
        "Then, turn off the stove and pour the gravy into a dish you can easily use to pour it onto your food.",
        "Serve.",
        "Garnish the gravy with crumbled bacon and pour it over toasted black bread, biscuits, mashed potatoes, or any other tasty food.",
        "Creamy Country Bacon Gravy Place a large skillet over medium-high heat.",
        "Cook 6 slices of bacon in the skillet.",
        "Cook the bacon with 1/4 cup of butter on the skillet until it's just a bit under crispy.",
        "When it's done, remove it from the skillet, drain it while keeping 4 tablespoon (59.1 ml).",
        "of the bacon grease, and set it aside.",
        "Whisk the flour and grease together in the skillet.",
        "Place 4 tbsp.",
        "of flour and the 4 tbsp.",
        "of grease in the skillet and stir the ingredients together for at least a minute, until they are thoroughly combined.",
        "Make sure not to burn the flour; if it has started to burn a little early, it's time to add the milk.",
        "Combine the milk into the mixture.",
        "Add 2 1/2 cups of milk to the mixture and continue to stir the ingredients together.",
        "Add 1 minced glove of garlic and 1 chicken bouillon cube to the mixture.",
        "This will add extra delicious flavor to the country bacon gravy.",
        "Stir the ingredients to combine.",
        "Heat the mixture until it bubbles.",
        "Then, let it simmer for about 5-10 minutes, until the sauce thickens.",
        "Crumble the bacon over the mixture while it's cooking.",
        "Stir it in to the mixture a little bit.",
        "Let the mixture simmer until it reaches the consistency you want.",
        "Season the mixture to taste.",
        "Add salt and pepper to the gravy to taste.",
        "Serve.",
        "Serve this creamy country bacon gravy over crispy biscuits."
    ]
}