{
    "title": "How to Love Your Stuffed Animal",
    "url": "https://www.wikihow.com/Love-Your-Stuffed-Animal",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Toys",
        "Traditional Toys",
        "Stuffed Animals"
    ],
    "parts": [
        {
            "name": "Caring for a New Stuffed Animal",
            "steps": [
                {
                    "headline": "Choose your stuffed animal with care.",
                    "description": "When adopting or buying a stuffed animal, decide wisely on what you will choose. Size, shape, colour, texture and the type of animal all make a difference to your feelings for the little critter."
                },
                {
                    "headline": "Give your new pet a name.",
                    "description": "This will make it seem like a real companion for you."
                },
                {
                    "headline": "Give your stuffed animal a little house or a home to live in.",
                    "description": "Or you could just make a bed for it. If it's very big or likes cuddling with you, it can live on your bed."
                }
            ]
        },
        {
            "name": "Spending Time with Your Stuffed Animal",
            "steps": [
                {
                    "headline": "Take your companion everywhere you go.",
                    "description": "This helps it to feel wanted. If you absolutely cannot take your stuffed animal with you, tell him or her they can't come and give them a hug, kiss or both."
                },
                {
                    "headline": "Do fun projects with your stuffed animal companion.",
                    "description": "Do things such as:\nMaking a bedroom for it\nPapier mâché projects\nHave a party/tea party with other stuffed animals. Have a sleepover party with other stuffed animals. Write a story. Draw funny pictures and caricatures of people. Read a good story. Cooking or baking pretend food. Put in a movie and cuddle up on the sofa with a tub of popcorn. Brush each other's fur and hair. Play some make-believe games. Take a walk and tell each other some personal things. Draw a family tree of all the family members in existence. Play doctor with your companion or on your companion. Go shopping and look at the new teddy bear styles."
                },
                {
                    "headline": "Have fun!",
                    "description": "The best way of showing your stuffed animal or teddy you love him or her is to do things with them and have fun together."
                },
                {
                    "headline": "Keep your stuffed toy close to you.",
                    "description": ""
                },
                {
                    "headline": "Keep it well-groomed.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Taking Care of Your Stuffed Animal",
            "steps": [
                {
                    "headline": "Tend to your stuffed animal when it has damage.",
                    "description": "If your teddy or stuffed animal receives a tear or loses parts, leave it on a little hospital bed until you can stitch it up. Ask an adult to help you, especially if parts need replacing."
                },
                {
                    "headline": "Keep the stuffed animal groomed.",
                    "description": "Your stuffed animal might like being groomed once in a while. Brush him or her with a soft brush."
                },
                {
                    "headline": "Wash your stuffed animal at least once a month.",
                    "description": "For whole washes, place the stuffed animal in the washer on a low setting preferably in a closed pillowcase. For spot cleaning (removing small marks), dip a clean old toothbrush into water and gently rub over the mark. Make sure you always care for your animal!"
                }
            ]
        }
    ],
    "tyn": [
        "Stuffed Animal(s)",
        "Clothes (optional)",
        "More friends!"
    ],
    "text": " Caring for a New Stuffed Animal Choose your stuffed animal with care. When adopting or buying a stuffed animal, decide wisely on what you will choose. Size, shape, colour, texture and the type of animal all make a difference to your feelings for the little critter. Give your new pet a name. This will make it seem like a real companion for you. Give your stuffed animal a little house or a home to live in. Or you could just make a bed for it. If it's very big or likes cuddling with you, it can live on your bed. Spending Time with Your Stuffed Animal Take your companion everywhere you go. This helps it to feel wanted. If you absolutely cannot take your stuffed animal with you, tell him or her they can't come and give them a hug, kiss or both. Do fun projects with your stuffed animal companion. Do things such as:\nMaking a bedroom for it\nPapier mâché projects\nHave a party/tea party with other stuffed animals. Have a sleepover party with other stuffed animals. Write a story. Draw funny pictures and caricatures of people. Read a good story. Cooking or baking pretend food. Put in a movie and cuddle up on the sofa with a tub of popcorn. Brush each other's fur and hair. Play some make-believe games. Take a walk and tell each other some personal things. Draw a family tree of all the family members in existence. Play doctor with your companion or on your companion. Go shopping and look at the new teddy bear styles. Have fun! The best way of showing your stuffed animal or teddy you love him or her is to do things with them and have fun together. Keep your stuffed toy close to you.  Keep it well-groomed.  Taking Care of Your Stuffed Animal Tend to your stuffed animal when it has damage. If your teddy or stuffed animal receives a tear or loses parts, leave it on a little hospital bed until you can stitch it up. Ask an adult to help you, especially if parts need replacing. Keep the stuffed animal groomed. Your stuffed animal might like being groomed once in a while. Brush him or her with a soft brush. Wash your stuffed animal at least once a month. For whole washes, place the stuffed animal in the washer on a low setting preferably in a closed pillowcase. For spot cleaning (removing small marks), dip a clean old toothbrush into water and gently rub over the mark. Make sure you always care for your animal!",
    "sentences": [
        " Caring for a New Stuffed Animal Choose your stuffed animal with care.",
        "When adopting or buying a stuffed animal, decide wisely on what you will choose.",
        "Size, shape, colour, texture and the type of animal all make a difference to your feelings for the little critter.",
        "Give your new pet a name.",
        "This will make it seem like a real companion for you.",
        "Give your stuffed animal a little house or a home to live in.",
        "Or you could just make a bed for it.",
        "If it's very big or likes cuddling with you, it can live on your bed.",
        "Spending Time with Your Stuffed Animal Take your companion everywhere you go.",
        "This helps it to feel wanted.",
        "If you absolutely cannot take your stuffed animal with you, tell him or her they can't come and give them a hug, kiss or both.",
        "Do fun projects with your stuffed animal companion.",
        "Do things such as:\nMaking a bedroom for it\nPapier mâché projects\nHave a party/tea party with other stuffed animals.",
        "Have a sleepover party with other stuffed animals.",
        "Write a story.",
        "Draw funny pictures and caricatures of people.",
        "Read a good story.",
        "Cooking or baking pretend food.",
        "Put in a movie and cuddle up on the sofa with a tub of popcorn.",
        "Brush each other's fur and hair.",
        "Play some make-believe games.",
        "Take a walk and tell each other some personal things.",
        "Draw a family tree of all the family members in existence.",
        "Play doctor with your companion or on your companion.",
        "Go shopping and look at the new teddy bear styles.",
        "Have fun!",
        "The best way of showing your stuffed animal or teddy you love him or her is to do things with them and have fun together.",
        "Keep your stuffed toy close to you.",
        "Keep it well-groomed.",
        "Taking Care of Your Stuffed Animal Tend to your stuffed animal when it has damage.",
        "If your teddy or stuffed animal receives a tear or loses parts, leave it on a little hospital bed until you can stitch it up.",
        "Ask an adult to help you, especially if parts need replacing.",
        "Keep the stuffed animal groomed.",
        "Your stuffed animal might like being groomed once in a while.",
        "Brush him or her with a soft brush.",
        "Wash your stuffed animal at least once a month.",
        "For whole washes, place the stuffed animal in the washer on a low setting preferably in a closed pillowcase.",
        "For spot cleaning (removing small marks), dip a clean old toothbrush into water and gently rub over the mark.",
        "Make sure you always care for your animal!"
    ]
}