{
    "title": "How to Care for Baby Guppies",
    "url": "https://www.wikihow.com/Care-for-Baby-Guppies",
    "category_hierarchy": [
        "Pets and Animals",
        "Fish",
        "Fish Breeds",
        "Guppies"
    ],
    "parts": [
        {
            "name": "Separating Your Baby Guppies",
            "steps": [
                {
                    "headline": "Place the pregnant guppy in a breeder net or separate tank, if you can.",
                    "description": "Fit the breeder net in the corner of your tank. As another option, place the mother fish in a separate, small tank until she gives birth. This way your baby guppies are born in a safe environment. For example, you might keep your pregnant fish in a small 5 US gal (19 L) tank until she gives birth. After they're born, the baby guppies can live in this tank until they're big enough to join your aquarium. You can find a fish breeder net at your local pet store or online. They’re fairly inexpensive, as you can find some for around $10. Don’t put the breeder net near the tank filter’s pump, as the baby guppies might get sucked up into the filter."
                },
                {
                    "headline": "Monitor the tank until the mother gives birth to live baby guppies.",
                    "description": "Unlike other fish, guppies don’t lay eggs. That means your female guppy is going to give birth to live baby fish, which are called fry. You’ll know your mother fish is in labor when you see her hiding or resting near the heater. Her color will look faded, her belly will look square, and she will appear to be swimming in place or shivering, which is really contractions. Guppies are typically pregnant from 22 to 40 days."
                },
                {
                    "headline": "Notice when the mother guppy is swimming normally.",
                    "description": "During labor, the mother guppy may pace or appear to swim backwards. When she's swimming calmly, you'll know the birth is over. The birth can take up to 6 hours but may be shorter. Newborn guppies are typically 7 to 10 millimetres (0.28 to 0.39 in) long. They're usually transparent, but they may be slightly colored gray or black. Guppies typically have 20 to 50 babies at one time."
                },
                {
                    "headline": "Remove the mother immediately after the birth or she'll eat the babies.",
                    "description": "It’s natural for the mother to eat her babies, so it’s important to remove her as soon as you can. Use a fish net to scoop the mother from the breeder net or tank, then place her back in her regular habitat. If the babies are born inside a large aquarium, you can try removing the babies from the tank. However, this can be difficult since the babies are so small and are easily injured. It’s much easier to remove the adult fish."
                },
                {
                    "headline": "Fill your tank with plants if you don’t want to separate the baby guppies.",
                    "description": "Place real or artificial plants in multiple places in the aquarium. Group 2 or 3 plants close together to form a safe hiding place for the baby guppies. They will attempt to hide in the plants so that the adult fish won’t eat them. Using plants will prevent the adult fish from eating all of the baby guppies, but it’s likely that some of the babies will still get eaten. They only way to guarantee the babies won’t get eaten is to place them in a separate tank."
                }
            ]
        },
        {
            "name": "Creating the Perfect Environment",
            "steps": [
                {
                    "headline": "Keep the tank temperature between 76 to 80 °F (24 to 27 °C).",
                    "description": "This is the optimal temperature for keeping the baby guppies comfortable and hungry so they'll eat enough food for healthy growth. If your tank temperature isn’t within this range, you can install a heater in your tank. Choose a heater that can handle the capacity of your tank. Cold water will make your fish too sluggish, while very warm water can harm the fish. To check the precise temperature of your water, use a thermometer that sticks to the side of your tank. You can find a tank heater at a local pet store or online."
                },
                {
                    "headline": "Install a filter in your fish tank to keep the water clean.",
                    "description": "Follow the directions on your filter model to place it in the tank. Baby guppies don’t have a strong immune system, so they’re vulnerable to disease. A filter can keep your water clean enough to protect the fry, though you still need to change the water often. It’s best to put a thin fishnet or sponge over the intake valve in your filter, where water is pulled into the filter. That way, the baby guppies can’t get pulled into the filter. Make sure you read all of the instructions that come with your filter."
                },
                {
                    "headline": "Clean the tank weekly because a dirty tank can cause illness.",
                    "description": "Scoop the baby guppies out of their tank using a cup or fish net. Then, pour the old water out of the tank. Wipe any algae or grime from the sides of the tank. Finally, refill it with fresh, clean water that’s been treated for chlorine. Wait until the tank thermometer reaches the optimal temperature for your guppies before you return them to the tank. If you can’t change the water every week, replace at least 1/4 of the water each week with fresh, clean water. Chlorine can harm your fish, but you can neutralize it. Purchase chlorine treatment tablets or liquid from your local pet store or online. If you don't have this, let the water sit out for 24 hours before you use it to replace the water in your fish tank."
                },
                {
                    "headline": "Turn on the tank light for 8 to 12 hours a day so their spines grow.",
                    "description": "Baby guppies that grow up in dim lighting may develop deformities, especially in their spine. A regular tank light installed in the top of your tank is all you need to give your fish light. Turn the light on in the morning, then turn it off in the evening. Don’t leave the light on longer than 14 hours a day, as the baby guppies need to be able to sleep."
                }
            ]
        },
        {
            "name": "Feeding Your Baby Guppies",
            "steps": [
                {
                    "headline": "Feed your baby guppies every 2-3 hours for the first 6 weeks.",
                    "description": "They need to eat 5-6 times a day when they’re very small. After the first 6 weeks, it’s okay to decrease your feedings to every 4-5 hours, which will be 3-4 times per day. It’s best to give your guppies a mixture of fresh and dry food, if you can. If you can’t give your fish a mix of fresh and dry food, choose the best dry food you can find. Look for one that’s labeled as providing all of the necessary nutrients for baby livebearing fish."
                },
                {
                    "headline": "Give your baby guppies ground up dry food for baby livebearing fish.",
                    "description": "The food may come already ground up, or you might need to grind it yourself. Sprinkle the food into the tank at feeding times. Watch to make sure the baby guppies are able to eat the bits of food. Read the label on the fish food to make sure you’re feeding the fish in the right quantity. You can grind up the food using a mortar and pestle. If you don’t have one, place the food on a plate, then grind it up with the back of a spoon. Don’t feed your baby guppies large pieces of adult fish food, as they will be too small to eat this food. Check the label to make sure the food you choose is appropriate for baby fish."
                },
                {
                    "headline": "Add dried blood worms to the food for added nutrients.",
                    "description": "Baby guppies love the taste of bloodworms, so they’ll gobble them right up. Make sure the blood worms are ground up, just like the dry food. You can feed them the bloodworms mixed into their dry food or separately, depending on your preference. You can feed your baby guppies bloodworms every day. Look for dried blood worms at your local pet store or online."
                },
                {
                    "headline": "Give your baby guppies freshly hatched brine shrimp as a supplement.",
                    "description": "Brine shrimp are very tasty to baby guppies. Plus, the shrimp are full of nutrients that will help the fish grow and develop a nice coloring. Offer brine shrimp at 1-2 feeding a days. Brine shrimp are available at local pet stores or online."
                },
                {
                    "headline": "Offer freshly hatched daphnia, as another supplement option.",
                    "description": "Daphnia are a type of aquatic crustacean. Like brine shrimp, they’re very tasty to baby guppies and contain lots of nutrients. Offer the daphnia as a supplement at 1-2 feedings a day. You can buy daphnia at your local pet store or online."
                }
            ]
        },
        {
            "name": "Monitoring Their Health",
            "steps": [
                {
                    "headline": "Remove fry that show signs of deformity and illness.",
                    "description": "Baby guppies are especially vulnerable to illnesses caused by bacteria or aggression from other fish. Don’t leave sick fish in your tank, as others may become ill, as well. You can either attempt to nurse the sick fry in a separate tank or dispose of them, as they're unlikely to thrive. If you notice the following symptoms, remove the affected fry from the tank:\nBent or warped spine\nSores\nTail rot\nFin rot"
                },
                {
                    "headline": "Avoid medicating your tank, as you risk harming the fry.",
                    "description": "You can find medications to help treat common illnesses in guppies. However, these medications aren’t appropriate for fry, unless you are very knowledgeable about dosing fish. It’s better to remove ill fish from the tank rather than risking the health of the other fish. You can try to treat the sick fish in a separate tank. However, they’re unlikely to thrive if they’ve become ill at such a vulnerable stage."
                },
                {
                    "headline": "Place your baby guppies into your regular aquarium at 6-8 weeks old.",
                    "description": "Most baby guppies will be too big to eat at this point. Make sure they’re bigger than the mouth of your adult fish before you put them in the aquarium. Otherwise, the bigger fish may still eat them. Your fish will continue to grow until they reach 6 months old, which is considered adulthood. You may notice some growth after your fish is an adult, but it will be minimal."
                },
                {
                    "headline": "Separate males and females if you don't want more babies.",
                    "description": "Female guppies usually start to reproduce at 2 to 3 months of age. Additionally, they can store sperm for up to 3 months. If you don't want more babies, you'll need to separate your male and female fry once they reach about 6 to 8 weeks old. You'll be able to determine the sex of your baby guppies when they're about 1 month old. Male guppies will have a long, rod-like fin on their underbelly, which is called a gonopodium. Females will have a dark spot called a gravid spot on their underbelly."
                }
            ]
        }
    ],
    "tyn": [
        "Aquarium",
        "Breeder net",
        "5 gallons (19 L) fish tank (optional)",
        "Fish net",
        "Aquarium plants",
        "Fish tank thermometer",
        "Water filter",
        "Chlorine treatment (optional)",
        "Fish tank light",
        "Dry food for baby livebearing fish",
        "Dry bloodworms",
        "Freshly hatched brine shrimp (optional)",
        "Freshly hatched daphnia"
    ],
    "text": " Separating Your Baby Guppies Place the pregnant guppy in a breeder net or separate tank, if you can. Fit the breeder net in the corner of your tank. As another option, place the mother fish in a separate, small tank until she gives birth. This way your baby guppies are born in a safe environment. For example, you might keep your pregnant fish in a small 5 US gal (19 L) tank until she gives birth. After they're born, the baby guppies can live in this tank until they're big enough to join your aquarium. You can find a fish breeder net at your local pet store or online. They’re fairly inexpensive, as you can find some for around $10. Don’t put the breeder net near the tank filter’s pump, as the baby guppies might get sucked up into the filter. Monitor the tank until the mother gives birth to live baby guppies. Unlike other fish, guppies don’t lay eggs. That means your female guppy is going to give birth to live baby fish, which are called fry. You’ll know your mother fish is in labor when you see her hiding or resting near the heater. Her color will look faded, her belly will look square, and she will appear to be swimming in place or shivering, which is really contractions. Guppies are typically pregnant from 22 to 40 days. Notice when the mother guppy is swimming normally. During labor, the mother guppy may pace or appear to swim backwards. When she's swimming calmly, you'll know the birth is over. The birth can take up to 6 hours but may be shorter. Newborn guppies are typically 7 to 10 millimetres (0.28 to 0.39 in) long. They're usually transparent, but they may be slightly colored gray or black. Guppies typically have 20 to 50 babies at one time. Remove the mother immediately after the birth or she'll eat the babies. It’s natural for the mother to eat her babies, so it’s important to remove her as soon as you can. Use a fish net to scoop the mother from the breeder net or tank, then place her back in her regular habitat. If the babies are born inside a large aquarium, you can try removing the babies from the tank. However, this can be difficult since the babies are so small and are easily injured. It’s much easier to remove the adult fish. Fill your tank with plants if you don’t want to separate the baby guppies. Place real or artificial plants in multiple places in the aquarium. Group 2 or 3 plants close together to form a safe hiding place for the baby guppies. They will attempt to hide in the plants so that the adult fish won’t eat them. Using plants will prevent the adult fish from eating all of the baby guppies, but it’s likely that some of the babies will still get eaten. They only way to guarantee the babies won’t get eaten is to place them in a separate tank. Creating the Perfect Environment Keep the tank temperature between 76 to 80 °F (24 to 27 °C). This is the optimal temperature for keeping the baby guppies comfortable and hungry so they'll eat enough food for healthy growth. If your tank temperature isn’t within this range, you can install a heater in your tank. Choose a heater that can handle the capacity of your tank. Cold water will make your fish too sluggish, while very warm water can harm the fish. To check the precise temperature of your water, use a thermometer that sticks to the side of your tank. You can find a tank heater at a local pet store or online. Install a filter in your fish tank to keep the water clean. Follow the directions on your filter model to place it in the tank. Baby guppies don’t have a strong immune system, so they’re vulnerable to disease. A filter can keep your water clean enough to protect the fry, though you still need to change the water often. It’s best to put a thin fishnet or sponge over the intake valve in your filter, where water is pulled into the filter. That way, the baby guppies can’t get pulled into the filter. Make sure you read all of the instructions that come with your filter. Clean the tank weekly because a dirty tank can cause illness. Scoop the baby guppies out of their tank using a cup or fish net. Then, pour the old water out of the tank. Wipe any algae or grime from the sides of the tank. Finally, refill it with fresh, clean water that’s been treated for chlorine. Wait until the tank thermometer reaches the optimal temperature for your guppies before you return them to the tank. If you can’t change the water every week, replace at least 1/4 of the water each week with fresh, clean water. Chlorine can harm your fish, but you can neutralize it. Purchase chlorine treatment tablets or liquid from your local pet store or online. If you don't have this, let the water sit out for 24 hours before you use it to replace the water in your fish tank. Turn on the tank light for 8 to 12 hours a day so their spines grow. Baby guppies that grow up in dim lighting may develop deformities, especially in their spine. A regular tank light installed in the top of your tank is all you need to give your fish light. Turn the light on in the morning, then turn it off in the evening. Don’t leave the light on longer than 14 hours a day, as the baby guppies need to be able to sleep. Feeding Your Baby Guppies Feed your baby guppies every 2-3 hours for the first 6 weeks. They need to eat 5-6 times a day when they’re very small. After the first 6 weeks, it’s okay to decrease your feedings to every 4-5 hours, which will be 3-4 times per day. It’s best to give your guppies a mixture of fresh and dry food, if you can. If you can’t give your fish a mix of fresh and dry food, choose the best dry food you can find. Look for one that’s labeled as providing all of the necessary nutrients for baby livebearing fish. Give your baby guppies ground up dry food for baby livebearing fish. The food may come already ground up, or you might need to grind it yourself. Sprinkle the food into the tank at feeding times. Watch to make sure the baby guppies are able to eat the bits of food. Read the label on the fish food to make sure you’re feeding the fish in the right quantity. You can grind up the food using a mortar and pestle. If you don’t have one, place the food on a plate, then grind it up with the back of a spoon. Don’t feed your baby guppies large pieces of adult fish food, as they will be too small to eat this food. Check the label to make sure the food you choose is appropriate for baby fish. Add dried blood worms to the food for added nutrients. Baby guppies love the taste of bloodworms, so they’ll gobble them right up. Make sure the blood worms are ground up, just like the dry food. You can feed them the bloodworms mixed into their dry food or separately, depending on your preference. You can feed your baby guppies bloodworms every day. Look for dried blood worms at your local pet store or online. Give your baby guppies freshly hatched brine shrimp as a supplement. Brine shrimp are very tasty to baby guppies. Plus, the shrimp are full of nutrients that will help the fish grow and develop a nice coloring. Offer brine shrimp at 1-2 feeding a days. Brine shrimp are available at local pet stores or online. Offer freshly hatched daphnia, as another supplement option. Daphnia are a type of aquatic crustacean. Like brine shrimp, they’re very tasty to baby guppies and contain lots of nutrients. Offer the daphnia as a supplement at 1-2 feedings a day. You can buy daphnia at your local pet store or online. Monitoring Their Health Remove fry that show signs of deformity and illness. Baby guppies are especially vulnerable to illnesses caused by bacteria or aggression from other fish. Don’t leave sick fish in your tank, as others may become ill, as well. You can either attempt to nurse the sick fry in a separate tank or dispose of them, as they're unlikely to thrive. If you notice the following symptoms, remove the affected fry from the tank:\nBent or warped spine\nSores\nTail rot\nFin rot Avoid medicating your tank, as you risk harming the fry. You can find medications to help treat common illnesses in guppies. However, these medications aren’t appropriate for fry, unless you are very knowledgeable about dosing fish. It’s better to remove ill fish from the tank rather than risking the health of the other fish. You can try to treat the sick fish in a separate tank. However, they’re unlikely to thrive if they’ve become ill at such a vulnerable stage. Place your baby guppies into your regular aquarium at 6-8 weeks old. Most baby guppies will be too big to eat at this point. Make sure they’re bigger than the mouth of your adult fish before you put them in the aquarium. Otherwise, the bigger fish may still eat them. Your fish will continue to grow until they reach 6 months old, which is considered adulthood. You may notice some growth after your fish is an adult, but it will be minimal. Separate males and females if you don't want more babies. Female guppies usually start to reproduce at 2 to 3 months of age. Additionally, they can store sperm for up to 3 months. If you don't want more babies, you'll need to separate your male and female fry once they reach about 6 to 8 weeks old. You'll be able to determine the sex of your baby guppies when they're about 1 month old. Male guppies will have a long, rod-like fin on their underbelly, which is called a gonopodium. Females will have a dark spot called a gravid spot on their underbelly.",
    "sentences": [
        " Separating Your Baby Guppies Place the pregnant guppy in a breeder net or separate tank, if you can.",
        "Fit the breeder net in the corner of your tank.",
        "As another option, place the mother fish in a separate, small tank until she gives birth.",
        "This way your baby guppies are born in a safe environment.",
        "For example, you might keep your pregnant fish in a small 5 US gal (19 L) tank until she gives birth.",
        "After they're born, the baby guppies can live in this tank until they're big enough to join your aquarium.",
        "You can find a fish breeder net at your local pet store or online.",
        "They’re fairly inexpensive, as you can find some for around $10.",
        "Don’t put the breeder net near the tank filter’s pump, as the baby guppies might get sucked up into the filter.",
        "Monitor the tank until the mother gives birth to live baby guppies.",
        "Unlike other fish, guppies don’t lay eggs.",
        "That means your female guppy is going to give birth to live baby fish, which are called fry.",
        "You’ll know your mother fish is in labor when you see her hiding or resting near the heater.",
        "Her color will look faded, her belly will look square, and she will appear to be swimming in place or shivering, which is really contractions.",
        "Guppies are typically pregnant from 22 to 40 days.",
        "Notice when the mother guppy is swimming normally.",
        "During labor, the mother guppy may pace or appear to swim backwards.",
        "When she's swimming calmly, you'll know the birth is over.",
        "The birth can take up to 6 hours but may be shorter.",
        "Newborn guppies are typically 7 to 10 millimetres (0.28 to 0.39 in) long.",
        "They're usually transparent, but they may be slightly colored gray or black.",
        "Guppies typically have 20 to 50 babies at one time.",
        "Remove the mother immediately after the birth or she'll eat the babies.",
        "It’s natural for the mother to eat her babies, so it’s important to remove her as soon as you can.",
        "Use a fish net to scoop the mother from the breeder net or tank, then place her back in her regular habitat.",
        "If the babies are born inside a large aquarium, you can try removing the babies from the tank.",
        "However, this can be difficult since the babies are so small and are easily injured.",
        "It’s much easier to remove the adult fish.",
        "Fill your tank with plants if you don’t want to separate the baby guppies.",
        "Place real or artificial plants in multiple places in the aquarium.",
        "Group 2 or 3 plants close together to form a safe hiding place for the baby guppies.",
        "They will attempt to hide in the plants so that the adult fish won’t eat them.",
        "Using plants will prevent the adult fish from eating all of the baby guppies, but it’s likely that some of the babies will still get eaten.",
        "They only way to guarantee the babies won’t get eaten is to place them in a separate tank.",
        "Creating the Perfect Environment Keep the tank temperature between 76 to 80 °F (24 to 27 °C).",
        "This is the optimal temperature for keeping the baby guppies comfortable and hungry so they'll eat enough food for healthy growth.",
        "If your tank temperature isn’t within this range, you can install a heater in your tank.",
        "Choose a heater that can handle the capacity of your tank.",
        "Cold water will make your fish too sluggish, while very warm water can harm the fish.",
        "To check the precise temperature of your water, use a thermometer that sticks to the side of your tank.",
        "You can find a tank heater at a local pet store or online.",
        "Install a filter in your fish tank to keep the water clean.",
        "Follow the directions on your filter model to place it in the tank.",
        "Baby guppies don’t have a strong immune system, so they’re vulnerable to disease.",
        "A filter can keep your water clean enough to protect the fry, though you still need to change the water often.",
        "It’s best to put a thin fishnet or sponge over the intake valve in your filter, where water is pulled into the filter.",
        "That way, the baby guppies can’t get pulled into the filter.",
        "Make sure you read all of the instructions that come with your filter.",
        "Clean the tank weekly because a dirty tank can cause illness.",
        "Scoop the baby guppies out of their tank using a cup or fish net.",
        "Then, pour the old water out of the tank.",
        "Wipe any algae or grime from the sides of the tank.",
        "Finally, refill it with fresh, clean water that’s been treated for chlorine.",
        "Wait until the tank thermometer reaches the optimal temperature for your guppies before you return them to the tank.",
        "If you can’t change the water every week, replace at least 1/4 of the water each week with fresh, clean water.",
        "Chlorine can harm your fish, but you can neutralize it.",
        "Purchase chlorine treatment tablets or liquid from your local pet store or online.",
        "If you don't have this, let the water sit out for 24 hours before you use it to replace the water in your fish tank.",
        "Turn on the tank light for 8 to 12 hours a day so their spines grow.",
        "Baby guppies that grow up in dim lighting may develop deformities, especially in their spine.",
        "A regular tank light installed in the top of your tank is all you need to give your fish light.",
        "Turn the light on in the morning, then turn it off in the evening.",
        "Don’t leave the light on longer than 14 hours a day, as the baby guppies need to be able to sleep.",
        "Feeding Your Baby Guppies Feed your baby guppies every 2-3 hours for the first 6 weeks.",
        "They need to eat 5-6 times a day when they’re very small.",
        "After the first 6 weeks, it’s okay to decrease your feedings to every 4-5 hours, which will be 3-4 times per day.",
        "It’s best to give your guppies a mixture of fresh and dry food, if you can.",
        "If you can’t give your fish a mix of fresh and dry food, choose the best dry food you can find.",
        "Look for one that’s labeled as providing all of the necessary nutrients for baby livebearing fish.",
        "Give your baby guppies ground up dry food for baby livebearing fish.",
        "The food may come already ground up, or you might need to grind it yourself.",
        "Sprinkle the food into the tank at feeding times.",
        "Watch to make sure the baby guppies are able to eat the bits of food.",
        "Read the label on the fish food to make sure you’re feeding the fish in the right quantity.",
        "You can grind up the food using a mortar and pestle.",
        "If you don’t have one, place the food on a plate, then grind it up with the back of a spoon.",
        "Don’t feed your baby guppies large pieces of adult fish food, as they will be too small to eat this food.",
        "Check the label to make sure the food you choose is appropriate for baby fish.",
        "Add dried blood worms to the food for added nutrients.",
        "Baby guppies love the taste of bloodworms, so they’ll gobble them right up.",
        "Make sure the blood worms are ground up, just like the dry food.",
        "You can feed them the bloodworms mixed into their dry food or separately, depending on your preference.",
        "You can feed your baby guppies bloodworms every day.",
        "Look for dried blood worms at your local pet store or online.",
        "Give your baby guppies freshly hatched brine shrimp as a supplement.",
        "Brine shrimp are very tasty to baby guppies.",
        "Plus, the shrimp are full of nutrients that will help the fish grow and develop a nice coloring.",
        "Offer brine shrimp at 1-2 feeding a days.",
        "Brine shrimp are available at local pet stores or online.",
        "Offer freshly hatched daphnia, as another supplement option.",
        "Daphnia are a type of aquatic crustacean.",
        "Like brine shrimp, they’re very tasty to baby guppies and contain lots of nutrients.",
        "Offer the daphnia as a supplement at 1-2 feedings a day.",
        "You can buy daphnia at your local pet store or online.",
        "Monitoring Their Health Remove fry that show signs of deformity and illness.",
        "Baby guppies are especially vulnerable to illnesses caused by bacteria or aggression from other fish.",
        "Don’t leave sick fish in your tank, as others may become ill, as well.",
        "You can either attempt to nurse the sick fry in a separate tank or dispose of them, as they're unlikely to thrive.",
        "If you notice the following symptoms, remove the affected fry from the tank:\nBent or warped spine\nSores\nTail rot\nFin rot Avoid medicating your tank, as you risk harming the fry.",
        "You can find medications to help treat common illnesses in guppies.",
        "However, these medications aren’t appropriate for fry, unless you are very knowledgeable about dosing fish.",
        "It’s better to remove ill fish from the tank rather than risking the health of the other fish.",
        "You can try to treat the sick fish in a separate tank.",
        "However, they’re unlikely to thrive if they’ve become ill at such a vulnerable stage.",
        "Place your baby guppies into your regular aquarium at 6-8 weeks old.",
        "Most baby guppies will be too big to eat at this point.",
        "Make sure they’re bigger than the mouth of your adult fish before you put them in the aquarium.",
        "Otherwise, the bigger fish may still eat them.",
        "Your fish will continue to grow until they reach 6 months old, which is considered adulthood.",
        "You may notice some growth after your fish is an adult, but it will be minimal.",
        "Separate males and females if you don't want more babies.",
        "Female guppies usually start to reproduce at 2 to 3 months of age.",
        "Additionally, they can store sperm for up to 3 months.",
        "If you don't want more babies, you'll need to separate your male and female fry once they reach about 6 to 8 weeks old.",
        "You'll be able to determine the sex of your baby guppies when they're about 1 month old.",
        "Male guppies will have a long, rod-like fin on their underbelly, which is called a gonopodium.",
        "Females will have a dark spot called a gravid spot on their underbelly."
    ]
}