{
    "title": "How to Remove Honda CR V Radiators",
    "url": "https://www.wikihow.com/Remove-Honda-CR-V-Radiators",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars",
        "Car Makes",
        "Honda Vehicles"
    ],
    "steps": [
        {
            "headline": "Ensure your Honda CR-V's ignition is in “Off” or “lock” mode.",
            "description": "Then, reattach the negative cable of the battery. This is a very important step to begin with."
        },
        {
            "headline": "Remove the plug on the lower side of the radiator pan.",
            "description": "Drain the liquid and collect it in a reseal-able container."
        },
        {
            "headline": "Remove the top and bottom radiator hoses as the next step.",
            "description": "(Have a look at the hoses once for any wear-and-tear, and replace them if you must.)"
        },
        {
            "headline": "Detach the fan motor and remove the top radiator brackets.",
            "description": "Now carefully pull the radiator up and out, ensuring it doesn't scratch your CR-V's paint"
        },
        {
            "headline": "Remove the fan covering and other parts attached to the radiator.",
            "description": "Connect them to the new radiator."
        },
        {
            "headline": "Make sure the new radiator is seated securely on the pads.",
            "description": "Rejoin the negative cable of the battery."
        },
        {
            "headline": "Pour in a mix of engine coolant and distilled water (in equal proportion) inside the new radiator.",
            "description": ""
        },
        {
            "headline": "Take the radiator cap off.",
            "description": "Switch on the engine for a few minutes, to remove any air out of the system. Switch off the engine and fill the radiator to the brim with the coolant mixture."
        }
    ],
    "tyn": [
        "Reseal-able container",
        "Replacement radiator hoses, if needed",
        "Replacement radiator",
        "Engine coolant",
        "Water"
    ],
    "text": " Ensure your Honda CR-V's ignition is in “Off” or “lock” mode. Then, reattach the negative cable of the battery. This is a very important step to begin with. Remove the plug on the lower side of the radiator pan. Drain the liquid and collect it in a reseal-able container. Remove the top and bottom radiator hoses as the next step. (Have a look at the hoses once for any wear-and-tear, and replace them if you must.) Detach the fan motor and remove the top radiator brackets. Now carefully pull the radiator up and out, ensuring it doesn't scratch your CR-V's paint Remove the fan covering and other parts attached to the radiator. Connect them to the new radiator. Make sure the new radiator is seated securely on the pads. Rejoin the negative cable of the battery. Pour in a mix of engine coolant and distilled water (in equal proportion) inside the new radiator.  Take the radiator cap off. Switch on the engine for a few minutes, to remove any air out of the system. Switch off the engine and fill the radiator to the brim with the coolant mixture.",
    "sentences": [
        " Ensure your Honda CR-V's ignition is in “Off” or “lock” mode.",
        "Then, reattach the negative cable of the battery.",
        "This is a very important step to begin with.",
        "Remove the plug on the lower side of the radiator pan.",
        "Drain the liquid and collect it in a reseal-able container.",
        "Remove the top and bottom radiator hoses as the next step.",
        "(Have a look at the hoses once for any wear-and-tear, and replace them if you must.)",
        "Detach the fan motor and remove the top radiator brackets.",
        "Now carefully pull the radiator up and out, ensuring it doesn't scratch your CR-V's paint Remove the fan covering and other parts attached to the radiator.",
        "Connect them to the new radiator.",
        "Make sure the new radiator is seated securely on the pads.",
        "Rejoin the negative cable of the battery.",
        "Pour in a mix of engine coolant and distilled water (in equal proportion) inside the new radiator.",
        "Take the radiator cap off.",
        "Switch on the engine for a few minutes, to remove any air out of the system.",
        "Switch off the engine and fill the radiator to the brim with the coolant mixture."
    ]
}