{
    "title": "How to Clean a Horse",
    "url": "https://www.wikihow.com/Clean-a-Horse",
    "category_hierarchy": [
        "Pets and Animals",
        "Horses",
        "Horse Grooming"
    ],
    "methods": [
        {
            "name": "Brushing out Dirt and Grime",
            "steps": [
                {
                    "headline": "Secure your horse and set up your supplies.",
                    "description": "Before you start to clean your horse, you need to make sure that your horse won’t run away by tying it to a stable fence or post. If possible, groom your horse in a wash rack with crossties. Get your curry comb, stiff-bristled brush, mane and tail comb, and a finishing brush. Set them aside where your horse can’t knock them over. A rubber curry comb is preferable because it will make it easier to navigate the contours of your horse’s body. A plastic mane and tail comb is better than a metal one because it’s less likely to rip out knotted strands of hair. A finishing brush with a curved handle will make it easier to brush your horse’s body."
                },
                {
                    "headline": "Use your curry comb to begin brushing the horse’s neck.",
                    "description": "A rubber curry comb will loosen dirt from the deeper layers of your horse’s hair. Run the flat side of the curry comb through 4 fingers on your dominant hand and put your thumb on the side to keep it even. Use soft, circular motions and cover each section of the horse’s hair at least twice. Your horse will appreciate it you spend more time grooming its withers and hindquarters since these are areas horses naturally groom on each other.Tip: Most horses enjoy a good brushing, but they may be nervous at first. Petting your horse while you start is a good way to calm your horse down during the beginning stages of the brushing."
                },
                {
                    "headline": "Work your way back towards the horse’s tail with the curry comb.",
                    "description": "Continue using soft, medium-sized circular motions as you move your way back along the side of the horse. Make sure that you get the top of the horse’s back and the bottom side of the horse’s belly. Once you get to the tail section, carefully and slowly brush the area around the tail and hindquarters. Don’t stand directly behind the horse while you’re cleaning it. It may reflexively kick back if you hit a sensitive part of its body. Repeat this process on the opposite side of the horse."
                },
                {
                    "headline": "Switch to a stiff-bristled brush to flick dirt away.",
                    "description": "The curry comb loosens dirt and dust from deeper layers of hair, but won’t necessarily remove it from the horse. Switch to a stiff-bristled brush to remove it from the horse’s body. Hold the flat portion or handle of the stiff-bristled brush firmly and use short, flicking motions to knock the dirt and dust out of the horse’s hair. Start from the neck and work your way towards the horse’s tail. The stiff-bristled brush will send lots of dirt, dust, pebbles, and dead hair flying all over the place. Keep your mouth closed and brush away from your eyes while you’re doing this. Repeat this process on the opposite side of the horse."
                },
                {
                    "headline": "Use a finishing brush to remove any remaining dirt or grime.",
                    "description": "The finishing brush will remove hard-to-see sections of dust and grime. Start with the horse’s neck and run the brush directly along a single horizontal section of the horse until you reach the tail. Hold the brush with the soft bristles at a 45-degree angle behind you as you move the brush. Repeat this process for each section of your horse’s body until you’ve covered every portion of your horse. The finishing brush will remove any unwanted clumps of hair or dirt that have been knocked up to the outer layers of hair. Repeat this process on the other side of the horse."
                },
                {
                    "headline": "Brush your horse’s face if it’s dirty.",
                    "description": "The hard-bristle brush and curry comb will be too rough on your horse’s face. Instead, use the finishing brush or a soft-bristle brush to carefully and slowly brush your horses face, taking special care to avoid the nostrils, ears, eyes, and mouth. Brush in small, circular and flicking motions. Approach the horse's face slowly so as not to scare it and work from the bottom to the top of their face. Most horses don’t need a lot of brushing on the face, so be gentle and don’t overdo it."
                }
            ]
        },
        {
            "name": "Bathing a Dirty Horse",
            "steps": [
                {
                    "headline": "Make sure that your horse really needs a bath and get your supplies.",
                    "description": "Horses don’t need to be bathed often, and you should only bathe your horse if it’s excessively dirty. Bathing removes the natural oils in the horse’s hair, which can lead to chafing and discomfort. If you think a bath is necessary, get a hose or fill a bucket with warm water. You’ll also need a large sponge, a soft sponge, dry cloths, and a horse shampoo and conditioner.Tip: Never wash your horse with water if it’s cold out. Use a dry shampoo instead so that you don’t endanger your horse’s immune system. If possible, wash your horse in the summer when they’re likely to appreciate some temperate water. Certain breeds of horse, like Arabian horses, tend to hate baths and will act out when they get wet."
                },
                {
                    "headline": "Use a hose or buckets to cover your horse’s body in warm water.",
                    "description": "If you’re using a hose, turn on the water and wait for it to get warm. If you’re using a bucket, fill it with warm water. Starting with the feet and working your way up to the middle of the horse’s abdomen, spray or pour water over your horse’s body. After it’s comfortable, move on to the front and back of your horse and cover it until it’s completely wet. Move the hose further up your horse’s neck once they get used to the water. Avoid getting water directly on the horse’s eyes. Use the sponge to cover your horse’s body in water if you’re using a bucket."
                },
                {
                    "headline": "Lather your horse with a shampooed sponge.",
                    "description": "Use a horse shampoo and warm water to fill a large sponge with shampoo. Rub it across your horse’s body in circular motions, scrubbing any particularly filthy areas with the sponge. Run the sponge softly through the horse’s mane and tail and don’t scrub the hair. Cover both sides of the horse’s body, and make sure that you wash the horse’s belly on each side."
                },
                {
                    "headline": "Rinse your horse in warm water.",
                    "description": "Use clean, warm water to rinse the shampoo out of your horse’s hair. Cover your horse in hose or bucket water 2-3 times until you don’t see any soap suds remaining on the horse’s body. You’re going to condition your horse’s hair momentarily, so don’t worry about getting every single section of your horse totally clean of shampoo."
                },
                {
                    "headline": "Repeat the process with horse conditioner.",
                    "description": "Wring out your sponge multiple times and rinse it to remove the shampoo. Fill it with conditioner and warm water, and scrub your horse the same way you did when you shampooed it. Use firm, circular motions to penetrate each layer of hair. Rinse your horse with warm water again."
                },
                {
                    "headline": "Use a soft sponge with no shampoo to wash a horse’s face.",
                    "description": "Fill a small, soft sponge with warm water and wash your horse’s face by running the sponge along the contours of the horse’s face. Don’t get any water on or directly around the horse’s eyes. Pat sensitive sections of the horse’s face with the sponge instead of moving it around. Take care to only wash the back of the horse’s ears with light pats. A horse’s face is sensitive, but luckily doesn’t require much cleaning. The horse’s face is the least likely to get excessively dirty and require heavy scrubbing."
                },
                {
                    "headline": "Dry your horse with clean, large towels and a sweat scraper.",
                    "description": "Use a curved sweat scraper to remove excess water from your horse's fur. Then, use a large set of dry, clean towels to finish drying your horse. Lay each towel on top of a section of your horse and use both hands to rub your horse in circular motions. Continue drying your horse until the hair is no longer damp. Use a soft towel to pat your horse’s face dry. Let your horse sniff a dry towel before you put it on its body to make it comfortable with what you’re doing. Brush your horse afterward by combing it with a soft bristle brush."
                }
            ]
        },
        {
            "name": "Cleaning Specific Areas",
            "steps": [
                {
                    "headline": "Inspect teeth once or twice a year and have a horse dentist clean yearly.",
                    "description": "You don’t need to brush your horse’s teeth—they continue growing over the course of a horse’s life and have a layer of enamel that absorbs bacteria and becomes discolored naturally. Inspect your horse’s teeth by gently holding your horse’s mouth open and look for large chips or cracks in the teeth. Call a vet or horse dentist as necessary, and hire an equine dentist to clean your horse’s teeth on a yearly basis. Smell your horse’s breath when you inspect their teeth. If the smell is rancid, it may be a sign that your horse has an infection in their mouth. Ask your vet to check your horse's teeth if it is losing weight, having trouble eating, or dropping feed. Don’t stick your fingers in a horse’s mouth."
                },
                {
                    "headline": "Rinse a female horse’s groin sparingly.",
                    "description": "If a mare’s udder develops a buildup of grime (called smegma), you may need to clean it periodically. If you have to clean a horse’s underside, wear rubber gloves and use a soft cloth to carefully wash the udder with warm water.Warning: Despite popular thinking, it’s actually not good to clean a male horse’s penis regularly. Sheath has been championed as a necessary part of horse hygiene for a long time, but it’s actually quite bad for the horse. Try to do this without standing directly behind the horse. The horse is likely to have a strong reaction to someone touching their udder, and you don’t want to get kicked. Only clean a female horse’s udder if it’s absolutely necessary. Some unpleasant-looking buildup is actually good for the horse, and protects sensitive sections of skin."
                },
                {
                    "headline": "Remove dirt from a horse’s hooves by picking them.",
                    "description": "Horse hooves can get caked in dirt, grime, and all kinds of unpleasant stuff floating around on a stable floor. To clean hooves, be patient with your horse and calm them down with heavy petting and treats before raising a hoof off of the floor. Hold a hook pick firmly in your hand use the tip of the hook to dig into layers of dirt. Use the round edge to scrape away any tough layers. Rinse your horse’s hooves in warm water afterwards. Always check your horse’s hooves before riding it. If they’re damaged or dirty, you could cause your horse pain while it trots."
                },
                {
                    "headline": "Use dry shampoo to keep your horse’s hair clean in cold weather.",
                    "description": "Dry shampoo is the perfect tool for keeping your horse’s hair clean and healthy without getting it wet. Dry horse shampoos come in spray bottles. To use the dry shampoo, spray a light layer of dry shampoo over the area of your horse that you wish to clean. Then, rub the shampoo in with a dry, clean towel and leave it. Check the directions for your specific brand of dry shampoo by reading the bottle. Some dry shampoos require you to leave them in overnight or to brush your horse after using it."
                },
                {
                    "headline": "Remove stains by sponge-bathing selected areas with white vinegar.",
                    "description": "To remove stains in your horse’s hair, fill a bucket with white vinegar. Soak a small, soft sponge in the vinegar and wring excess liquid out. Blot the stained area with your sponge and leave it for 2-3 days. Then, bathe your horse with warm water as you normally would to permanently remove the stain and wash out the vinegar. You can use a mix of 1 part vinegar and 1 part olive oil to promote hair growth if your horse is shedding too much. Vinegar also keeps flies away from your horse."
                }
            ]
        }
    ],
    "tyn": [
        "Brushing out Dirt and Grime",
        "Curry comb",
        "Stiff-bristled brush",
        "Plastic mane and tail comb",
        "Finishing brush",
        "Bathing a Dirty Horse",
        "Horse shampoo",
        "Horse conditioner",
        "Large sponge",
        "Soft sponge",
        "Dry towels",
        "Sweat scraper",
        "Cleaning Specific Areas",
        "Soft cloth",
        "Warm water",
        "Hoof pick",
        "Dry shampoo",
        "Vinegar",
        "Olive oil (optional)"
    ],
    "text": " Brushing out Dirt and Grime Secure your horse and set up your supplies. Before you start to clean your horse, you need to make sure that your horse won’t run away by tying it to a stable fence or post. If possible, groom your horse in a wash rack with crossties. Get your curry comb, stiff-bristled brush, mane and tail comb, and a finishing brush. Set them aside where your horse can’t knock them over. A rubber curry comb is preferable because it will make it easier to navigate the contours of your horse’s body. A plastic mane and tail comb is better than a metal one because it’s less likely to rip out knotted strands of hair. A finishing brush with a curved handle will make it easier to brush your horse’s body. Use your curry comb to begin brushing the horse’s neck. A rubber curry comb will loosen dirt from the deeper layers of your horse’s hair. Run the flat side of the curry comb through 4 fingers on your dominant hand and put your thumb on the side to keep it even. Use soft, circular motions and cover each section of the horse’s hair at least twice. Your horse will appreciate it you spend more time grooming its withers and hindquarters since these are areas horses naturally groom on each other.Tip: Most horses enjoy a good brushing, but they may be nervous at first. Petting your horse while you start is a good way to calm your horse down during the beginning stages of the brushing. Work your way back towards the horse’s tail with the curry comb. Continue using soft, medium-sized circular motions as you move your way back along the side of the horse. Make sure that you get the top of the horse’s back and the bottom side of the horse’s belly. Once you get to the tail section, carefully and slowly brush the area around the tail and hindquarters. Don’t stand directly behind the horse while you’re cleaning it. It may reflexively kick back if you hit a sensitive part of its body. Repeat this process on the opposite side of the horse. Switch to a stiff-bristled brush to flick dirt away. The curry comb loosens dirt and dust from deeper layers of hair, but won’t necessarily remove it from the horse. Switch to a stiff-bristled brush to remove it from the horse’s body. Hold the flat portion or handle of the stiff-bristled brush firmly and use short, flicking motions to knock the dirt and dust out of the horse’s hair. Start from the neck and work your way towards the horse’s tail. The stiff-bristled brush will send lots of dirt, dust, pebbles, and dead hair flying all over the place. Keep your mouth closed and brush away from your eyes while you’re doing this. Repeat this process on the opposite side of the horse. Use a finishing brush to remove any remaining dirt or grime. The finishing brush will remove hard-to-see sections of dust and grime. Start with the horse’s neck and run the brush directly along a single horizontal section of the horse until you reach the tail. Hold the brush with the soft bristles at a 45-degree angle behind you as you move the brush. Repeat this process for each section of your horse’s body until you’ve covered every portion of your horse. The finishing brush will remove any unwanted clumps of hair or dirt that have been knocked up to the outer layers of hair. Repeat this process on the other side of the horse. Brush your horse’s face if it’s dirty. The hard-bristle brush and curry comb will be too rough on your horse’s face. Instead, use the finishing brush or a soft-bristle brush to carefully and slowly brush your horses face, taking special care to avoid the nostrils, ears, eyes, and mouth. Brush in small, circular and flicking motions. Approach the horse's face slowly so as not to scare it and work from the bottom to the top of their face. Most horses don’t need a lot of brushing on the face, so be gentle and don’t overdo it. Bathing a Dirty Horse Make sure that your horse really needs a bath and get your supplies. Horses don’t need to be bathed often, and you should only bathe your horse if it’s excessively dirty. Bathing removes the natural oils in the horse’s hair, which can lead to chafing and discomfort. If you think a bath is necessary, get a hose or fill a bucket with warm water. You’ll also need a large sponge, a soft sponge, dry cloths, and a horse shampoo and conditioner.Tip: Never wash your horse with water if it’s cold out. Use a dry shampoo instead so that you don’t endanger your horse’s immune system. If possible, wash your horse in the summer when they’re likely to appreciate some temperate water. Certain breeds of horse, like Arabian horses, tend to hate baths and will act out when they get wet. Use a hose or buckets to cover your horse’s body in warm water. If you’re using a hose, turn on the water and wait for it to get warm. If you’re using a bucket, fill it with warm water. Starting with the feet and working your way up to the middle of the horse’s abdomen, spray or pour water over your horse’s body. After it’s comfortable, move on to the front and back of your horse and cover it until it’s completely wet. Move the hose further up your horse’s neck once they get used to the water. Avoid getting water directly on the horse’s eyes. Use the sponge to cover your horse’s body in water if you’re using a bucket. Lather your horse with a shampooed sponge. Use a horse shampoo and warm water to fill a large sponge with shampoo. Rub it across your horse’s body in circular motions, scrubbing any particularly filthy areas with the sponge. Run the sponge softly through the horse’s mane and tail and don’t scrub the hair. Cover both sides of the horse’s body, and make sure that you wash the horse’s belly on each side. Rinse your horse in warm water. Use clean, warm water to rinse the shampoo out of your horse’s hair. Cover your horse in hose or bucket water 2-3 times until you don’t see any soap suds remaining on the horse’s body. You’re going to condition your horse’s hair momentarily, so don’t worry about getting every single section of your horse totally clean of shampoo. Repeat the process with horse conditioner. Wring out your sponge multiple times and rinse it to remove the shampoo. Fill it with conditioner and warm water, and scrub your horse the same way you did when you shampooed it. Use firm, circular motions to penetrate each layer of hair. Rinse your horse with warm water again. Use a soft sponge with no shampoo to wash a horse’s face. Fill a small, soft sponge with warm water and wash your horse’s face by running the sponge along the contours of the horse’s face. Don’t get any water on or directly around the horse’s eyes. Pat sensitive sections of the horse’s face with the sponge instead of moving it around. Take care to only wash the back of the horse’s ears with light pats. A horse’s face is sensitive, but luckily doesn’t require much cleaning. The horse’s face is the least likely to get excessively dirty and require heavy scrubbing. Dry your horse with clean, large towels and a sweat scraper. Use a curved sweat scraper to remove excess water from your horse's fur. Then, use a large set of dry, clean towels to finish drying your horse. Lay each towel on top of a section of your horse and use both hands to rub your horse in circular motions. Continue drying your horse until the hair is no longer damp. Use a soft towel to pat your horse’s face dry. Let your horse sniff a dry towel before you put it on its body to make it comfortable with what you’re doing. Brush your horse afterward by combing it with a soft bristle brush. Cleaning Specific Areas Inspect teeth once or twice a year and have a horse dentist clean yearly. You don’t need to brush your horse’s teeth—they continue growing over the course of a horse’s life and have a layer of enamel that absorbs bacteria and becomes discolored naturally. Inspect your horse’s teeth by gently holding your horse’s mouth open and look for large chips or cracks in the teeth. Call a vet or horse dentist as necessary, and hire an equine dentist to clean your horse’s teeth on a yearly basis. Smell your horse’s breath when you inspect their teeth. If the smell is rancid, it may be a sign that your horse has an infection in their mouth. Ask your vet to check your horse's teeth if it is losing weight, having trouble eating, or dropping feed. Don’t stick your fingers in a horse’s mouth. Rinse a female horse’s groin sparingly. If a mare’s udder develops a buildup of grime (called smegma), you may need to clean it periodically. If you have to clean a horse’s underside, wear rubber gloves and use a soft cloth to carefully wash the udder with warm water.Warning: Despite popular thinking, it’s actually not good to clean a male horse’s penis regularly. Sheath has been championed as a necessary part of horse hygiene for a long time, but it’s actually quite bad for the horse. Try to do this without standing directly behind the horse. The horse is likely to have a strong reaction to someone touching their udder, and you don’t want to get kicked. Only clean a female horse’s udder if it’s absolutely necessary. Some unpleasant-looking buildup is actually good for the horse, and protects sensitive sections of skin. Remove dirt from a horse’s hooves by picking them. Horse hooves can get caked in dirt, grime, and all kinds of unpleasant stuff floating around on a stable floor. To clean hooves, be patient with your horse and calm them down with heavy petting and treats before raising a hoof off of the floor. Hold a hook pick firmly in your hand use the tip of the hook to dig into layers of dirt. Use the round edge to scrape away any tough layers. Rinse your horse’s hooves in warm water afterwards. Always check your horse’s hooves before riding it. If they’re damaged or dirty, you could cause your horse pain while it trots. Use dry shampoo to keep your horse’s hair clean in cold weather. Dry shampoo is the perfect tool for keeping your horse’s hair clean and healthy without getting it wet. Dry horse shampoos come in spray bottles. To use the dry shampoo, spray a light layer of dry shampoo over the area of your horse that you wish to clean. Then, rub the shampoo in with a dry, clean towel and leave it. Check the directions for your specific brand of dry shampoo by reading the bottle. Some dry shampoos require you to leave them in overnight or to brush your horse after using it. Remove stains by sponge-bathing selected areas with white vinegar. To remove stains in your horse’s hair, fill a bucket with white vinegar. Soak a small, soft sponge in the vinegar and wring excess liquid out. Blot the stained area with your sponge and leave it for 2-3 days. Then, bathe your horse with warm water as you normally would to permanently remove the stain and wash out the vinegar. You can use a mix of 1 part vinegar and 1 part olive oil to promote hair growth if your horse is shedding too much. Vinegar also keeps flies away from your horse.",
    "sentences": [
        " Brushing out Dirt and Grime Secure your horse and set up your supplies.",
        "Before you start to clean your horse, you need to make sure that your horse won’t run away by tying it to a stable fence or post.",
        "If possible, groom your horse in a wash rack with crossties.",
        "Get your curry comb, stiff-bristled brush, mane and tail comb, and a finishing brush.",
        "Set them aside where your horse can’t knock them over.",
        "A rubber curry comb is preferable because it will make it easier to navigate the contours of your horse’s body.",
        "A plastic mane and tail comb is better than a metal one because it’s less likely to rip out knotted strands of hair.",
        "A finishing brush with a curved handle will make it easier to brush your horse’s body.",
        "Use your curry comb to begin brushing the horse’s neck.",
        "A rubber curry comb will loosen dirt from the deeper layers of your horse’s hair.",
        "Run the flat side of the curry comb through 4 fingers on your dominant hand and put your thumb on the side to keep it even.",
        "Use soft, circular motions and cover each section of the horse’s hair at least twice.",
        "Your horse will appreciate it you spend more time grooming its withers and hindquarters since these are areas horses naturally groom on each other.Tip: Most horses enjoy a good brushing, but they may be nervous at first.",
        "Petting your horse while you start is a good way to calm your horse down during the beginning stages of the brushing.",
        "Work your way back towards the horse’s tail with the curry comb.",
        "Continue using soft, medium-sized circular motions as you move your way back along the side of the horse.",
        "Make sure that you get the top of the horse’s back and the bottom side of the horse’s belly.",
        "Once you get to the tail section, carefully and slowly brush the area around the tail and hindquarters.",
        "Don’t stand directly behind the horse while you’re cleaning it.",
        "It may reflexively kick back if you hit a sensitive part of its body.",
        "Repeat this process on the opposite side of the horse.",
        "Switch to a stiff-bristled brush to flick dirt away.",
        "The curry comb loosens dirt and dust from deeper layers of hair, but won’t necessarily remove it from the horse.",
        "Switch to a stiff-bristled brush to remove it from the horse’s body.",
        "Hold the flat portion or handle of the stiff-bristled brush firmly and use short, flicking motions to knock the dirt and dust out of the horse’s hair.",
        "Start from the neck and work your way towards the horse’s tail.",
        "The stiff-bristled brush will send lots of dirt, dust, pebbles, and dead hair flying all over the place.",
        "Keep your mouth closed and brush away from your eyes while you’re doing this.",
        "Repeat this process on the opposite side of the horse.",
        "Use a finishing brush to remove any remaining dirt or grime.",
        "The finishing brush will remove hard-to-see sections of dust and grime.",
        "Start with the horse’s neck and run the brush directly along a single horizontal section of the horse until you reach the tail.",
        "Hold the brush with the soft bristles at a 45-degree angle behind you as you move the brush.",
        "Repeat this process for each section of your horse’s body until you’ve covered every portion of your horse.",
        "The finishing brush will remove any unwanted clumps of hair or dirt that have been knocked up to the outer layers of hair.",
        "Repeat this process on the other side of the horse.",
        "Brush your horse’s face if it’s dirty.",
        "The hard-bristle brush and curry comb will be too rough on your horse’s face.",
        "Instead, use the finishing brush or a soft-bristle brush to carefully and slowly brush your horses face, taking special care to avoid the nostrils, ears, eyes, and mouth.",
        "Brush in small, circular and flicking motions.",
        "Approach the horse's face slowly so as not to scare it and work from the bottom to the top of their face.",
        "Most horses don’t need a lot of brushing on the face, so be gentle and don’t overdo it.",
        "Bathing a Dirty Horse Make sure that your horse really needs a bath and get your supplies.",
        "Horses don’t need to be bathed often, and you should only bathe your horse if it’s excessively dirty.",
        "Bathing removes the natural oils in the horse’s hair, which can lead to chafing and discomfort.",
        "If you think a bath is necessary, get a hose or fill a bucket with warm water.",
        "You’ll also need a large sponge, a soft sponge, dry cloths, and a horse shampoo and conditioner.Tip: Never wash your horse with water if it’s cold out.",
        "Use a dry shampoo instead so that you don’t endanger your horse’s immune system.",
        "If possible, wash your horse in the summer when they’re likely to appreciate some temperate water.",
        "Certain breeds of horse, like Arabian horses, tend to hate baths and will act out when they get wet.",
        "Use a hose or buckets to cover your horse’s body in warm water.",
        "If you’re using a hose, turn on the water and wait for it to get warm.",
        "If you’re using a bucket, fill it with warm water.",
        "Starting with the feet and working your way up to the middle of the horse’s abdomen, spray or pour water over your horse’s body.",
        "After it’s comfortable, move on to the front and back of your horse and cover it until it’s completely wet.",
        "Move the hose further up your horse’s neck once they get used to the water.",
        "Avoid getting water directly on the horse’s eyes.",
        "Use the sponge to cover your horse’s body in water if you’re using a bucket.",
        "Lather your horse with a shampooed sponge.",
        "Use a horse shampoo and warm water to fill a large sponge with shampoo.",
        "Rub it across your horse’s body in circular motions, scrubbing any particularly filthy areas with the sponge.",
        "Run the sponge softly through the horse’s mane and tail and don’t scrub the hair.",
        "Cover both sides of the horse’s body, and make sure that you wash the horse’s belly on each side.",
        "Rinse your horse in warm water.",
        "Use clean, warm water to rinse the shampoo out of your horse’s hair.",
        "Cover your horse in hose or bucket water 2-3 times until you don’t see any soap suds remaining on the horse’s body.",
        "You’re going to condition your horse’s hair momentarily, so don’t worry about getting every single section of your horse totally clean of shampoo.",
        "Repeat the process with horse conditioner.",
        "Wring out your sponge multiple times and rinse it to remove the shampoo.",
        "Fill it with conditioner and warm water, and scrub your horse the same way you did when you shampooed it.",
        "Use firm, circular motions to penetrate each layer of hair.",
        "Rinse your horse with warm water again.",
        "Use a soft sponge with no shampoo to wash a horse’s face.",
        "Fill a small, soft sponge with warm water and wash your horse’s face by running the sponge along the contours of the horse’s face.",
        "Don’t get any water on or directly around the horse’s eyes.",
        "Pat sensitive sections of the horse’s face with the sponge instead of moving it around.",
        "Take care to only wash the back of the horse’s ears with light pats.",
        "A horse’s face is sensitive, but luckily doesn’t require much cleaning.",
        "The horse’s face is the least likely to get excessively dirty and require heavy scrubbing.",
        "Dry your horse with clean, large towels and a sweat scraper.",
        "Use a curved sweat scraper to remove excess water from your horse's fur.",
        "Then, use a large set of dry, clean towels to finish drying your horse.",
        "Lay each towel on top of a section of your horse and use both hands to rub your horse in circular motions.",
        "Continue drying your horse until the hair is no longer damp.",
        "Use a soft towel to pat your horse’s face dry.",
        "Let your horse sniff a dry towel before you put it on its body to make it comfortable with what you’re doing.",
        "Brush your horse afterward by combing it with a soft bristle brush.",
        "Cleaning Specific Areas Inspect teeth once or twice a year and have a horse dentist clean yearly.",
        "You don’t need to brush your horse’s teeth—they continue growing over the course of a horse’s life and have a layer of enamel that absorbs bacteria and becomes discolored naturally.",
        "Inspect your horse’s teeth by gently holding your horse’s mouth open and look for large chips or cracks in the teeth.",
        "Call a vet or horse dentist as necessary, and hire an equine dentist to clean your horse’s teeth on a yearly basis.",
        "Smell your horse’s breath when you inspect their teeth.",
        "If the smell is rancid, it may be a sign that your horse has an infection in their mouth.",
        "Ask your vet to check your horse's teeth if it is losing weight, having trouble eating, or dropping feed.",
        "Don’t stick your fingers in a horse’s mouth.",
        "Rinse a female horse’s groin sparingly.",
        "If a mare’s udder develops a buildup of grime (called smegma), you may need to clean it periodically.",
        "If you have to clean a horse’s underside, wear rubber gloves and use a soft cloth to carefully wash the udder with warm water.Warning: Despite popular thinking, it’s actually not good to clean a male horse’s penis regularly.",
        "Sheath has been championed as a necessary part of horse hygiene for a long time, but it’s actually quite bad for the horse.",
        "Try to do this without standing directly behind the horse.",
        "The horse is likely to have a strong reaction to someone touching their udder, and you don’t want to get kicked.",
        "Only clean a female horse’s udder if it’s absolutely necessary.",
        "Some unpleasant-looking buildup is actually good for the horse, and protects sensitive sections of skin.",
        "Remove dirt from a horse’s hooves by picking them.",
        "Horse hooves can get caked in dirt, grime, and all kinds of unpleasant stuff floating around on a stable floor.",
        "To clean hooves, be patient with your horse and calm them down with heavy petting and treats before raising a hoof off of the floor.",
        "Hold a hook pick firmly in your hand use the tip of the hook to dig into layers of dirt.",
        "Use the round edge to scrape away any tough layers.",
        "Rinse your horse’s hooves in warm water afterwards.",
        "Always check your horse’s hooves before riding it.",
        "If they’re damaged or dirty, you could cause your horse pain while it trots.",
        "Use dry shampoo to keep your horse’s hair clean in cold weather.",
        "Dry shampoo is the perfect tool for keeping your horse’s hair clean and healthy without getting it wet.",
        "Dry horse shampoos come in spray bottles.",
        "To use the dry shampoo, spray a light layer of dry shampoo over the area of your horse that you wish to clean.",
        "Then, rub the shampoo in with a dry, clean towel and leave it.",
        "Check the directions for your specific brand of dry shampoo by reading the bottle.",
        "Some dry shampoos require you to leave them in overnight or to brush your horse after using it.",
        "Remove stains by sponge-bathing selected areas with white vinegar.",
        "To remove stains in your horse’s hair, fill a bucket with white vinegar.",
        "Soak a small, soft sponge in the vinegar and wring excess liquid out.",
        "Blot the stained area with your sponge and leave it for 2-3 days.",
        "Then, bathe your horse with warm water as you normally would to permanently remove the stain and wash out the vinegar.",
        "You can use a mix of 1 part vinegar and 1 part olive oil to promote hair growth if your horse is shedding too much.",
        "Vinegar also keeps flies away from your horse."
    ]
}