{
    "title": "How to Use Sea Salt Spray",
    "url": "https://www.wikihow.com/Use-Sea-Salt-Spray",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics"
    ],
    "methods": [
        {
            "name": "Creating Beach-Like Waves and Volume",
            "steps": [
                {
                    "headline": "Comb through damp hair.",
                    "description": "Make your hair damp by wetting it, then brush out any knots and tangles using a wide-toothed comb. If you just washed your hair, dry it with a towel so that it is evenly damp from roots to ends. It should “not” be soaking wet. If you wash your hair, use a moisturizing shampoo or follow your usual shampoo with a conditioner. Normal shampoo and clarifying shampoo strip the oil from your hair, which will make it harder to achieve the sort of texture this look calls for."
                },
                {
                    "headline": "Spritz about 6-8 pumps of sea salt spray all over your hair.",
                    "description": "Shake the bottle of sea salt spray, then apply the product to your hair, working from midpoint down to the ends. For this style, it's best to avoid using sea salt spray on the roots of your hair. The product can add too much texture to the roots and may weigh your hair down, especially if you have naturally fine hair."
                },
                {
                    "headline": "Use the palm of your hand to scrunch your hair.",
                    "description": "Working in sections, lightly scrunch the product into your hair from the bottom up. To scrunch your hair, place the palm of your hand beneath the ends and gradually push up, forcing more of your hair into your hand. The strands of hair should naturally gather and lock together, creating texture."
                },
                {
                    "headline": "Add volume and definition to the top of the hair by twisting it.",
                    "description": "To twist your hair, grab a small section with your index and middle finger. Gently twist it back away you’re your face. As it spirals, the strands of hair should grab one another and create texture."
                },
                {
                    "headline": "Dry your hair with a hair dryer.",
                    "description": "Once you’re finished scrunching and twisting, grab a hair dryer and set it to low or medium heat. Cup a fist full of hair in your hands and blast it with the heat from the blow dryer. Continue until all of your hair is dry. This technique will add textured beach waves to your hair without flattening it out. Don’t use hot air or rub your hair dry with a towel, though, since either option will create frizz."
                }
            ]
        },
        {
            "name": "Adding Texture and Volume to Straight, Flat Hair",
            "steps": [
                {
                    "headline": "Make sure your hair is dry.",
                    "description": "If your hair is flat and you’re trying to give it some volume and texture, don’t wash it prior to using the sea salt spray. Water will weigh your hair down and shampoo will strip the hair of essential oils, ultimately minimizing the effects of the spray. This technique is best on hair that hasn't been washed in 24 to 48 hours. If you must wash your hair, make sure to towel dry before styling. Your hair can be damp, but not soaked."
                },
                {
                    "headline": "Comb through your hair to separate the follicles and remove any tangles.",
                    "description": "Before applying the sea salt spray, use a wide tooth comb to get out any knots or tangles. Combing your hair will also separate the hair follicles and help your hair to fall naturally. This allows the sea salt to enter the hair more easily."
                },
                {
                    "headline": "Shake the sea salt spray.",
                    "description": "It is important to make sure the product is mixed well. Sea salt is made up of minerals and salt from the ocean that need to be mixed together in order to function properly. So whatever brand of sea salt you use, shake it well for a few seconds before you start spraying."
                },
                {
                    "headline": "Spray each section of your hair.",
                    "description": "When you spray, focus on the roots of the hair, mostly at the crown, and the mid shaft. Avoid spraying ends, as they are usually more porous and damaged. Work your way around your hair, grabbing a fist full, and apply 2-3 sprays per section. Spraying the roots will help with volume. If you have fine hair, only use a small amount of sea salt spray. Some sea salt brands can be heavy, so only apply about 1-2 sprays per section."
                },
                {
                    "headline": "Use a diffuser to dry the hair and add volume.",
                    "description": "A diffuser is an attachment that is placed on the ends of a hair dryer. It is used to dry the hair while adding volume. To use, set the hair dryer to low or medium heat. Tilt your head to one side and place the diffuser on your roots. Then, gently massage the diffuser’s prongs on your hair. You only need to use the diffuser on the parts of the hair where you applied the sea salt. Using a hair diffuser will help to activate the sea salt, minimize frizz, and add definition to the hair. To add more volume, massage your fingers into your hair while you diffuse, pushing your hair up."
                }
            ]
        },
        {
            "name": "Styling Short Hair with Sea Salt Spray",
            "steps": [
                {
                    "headline": "Wash your hair and towel dry.",
                    "description": "Sea salt can dry out your hair, so make sure to use moisturizing shampoo and conditioner. When you’re finished washing, use a towel to dry your hair instead of a blow dryer. Your hair should be slightly damp before styling. Never use clarifying shampoo before applying sea salt spray. This type of shampoo strips the hair of volume and bounce, making the spray less effective."
                },
                {
                    "headline": "Spritz your hair with sea salt spray.",
                    "description": "Gently shake the sea salt spray to combine the ingredients. Then, working from the roots to the tip, spray a generous amount of the spray all over your hair. The amount of sea salt you need depends on the length and thickness of your hair. Spray as much as you need to saturate your hair."
                },
                {
                    "headline": "Let it air dry if you have thick hair.",
                    "description": "If you want your hair to appear slightly wavy and completely effortless, let it air dry. This works well on hair that is slightly long (down to the ears) and thick. After spraying with the sea salt, work through your hair with your hands to style it. You can scrunch your hair with your hands to create beach-like waves."
                },
                {
                    "headline": "Use a hair dryer to add volume.",
                    "description": "If you want to add more volume, dry your hair with a hair dryer. To do this, blast the hair with medium or hot heat in the direction that you want your hair to fall. You can dry your hair upward, or make it fall to the side. Make sure to stop blow-drying as soon as your hair is dry so it doesn’t over-dry. When you’re finished, use your hands to style your hair if you want it to lay down flat, or push it up for a loose pompadour style. You do not need to use any dryer attachments for this look."
                }
            ]
        },
        {
            "name": "Giving Texture to Braids and Updos",
            "steps": [
                {
                    "headline": "Wash and dry your hair.",
                    "description": "Wash your hair using a normal shampoo and conditioner, then use a blow dryer on high heat until it is completely dry. Avoid clarifying shampoos since they’ll strip oil and texture out of your hair and counteract the effects of the sea salt spray. You don't need to add other products to your hair, but if you'd like to add an anti-frizz serum, mousse, or other styling agents, do so after washing your hair and before moving onto the next step."
                },
                {
                    "headline": "Coat your hair with sea salt spray.",
                    "description": "Spritz sea salt spray through your hair from root to ends. Apply a generous amount so that your hair is somewhat damp to the touch, but not drenched. Then use a comb to evenly spread the product throughout your hair. Remember to shake the bottle of sea salt spray before applying it. The ingredients need to mix well in order for the style to work."
                },
                {
                    "headline": "Style your hair into an updo of your choice.",
                    "description": "Gather your hair into your favorite updo, such as a French twist or side bun. You can also do a braided updo; depending on your hair length and personal style. Make sure to hold your hair in place with hair ties or bobby pins so it doesn’t fall out. You can use this technique with nearly any updo, but it'll have the most dramatic effect on traditionally sleek styles like French twists and tight chignons."
                },
                {
                    "headline": "Spritz more sea salt on the updo and massage it into your hair.",
                    "description": "After pinning up your hair, apply a final, light spray of sea salt all over your hair to help lock the style in place. If your hairstyle allows, gently massage the sea salt into your hair with your fingers. This will add extra texture to slightly accentuate the style and give it a chic, modern twist. If there are any loose locks hanging down from your updo, you can give them a gentle twist after applying this final spritz to give it more definition and character."
                },
                {
                    "headline": "Let your hair air-dry.",
                    "description": "Using a blow dryer will completely destroy your updo. When you’re finished spraying the sea salt, let your hair dry naturally. Once it finishes, you are ready to show your cute updo to the world! The texture provided by the sea salt spray should help prevent your hair from sliding out of place, which may increase the longevity of your updo."
                }
            ]
        }
    ],
    "tyn": [
        "Adding Texture and Volume to Straight, Flat Hair",
        "Towel (optional)",
        "Wide tooth comb",
        "Sea salt spray",
        "Hair dryer",
        "Diffuser",
        "Creating Beach-Like Waves and Volume",
        "Shampoo",
        "Conditioner",
        "Styling Short Hair with Sea Salt Spray",
        "Towel",
        "Giving Texture to Braids and Updos",
        "Hair ties and bobby pins"
    ],
    "text": " Creating Beach-Like Waves and Volume Comb through damp hair. Make your hair damp by wetting it, then brush out any knots and tangles using a wide-toothed comb. If you just washed your hair, dry it with a towel so that it is evenly damp from roots to ends. It should “not” be soaking wet. If you wash your hair, use a moisturizing shampoo or follow your usual shampoo with a conditioner. Normal shampoo and clarifying shampoo strip the oil from your hair, which will make it harder to achieve the sort of texture this look calls for. Spritz about 6-8 pumps of sea salt spray all over your hair. Shake the bottle of sea salt spray, then apply the product to your hair, working from midpoint down to the ends. For this style, it's best to avoid using sea salt spray on the roots of your hair. The product can add too much texture to the roots and may weigh your hair down, especially if you have naturally fine hair. Use the palm of your hand to scrunch your hair. Working in sections, lightly scrunch the product into your hair from the bottom up. To scrunch your hair, place the palm of your hand beneath the ends and gradually push up, forcing more of your hair into your hand. The strands of hair should naturally gather and lock together, creating texture. Add volume and definition to the top of the hair by twisting it. To twist your hair, grab a small section with your index and middle finger. Gently twist it back away you’re your face. As it spirals, the strands of hair should grab one another and create texture. Dry your hair with a hair dryer. Once you’re finished scrunching and twisting, grab a hair dryer and set it to low or medium heat. Cup a fist full of hair in your hands and blast it with the heat from the blow dryer. Continue until all of your hair is dry. This technique will add textured beach waves to your hair without flattening it out. Don’t use hot air or rub your hair dry with a towel, though, since either option will create frizz. Adding Texture and Volume to Straight, Flat Hair Make sure your hair is dry. If your hair is flat and you’re trying to give it some volume and texture, don’t wash it prior to using the sea salt spray. Water will weigh your hair down and shampoo will strip the hair of essential oils, ultimately minimizing the effects of the spray. This technique is best on hair that hasn't been washed in 24 to 48 hours. If you must wash your hair, make sure to towel dry before styling. Your hair can be damp, but not soaked. Comb through your hair to separate the follicles and remove any tangles. Before applying the sea salt spray, use a wide tooth comb to get out any knots or tangles. Combing your hair will also separate the hair follicles and help your hair to fall naturally. This allows the sea salt to enter the hair more easily. Shake the sea salt spray. It is important to make sure the product is mixed well. Sea salt is made up of minerals and salt from the ocean that need to be mixed together in order to function properly. So whatever brand of sea salt you use, shake it well for a few seconds before you start spraying. Spray each section of your hair. When you spray, focus on the roots of the hair, mostly at the crown, and the mid shaft. Avoid spraying ends, as they are usually more porous and damaged. Work your way around your hair, grabbing a fist full, and apply 2-3 sprays per section. Spraying the roots will help with volume. If you have fine hair, only use a small amount of sea salt spray. Some sea salt brands can be heavy, so only apply about 1-2 sprays per section. Use a diffuser to dry the hair and add volume. A diffuser is an attachment that is placed on the ends of a hair dryer. It is used to dry the hair while adding volume. To use, set the hair dryer to low or medium heat. Tilt your head to one side and place the diffuser on your roots. Then, gently massage the diffuser’s prongs on your hair. You only need to use the diffuser on the parts of the hair where you applied the sea salt. Using a hair diffuser will help to activate the sea salt, minimize frizz, and add definition to the hair. To add more volume, massage your fingers into your hair while you diffuse, pushing your hair up. Styling Short Hair with Sea Salt Spray Wash your hair and towel dry. Sea salt can dry out your hair, so make sure to use moisturizing shampoo and conditioner. When you’re finished washing, use a towel to dry your hair instead of a blow dryer. Your hair should be slightly damp before styling. Never use clarifying shampoo before applying sea salt spray. This type of shampoo strips the hair of volume and bounce, making the spray less effective. Spritz your hair with sea salt spray. Gently shake the sea salt spray to combine the ingredients. Then, working from the roots to the tip, spray a generous amount of the spray all over your hair. The amount of sea salt you need depends on the length and thickness of your hair. Spray as much as you need to saturate your hair. Let it air dry if you have thick hair. If you want your hair to appear slightly wavy and completely effortless, let it air dry. This works well on hair that is slightly long (down to the ears) and thick. After spraying with the sea salt, work through your hair with your hands to style it. You can scrunch your hair with your hands to create beach-like waves. Use a hair dryer to add volume. If you want to add more volume, dry your hair with a hair dryer. To do this, blast the hair with medium or hot heat in the direction that you want your hair to fall. You can dry your hair upward, or make it fall to the side. Make sure to stop blow-drying as soon as your hair is dry so it doesn’t over-dry. When you’re finished, use your hands to style your hair if you want it to lay down flat, or push it up for a loose pompadour style. You do not need to use any dryer attachments for this look. Giving Texture to Braids and Updos Wash and dry your hair. Wash your hair using a normal shampoo and conditioner, then use a blow dryer on high heat until it is completely dry. Avoid clarifying shampoos since they’ll strip oil and texture out of your hair and counteract the effects of the sea salt spray. You don't need to add other products to your hair, but if you'd like to add an anti-frizz serum, mousse, or other styling agents, do so after washing your hair and before moving onto the next step. Coat your hair with sea salt spray. Spritz sea salt spray through your hair from root to ends. Apply a generous amount so that your hair is somewhat damp to the touch, but not drenched. Then use a comb to evenly spread the product throughout your hair. Remember to shake the bottle of sea salt spray before applying it. The ingredients need to mix well in order for the style to work. Style your hair into an updo of your choice. Gather your hair into your favorite updo, such as a French twist or side bun. You can also do a braided updo; depending on your hair length and personal style. Make sure to hold your hair in place with hair ties or bobby pins so it doesn’t fall out. You can use this technique with nearly any updo, but it'll have the most dramatic effect on traditionally sleek styles like French twists and tight chignons. Spritz more sea salt on the updo and massage it into your hair. After pinning up your hair, apply a final, light spray of sea salt all over your hair to help lock the style in place. If your hairstyle allows, gently massage the sea salt into your hair with your fingers. This will add extra texture to slightly accentuate the style and give it a chic, modern twist. If there are any loose locks hanging down from your updo, you can give them a gentle twist after applying this final spritz to give it more definition and character. Let your hair air-dry. Using a blow dryer will completely destroy your updo. When you’re finished spraying the sea salt, let your hair dry naturally. Once it finishes, you are ready to show your cute updo to the world! The texture provided by the sea salt spray should help prevent your hair from sliding out of place, which may increase the longevity of your updo.",
    "sentences": [
        " Creating Beach-Like Waves and Volume Comb through damp hair.",
        "Make your hair damp by wetting it, then brush out any knots and tangles using a wide-toothed comb.",
        "If you just washed your hair, dry it with a towel so that it is evenly damp from roots to ends.",
        "It should “not” be soaking wet.",
        "If you wash your hair, use a moisturizing shampoo or follow your usual shampoo with a conditioner.",
        "Normal shampoo and clarifying shampoo strip the oil from your hair, which will make it harder to achieve the sort of texture this look calls for.",
        "Spritz about 6-8 pumps of sea salt spray all over your hair.",
        "Shake the bottle of sea salt spray, then apply the product to your hair, working from midpoint down to the ends.",
        "For this style, it's best to avoid using sea salt spray on the roots of your hair.",
        "The product can add too much texture to the roots and may weigh your hair down, especially if you have naturally fine hair.",
        "Use the palm of your hand to scrunch your hair.",
        "Working in sections, lightly scrunch the product into your hair from the bottom up.",
        "To scrunch your hair, place the palm of your hand beneath the ends and gradually push up, forcing more of your hair into your hand.",
        "The strands of hair should naturally gather and lock together, creating texture.",
        "Add volume and definition to the top of the hair by twisting it.",
        "To twist your hair, grab a small section with your index and middle finger.",
        "Gently twist it back away you’re your face.",
        "As it spirals, the strands of hair should grab one another and create texture.",
        "Dry your hair with a hair dryer.",
        "Once you’re finished scrunching and twisting, grab a hair dryer and set it to low or medium heat.",
        "Cup a fist full of hair in your hands and blast it with the heat from the blow dryer.",
        "Continue until all of your hair is dry.",
        "This technique will add textured beach waves to your hair without flattening it out.",
        "Don’t use hot air or rub your hair dry with a towel, though, since either option will create frizz.",
        "Adding Texture and Volume to Straight, Flat Hair Make sure your hair is dry.",
        "If your hair is flat and you’re trying to give it some volume and texture, don’t wash it prior to using the sea salt spray.",
        "Water will weigh your hair down and shampoo will strip the hair of essential oils, ultimately minimizing the effects of the spray.",
        "This technique is best on hair that hasn't been washed in 24 to 48 hours.",
        "If you must wash your hair, make sure to towel dry before styling.",
        "Your hair can be damp, but not soaked.",
        "Comb through your hair to separate the follicles and remove any tangles.",
        "Before applying the sea salt spray, use a wide tooth comb to get out any knots or tangles.",
        "Combing your hair will also separate the hair follicles and help your hair to fall naturally.",
        "This allows the sea salt to enter the hair more easily.",
        "Shake the sea salt spray.",
        "It is important to make sure the product is mixed well.",
        "Sea salt is made up of minerals and salt from the ocean that need to be mixed together in order to function properly.",
        "So whatever brand of sea salt you use, shake it well for a few seconds before you start spraying.",
        "Spray each section of your hair.",
        "When you spray, focus on the roots of the hair, mostly at the crown, and the mid shaft.",
        "Avoid spraying ends, as they are usually more porous and damaged.",
        "Work your way around your hair, grabbing a fist full, and apply 2-3 sprays per section.",
        "Spraying the roots will help with volume.",
        "If you have fine hair, only use a small amount of sea salt spray.",
        "Some sea salt brands can be heavy, so only apply about 1-2 sprays per section.",
        "Use a diffuser to dry the hair and add volume.",
        "A diffuser is an attachment that is placed on the ends of a hair dryer.",
        "It is used to dry the hair while adding volume.",
        "To use, set the hair dryer to low or medium heat.",
        "Tilt your head to one side and place the diffuser on your roots.",
        "Then, gently massage the diffuser’s prongs on your hair.",
        "You only need to use the diffuser on the parts of the hair where you applied the sea salt.",
        "Using a hair diffuser will help to activate the sea salt, minimize frizz, and add definition to the hair.",
        "To add more volume, massage your fingers into your hair while you diffuse, pushing your hair up.",
        "Styling Short Hair with Sea Salt Spray Wash your hair and towel dry.",
        "Sea salt can dry out your hair, so make sure to use moisturizing shampoo and conditioner.",
        "When you’re finished washing, use a towel to dry your hair instead of a blow dryer.",
        "Your hair should be slightly damp before styling.",
        "Never use clarifying shampoo before applying sea salt spray.",
        "This type of shampoo strips the hair of volume and bounce, making the spray less effective.",
        "Spritz your hair with sea salt spray.",
        "Gently shake the sea salt spray to combine the ingredients.",
        "Then, working from the roots to the tip, spray a generous amount of the spray all over your hair.",
        "The amount of sea salt you need depends on the length and thickness of your hair.",
        "Spray as much as you need to saturate your hair.",
        "Let it air dry if you have thick hair.",
        "If you want your hair to appear slightly wavy and completely effortless, let it air dry.",
        "This works well on hair that is slightly long (down to the ears) and thick.",
        "After spraying with the sea salt, work through your hair with your hands to style it.",
        "You can scrunch your hair with your hands to create beach-like waves.",
        "Use a hair dryer to add volume.",
        "If you want to add more volume, dry your hair with a hair dryer.",
        "To do this, blast the hair with medium or hot heat in the direction that you want your hair to fall.",
        "You can dry your hair upward, or make it fall to the side.",
        "Make sure to stop blow-drying as soon as your hair is dry so it doesn’t over-dry.",
        "When you’re finished, use your hands to style your hair if you want it to lay down flat, or push it up for a loose pompadour style.",
        "You do not need to use any dryer attachments for this look.",
        "Giving Texture to Braids and Updos Wash and dry your hair.",
        "Wash your hair using a normal shampoo and conditioner, then use a blow dryer on high heat until it is completely dry.",
        "Avoid clarifying shampoos since they’ll strip oil and texture out of your hair and counteract the effects of the sea salt spray.",
        "You don't need to add other products to your hair, but if you'd like to add an anti-frizz serum, mousse, or other styling agents, do so after washing your hair and before moving onto the next step.",
        "Coat your hair with sea salt spray.",
        "Spritz sea salt spray through your hair from root to ends.",
        "Apply a generous amount so that your hair is somewhat damp to the touch, but not drenched.",
        "Then use a comb to evenly spread the product throughout your hair.",
        "Remember to shake the bottle of sea salt spray before applying it.",
        "The ingredients need to mix well in order for the style to work.",
        "Style your hair into an updo of your choice.",
        "Gather your hair into your favorite updo, such as a French twist or side bun.",
        "You can also do a braided updo; depending on your hair length and personal style.",
        "Make sure to hold your hair in place with hair ties or bobby pins so it doesn’t fall out.",
        "You can use this technique with nearly any updo, but it'll have the most dramatic effect on traditionally sleek styles like French twists and tight chignons.",
        "Spritz more sea salt on the updo and massage it into your hair.",
        "After pinning up your hair, apply a final, light spray of sea salt all over your hair to help lock the style in place.",
        "If your hairstyle allows, gently massage the sea salt into your hair with your fingers.",
        "This will add extra texture to slightly accentuate the style and give it a chic, modern twist.",
        "If there are any loose locks hanging down from your updo, you can give them a gentle twist after applying this final spritz to give it more definition and character.",
        "Let your hair air-dry.",
        "Using a blow dryer will completely destroy your updo.",
        "When you’re finished spraying the sea salt, let your hair dry naturally.",
        "Once it finishes, you are ready to show your cute updo to the world!",
        "The texture provided by the sea salt spray should help prevent your hair from sliding out of place, which may increase the longevity of your updo."
    ]
}