{
    "title": "How to Plan a Fashion Show to Raise Funds",
    "url": "https://www.wikihow.com/Plan-a-Fashion-Show-to-Raise-Funds",
    "category_hierarchy": [
        "Finance and Business",
        "Fundraising and Charity"
    ],
    "steps": [
        {
            "headline": "Find suitable clothes or vendors.",
            "description": "A fashion show is all about clothes so find suitable clothes as quickly as you can. Many stores will lend clothes for your show. Ask friends, family, schoolmates, etc. if they have recent bought clothes that you can borrow."
        },
        {
            "headline": "Find your models.",
            "description": "You can ask anyone to be a model for your show. Friends, family, schoolmates, etc. can be asked to model for the show."
        },
        {
            "headline": "Decide on a theme.",
            "description": "Find a theme for your fashion show so you know what kind of clothes you need for the show."
        },
        {
            "headline": "Make or order decorations and invitations.",
            "description": "Order or make your invitations for your show based on your theme."
        },
        {
            "headline": "Book a photographer.",
            "description": "If you want some great publicity shots, it's a good idea to get a good amateur photographer on board. There will always be someone who is able to do this from among moms, dads, school students, etc."
        },
        {
            "headline": "Seek a pro bono website designer.",
            "description": "Send out a call for a website designer who can make a site to advertise and promote the event beforehand, as well as carrying news and photos once the event has been held. This will help increase your professionalism and can serve as a way to encourage people to participate in repeats of the show the next season or year."
        },
        {
            "headline": "Book a suitable venue.",
            "description": "If your school or community has a suitable hall, this will make things easy. Otherwise, look about – the local municipality might be willing to help out with a free or reduced cost hall."
        },
        {
            "headline": "Find your paying audience.",
            "description": "Advertise through newsletters, fliers, brochures, online, word-of-mouth, street posters, etc. Get the moms, dads, other family members, local community members, students, everyone possible interested in coming along!"
        },
        {
            "headline": "Be sure to get support people organized.",
            "description": "You will need hair stylists, make up artists, lighting specialists, music coordinators, etc. Use the school's drama department, and ask students to help out as much as possible. Some parents, community members, local business leaders might be able to donate some of their time and expertise as well."
        }
    ],
    "tyn": [
        "Makeup",
        "Fashion clothing",
        "Cameras",
        "Computer",
        "Printer with paper",
        "Hair stylists",
        "D.J."
    ],
    "text": " Find suitable clothes or vendors. A fashion show is all about clothes so find suitable clothes as quickly as you can. Many stores will lend clothes for your show. Ask friends, family, schoolmates, etc. if they have recent bought clothes that you can borrow. Find your models. You can ask anyone to be a model for your show. Friends, family, schoolmates, etc. can be asked to model for the show. Decide on a theme. Find a theme for your fashion show so you know what kind of clothes you need for the show. Make or order decorations and invitations. Order or make your invitations for your show based on your theme. Book a photographer. If you want some great publicity shots, it's a good idea to get a good amateur photographer on board. There will always be someone who is able to do this from among moms, dads, school students, etc. Seek a pro bono website designer. Send out a call for a website designer who can make a site to advertise and promote the event beforehand, as well as carrying news and photos once the event has been held. This will help increase your professionalism and can serve as a way to encourage people to participate in repeats of the show the next season or year. Book a suitable venue. If your school or community has a suitable hall, this will make things easy. Otherwise, look about – the local municipality might be willing to help out with a free or reduced cost hall. Find your paying audience. Advertise through newsletters, fliers, brochures, online, word-of-mouth, street posters, etc. Get the moms, dads, other family members, local community members, students, everyone possible interested in coming along! Be sure to get support people organized. You will need hair stylists, make up artists, lighting specialists, music coordinators, etc. Use the school's drama department, and ask students to help out as much as possible. Some parents, community members, local business leaders might be able to donate some of their time and expertise as well.",
    "sentences": [
        " Find suitable clothes or vendors.",
        "A fashion show is all about clothes so find suitable clothes as quickly as you can.",
        "Many stores will lend clothes for your show.",
        "Ask friends, family, schoolmates, etc.",
        "if they have recent bought clothes that you can borrow.",
        "Find your models.",
        "You can ask anyone to be a model for your show.",
        "Friends, family, schoolmates, etc.",
        "can be asked to model for the show.",
        "Decide on a theme.",
        "Find a theme for your fashion show so you know what kind of clothes you need for the show.",
        "Make or order decorations and invitations.",
        "Order or make your invitations for your show based on your theme.",
        "Book a photographer.",
        "If you want some great publicity shots, it's a good idea to get a good amateur photographer on board.",
        "There will always be someone who is able to do this from among moms, dads, school students, etc.",
        "Seek a pro bono website designer.",
        "Send out a call for a website designer who can make a site to advertise and promote the event beforehand, as well as carrying news and photos once the event has been held.",
        "This will help increase your professionalism and can serve as a way to encourage people to participate in repeats of the show the next season or year.",
        "Book a suitable venue.",
        "If your school or community has a suitable hall, this will make things easy.",
        "Otherwise, look about – the local municipality might be willing to help out with a free or reduced cost hall.",
        "Find your paying audience.",
        "Advertise through newsletters, fliers, brochures, online, word-of-mouth, street posters, etc.",
        "Get the moms, dads, other family members, local community members, students, everyone possible interested in coming along!",
        "Be sure to get support people organized.",
        "You will need hair stylists, make up artists, lighting specialists, music coordinators, etc.",
        "Use the school's drama department, and ask students to help out as much as possible.",
        "Some parents, community members, local business leaders might be able to donate some of their time and expertise as well."
    ]
}