{
    "title": "How to Make Tortellini",
    "url": "https://www.wikihow.com/Make-Tortellini",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Pasta and Noodles"
    ],
    "parts": [
        {
            "name": "Making the Dough",
            "steps": [
                {
                    "headline": "Whisk the flour and salt in a bowl.",
                    "description": "Put 2 cups (250 g) of all-purpose flour and 1/2 teaspoon (2.5 g) of salt into a mixing bowl and whisk for about 10 seconds. Then use your hand to make a deep well in the center of the flour.Did You Know? Traditionally, pasta is mixed on a counter or work surface although this can take some skill."
                },
                {
                    "headline": "Crack 3 eggs into the flour and whisk to form a soft dough.",
                    "description": "Use a fork to whisk the eggs until they're combined. Keep whisking while you slowly incorporate the flour on the sides of the eggs. This should make a wet, sticky dough. If you prefer, beat the eggs and then use your fingers to combine the flour."
                },
                {
                    "headline": "Knead the dough until it's smooth and elastic.",
                    "description": "Once the dough is too thick to mix with the fork, turn it onto a work surface. Use your hands to fold the dough, turn it, and stretch it. Continue to knead the dough until it springs back when you firmly press your finger into it. Sprinkle extra flour on your work surface if the dough sticks to your hands."
                },
                {
                    "headline": "Wrap the dough and rest it for 30 minutes.",
                    "description": "Wrap the ball of dough tightly in plastic wrap and set it aside at room temperature. Leave it for at least 30 minutes or up to 2 hours. Resting the dough will relax the gluten so the pasta isn't tough. If you want to make the dough in advance, refrigerate it for up to 2 days. Let the dough come to room temperature before you roll it out."
                }
            ]
        },
        {
            "name": "Mixing the Filling",
            "steps": [
                {
                    "headline": "Mince the parsley and grate the cheese.",
                    "description": "Place a bunch of fresh flat-leaf parsley on a cutting board. Use a chef's knife to mince the parsley leaves until you get 2/3 of a cup (15 g). Then get out a wedge of Parmesan and grate it against the smallest side of a box grater until you get 1/2 cup (50 g). Put the parsley and Parmesan in a mixing bowl. If you prefer Asiago or Romano, you can substitute them for the Parmesan."
                },
                {
                    "headline": "Add ricotta, nutmeg, lemon zest, and salt to the bowl.",
                    "description": "Put 2 1/3 cups (567 g) of whole-milk ricotta into the bowl with the parsley and Parmesan. Then add 1 teaspoon (2 g) of freshly grated nutmeg, 1 teaspoon (2 g) of lemon zest, and 1/4 teaspoon (1 g) of fine sea salt.Did You Know? The lemon zest will brighten the flavor of the cheese filling without adding a strong citrus flavor."
                },
                {
                    "headline": "Mix the ingredients to form a smooth filling.",
                    "description": "Use a wooden spoon to combine the ricotta with all of the ingredients. Keep mixing until the filling is completely smooth and the seasonings are incorporated. Cover the bowl and refrigerate the filling while you roll out the dough. You can make the ricotta filling up to 6 hours in advance."
                }
            ]
        },
        {
            "name": "Assembling the Tortellini",
            "steps": [
                {
                    "headline": "Divide the dough into 4 portions.",
                    "description": "Once the dough has rested and you've made the filling, unwrap the pasta dough. Sprinkle a baking sheet with flour and place the dough on it. Then cut the dough into 4 equal portions and sprinkle a little flour on them. Lay a kitchen towel over the dough.Tip: Keep the dough and your work surface lightly floured so the dough doesn't stick as you begin to roll it out."
                },
                {
                    "headline": "Roll each portion of dough into a thin sheet.",
                    "description": "Press 1 portion of dough so it's about ⁄2 inch (1.3 cm) thick and set your pasta machine to the widest setting. Turn on the machine to low or crank it slowly as you feed the portion of dough through the machine. Then adjust the machine to a thinner setting and run the pasta through again. Continue rolling the pasta through the machine until the pasta is as thin as paper. Keep the other portions of pasta covered while you roll out the first portion."
                },
                {
                    "headline": "Cut the rolled dough into 3 in (7.6 cm) circles.",
                    "description": "Place the rolled portion of pasta dough on a floured surface and use a 2 in (5.1 cm) cookie or biscuit cutter to cut out as many circles as you can. You should be able to get about 20 from 1 rolled portion of dough. Lay a towel over the pasta circles while you cut the remaining portions of dough. The towel will prevent the pasta from drying out. Gather up the pasta scraps from each portion. You can roll them together and run them through the pasta machine or attachment. Then cut 1 last batch of circles from it."
                },
                {
                    "headline": "Put 1 teaspoon (4.9 ml) of filling on the circles and fold them in half.",
                    "description": "Spoon a little of the ricotta filling onto the center of each pasta circle. Then dip your finger in a little water and brush it around the edge of the circle. Fold 1/2 of the circle over the filling so it lines up with the other side. Press it tightly so the dough is sealed. You should now have a half-moon shaped tortellini. If you prefer, use a piping bag with a wide tip to squeeze the filling onto the pasta circles."
                },
                {
                    "headline": "Bring the corners together to form the tortellini.",
                    "description": "Overlap the corners a little and pinch them tightly so the tortellini is round like a bonnet. Set the shaped tortellini on a flour-lined baking sheet and keep it covered while you shape the remaining pasta. You may need to moisten your fingertips occasionally to help seal the dough."
                }
            ]
        },
        {
            "name": "Cooking the Tortellini",
            "steps": [
                {
                    "headline": "Bring a pot of water to boil.",
                    "description": "Heat a large pot of water over high heat until the water begins to boil. Then add 1 to 2 tablespoons (17 to 34 g) of salt to the water just before you add the tortellini.Tip: If you add the salt when you pour the water in the pot, the salt can cause pitting to the pot."
                },
                {
                    "headline": "Boil the tortellini for 4 to 5 minutes.",
                    "description": "Carefully lower the tortellini into the pot of boiling water and stir them gently. Boil the uncovered pot of tortellini until they float to the top of the water. To see if the tortellini have finished cooking, cut 1 in half and taste it. The pasta should be firm and the filling needs to be hot."
                },
                {
                    "headline": "Serve the tortellini.",
                    "description": "Drain the tortellini and drizzle a little browned butter or olive oil over it. You can serve the tortellini like this to highlight the flavor of the homemade pasta and filling. If you prefer, toss the tortellini in your favorite warmed pasta sauce. Store leftover tortellini in an airtight container in the refrigerator for up to 3 or 4 days."
                }
            ]
        }
    ],
    "tyn": [
        "Measuring cups and spoons",
        "Whisk or fork",
        "Mixing bowls",
        "Plastic wrap",
        "Spoons",
        "Fork",
        "Knife and cutting board",
        "Kitchen towels",
        "3 in (7.6 cm) cookie or biscuit cutter"
    ],
    "text": " Making the Dough Whisk the flour and salt in a bowl. Put 2 cups (250 g) of all-purpose flour and 1/2 teaspoon (2.5 g) of salt into a mixing bowl and whisk for about 10 seconds. Then use your hand to make a deep well in the center of the flour.Did You Know? Traditionally, pasta is mixed on a counter or work surface although this can take some skill. Crack 3 eggs into the flour and whisk to form a soft dough. Use a fork to whisk the eggs until they're combined. Keep whisking while you slowly incorporate the flour on the sides of the eggs. This should make a wet, sticky dough. If you prefer, beat the eggs and then use your fingers to combine the flour. Knead the dough until it's smooth and elastic. Once the dough is too thick to mix with the fork, turn it onto a work surface. Use your hands to fold the dough, turn it, and stretch it. Continue to knead the dough until it springs back when you firmly press your finger into it. Sprinkle extra flour on your work surface if the dough sticks to your hands. Wrap the dough and rest it for 30 minutes. Wrap the ball of dough tightly in plastic wrap and set it aside at room temperature. Leave it for at least 30 minutes or up to 2 hours. Resting the dough will relax the gluten so the pasta isn't tough. If you want to make the dough in advance, refrigerate it for up to 2 days. Let the dough come to room temperature before you roll it out. Mixing the Filling Mince the parsley and grate the cheese. Place a bunch of fresh flat-leaf parsley on a cutting board. Use a chef's knife to mince the parsley leaves until you get 2/3 of a cup (15 g). Then get out a wedge of Parmesan and grate it against the smallest side of a box grater until you get 1/2 cup (50 g). Put the parsley and Parmesan in a mixing bowl. If you prefer Asiago or Romano, you can substitute them for the Parmesan. Add ricotta, nutmeg, lemon zest, and salt to the bowl. Put 2 1/3 cups (567 g) of whole-milk ricotta into the bowl with the parsley and Parmesan. Then add 1 teaspoon (2 g) of freshly grated nutmeg, 1 teaspoon (2 g) of lemon zest, and 1/4 teaspoon (1 g) of fine sea salt.Did You Know? The lemon zest will brighten the flavor of the cheese filling without adding a strong citrus flavor. Mix the ingredients to form a smooth filling. Use a wooden spoon to combine the ricotta with all of the ingredients. Keep mixing until the filling is completely smooth and the seasonings are incorporated. Cover the bowl and refrigerate the filling while you roll out the dough. You can make the ricotta filling up to 6 hours in advance. Assembling the Tortellini Divide the dough into 4 portions. Once the dough has rested and you've made the filling, unwrap the pasta dough. Sprinkle a baking sheet with flour and place the dough on it. Then cut the dough into 4 equal portions and sprinkle a little flour on them. Lay a kitchen towel over the dough.Tip: Keep the dough and your work surface lightly floured so the dough doesn't stick as you begin to roll it out. Roll each portion of dough into a thin sheet. Press 1 portion of dough so it's about ⁄2 inch (1.3 cm) thick and set your pasta machine to the widest setting. Turn on the machine to low or crank it slowly as you feed the portion of dough through the machine. Then adjust the machine to a thinner setting and run the pasta through again. Continue rolling the pasta through the machine until the pasta is as thin as paper. Keep the other portions of pasta covered while you roll out the first portion. Cut the rolled dough into 3 in (7.6 cm) circles. Place the rolled portion of pasta dough on a floured surface and use a 2 in (5.1 cm) cookie or biscuit cutter to cut out as many circles as you can. You should be able to get about 20 from 1 rolled portion of dough. Lay a towel over the pasta circles while you cut the remaining portions of dough. The towel will prevent the pasta from drying out. Gather up the pasta scraps from each portion. You can roll them together and run them through the pasta machine or attachment. Then cut 1 last batch of circles from it. Put 1 teaspoon (4.9 ml) of filling on the circles and fold them in half. Spoon a little of the ricotta filling onto the center of each pasta circle. Then dip your finger in a little water and brush it around the edge of the circle. Fold 1/2 of the circle over the filling so it lines up with the other side. Press it tightly so the dough is sealed. You should now have a half-moon shaped tortellini. If you prefer, use a piping bag with a wide tip to squeeze the filling onto the pasta circles. Bring the corners together to form the tortellini. Overlap the corners a little and pinch them tightly so the tortellini is round like a bonnet. Set the shaped tortellini on a flour-lined baking sheet and keep it covered while you shape the remaining pasta. You may need to moisten your fingertips occasionally to help seal the dough. Cooking the Tortellini Bring a pot of water to boil. Heat a large pot of water over high heat until the water begins to boil. Then add 1 to 2 tablespoons (17 to 34 g) of salt to the water just before you add the tortellini.Tip: If you add the salt when you pour the water in the pot, the salt can cause pitting to the pot. Boil the tortellini for 4 to 5 minutes. Carefully lower the tortellini into the pot of boiling water and stir them gently. Boil the uncovered pot of tortellini until they float to the top of the water. To see if the tortellini have finished cooking, cut 1 in half and taste it. The pasta should be firm and the filling needs to be hot. Serve the tortellini. Drain the tortellini and drizzle a little browned butter or olive oil over it. You can serve the tortellini like this to highlight the flavor of the homemade pasta and filling. If you prefer, toss the tortellini in your favorite warmed pasta sauce. Store leftover tortellini in an airtight container in the refrigerator for up to 3 or 4 days.",
    "sentences": [
        " Making the Dough Whisk the flour and salt in a bowl.",
        "Put 2 cups (250 g) of all-purpose flour and 1/2 teaspoon (2.5 g) of salt into a mixing bowl and whisk for about 10 seconds.",
        "Then use your hand to make a deep well in the center of the flour.Did You Know?",
        "Traditionally, pasta is mixed on a counter or work surface although this can take some skill.",
        "Crack 3 eggs into the flour and whisk to form a soft dough.",
        "Use a fork to whisk the eggs until they're combined.",
        "Keep whisking while you slowly incorporate the flour on the sides of the eggs.",
        "This should make a wet, sticky dough.",
        "If you prefer, beat the eggs and then use your fingers to combine the flour.",
        "Knead the dough until it's smooth and elastic.",
        "Once the dough is too thick to mix with the fork, turn it onto a work surface.",
        "Use your hands to fold the dough, turn it, and stretch it.",
        "Continue to knead the dough until it springs back when you firmly press your finger into it.",
        "Sprinkle extra flour on your work surface if the dough sticks to your hands.",
        "Wrap the dough and rest it for 30 minutes.",
        "Wrap the ball of dough tightly in plastic wrap and set it aside at room temperature.",
        "Leave it for at least 30 minutes or up to 2 hours.",
        "Resting the dough will relax the gluten so the pasta isn't tough.",
        "If you want to make the dough in advance, refrigerate it for up to 2 days.",
        "Let the dough come to room temperature before you roll it out.",
        "Mixing the Filling Mince the parsley and grate the cheese.",
        "Place a bunch of fresh flat-leaf parsley on a cutting board.",
        "Use a chef's knife to mince the parsley leaves until you get 2/3 of a cup (15 g).",
        "Then get out a wedge of Parmesan and grate it against the smallest side of a box grater until you get 1/2 cup (50 g).",
        "Put the parsley and Parmesan in a mixing bowl.",
        "If you prefer Asiago or Romano, you can substitute them for the Parmesan.",
        "Add ricotta, nutmeg, lemon zest, and salt to the bowl.",
        "Put 2 1/3 cups (567 g) of whole-milk ricotta into the bowl with the parsley and Parmesan.",
        "Then add 1 teaspoon (2 g) of freshly grated nutmeg, 1 teaspoon (2 g) of lemon zest, and 1/4 teaspoon (1 g) of fine sea salt.Did You Know?",
        "The lemon zest will brighten the flavor of the cheese filling without adding a strong citrus flavor.",
        "Mix the ingredients to form a smooth filling.",
        "Use a wooden spoon to combine the ricotta with all of the ingredients.",
        "Keep mixing until the filling is completely smooth and the seasonings are incorporated.",
        "Cover the bowl and refrigerate the filling while you roll out the dough.",
        "You can make the ricotta filling up to 6 hours in advance.",
        "Assembling the Tortellini Divide the dough into 4 portions.",
        "Once the dough has rested and you've made the filling, unwrap the pasta dough.",
        "Sprinkle a baking sheet with flour and place the dough on it.",
        "Then cut the dough into 4 equal portions and sprinkle a little flour on them.",
        "Lay a kitchen towel over the dough.Tip: Keep the dough and your work surface lightly floured so the dough doesn't stick as you begin to roll it out.",
        "Roll each portion of dough into a thin sheet.",
        "Press 1 portion of dough so it's about ⁄2 inch (1.3 cm) thick and set your pasta machine to the widest setting.",
        "Turn on the machine to low or crank it slowly as you feed the portion of dough through the machine.",
        "Then adjust the machine to a thinner setting and run the pasta through again.",
        "Continue rolling the pasta through the machine until the pasta is as thin as paper.",
        "Keep the other portions of pasta covered while you roll out the first portion.",
        "Cut the rolled dough into 3 in (7.6 cm) circles.",
        "Place the rolled portion of pasta dough on a floured surface and use a 2 in (5.1 cm) cookie or biscuit cutter to cut out as many circles as you can.",
        "You should be able to get about 20 from 1 rolled portion of dough.",
        "Lay a towel over the pasta circles while you cut the remaining portions of dough.",
        "The towel will prevent the pasta from drying out.",
        "Gather up the pasta scraps from each portion.",
        "You can roll them together and run them through the pasta machine or attachment.",
        "Then cut 1 last batch of circles from it.",
        "Put 1 teaspoon (4.9 ml) of filling on the circles and fold them in half.",
        "Spoon a little of the ricotta filling onto the center of each pasta circle.",
        "Then dip your finger in a little water and brush it around the edge of the circle.",
        "Fold 1/2 of the circle over the filling so it lines up with the other side.",
        "Press it tightly so the dough is sealed.",
        "You should now have a half-moon shaped tortellini.",
        "If you prefer, use a piping bag with a wide tip to squeeze the filling onto the pasta circles.",
        "Bring the corners together to form the tortellini.",
        "Overlap the corners a little and pinch them tightly so the tortellini is round like a bonnet.",
        "Set the shaped tortellini on a flour-lined baking sheet and keep it covered while you shape the remaining pasta.",
        "You may need to moisten your fingertips occasionally to help seal the dough.",
        "Cooking the Tortellini Bring a pot of water to boil.",
        "Heat a large pot of water over high heat until the water begins to boil.",
        "Then add 1 to 2 tablespoons (17 to 34 g) of salt to the water just before you add the tortellini.Tip: If you add the salt when you pour the water in the pot, the salt can cause pitting to the pot.",
        "Boil the tortellini for 4 to 5 minutes.",
        "Carefully lower the tortellini into the pot of boiling water and stir them gently.",
        "Boil the uncovered pot of tortellini until they float to the top of the water.",
        "To see if the tortellini have finished cooking, cut 1 in half and taste it.",
        "The pasta should be firm and the filling needs to be hot.",
        "Serve the tortellini.",
        "Drain the tortellini and drizzle a little browned butter or olive oil over it.",
        "You can serve the tortellini like this to highlight the flavor of the homemade pasta and filling.",
        "If you prefer, toss the tortellini in your favorite warmed pasta sauce.",
        "Store leftover tortellini in an airtight container in the refrigerator for up to 3 or 4 days."
    ]
}