{
    "title": "How to Straighten a Frizzy Wig",
    "url": "https://www.wikihow.com/Straighten-a-Frizzy-Wig",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Artificial Hair Integrations",
        "Wigs"
    ],
    "methods": [
        {
            "name": "Using Detangling Products on a Dry Wig",
            "steps": [
                {
                    "headline": "Place the wig on a head.",
                    "description": "If you don't have a mannequin head, use your knee, or ask a family member if you can put the wig on their head. Trying to straighten a wig without stabilizing it on a head can easily lead to more tangling."
                },
                {
                    "headline": "Detangle the ends of the wig with your fingers and a wide-tooth comb.",
                    "description": "Using your hands, gently brush out the wig, and focus on detangling the ends slowly. You can also use a wide-tooth comb for further smoothness, as long as you're gentle with it. Using a fine-tooth comb or brushing the wig too much might increase hair static."
                },
                {
                    "headline": "Use a detangling spray or lotion.",
                    "description": "Take a small section of the wig, around 1 to 2 inches (2.5 to 5 cm), and spray a minimal amount of detangling spray onto it. When picking a spray, look for products with labels like “wig spray,” “wig detangler,” or “hair detangler.”"
                },
                {
                    "headline": "Comb the sprayed wig gently.",
                    "description": "Now start slowly combing the sprayed section. If there is a knot, put the comb away and detangle it with your fingers. Once it's solved, continue combing. Go on with the spraying and combing until you have worked your way all the way around the wig."
                },
                {
                    "headline": "Use diluted fabric softener if you don't have a detangling product.",
                    "description": "Fabric softener eliminates static electricity that causes frizziness in synthetic wigs. Make your own detangling product by mixing ½ cup (118 ml) of cold water with ½ cup (118 ml) of liquid fabric softener in a spray bottle. Spray it lightly on your wig, covering every spot, and let it air-dry. If you have more time, you can use more diluted fabric softener. Use a towel to dab the wig, and have it dry out overnight."
                }
            ]
        },
        {
            "name": "Washing the Wig",
            "steps": [
                {
                    "headline": "Soak the wig with laundry detergent in a bathtub.",
                    "description": "If your wig is too frizzy to straighten when dry, let it soak in a bathtub with water and a little laundry detergent (¼ of the bottle cap is enough). Keep the water lukewarm, around 85° to 95° F (29° to 35° C)."
                },
                {
                    "headline": "Rinse the wig in lukewarm water after a few minutes.",
                    "description": "Be gentle while rinsing it in order to avoid further tangling. Dab the wig with a towel lightly to get rid of the excess water. Move the wig back to the mannequin head to let it air-dry."
                },
                {
                    "headline": "Wash the wig on the mannequin with shampoo and conditioner for a gentler approach.",
                    "description": "Take the mannequin head to a sink, bathtub or basin. Apply shampoo on your hand, and use your fingers as a comb, gently squeezing the strands of the wig. Condition the same way, and rinse thoroughly in lukewarm water. Pick a gentle shampoo and conditioner that don't contain sulfate and have a low pH. Find ones that are intended for extra-dry hair."
                },
                {
                    "headline": "Rub a sheet of fabric softener onto the damp wig to soften it.",
                    "description": "Use a dryer sheet to eliminate the potential frizziness by gently rubbing it onto the strands of the wet wig."
                },
                {
                    "headline": "Towel-dry more, and hang it to air-dry.",
                    "description": "It's ideal to wash your wig the night before the day you'll wear it, since it'll likely take 4 to 5 hours to dry. Once it's dry, gently brush it out with a natural bristle brush before putting it on. Except for emergency cases, try not to wash your wig more than once a week."
                }
            ]
        },
        {
            "name": "Using Heating Tools for Heat-Friendly Wigs",
            "steps": [
                {
                    "headline": "Check if your wig can bear exposure to heat.",
                    "description": "Many synthetic wigs do not respond well to heat; some might melt when you're opening the lid of a hot oven or trying to blow-dry them. Before using any heated hair-styling tools on your wig, make sure to check its label. Look for phrases like “heat-friendly” or “heat-resistant.” If there is none, you shouldn't risk burning your wig."
                },
                {
                    "headline": "Preheat your flat iron on the lowest temperature.",
                    "description": "Even if your wig is heat-friendly, opt for the lowest heat in order to avoid damaging your wig. If you set the flat iron too high, the wig might melt. Wait a few minutes until the iron is hot enough. Ideally the temperature of the flat iron shouldn't exceed 240° F (116° C)."
                },
                {
                    "headline": "Clip up the top layer of the wig, and straighten the bottom layer.",
                    "description": "When the wig is on the mannequin head, use your hands to divide it into two layers: top and bottom. Use to clip to stabilize the top layer. Take a small section from the bottom, around 1 inch (2.5 cm) in width, and apply the iron from the roots to the ends."
                },
                {
                    "headline": "Remove the clip, and iron the top layer.",
                    "description": "Once you're done with the bottom layer, take off the clip, and take a small section from the top layer. Apply the flat iron, using the same method as you did on the bottom layer. Continue until you covered every part of the wig. Don't hold the flat iron on one spot for longer than a few seconds, as overexposure to heat might harm the wig."
                },
                {
                    "headline": "Use a natural bristle brush while heat-styling your wig.",
                    "description": "During straightening, gently brush out the wig using a natural bristle brush. This will help make the strands look soft and shiny."
                },
                {
                    "headline": "Use a hot-air brush on your wig for increased volume and softness.",
                    "description": "If you don't have a straightener or want a softer feel, go for a hot-air brush. You can use it after lightly spraying the wig with detangler, fabric softener, or plain water. Move it down the wig slowly, letting the brush dry the fibers."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "A wig",
        "A mannequin head (or family member, etc.)",
        "A wide-toothed comb",
        "Detangling spray or lotion",
        "A natural bristle brush",
        "Liquid fabric softener (optional)",
        "Dryer sheet (optional)",
        "A flat iron (optional)",
        "Hot-air brush (optional)"
    ],
    "text": " Using Detangling Products on a Dry Wig Place the wig on a head. If you don't have a mannequin head, use your knee, or ask a family member if you can put the wig on their head. Trying to straighten a wig without stabilizing it on a head can easily lead to more tangling. Detangle the ends of the wig with your fingers and a wide-tooth comb. Using your hands, gently brush out the wig, and focus on detangling the ends slowly. You can also use a wide-tooth comb for further smoothness, as long as you're gentle with it. Using a fine-tooth comb or brushing the wig too much might increase hair static. Use a detangling spray or lotion. Take a small section of the wig, around 1 to 2 inches (2.5 to 5 cm), and spray a minimal amount of detangling spray onto it. When picking a spray, look for products with labels like “wig spray,” “wig detangler,” or “hair detangler.” Comb the sprayed wig gently. Now start slowly combing the sprayed section. If there is a knot, put the comb away and detangle it with your fingers. Once it's solved, continue combing. Go on with the spraying and combing until you have worked your way all the way around the wig. Use diluted fabric softener if you don't have a detangling product. Fabric softener eliminates static electricity that causes frizziness in synthetic wigs. Make your own detangling product by mixing ½ cup (118 ml) of cold water with ½ cup (118 ml) of liquid fabric softener in a spray bottle. Spray it lightly on your wig, covering every spot, and let it air-dry. If you have more time, you can use more diluted fabric softener. Use a towel to dab the wig, and have it dry out overnight. Washing the Wig Soak the wig with laundry detergent in a bathtub. If your wig is too frizzy to straighten when dry, let it soak in a bathtub with water and a little laundry detergent (¼ of the bottle cap is enough). Keep the water lukewarm, around 85° to 95° F (29° to 35° C). Rinse the wig in lukewarm water after a few minutes. Be gentle while rinsing it in order to avoid further tangling. Dab the wig with a towel lightly to get rid of the excess water. Move the wig back to the mannequin head to let it air-dry. Wash the wig on the mannequin with shampoo and conditioner for a gentler approach. Take the mannequin head to a sink, bathtub or basin. Apply shampoo on your hand, and use your fingers as a comb, gently squeezing the strands of the wig. Condition the same way, and rinse thoroughly in lukewarm water. Pick a gentle shampoo and conditioner that don't contain sulfate and have a low pH. Find ones that are intended for extra-dry hair. Rub a sheet of fabric softener onto the damp wig to soften it. Use a dryer sheet to eliminate the potential frizziness by gently rubbing it onto the strands of the wet wig. Towel-dry more, and hang it to air-dry. It's ideal to wash your wig the night before the day you'll wear it, since it'll likely take 4 to 5 hours to dry. Once it's dry, gently brush it out with a natural bristle brush before putting it on. Except for emergency cases, try not to wash your wig more than once a week. Using Heating Tools for Heat-Friendly Wigs Check if your wig can bear exposure to heat. Many synthetic wigs do not respond well to heat; some might melt when you're opening the lid of a hot oven or trying to blow-dry them. Before using any heated hair-styling tools on your wig, make sure to check its label. Look for phrases like “heat-friendly” or “heat-resistant.” If there is none, you shouldn't risk burning your wig. Preheat your flat iron on the lowest temperature. Even if your wig is heat-friendly, opt for the lowest heat in order to avoid damaging your wig. If you set the flat iron too high, the wig might melt. Wait a few minutes until the iron is hot enough. Ideally the temperature of the flat iron shouldn't exceed 240° F (116° C). Clip up the top layer of the wig, and straighten the bottom layer. When the wig is on the mannequin head, use your hands to divide it into two layers: top and bottom. Use to clip to stabilize the top layer. Take a small section from the bottom, around 1 inch (2.5 cm) in width, and apply the iron from the roots to the ends. Remove the clip, and iron the top layer. Once you're done with the bottom layer, take off the clip, and take a small section from the top layer. Apply the flat iron, using the same method as you did on the bottom layer. Continue until you covered every part of the wig. Don't hold the flat iron on one spot for longer than a few seconds, as overexposure to heat might harm the wig. Use a natural bristle brush while heat-styling your wig. During straightening, gently brush out the wig using a natural bristle brush. This will help make the strands look soft and shiny. Use a hot-air brush on your wig for increased volume and softness. If you don't have a straightener or want a softer feel, go for a hot-air brush. You can use it after lightly spraying the wig with detangler, fabric softener, or plain water. Move it down the wig slowly, letting the brush dry the fibers. Finished. ",
    "sentences": [
        " Using Detangling Products on a Dry Wig Place the wig on a head.",
        "If you don't have a mannequin head, use your knee, or ask a family member if you can put the wig on their head.",
        "Trying to straighten a wig without stabilizing it on a head can easily lead to more tangling.",
        "Detangle the ends of the wig with your fingers and a wide-tooth comb.",
        "Using your hands, gently brush out the wig, and focus on detangling the ends slowly.",
        "You can also use a wide-tooth comb for further smoothness, as long as you're gentle with it.",
        "Using a fine-tooth comb or brushing the wig too much might increase hair static.",
        "Use a detangling spray or lotion.",
        "Take a small section of the wig, around 1 to 2 inches (2.5 to 5 cm), and spray a minimal amount of detangling spray onto it.",
        "When picking a spray, look for products with labels like “wig spray,” “wig detangler,” or “hair detangler.” Comb the sprayed wig gently.",
        "Now start slowly combing the sprayed section.",
        "If there is a knot, put the comb away and detangle it with your fingers.",
        "Once it's solved, continue combing.",
        "Go on with the spraying and combing until you have worked your way all the way around the wig.",
        "Use diluted fabric softener if you don't have a detangling product.",
        "Fabric softener eliminates static electricity that causes frizziness in synthetic wigs.",
        "Make your own detangling product by mixing ½ cup (118 ml) of cold water with ½ cup (118 ml) of liquid fabric softener in a spray bottle.",
        "Spray it lightly on your wig, covering every spot, and let it air-dry.",
        "If you have more time, you can use more diluted fabric softener.",
        "Use a towel to dab the wig, and have it dry out overnight.",
        "Washing the Wig Soak the wig with laundry detergent in a bathtub.",
        "If your wig is too frizzy to straighten when dry, let it soak in a bathtub with water and a little laundry detergent (¼ of the bottle cap is enough).",
        "Keep the water lukewarm, around 85° to 95° F (29° to 35° C).",
        "Rinse the wig in lukewarm water after a few minutes.",
        "Be gentle while rinsing it in order to avoid further tangling.",
        "Dab the wig with a towel lightly to get rid of the excess water.",
        "Move the wig back to the mannequin head to let it air-dry.",
        "Wash the wig on the mannequin with shampoo and conditioner for a gentler approach.",
        "Take the mannequin head to a sink, bathtub or basin.",
        "Apply shampoo on your hand, and use your fingers as a comb, gently squeezing the strands of the wig.",
        "Condition the same way, and rinse thoroughly in lukewarm water.",
        "Pick a gentle shampoo and conditioner that don't contain sulfate and have a low pH.",
        "Find ones that are intended for extra-dry hair.",
        "Rub a sheet of fabric softener onto the damp wig to soften it.",
        "Use a dryer sheet to eliminate the potential frizziness by gently rubbing it onto the strands of the wet wig.",
        "Towel-dry more, and hang it to air-dry.",
        "It's ideal to wash your wig the night before the day you'll wear it, since it'll likely take 4 to 5 hours to dry.",
        "Once it's dry, gently brush it out with a natural bristle brush before putting it on.",
        "Except for emergency cases, try not to wash your wig more than once a week.",
        "Using Heating Tools for Heat-Friendly Wigs Check if your wig can bear exposure to heat.",
        "Many synthetic wigs do not respond well to heat; some might melt when you're opening the lid of a hot oven or trying to blow-dry them.",
        "Before using any heated hair-styling tools on your wig, make sure to check its label.",
        "Look for phrases like “heat-friendly” or “heat-resistant.” If there is none, you shouldn't risk burning your wig.",
        "Preheat your flat iron on the lowest temperature.",
        "Even if your wig is heat-friendly, opt for the lowest heat in order to avoid damaging your wig.",
        "If you set the flat iron too high, the wig might melt.",
        "Wait a few minutes until the iron is hot enough.",
        "Ideally the temperature of the flat iron shouldn't exceed 240° F (116° C).",
        "Clip up the top layer of the wig, and straighten the bottom layer.",
        "When the wig is on the mannequin head, use your hands to divide it into two layers: top and bottom.",
        "Use to clip to stabilize the top layer.",
        "Take a small section from the bottom, around 1 inch (2.5 cm) in width, and apply the iron from the roots to the ends.",
        "Remove the clip, and iron the top layer.",
        "Once you're done with the bottom layer, take off the clip, and take a small section from the top layer.",
        "Apply the flat iron, using the same method as you did on the bottom layer.",
        "Continue until you covered every part of the wig.",
        "Don't hold the flat iron on one spot for longer than a few seconds, as overexposure to heat might harm the wig.",
        "Use a natural bristle brush while heat-styling your wig.",
        "During straightening, gently brush out the wig using a natural bristle brush.",
        "This will help make the strands look soft and shiny.",
        "Use a hot-air brush on your wig for increased volume and softness.",
        "If you don't have a straightener or want a softer feel, go for a hot-air brush.",
        "You can use it after lightly spraying the wig with detangler, fabric softener, or plain water.",
        "Move it down the wig slowly, letting the brush dry the fibers.",
        "Finished."
    ]
}