{
    "title": "How to Embroider Letters",
    "url": "https://www.wikihow.com/Embroider-Letters",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework",
        "Embroidery"
    ],
    "methods": [
        {
            "name": "Transferring the Letters",
            "steps": [
                {
                    "headline": "Use a pen or pencil to draw the letters on the fabric.",
                    "description": "Free-hand draw the letters right on the fabric that you're going to embroider. A sharp pencil will give a faint outline while a pen will give you a bolder line to follow. Avoid using chalk since it can disappear when rubbed. Use a water-soluble pen or specialty fabric pen so the ink will wash out of the fabric. Free-hand drawing is great for childlike or rustic fonts since the letters don't have to be uniform."
                },
                {
                    "headline": "Stencil the letters.",
                    "description": "If you'd like letters that are evenly shaped, lay a stencil directly on the fabric that you want to embroider. Use craft, scotch, or masking tape to tape down the sides of the stencil if you're worried that it will move as you stencil the letters. Use a sharp pencil or pen to trace around the letters. Stencils can be as simple or intricate as you like. You can make your own stencils on plastic, print them onto paper, or buy them from craft stores."
                },
                {
                    "headline": "Trace the letter design using carbon paper.",
                    "description": "Buy dress maker's carbon paper and lay it flat on your fabric so the carbon side is facing down. Position the paper to where you want to embroider the letters. Lay a piece of paper that has the letters in the font you'd like on the carbon paper. Use a blunt stylus to trace the letters on the paper. Push down a little so the letters are transferred in carbon onto the fabric. Choose light colored carbon paper for dark colored fabric and pick dark colored carbon paper for light colored fabric."
                },
                {
                    "headline": "Use an inkjet printer to print the letters on the fabric.",
                    "description": "Choose a fabric that you can run through your printer such as light canvas. Lay a piece of freezer paper on it so the shiny side is facing down and iron over it. The freezer paper should completely stick to the fabric. Cut it to 8 ⁄2 inches (22 cm) by 11 inches (28 cm) so it can run through your printer without getting caught. Print the letters in the font you would like. Consider using one of your computer's programs to position and adjust the size of the letters before you print."
                }
            ]
        },
        {
            "name": "Hand-Stitching the Letters",
            "steps": [
                {
                    "headline": "Back stitch to make cursive or printed letters.",
                    "description": "Secure your fabric between an embroidery hoop. Pull the threaded needle up from under the fabric and back down again to make a stitch as long as you like. Leave the space of 1 stitch when you bring the needle back up through the fabric. Insert the needle back at the end of the stitch you just finished. The back stitch will make a smooth, continuous letter. Continue to embroider multiple letters with the continuous piece of thread. Begin at either end of your letter. You can work the stitches in whatever direction you're most comfortable with. You can also use the back stitch to outline your letters. Decide if you'd like to leave the letters outlined or fill them in."
                },
                {
                    "headline": "Create a twisted rope effect using the stem stitch.",
                    "description": "Bring a threaded needle under your embroidery hoop and up through the fabric. Push it down through the fabric to make 1 stitch as long as you like. Bring the needle back up through the fabric so it comes out halfway up the side of the stitch you made. Insert the needle back down to make another stitch. You should be following the outline of the letter and be able to stitch more letters with the same piece of yarn. Stem stitch works well for curves, loops, or cursive letters because you can direct the twist of each stitch."
                },
                {
                    "headline": "Split the yarn through the stem stitch to create a braid effect.",
                    "description": "To split stitch, bring your threaded needle under the embroidery hoop and up through the fabric. Insert and push it back down to make the first stitch on the end of a letter. The stitch can be as long as you want. When you bring the needle back up through the fabric, push it up through the middle of the stitch you just made. This will make the thread split. Continue to split stitch across each letter using the same piece of yarn. As you work the letters, they will begin to look braided. You can work the letters in whatever direction you feel the most comfortable with."
                },
                {
                    "headline": "Make dashed-line letters using a running stitch.",
                    "description": "Work just the surface of your fabric to create gaps between the stitches. Bring the threaded needle up through the fabric and lay the needle flat. Insert the tip of the needle where you'd like to start the next stitch. Make the stitches as long or short as you want. Push the needle through and lift up a little to create a gap after the stitch. Keep making the running stitch along the outline of your letters with the continuous piece of yarn."
                }
            ]
        },
        {
            "name": "Machine-Stitching the Letters",
            "steps": [
                {
                    "headline": "Apply stabilizer to the fabric you want to embroider.",
                    "description": "Lay stabilizer on an ironing board and set the underside of your fabric on the stabilizer. Use the iron on steam setting to fuse the stabilizer to the fabric. The stabilizer will strengthen the fabric so you can easily embroider letters using a template. You can buy tear-away, wash-away, or cut-away stabilizer depending on whether or not you can wash the embroidered fabric. Buy the stabilizer from a craft store. If you're embroidering a large project, apply the stabilizer to the entire piece of fabric or cut it down to size."
                },
                {
                    "headline": "Spray adhesive on the fabric and secure the template to it.",
                    "description": "Spray a temporary fabric adhesive evenly across the surface of the fabric. Place a printed template with your letters on the adhesive and press it down firmly. The paper will stick to the fabric. If you don't have spray adhesive, you can pin the paper in place."
                },
                {
                    "headline": "Load your machine with an embroidery needle and thread.",
                    "description": "Insert an embroidery needle and secure it to the sewing machine. Wind and thread your choice of embroidery thread through the machine."
                },
                {
                    "headline": "Test the size of the stitches on a scrap of fabric, if desired.",
                    "description": "If you'd like to ensure that the machine stitches are as long and wide as you'd like, load a scrap piece of fabric. Embroider a practice letter or two and make any adjustments."
                },
                {
                    "headline": "Hoop the fabric and stabilizer.",
                    "description": "Take an embroidery hoop that will fit all of the letters you're embroidering and open it. Place the fabric on the hoop so the stabilizer is on the bottom. Lay the top of the hoop over the fabric and tighten it in place. The fabric should be taut between the hoop."
                },
                {
                    "headline": "Hold the embroidery hoop as you machine stitch along the template.",
                    "description": "You'll need to hold the hoop so the first few stitches on your template are secured. Move the hoop to machine embroider the letters on your template. Begin at 1 end of a letter and stitch the outline or fill in the letter before moving on to the next letter. Remember to move the hoop instead of pulling on the fabric."
                },
                {
                    "headline": "Cut the thread and back stitch the ends.",
                    "description": "Once you've finished embroidering the letters on your template, lift the needle up and pull the thread out. Pull away the paper template and cut the thread to leave a 4 in (10-cm) tail. Thread a needle and weave the end into the last letter using the back stitch."
                }
            ]
        }
    ],
    "tyn": [
        "Transferring the Letters",
        "Pen or pencil",
        "Dress maker's carbon paper",
        "Stencil",
        "Blunt stylus",
        "Freezer paper",
        "Fabric",
        "Iron",
        "Scissors",
        "Inkjet printer",
        "Hand-Stitching the Letters",
        "Needle",
        "Thread",
        "Embroidery hoop, optional",
        "Machine-Stitching the Letters",
        "Sewing machine with embroidery needle",
        "Embroidery thread",
        "Template",
        "Single-sided stabilizer",
        "Embroidery hoop",
        "Spray adhesive"
    ],
    "text": " Transferring the Letters Use a pen or pencil to draw the letters on the fabric. Free-hand draw the letters right on the fabric that you're going to embroider. A sharp pencil will give a faint outline while a pen will give you a bolder line to follow. Avoid using chalk since it can disappear when rubbed. Use a water-soluble pen or specialty fabric pen so the ink will wash out of the fabric. Free-hand drawing is great for childlike or rustic fonts since the letters don't have to be uniform. Stencil the letters. If you'd like letters that are evenly shaped, lay a stencil directly on the fabric that you want to embroider. Use craft, scotch, or masking tape to tape down the sides of the stencil if you're worried that it will move as you stencil the letters. Use a sharp pencil or pen to trace around the letters. Stencils can be as simple or intricate as you like. You can make your own stencils on plastic, print them onto paper, or buy them from craft stores. Trace the letter design using carbon paper. Buy dress maker's carbon paper and lay it flat on your fabric so the carbon side is facing down. Position the paper to where you want to embroider the letters. Lay a piece of paper that has the letters in the font you'd like on the carbon paper. Use a blunt stylus to trace the letters on the paper. Push down a little so the letters are transferred in carbon onto the fabric. Choose light colored carbon paper for dark colored fabric and pick dark colored carbon paper for light colored fabric. Use an inkjet printer to print the letters on the fabric. Choose a fabric that you can run through your printer such as light canvas. Lay a piece of freezer paper on it so the shiny side is facing down and iron over it. The freezer paper should completely stick to the fabric. Cut it to 8 ⁄2 inches (22 cm) by 11 inches (28 cm) so it can run through your printer without getting caught. Print the letters in the font you would like. Consider using one of your computer's programs to position and adjust the size of the letters before you print. Hand-Stitching the Letters Back stitch to make cursive or printed letters. Secure your fabric between an embroidery hoop. Pull the threaded needle up from under the fabric and back down again to make a stitch as long as you like. Leave the space of 1 stitch when you bring the needle back up through the fabric. Insert the needle back at the end of the stitch you just finished. The back stitch will make a smooth, continuous letter. Continue to embroider multiple letters with the continuous piece of thread. Begin at either end of your letter. You can work the stitches in whatever direction you're most comfortable with. You can also use the back stitch to outline your letters. Decide if you'd like to leave the letters outlined or fill them in. Create a twisted rope effect using the stem stitch. Bring a threaded needle under your embroidery hoop and up through the fabric. Push it down through the fabric to make 1 stitch as long as you like. Bring the needle back up through the fabric so it comes out halfway up the side of the stitch you made. Insert the needle back down to make another stitch. You should be following the outline of the letter and be able to stitch more letters with the same piece of yarn. Stem stitch works well for curves, loops, or cursive letters because you can direct the twist of each stitch. Split the yarn through the stem stitch to create a braid effect. To split stitch, bring your threaded needle under the embroidery hoop and up through the fabric. Insert and push it back down to make the first stitch on the end of a letter. The stitch can be as long as you want. When you bring the needle back up through the fabric, push it up through the middle of the stitch you just made. This will make the thread split. Continue to split stitch across each letter using the same piece of yarn. As you work the letters, they will begin to look braided. You can work the letters in whatever direction you feel the most comfortable with. Make dashed-line letters using a running stitch. Work just the surface of your fabric to create gaps between the stitches. Bring the threaded needle up through the fabric and lay the needle flat. Insert the tip of the needle where you'd like to start the next stitch. Make the stitches as long or short as you want. Push the needle through and lift up a little to create a gap after the stitch. Keep making the running stitch along the outline of your letters with the continuous piece of yarn. Machine-Stitching the Letters Apply stabilizer to the fabric you want to embroider. Lay stabilizer on an ironing board and set the underside of your fabric on the stabilizer. Use the iron on steam setting to fuse the stabilizer to the fabric. The stabilizer will strengthen the fabric so you can easily embroider letters using a template. You can buy tear-away, wash-away, or cut-away stabilizer depending on whether or not you can wash the embroidered fabric. Buy the stabilizer from a craft store. If you're embroidering a large project, apply the stabilizer to the entire piece of fabric or cut it down to size. Spray adhesive on the fabric and secure the template to it. Spray a temporary fabric adhesive evenly across the surface of the fabric. Place a printed template with your letters on the adhesive and press it down firmly. The paper will stick to the fabric. If you don't have spray adhesive, you can pin the paper in place. Load your machine with an embroidery needle and thread. Insert an embroidery needle and secure it to the sewing machine. Wind and thread your choice of embroidery thread through the machine. Test the size of the stitches on a scrap of fabric, if desired. If you'd like to ensure that the machine stitches are as long and wide as you'd like, load a scrap piece of fabric. Embroider a practice letter or two and make any adjustments. Hoop the fabric and stabilizer. Take an embroidery hoop that will fit all of the letters you're embroidering and open it. Place the fabric on the hoop so the stabilizer is on the bottom. Lay the top of the hoop over the fabric and tighten it in place. The fabric should be taut between the hoop. Hold the embroidery hoop as you machine stitch along the template. You'll need to hold the hoop so the first few stitches on your template are secured. Move the hoop to machine embroider the letters on your template. Begin at 1 end of a letter and stitch the outline or fill in the letter before moving on to the next letter. Remember to move the hoop instead of pulling on the fabric. Cut the thread and back stitch the ends. Once you've finished embroidering the letters on your template, lift the needle up and pull the thread out. Pull away the paper template and cut the thread to leave a 4 in (10-cm) tail. Thread a needle and weave the end into the last letter using the back stitch.",
    "sentences": [
        " Transferring the Letters Use a pen or pencil to draw the letters on the fabric.",
        "Free-hand draw the letters right on the fabric that you're going to embroider.",
        "A sharp pencil will give a faint outline while a pen will give you a bolder line to follow.",
        "Avoid using chalk since it can disappear when rubbed.",
        "Use a water-soluble pen or specialty fabric pen so the ink will wash out of the fabric.",
        "Free-hand drawing is great for childlike or rustic fonts since the letters don't have to be uniform.",
        "Stencil the letters.",
        "If you'd like letters that are evenly shaped, lay a stencil directly on the fabric that you want to embroider.",
        "Use craft, scotch, or masking tape to tape down the sides of the stencil if you're worried that it will move as you stencil the letters.",
        "Use a sharp pencil or pen to trace around the letters.",
        "Stencils can be as simple or intricate as you like.",
        "You can make your own stencils on plastic, print them onto paper, or buy them from craft stores.",
        "Trace the letter design using carbon paper.",
        "Buy dress maker's carbon paper and lay it flat on your fabric so the carbon side is facing down.",
        "Position the paper to where you want to embroider the letters.",
        "Lay a piece of paper that has the letters in the font you'd like on the carbon paper.",
        "Use a blunt stylus to trace the letters on the paper.",
        "Push down a little so the letters are transferred in carbon onto the fabric.",
        "Choose light colored carbon paper for dark colored fabric and pick dark colored carbon paper for light colored fabric.",
        "Use an inkjet printer to print the letters on the fabric.",
        "Choose a fabric that you can run through your printer such as light canvas.",
        "Lay a piece of freezer paper on it so the shiny side is facing down and iron over it.",
        "The freezer paper should completely stick to the fabric.",
        "Cut it to 8 ⁄2 inches (22 cm) by 11 inches (28 cm) so it can run through your printer without getting caught.",
        "Print the letters in the font you would like.",
        "Consider using one of your computer's programs to position and adjust the size of the letters before you print.",
        "Hand-Stitching the Letters Back stitch to make cursive or printed letters.",
        "Secure your fabric between an embroidery hoop.",
        "Pull the threaded needle up from under the fabric and back down again to make a stitch as long as you like.",
        "Leave the space of 1 stitch when you bring the needle back up through the fabric.",
        "Insert the needle back at the end of the stitch you just finished.",
        "The back stitch will make a smooth, continuous letter.",
        "Continue to embroider multiple letters with the continuous piece of thread.",
        "Begin at either end of your letter.",
        "You can work the stitches in whatever direction you're most comfortable with.",
        "You can also use the back stitch to outline your letters.",
        "Decide if you'd like to leave the letters outlined or fill them in.",
        "Create a twisted rope effect using the stem stitch.",
        "Bring a threaded needle under your embroidery hoop and up through the fabric.",
        "Push it down through the fabric to make 1 stitch as long as you like.",
        "Bring the needle back up through the fabric so it comes out halfway up the side of the stitch you made.",
        "Insert the needle back down to make another stitch.",
        "You should be following the outline of the letter and be able to stitch more letters with the same piece of yarn.",
        "Stem stitch works well for curves, loops, or cursive letters because you can direct the twist of each stitch.",
        "Split the yarn through the stem stitch to create a braid effect.",
        "To split stitch, bring your threaded needle under the embroidery hoop and up through the fabric.",
        "Insert and push it back down to make the first stitch on the end of a letter.",
        "The stitch can be as long as you want.",
        "When you bring the needle back up through the fabric, push it up through the middle of the stitch you just made.",
        "This will make the thread split.",
        "Continue to split stitch across each letter using the same piece of yarn.",
        "As you work the letters, they will begin to look braided.",
        "You can work the letters in whatever direction you feel the most comfortable with.",
        "Make dashed-line letters using a running stitch.",
        "Work just the surface of your fabric to create gaps between the stitches.",
        "Bring the threaded needle up through the fabric and lay the needle flat.",
        "Insert the tip of the needle where you'd like to start the next stitch.",
        "Make the stitches as long or short as you want.",
        "Push the needle through and lift up a little to create a gap after the stitch.",
        "Keep making the running stitch along the outline of your letters with the continuous piece of yarn.",
        "Machine-Stitching the Letters Apply stabilizer to the fabric you want to embroider.",
        "Lay stabilizer on an ironing board and set the underside of your fabric on the stabilizer.",
        "Use the iron on steam setting to fuse the stabilizer to the fabric.",
        "The stabilizer will strengthen the fabric so you can easily embroider letters using a template.",
        "You can buy tear-away, wash-away, or cut-away stabilizer depending on whether or not you can wash the embroidered fabric.",
        "Buy the stabilizer from a craft store.",
        "If you're embroidering a large project, apply the stabilizer to the entire piece of fabric or cut it down to size.",
        "Spray adhesive on the fabric and secure the template to it.",
        "Spray a temporary fabric adhesive evenly across the surface of the fabric.",
        "Place a printed template with your letters on the adhesive and press it down firmly.",
        "The paper will stick to the fabric.",
        "If you don't have spray adhesive, you can pin the paper in place.",
        "Load your machine with an embroidery needle and thread.",
        "Insert an embroidery needle and secure it to the sewing machine.",
        "Wind and thread your choice of embroidery thread through the machine.",
        "Test the size of the stitches on a scrap of fabric, if desired.",
        "If you'd like to ensure that the machine stitches are as long and wide as you'd like, load a scrap piece of fabric.",
        "Embroider a practice letter or two and make any adjustments.",
        "Hoop the fabric and stabilizer.",
        "Take an embroidery hoop that will fit all of the letters you're embroidering and open it.",
        "Place the fabric on the hoop so the stabilizer is on the bottom.",
        "Lay the top of the hoop over the fabric and tighten it in place.",
        "The fabric should be taut between the hoop.",
        "Hold the embroidery hoop as you machine stitch along the template.",
        "You'll need to hold the hoop so the first few stitches on your template are secured.",
        "Move the hoop to machine embroider the letters on your template.",
        "Begin at 1 end of a letter and stitch the outline or fill in the letter before moving on to the next letter.",
        "Remember to move the hoop instead of pulling on the fabric.",
        "Cut the thread and back stitch the ends.",
        "Once you've finished embroidering the letters on your template, lift the needle up and pull the thread out.",
        "Pull away the paper template and cut the thread to leave a 4 in (10-cm) tail.",
        "Thread a needle and weave the end into the last letter using the back stitch."
    ]
}