{
    "title": "How to Make Icing Without Icing Sugar",
    "url": "https://www.wikihow.com/Make-Icing-Without-Icing-Sugar",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking"
    ],
    "methods": [
        {
            "name": "Grinding Granulated Sugar",
            "steps": [
                {
                    "headline": "Pick a type of sugar.",
                    "description": "Choose granulated white sugar, if you have it. Alternately, you can use coconut sugar, brown sugar or cane sugar. Use only a cup of sugar at a time. Refined white sugar, when ground, has the closest texture to icing sugar. Breaking down more than a cup at a time won’t produce results as even in consistency."
                },
                {
                    "headline": "Add cornstarch, if desired.",
                    "description": "Combine cornstarch with granulated sugar if you’re going to store the sugar. Cornstarch helps prevent clumps so your sugar maintains a powdered consistency. If you plan to use the sugar right away, cornstarch isn’t necessary. If you’re low on cornstarch, one teaspoon (six grams) will work."
                },
                {
                    "headline": "Pulse or grind the sugar for about two minutes.",
                    "description": "Pour the sugar into a glass blender or food processor. Add cornstarch, if desired. Pulse it for about two minutes. Alternately, you can use a spice grinder or coffee grinder, but be aware these may absorb flavor from previously-used spices or coffee. You may want to avoid using a plastic blender. It’s unlikely – but possible – that sugar crystals may cause scratches to a plastic appliance. If you’re using a blender or food processor with multiple settings, choose “pulse” or “blend.”"
                },
                {
                    "headline": "Stir the sugar with a spatula.",
                    "description": "Wipe the spatula along the inside of the blender. Mix the sugar well so that it will blend and break down evenly."
                },
                {
                    "headline": "Pulse the sugar for two to three more minutes.",
                    "description": "Turn off and unplug the appliance, if applicable. Pick up a bit of sugar in your fingers and feel the texture. Resume grinding the sugar if it feels gritty, until its texture is powdery. The sugar is done when it looks fine-grained and fluffy like confectioners’ sugar."
                },
                {
                    "headline": "Sift the sugar into a bowl.",
                    "description": "Stir the sugar with a fork. Place a mesh strainer over a bowl. Spoon the sugar into the strainer. Tap the side of the sieve repeatedly to sift the sugar into the bowl. Sifting aerates the sugar so that it’s lighter, fluffier and clump-free. If you don’t have a sifter, you can use a tea strainer or colander. Alternately, you can aerate the sugar by mixing it with a wire whisk."
                },
                {
                    "headline": "Substitute your ground sugar for icing sugar.",
                    "description": "Use your newly ground sugar in place of confectioners’ sugar in your favorite icing recipe. Make cake icing, such as buttercream or cream cheese icing. Frost cupcakes with peanut butter or berry icing. Or hold a gingerbread house together with royal icing! For a simple icing, combine a cup (220 g) of powdered sugar with a tablespoon (15 ml) of milk and 1/4 teaspoon (1 ml) of flavoring, such as vanilla extract, rum or lemon juice."
                }
            ]
        },
        {
            "name": "Making Flour Icing",
            "steps": [
                {
                    "headline": "Heat the flour and milk together.",
                    "description": "Whisk flour and milk together in a small saucepan over medium heat. Stir constantly until the mixture thickens to the consistency of pudding or thick batter. Remove it from the heat and allow it to cool to room temperature. The flour icing technique can be used to make either flour buttercream icing or cooked cream cheese icing. Use butter to make flour buttercream, and cream cheese to make cream cheese icing. This icing recipe will make enough for 24 cupcakes, or two 8-inch (20-cm) cakes."
                },
                {
                    "headline": "Cream together the butter and sugar.",
                    "description": "In a medium bowl, cream the butter or cream cheese and sugar with electric beaters or in a stand mixer. Beat on high speed for about five minutes, until the mixture becomes smooth, light, and fluffy. If you don’t have a stand mixer or electric beaters, beat the mixture vigorously with a whisk."
                },
                {
                    "headline": "Combine the two mixtures.",
                    "description": "When the milk and flour mixture has cooled to room temperature, whisk in the vanilla. Add the milk and flour mixture to the creamed sugar. Beat the mixture on high speed for six to eight minutes. Scrape down the sides of the bowl as needed. The mixture is done blending when the ingredients are evenly combined and the icing becomes light and fluffy like whipped cream."
                },
                {
                    "headline": "Use the icing immediately.",
                    "description": "Spread the flour buttercream or cooked cream cheese icing on cakes, cupcakes, pancakes, or any other desserts you like. Alternately, store it in the refrigerator for a couple hours until you're ready to use it. You can refrigerate this icing overnight. Before using, allow it to warm to room temperature, then beat it again to the proper consistency."
                }
            ]
        },
        {
            "name": "Creating a Brown Sugar Icing",
            "steps": [
                {
                    "headline": "Cream the sugars together with the cream and butter.",
                    "description": "Whisk the ingredients in a medium saucepan and heat it over medium heat. Stir constantly so that the sugar doesn’t burn and crystallize. You can use evaporated milk instead of cream."
                },
                {
                    "headline": "Bring the mixture to a boil.",
                    "description": "As soon as it boils, set the timer for 2.5 minutes. Continue stirring the mixture the entire time it’s boiling. Remove it from the heat as soon as the timer is up. Boiling the mixture for 2.5 minutes allows the sugars to begin caramelizing."
                },
                {
                    "headline": "Add the baking powder and vanilla.",
                    "description": "Beat the mixture on high speed with electric beaters for six to eight minutes, until it becomes smooth, light, fluffy, and the perfect consistency to spread onto cakes or other desserts. The purpose of the baking soda is to prevent the sugar from hardening. You can also beat the mixture in a stand mixture. Once the sugar mixture boils, add the baking soda and vanilla and transfer it to the stand mixer bowl."
                }
            ]
        },
        {
            "name": "Whipping up a Meringue-Style Icing",
            "steps": [
                {
                    "headline": "Combine all the ingredients.",
                    "description": "In a medium mixing bowl, whisk together sugar, egg whites, and salt. Make sure the mixing bowl is heat-proof, as you will be heating it in a double boiler-style. If you have a stand mixer, remove the bowl and whisk the ingredients together right in the bowl. The purpose of the salt in this recipe is to break down the egg albumen, meaning the icing won’t have an eggy taste."
                },
                {
                    "headline": "Heat the mixture over a pot of boiling water.",
                    "description": "Put one to two inches (2.5 to 5 cm) of water into the bottom of a medium saucepan. Bring it to a boil over medium–high heat. When the water is boiling, place the mixing bowl over the pot in double boiler-style. Whisk the mixture constantly for about seven minutes. The mixture is done when the eggs are heated through and become thin and runny."
                },
                {
                    "headline": "Beat the mixture.",
                    "description": "Remove the bowl from heat. Immediately begin beating the mixture on high speed, and continue until the icing becomes thick and fluffy, about five to ten minutes. The icing will be the consistency of shaving cream when it’s ready, and it will hold its shape when you pull the whisk out."
                }
            ]
        }
    ],
    "tyn": [
        "Grinding Granulated Sugar",
        "Blender, food processor, or other grinder",
        "Spatula",
        "Fork",
        "Mesh strainer",
        "Spoon",
        "Bowl",
        "Making Flour Icing",
        "Whisk",
        "Small saucepan",
        "Medium bowl",
        "Electric mixer or whisk",
        "Spoon or spatula",
        "Creating a Brown Sugar Icing",
        "Spoon or whisk",
        "Medium saucepan",
        "Electric mixer",
        "Meringue-Style Icing",
        "Medium heat-proof bowl",
        "Cooking spoon"
    ],
    "text": " Grinding Granulated Sugar Pick a type of sugar. Choose granulated white sugar, if you have it. Alternately, you can use coconut sugar, brown sugar or cane sugar. Use only a cup of sugar at a time. Refined white sugar, when ground, has the closest texture to icing sugar. Breaking down more than a cup at a time won’t produce results as even in consistency. Add cornstarch, if desired. Combine cornstarch with granulated sugar if you’re going to store the sugar. Cornstarch helps prevent clumps so your sugar maintains a powdered consistency. If you plan to use the sugar right away, cornstarch isn’t necessary. If you’re low on cornstarch, one teaspoon (six grams) will work. Pulse or grind the sugar for about two minutes. Pour the sugar into a glass blender or food processor. Add cornstarch, if desired. Pulse it for about two minutes. Alternately, you can use a spice grinder or coffee grinder, but be aware these may absorb flavor from previously-used spices or coffee. You may want to avoid using a plastic blender. It’s unlikely – but possible – that sugar crystals may cause scratches to a plastic appliance. If you’re using a blender or food processor with multiple settings, choose “pulse” or “blend.” Stir the sugar with a spatula. Wipe the spatula along the inside of the blender. Mix the sugar well so that it will blend and break down evenly. Pulse the sugar for two to three more minutes. Turn off and unplug the appliance, if applicable. Pick up a bit of sugar in your fingers and feel the texture. Resume grinding the sugar if it feels gritty, until its texture is powdery. The sugar is done when it looks fine-grained and fluffy like confectioners’ sugar. Sift the sugar into a bowl. Stir the sugar with a fork. Place a mesh strainer over a bowl. Spoon the sugar into the strainer. Tap the side of the sieve repeatedly to sift the sugar into the bowl. Sifting aerates the sugar so that it’s lighter, fluffier and clump-free. If you don’t have a sifter, you can use a tea strainer or colander. Alternately, you can aerate the sugar by mixing it with a wire whisk. Substitute your ground sugar for icing sugar. Use your newly ground sugar in place of confectioners’ sugar in your favorite icing recipe. Make cake icing, such as buttercream or cream cheese icing. Frost cupcakes with peanut butter or berry icing. Or hold a gingerbread house together with royal icing! For a simple icing, combine a cup (220 g) of powdered sugar with a tablespoon (15 ml) of milk and 1/4 teaspoon (1 ml) of flavoring, such as vanilla extract, rum or lemon juice. Making Flour Icing Heat the flour and milk together. Whisk flour and milk together in a small saucepan over medium heat. Stir constantly until the mixture thickens to the consistency of pudding or thick batter. Remove it from the heat and allow it to cool to room temperature. The flour icing technique can be used to make either flour buttercream icing or cooked cream cheese icing. Use butter to make flour buttercream, and cream cheese to make cream cheese icing. This icing recipe will make enough for 24 cupcakes, or two 8-inch (20-cm) cakes. Cream together the butter and sugar. In a medium bowl, cream the butter or cream cheese and sugar with electric beaters or in a stand mixer. Beat on high speed for about five minutes, until the mixture becomes smooth, light, and fluffy. If you don’t have a stand mixer or electric beaters, beat the mixture vigorously with a whisk. Combine the two mixtures. When the milk and flour mixture has cooled to room temperature, whisk in the vanilla. Add the milk and flour mixture to the creamed sugar. Beat the mixture on high speed for six to eight minutes. Scrape down the sides of the bowl as needed. The mixture is done blending when the ingredients are evenly combined and the icing becomes light and fluffy like whipped cream. Use the icing immediately. Spread the flour buttercream or cooked cream cheese icing on cakes, cupcakes, pancakes, or any other desserts you like. Alternately, store it in the refrigerator for a couple hours until you're ready to use it. You can refrigerate this icing overnight. Before using, allow it to warm to room temperature, then beat it again to the proper consistency. Creating a Brown Sugar Icing Cream the sugars together with the cream and butter. Whisk the ingredients in a medium saucepan and heat it over medium heat. Stir constantly so that the sugar doesn’t burn and crystallize. You can use evaporated milk instead of cream. Bring the mixture to a boil. As soon as it boils, set the timer for 2.5 minutes. Continue stirring the mixture the entire time it’s boiling. Remove it from the heat as soon as the timer is up. Boiling the mixture for 2.5 minutes allows the sugars to begin caramelizing. Add the baking powder and vanilla. Beat the mixture on high speed with electric beaters for six to eight minutes, until it becomes smooth, light, fluffy, and the perfect consistency to spread onto cakes or other desserts. The purpose of the baking soda is to prevent the sugar from hardening. You can also beat the mixture in a stand mixture. Once the sugar mixture boils, add the baking soda and vanilla and transfer it to the stand mixer bowl. Whipping up a Meringue-Style Icing Combine all the ingredients. In a medium mixing bowl, whisk together sugar, egg whites, and salt. Make sure the mixing bowl is heat-proof, as you will be heating it in a double boiler-style. If you have a stand mixer, remove the bowl and whisk the ingredients together right in the bowl. The purpose of the salt in this recipe is to break down the egg albumen, meaning the icing won’t have an eggy taste. Heat the mixture over a pot of boiling water. Put one to two inches (2.5 to 5 cm) of water into the bottom of a medium saucepan. Bring it to a boil over medium–high heat. When the water is boiling, place the mixing bowl over the pot in double boiler-style. Whisk the mixture constantly for about seven minutes. The mixture is done when the eggs are heated through and become thin and runny. Beat the mixture. Remove the bowl from heat. Immediately begin beating the mixture on high speed, and continue until the icing becomes thick and fluffy, about five to ten minutes. The icing will be the consistency of shaving cream when it’s ready, and it will hold its shape when you pull the whisk out.",
    "sentences": [
        " Grinding Granulated Sugar Pick a type of sugar.",
        "Choose granulated white sugar, if you have it.",
        "Alternately, you can use coconut sugar, brown sugar or cane sugar.",
        "Use only a cup of sugar at a time.",
        "Refined white sugar, when ground, has the closest texture to icing sugar.",
        "Breaking down more than a cup at a time won’t produce results as even in consistency.",
        "Add cornstarch, if desired.",
        "Combine cornstarch with granulated sugar if you’re going to store the sugar.",
        "Cornstarch helps prevent clumps so your sugar maintains a powdered consistency.",
        "If you plan to use the sugar right away, cornstarch isn’t necessary.",
        "If you’re low on cornstarch, one teaspoon (six grams) will work.",
        "Pulse or grind the sugar for about two minutes.",
        "Pour the sugar into a glass blender or food processor.",
        "Add cornstarch, if desired.",
        "Pulse it for about two minutes.",
        "Alternately, you can use a spice grinder or coffee grinder, but be aware these may absorb flavor from previously-used spices or coffee.",
        "You may want to avoid using a plastic blender.",
        "It’s unlikely – but possible – that sugar crystals may cause scratches to a plastic appliance.",
        "If you’re using a blender or food processor with multiple settings, choose “pulse” or “blend.” Stir the sugar with a spatula.",
        "Wipe the spatula along the inside of the blender.",
        "Mix the sugar well so that it will blend and break down evenly.",
        "Pulse the sugar for two to three more minutes.",
        "Turn off and unplug the appliance, if applicable.",
        "Pick up a bit of sugar in your fingers and feel the texture.",
        "Resume grinding the sugar if it feels gritty, until its texture is powdery.",
        "The sugar is done when it looks fine-grained and fluffy like confectioners’ sugar.",
        "Sift the sugar into a bowl.",
        "Stir the sugar with a fork.",
        "Place a mesh strainer over a bowl.",
        "Spoon the sugar into the strainer.",
        "Tap the side of the sieve repeatedly to sift the sugar into the bowl.",
        "Sifting aerates the sugar so that it’s lighter, fluffier and clump-free.",
        "If you don’t have a sifter, you can use a tea strainer or colander.",
        "Alternately, you can aerate the sugar by mixing it with a wire whisk.",
        "Substitute your ground sugar for icing sugar.",
        "Use your newly ground sugar in place of confectioners’ sugar in your favorite icing recipe.",
        "Make cake icing, such as buttercream or cream cheese icing.",
        "Frost cupcakes with peanut butter or berry icing.",
        "Or hold a gingerbread house together with royal icing!",
        "For a simple icing, combine a cup (220 g) of powdered sugar with a tablespoon (15 ml) of milk and 1/4 teaspoon (1 ml) of flavoring, such as vanilla extract, rum or lemon juice.",
        "Making Flour Icing Heat the flour and milk together.",
        "Whisk flour and milk together in a small saucepan over medium heat.",
        "Stir constantly until the mixture thickens to the consistency of pudding or thick batter.",
        "Remove it from the heat and allow it to cool to room temperature.",
        "The flour icing technique can be used to make either flour buttercream icing or cooked cream cheese icing.",
        "Use butter to make flour buttercream, and cream cheese to make cream cheese icing.",
        "This icing recipe will make enough for 24 cupcakes, or two 8-inch (20-cm) cakes.",
        "Cream together the butter and sugar.",
        "In a medium bowl, cream the butter or cream cheese and sugar with electric beaters or in a stand mixer.",
        "Beat on high speed for about five minutes, until the mixture becomes smooth, light, and fluffy.",
        "If you don’t have a stand mixer or electric beaters, beat the mixture vigorously with a whisk.",
        "Combine the two mixtures.",
        "When the milk and flour mixture has cooled to room temperature, whisk in the vanilla.",
        "Add the milk and flour mixture to the creamed sugar.",
        "Beat the mixture on high speed for six to eight minutes.",
        "Scrape down the sides of the bowl as needed.",
        "The mixture is done blending when the ingredients are evenly combined and the icing becomes light and fluffy like whipped cream.",
        "Use the icing immediately.",
        "Spread the flour buttercream or cooked cream cheese icing on cakes, cupcakes, pancakes, or any other desserts you like.",
        "Alternately, store it in the refrigerator for a couple hours until you're ready to use it.",
        "You can refrigerate this icing overnight.",
        "Before using, allow it to warm to room temperature, then beat it again to the proper consistency.",
        "Creating a Brown Sugar Icing Cream the sugars together with the cream and butter.",
        "Whisk the ingredients in a medium saucepan and heat it over medium heat.",
        "Stir constantly so that the sugar doesn’t burn and crystallize.",
        "You can use evaporated milk instead of cream.",
        "Bring the mixture to a boil.",
        "As soon as it boils, set the timer for 2.5 minutes.",
        "Continue stirring the mixture the entire time it’s boiling.",
        "Remove it from the heat as soon as the timer is up.",
        "Boiling the mixture for 2.5 minutes allows the sugars to begin caramelizing.",
        "Add the baking powder and vanilla.",
        "Beat the mixture on high speed with electric beaters for six to eight minutes, until it becomes smooth, light, fluffy, and the perfect consistency to spread onto cakes or other desserts.",
        "The purpose of the baking soda is to prevent the sugar from hardening.",
        "You can also beat the mixture in a stand mixture.",
        "Once the sugar mixture boils, add the baking soda and vanilla and transfer it to the stand mixer bowl.",
        "Whipping up a Meringue-Style Icing Combine all the ingredients.",
        "In a medium mixing bowl, whisk together sugar, egg whites, and salt.",
        "Make sure the mixing bowl is heat-proof, as you will be heating it in a double boiler-style.",
        "If you have a stand mixer, remove the bowl and whisk the ingredients together right in the bowl.",
        "The purpose of the salt in this recipe is to break down the egg albumen, meaning the icing won’t have an eggy taste.",
        "Heat the mixture over a pot of boiling water.",
        "Put one to two inches (2.5 to 5 cm) of water into the bottom of a medium saucepan.",
        "Bring it to a boil over medium–high heat.",
        "When the water is boiling, place the mixing bowl over the pot in double boiler-style.",
        "Whisk the mixture constantly for about seven minutes.",
        "The mixture is done when the eggs are heated through and become thin and runny.",
        "Beat the mixture.",
        "Remove the bowl from heat.",
        "Immediately begin beating the mixture on high speed, and continue until the icing becomes thick and fluffy, about five to ten minutes.",
        "The icing will be the consistency of shaving cream when it’s ready, and it will hold its shape when you pull the whisk out."
    ]
}