{
    "title": "How to Draw Manga Characters",
    "url": "https://www.wikihow.com/Draw-Manga-Characters",
    "category_hierarchy": [
        "Arts and Entertainment"
    ],
    "steps": [
        {
            "headline": "Start with the basic frame, lines indicating the bones of your person and dots representing joints.",
            "description": "For examples, buy one of those modeling dolls from a craft store or look in the mirror. Making your pose realistic is important, but start of with something basic, a person standing with hands behind their back. Draw a large circle for the hips, the legs connected on."
        },
        {
            "headline": "Draw an oblong/egg shape for the head.",
            "description": ""
        },
        {
            "headline": "Add some flesh.",
            "description": "Draw circles/oblongs around your lines, making sure again it's realistic. If you're a man, start off drawing men, if you're a woman start by drawing a woman. Start off according to your gender and learn to know the male/female body better before you draw any boy/girl characters. Turn your dots into larger circles, for example, around the knees (this eventually makes the kneecap)."
        },
        {
            "headline": "Smooth out your lines and put your waist in.",
            "description": "Women have a slimmer waist while a man's is less defined. Add some lines for the neck and make some triangle shapes for the feet. Erase all the original 'skeletal' lines leaving only your border."
        },
        {
            "headline": "Put on clothing and decoration.",
            "description": "You can basically design any clothes but an important part is the fold. They make the look realistic (that ever so important word again). Start basic though, a simple robe or something. If you need help, get a rag and hang it the same way. Gravity applies to fabric as well so make sure it falls the right way."
        },
        {
            "headline": "Buy a cheap Visual Art diary and do a drawing a day.",
            "description": "You'll soon see the difference."
        }
    ],
    "tyn": [
        "Good pencils",
        "Good eraser",
        "Good work space",
        "Art diary",
        "Anime/manga drawing book"
    ],
    "text": " Start with the basic frame, lines indicating the bones of your person and dots representing joints. For examples, buy one of those modeling dolls from a craft store or look in the mirror. Making your pose realistic is important, but start of with something basic, a person standing with hands behind their back. Draw a large circle for the hips, the legs connected on. Draw an oblong/egg shape for the head.  Add some flesh. Draw circles/oblongs around your lines, making sure again it's realistic. If you're a man, start off drawing men, if you're a woman start by drawing a woman. Start off according to your gender and learn to know the male/female body better before you draw any boy/girl characters. Turn your dots into larger circles, for example, around the knees (this eventually makes the kneecap). Smooth out your lines and put your waist in. Women have a slimmer waist while a man's is less defined. Add some lines for the neck and make some triangle shapes for the feet. Erase all the original 'skeletal' lines leaving only your border. Put on clothing and decoration. You can basically design any clothes but an important part is the fold. They make the look realistic (that ever so important word again). Start basic though, a simple robe or something. If you need help, get a rag and hang it the same way. Gravity applies to fabric as well so make sure it falls the right way. Buy a cheap Visual Art diary and do a drawing a day. You'll soon see the difference.",
    "sentences": [
        " Start with the basic frame, lines indicating the bones of your person and dots representing joints.",
        "For examples, buy one of those modeling dolls from a craft store or look in the mirror.",
        "Making your pose realistic is important, but start of with something basic, a person standing with hands behind their back.",
        "Draw a large circle for the hips, the legs connected on.",
        "Draw an oblong/egg shape for the head.",
        "Add some flesh.",
        "Draw circles/oblongs around your lines, making sure again it's realistic.",
        "If you're a man, start off drawing men, if you're a woman start by drawing a woman.",
        "Start off according to your gender and learn to know the male/female body better before you draw any boy/girl characters.",
        "Turn your dots into larger circles, for example, around the knees (this eventually makes the kneecap).",
        "Smooth out your lines and put your waist in.",
        "Women have a slimmer waist while a man's is less defined.",
        "Add some lines for the neck and make some triangle shapes for the feet.",
        "Erase all the original 'skeletal' lines leaving only your border.",
        "Put on clothing and decoration.",
        "You can basically design any clothes but an important part is the fold.",
        "They make the look realistic (that ever so important word again).",
        "Start basic though, a simple robe or something.",
        "If you need help, get a rag and hang it the same way.",
        "Gravity applies to fabric as well so make sure it falls the right way.",
        "Buy a cheap Visual Art diary and do a drawing a day.",
        "You'll soon see the difference."
    ]
}