{
    "title": "How to Read Minds (As a Magic Trick)",
    "url": "https://www.wikihow.com/Read-Minds-(As-a-Magic-Trick)",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Performing Arts",
        "Magic and Illusion Performance",
        "Mentalism"
    ],
    "methods": [
        {
            "name": "Name the Dead",
            "steps": [
                {
                    "headline": "Ask for three volunteers.",
                    "description": "This is a good trick to perform in front of a crowd, since you'll need three volunteers to do it correctly. Be sure to get exactly three; the trick won't resonate as well with two, and it simply won't work with four. It's best to choose people you don't know well, so the audience won't think you planned the trick together before the show."
                },
                {
                    "headline": "Give each volunteer a slip of paper.",
                    "description": "This part of the trick is very important. Take a sheet of paper and tear it into thirds. Give the first third, which will have one straight side and one jagged side, to the first person. Give the second piece, which will have two jagged sides, to the second person. Give the third piece, which will also have one straight side and one jagged side, to the third person. This trick can't be conducted properly unless you rip one piece of paper into thirds, so make sure you prepare for it by having a large sheet of paper on hand. Pay attention to the person who has the piece that is ripped on both sides. This piece of paper is the key to the trick."
                },
                {
                    "headline": "Tell each person to write down a name.",
                    "description": "The first person should write down the name of a person who is alive. The second person (with the double-ripped paper) should write down the name of a person who is dead. The third person should write down the name of a person who is alive."
                },
                {
                    "headline": "Announce that you will draw the name of the dead person.",
                    "description": "Make a show of leaving the room or turning your back while the volunteers write the names on their slips of paper. Without your touching them, the volunteers should place their slips of paper in a hat or box."
                },
                {
                    "headline": "Draw the name.",
                    "description": "Tell the volunteers to concentrate hard on the name they wrote down. Hold the hat or box above your head, or have someone else hold it, so it's clear that you can't see inside. Tell the audience that you already know what the name of the dead person is, and look knowingly at the volunteer who wrote it down, as though you're reading his or her mind. Finally, put your hand in the hat and feel around for the slip of paper that has two rough edges. Draw it out with a flourish and read the name to everyone's amazement."
                }
            ]
        },
        {
            "name": "Predict the Luckiest",
            "steps": [
                {
                    "headline": "Ask audience members to call out their names.",
                    "description": "Announce that you're writing down each name on a notecard and placing them all in a hat. At the end of the trick, you'll predict which audience member is the luckiest one in the audience, and you'll write your prediction on a chalkboard or slate. The name of the luckiest person will then by drawn from a hat by a volunteer, and it will match your prediction. If you have a large audience, you can pick the first ten people to volunteer their names; for a smaller audience, everyone can participate."
                },
                {
                    "headline": "Write down the same name on each card.",
                    "description": "When the first person calls out his or her name, write it down on a card. Write the same name when the second person calls out his or her name. Keep writing the same name on every card even though people are calling out a different name each time. Put all the cards in a hat as you finish writing on them. Make sure no volunteers are too close to you while you're writing down the names, or they'll see what you're up to. If you're doing the trick at a birthday party or an event to honor someone, you could also simply write down the name of the honored person on every card, to ensure that he or she is named the \"luckiest\" person there. Instead of saying you're predicting who is the luckiest person, you could say you're predicting who will get married next, who's the most mysterious person, or who's the unluckiest person. Tailor it to the event and the people."
                },
                {
                    "headline": "Write your prediction on a chalkboard or slate.",
                    "description": "After everyone is finished speaking and the cards are in the hat, write the special person's name down in large letters and show it to the audience. Announce that you know without a doubt that this person is the luckiest one in the room."
                },
                {
                    "headline": "Have a volunteer draw a name from the hat.",
                    "description": "Hold the hat above the volunteer's head and ask him or her to draw a name and announce it to the audience. People will gasp when they hear the name. Make sure you put the remaining cards away immediately so people won't see how you did the trick."
                }
            ]
        },
        {
            "name": "Pick a Card",
            "steps": [
                {
                    "headline": "Cut a peephole in a box of cards.",
                    "description": "You just need a standard deck of cards that comes in a cardboard box. Remove the cards from the box and use a scissors to snip a small hole in one of the corners of the back of the box. Put the cards back in the box and take a look at the hole. You should be able to see the upper corner of the last card in the deck, revealing which card it is. Come to your show with the card box already prepared. Keep the side with the hole away from the audience as you prepare to perform the trick. If you can find a box that has a picture of a playing card printed on it, as many standard decks do, all the better - the hole will barely be visible."
                },
                {
                    "headline": "Ask an audience member to pick a card.",
                    "description": "Start by having the person shuffle the cards a few times. Tell him or her to pick a card and show it to the audience while your back is turned, then place it at the bottom of the deck of cards. Hold out the box of cards, hole side facing your palm, and tell the person to put the cards into the box. He or she will almost certainly place the cards into the box face down so that you won't be able to see the chosen card. If not, tell him or her to start over and pick a new card."
                },
                {
                    "headline": "Make a show of reading the volunteer's mind.",
                    "description": "Hold up the deck of cards, with the hole facing you, and announce that you're reading the volunteer's mind to determine what he or she picked. Look through the hole to see what the card is, then close your eyes and tilt your head toward the ceiling. Announce, \"I've got it! It is (the name of the card)!\""
                },
                {
                    "headline": "Confirm your reading by showing the card.",
                    "description": "Pull the deck of cards from the box, taking care not to show the side with the hole, and hold it up to the audience so that they can see the bottom card."
                }
            ]
        },
        {
            "name": "The Dictionary Trick",
            "steps": [
                {
                    "headline": "Look up the 9th word on page 108 in your dictionary before doing this trick.",
                    "description": "Write this word on a slip of paper and slip it into an envelope. Put the envelope in your pocket. Note that this is the most important part of the trick. Without carrying out this step, you will not be able to perform the trick."
                },
                {
                    "headline": "Ask for two volunteers when you arrive at the show.",
                    "description": "Give one the dictionary, and the other a calculator."
                },
                {
                    "headline": "Ask the volunteer with the calculator to pick any three digit number.",
                    "description": "The only stipulation is that no two digits can repeat. For example, he or she might choose the number 365. The digits must be different - you cannot have a number like 222."
                },
                {
                    "headline": "Ask them to reverse the number (e.g.",
                    "description": "563). Then, ask them to take away the bigger number from the smaller number (e.g. 563- 365= 198) Finally, ask them to reverse that number (e.g. 891)."
                },
                {
                    "headline": "Ask them to add the last two number together.",
                    "description": "In our example, 198+891= 1,089. The result will always be 1,089 no matter what number you choose in the first place."
                },
                {
                    "headline": "Now ask them what the first three digits of the number are.",
                    "description": "These will always be 108. Ask the volunteer with the dictionary to turn to page 108."
                },
                {
                    "headline": "Now ask the other volunteer what the last digit of the number was.",
                    "description": "This will always be 9."
                },
                {
                    "headline": "Ask the volunteer with dictionary to stare at the ninth word down.",
                    "description": "Stare at the volunteer and make a show as if you are reading their mind, then, when you think you are ready, pull out the envelope and reveal the strip of paper. The audience will be astonished as you show the same word as the volunteer called out!"
                }
            ]
        },
        {
            "name": "Guessing a Volunteer's Thoughts",
            "steps": [
                {
                    "headline": "Tell the spectator to think of a number between 1 and 5.",
                    "description": "This awesome trick exploits certain common quirks in human psychology. Though you give your spectator choices that seem like they have many different possible answers, most people will guess exactly the same thing, which, at the end of the trick, you'll guess, to the likely amazement of your volunteer. Start by asking the volunteer to think of any number between 1 and 5, but not to reveal it."
                },
                {
                    "headline": "Ask the volunteer to multiply the number by nine, then add the two digits of the answer.",
                    "description": "For example, if your volunteer picked the number 5, 9 × 5 = 45, so s/he will add 4 + 5 to get 9. This should be done mentally, not out loud."
                },
                {
                    "headline": "Ask the volunteer to subtract 5 from their number.",
                    "description": "9 - 5 = 4, so, at this point, your volunteer will have the number 4 in his or her head."
                },
                {
                    "headline": "Tell the volunteer to find the letter in the alphabet that corresponds to that number.",
                    "description": "For example, the number 1 corresponds to A, 2 to B, etc. At this point, they will have the number 4, regardless of what number they initially picked, so they will pick the letter D."
                },
                {
                    "headline": "Tell the volunteer to pick a country that starts with that letter.",
                    "description": "Most of the time, people will think of the country Denmark."
                },
                {
                    "headline": "Ask the volunteer to think of an animal that starts with the last letter of the country's name.",
                    "description": "The last letter in \"Denmark\" is \"K\", and most people will associate the letter K with kangaroos."
                },
                {
                    "headline": "Ask the volunteer to think of a color that starts with the last letter of the animal's name.",
                    "description": "The last letter in \"Kangaroo\" is \"O\". Orange is the only common color that starts with O."
                },
                {
                    "headline": "Pretend to read your subject's mind.",
                    "description": "Make a big show of squinting and pressing your fingers to your temples. Tell your spectator that you are searching deep in the depths of his or her psyche."
                },
                {
                    "headline": "Act puzzled and tell your subject that you're seeing an Orange Kangaroo in Denmark.",
                    "description": "Nine times out of ten, your volunteer will react with amazement, though occasionally you'll get someone who picks \"Koala\" or \"Djibouti\" or another answer."
                }
            ]
        }
    ],
    "tyn": [
        "Paper and pencils",
        "A hat",
        "A slate and chalk",
        "A deck of cards",
        "An Audience",
        "3 volunteers",
        "Dictionary",
        "Envelope"
    ],
    "text": " Name the Dead Ask for three volunteers. This is a good trick to perform in front of a crowd, since you'll need three volunteers to do it correctly. Be sure to get exactly three; the trick won't resonate as well with two, and it simply won't work with four. It's best to choose people you don't know well, so the audience won't think you planned the trick together before the show. Give each volunteer a slip of paper. This part of the trick is very important. Take a sheet of paper and tear it into thirds. Give the first third, which will have one straight side and one jagged side, to the first person. Give the second piece, which will have two jagged sides, to the second person. Give the third piece, which will also have one straight side and one jagged side, to the third person. This trick can't be conducted properly unless you rip one piece of paper into thirds, so make sure you prepare for it by having a large sheet of paper on hand. Pay attention to the person who has the piece that is ripped on both sides. This piece of paper is the key to the trick. Tell each person to write down a name. The first person should write down the name of a person who is alive. The second person (with the double-ripped paper) should write down the name of a person who is dead. The third person should write down the name of a person who is alive. Announce that you will draw the name of the dead person. Make a show of leaving the room or turning your back while the volunteers write the names on their slips of paper. Without your touching them, the volunteers should place their slips of paper in a hat or box. Draw the name. Tell the volunteers to concentrate hard on the name they wrote down. Hold the hat or box above your head, or have someone else hold it, so it's clear that you can't see inside. Tell the audience that you already know what the name of the dead person is, and look knowingly at the volunteer who wrote it down, as though you're reading his or her mind. Finally, put your hand in the hat and feel around for the slip of paper that has two rough edges. Draw it out with a flourish and read the name to everyone's amazement. Predict the Luckiest Ask audience members to call out their names. Announce that you're writing down each name on a notecard and placing them all in a hat. At the end of the trick, you'll predict which audience member is the luckiest one in the audience, and you'll write your prediction on a chalkboard or slate. The name of the luckiest person will then by drawn from a hat by a volunteer, and it will match your prediction. If you have a large audience, you can pick the first ten people to volunteer their names; for a smaller audience, everyone can participate. Write down the same name on each card. When the first person calls out his or her name, write it down on a card. Write the same name when the second person calls out his or her name. Keep writing the same name on every card even though people are calling out a different name each time. Put all the cards in a hat as you finish writing on them. Make sure no volunteers are too close to you while you're writing down the names, or they'll see what you're up to. If you're doing the trick at a birthday party or an event to honor someone, you could also simply write down the name of the honored person on every card, to ensure that he or she is named the \"luckiest\" person there. Instead of saying you're predicting who is the luckiest person, you could say you're predicting who will get married next, who's the most mysterious person, or who's the unluckiest person. Tailor it to the event and the people. Write your prediction on a chalkboard or slate. After everyone is finished speaking and the cards are in the hat, write the special person's name down in large letters and show it to the audience. Announce that you know without a doubt that this person is the luckiest one in the room. Have a volunteer draw a name from the hat. Hold the hat above the volunteer's head and ask him or her to draw a name and announce it to the audience. People will gasp when they hear the name. Make sure you put the remaining cards away immediately so people won't see how you did the trick. Pick a Card Cut a peephole in a box of cards. You just need a standard deck of cards that comes in a cardboard box. Remove the cards from the box and use a scissors to snip a small hole in one of the corners of the back of the box. Put the cards back in the box and take a look at the hole. You should be able to see the upper corner of the last card in the deck, revealing which card it is. Come to your show with the card box already prepared. Keep the side with the hole away from the audience as you prepare to perform the trick. If you can find a box that has a picture of a playing card printed on it, as many standard decks do, all the better - the hole will barely be visible. Ask an audience member to pick a card. Start by having the person shuffle the cards a few times. Tell him or her to pick a card and show it to the audience while your back is turned, then place it at the bottom of the deck of cards. Hold out the box of cards, hole side facing your palm, and tell the person to put the cards into the box. He or she will almost certainly place the cards into the box face down so that you won't be able to see the chosen card. If not, tell him or her to start over and pick a new card. Make a show of reading the volunteer's mind. Hold up the deck of cards, with the hole facing you, and announce that you're reading the volunteer's mind to determine what he or she picked. Look through the hole to see what the card is, then close your eyes and tilt your head toward the ceiling. Announce, \"I've got it! It is (the name of the card)!\" Confirm your reading by showing the card. Pull the deck of cards from the box, taking care not to show the side with the hole, and hold it up to the audience so that they can see the bottom card. The Dictionary Trick Look up the 9th word on page 108 in your dictionary before doing this trick. Write this word on a slip of paper and slip it into an envelope. Put the envelope in your pocket. Note that this is the most important part of the trick. Without carrying out this step, you will not be able to perform the trick. Ask for two volunteers when you arrive at the show. Give one the dictionary, and the other a calculator. Ask the volunteer with the calculator to pick any three digit number. The only stipulation is that no two digits can repeat. For example, he or she might choose the number 365. The digits must be different - you cannot have a number like 222. Ask them to reverse the number (e.g. 563). Then, ask them to take away the bigger number from the smaller number (e.g. 563- 365= 198) Finally, ask them to reverse that number (e.g. 891). Ask them to add the last two number together. In our example, 198+891= 1,089. The result will always be 1,089 no matter what number you choose in the first place. Now ask them what the first three digits of the number are. These will always be 108. Ask the volunteer with the dictionary to turn to page 108. Now ask the other volunteer what the last digit of the number was. This will always be 9. Ask the volunteer with dictionary to stare at the ninth word down. Stare at the volunteer and make a show as if you are reading their mind, then, when you think you are ready, pull out the envelope and reveal the strip of paper. The audience will be astonished as you show the same word as the volunteer called out! Guessing a Volunteer's Thoughts Tell the spectator to think of a number between 1 and 5. This awesome trick exploits certain common quirks in human psychology. Though you give your spectator choices that seem like they have many different possible answers, most people will guess exactly the same thing, which, at the end of the trick, you'll guess, to the likely amazement of your volunteer. Start by asking the volunteer to think of any number between 1 and 5, but not to reveal it. Ask the volunteer to multiply the number by nine, then add the two digits of the answer. For example, if your volunteer picked the number 5, 9 × 5 = 45, so s/he will add 4 + 5 to get 9. This should be done mentally, not out loud. Ask the volunteer to subtract 5 from their number. 9 - 5 = 4, so, at this point, your volunteer will have the number 4 in his or her head. Tell the volunteer to find the letter in the alphabet that corresponds to that number. For example, the number 1 corresponds to A, 2 to B, etc. At this point, they will have the number 4, regardless of what number they initially picked, so they will pick the letter D. Tell the volunteer to pick a country that starts with that letter. Most of the time, people will think of the country Denmark. Ask the volunteer to think of an animal that starts with the last letter of the country's name. The last letter in \"Denmark\" is \"K\", and most people will associate the letter K with kangaroos. Ask the volunteer to think of a color that starts with the last letter of the animal's name. The last letter in \"Kangaroo\" is \"O\". Orange is the only common color that starts with O. Pretend to read your subject's mind. Make a big show of squinting and pressing your fingers to your temples. Tell your spectator that you are searching deep in the depths of his or her psyche. Act puzzled and tell your subject that you're seeing an Orange Kangaroo in Denmark. Nine times out of ten, your volunteer will react with amazement, though occasionally you'll get someone who picks \"Koala\" or \"Djibouti\" or another answer.",
    "sentences": [
        " Name the Dead Ask for three volunteers.",
        "This is a good trick to perform in front of a crowd, since you'll need three volunteers to do it correctly.",
        "Be sure to get exactly three; the trick won't resonate as well with two, and it simply won't work with four.",
        "It's best to choose people you don't know well, so the audience won't think you planned the trick together before the show.",
        "Give each volunteer a slip of paper.",
        "This part of the trick is very important.",
        "Take a sheet of paper and tear it into thirds.",
        "Give the first third, which will have one straight side and one jagged side, to the first person.",
        "Give the second piece, which will have two jagged sides, to the second person.",
        "Give the third piece, which will also have one straight side and one jagged side, to the third person.",
        "This trick can't be conducted properly unless you rip one piece of paper into thirds, so make sure you prepare for it by having a large sheet of paper on hand.",
        "Pay attention to the person who has the piece that is ripped on both sides.",
        "This piece of paper is the key to the trick.",
        "Tell each person to write down a name.",
        "The first person should write down the name of a person who is alive.",
        "The second person (with the double-ripped paper) should write down the name of a person who is dead.",
        "The third person should write down the name of a person who is alive.",
        "Announce that you will draw the name of the dead person.",
        "Make a show of leaving the room or turning your back while the volunteers write the names on their slips of paper.",
        "Without your touching them, the volunteers should place their slips of paper in a hat or box.",
        "Draw the name.",
        "Tell the volunteers to concentrate hard on the name they wrote down.",
        "Hold the hat or box above your head, or have someone else hold it, so it's clear that you can't see inside.",
        "Tell the audience that you already know what the name of the dead person is, and look knowingly at the volunteer who wrote it down, as though you're reading his or her mind.",
        "Finally, put your hand in the hat and feel around for the slip of paper that has two rough edges.",
        "Draw it out with a flourish and read the name to everyone's amazement.",
        "Predict the Luckiest Ask audience members to call out their names.",
        "Announce that you're writing down each name on a notecard and placing them all in a hat.",
        "At the end of the trick, you'll predict which audience member is the luckiest one in the audience, and you'll write your prediction on a chalkboard or slate.",
        "The name of the luckiest person will then by drawn from a hat by a volunteer, and it will match your prediction.",
        "If you have a large audience, you can pick the first ten people to volunteer their names; for a smaller audience, everyone can participate.",
        "Write down the same name on each card.",
        "When the first person calls out his or her name, write it down on a card.",
        "Write the same name when the second person calls out his or her name.",
        "Keep writing the same name on every card even though people are calling out a different name each time.",
        "Put all the cards in a hat as you finish writing on them.",
        "Make sure no volunteers are too close to you while you're writing down the names, or they'll see what you're up to.",
        "If you're doing the trick at a birthday party or an event to honor someone, you could also simply write down the name of the honored person on every card, to ensure that he or she is named the \"luckiest\" person there.",
        "Instead of saying you're predicting who is the luckiest person, you could say you're predicting who will get married next, who's the most mysterious person, or who's the unluckiest person.",
        "Tailor it to the event and the people.",
        "Write your prediction on a chalkboard or slate.",
        "After everyone is finished speaking and the cards are in the hat, write the special person's name down in large letters and show it to the audience.",
        "Announce that you know without a doubt that this person is the luckiest one in the room.",
        "Have a volunteer draw a name from the hat.",
        "Hold the hat above the volunteer's head and ask him or her to draw a name and announce it to the audience.",
        "People will gasp when they hear the name.",
        "Make sure you put the remaining cards away immediately so people won't see how you did the trick.",
        "Pick a Card Cut a peephole in a box of cards.",
        "You just need a standard deck of cards that comes in a cardboard box.",
        "Remove the cards from the box and use a scissors to snip a small hole in one of the corners of the back of the box.",
        "Put the cards back in the box and take a look at the hole.",
        "You should be able to see the upper corner of the last card in the deck, revealing which card it is.",
        "Come to your show with the card box already prepared.",
        "Keep the side with the hole away from the audience as you prepare to perform the trick.",
        "If you can find a box that has a picture of a playing card printed on it, as many standard decks do, all the better - the hole will barely be visible.",
        "Ask an audience member to pick a card.",
        "Start by having the person shuffle the cards a few times.",
        "Tell him or her to pick a card and show it to the audience while your back is turned, then place it at the bottom of the deck of cards.",
        "Hold out the box of cards, hole side facing your palm, and tell the person to put the cards into the box.",
        "He or she will almost certainly place the cards into the box face down so that you won't be able to see the chosen card.",
        "If not, tell him or her to start over and pick a new card.",
        "Make a show of reading the volunteer's mind.",
        "Hold up the deck of cards, with the hole facing you, and announce that you're reading the volunteer's mind to determine what he or she picked.",
        "Look through the hole to see what the card is, then close your eyes and tilt your head toward the ceiling.",
        "Announce, \"I've got it!",
        "It is (the name of the card)!\"",
        "Confirm your reading by showing the card.",
        "Pull the deck of cards from the box, taking care not to show the side with the hole, and hold it up to the audience so that they can see the bottom card.",
        "The Dictionary Trick Look up the 9th word on page 108 in your dictionary before doing this trick.",
        "Write this word on a slip of paper and slip it into an envelope.",
        "Put the envelope in your pocket.",
        "Note that this is the most important part of the trick.",
        "Without carrying out this step, you will not be able to perform the trick.",
        "Ask for two volunteers when you arrive at the show.",
        "Give one the dictionary, and the other a calculator.",
        "Ask the volunteer with the calculator to pick any three digit number.",
        "The only stipulation is that no two digits can repeat.",
        "For example, he or she might choose the number 365.",
        "The digits must be different - you cannot have a number like 222.",
        "Ask them to reverse the number (e.g.",
        "563).",
        "Then, ask them to take away the bigger number from the smaller number (e.g.",
        "563- 365= 198) Finally, ask them to reverse that number (e.g.",
        "891).",
        "Ask them to add the last two number together.",
        "In our example, 198+891= 1,089.",
        "The result will always be 1,089 no matter what number you choose in the first place.",
        "Now ask them what the first three digits of the number are.",
        "These will always be 108.",
        "Ask the volunteer with the dictionary to turn to page 108.",
        "Now ask the other volunteer what the last digit of the number was.",
        "This will always be 9.",
        "Ask the volunteer with dictionary to stare at the ninth word down.",
        "Stare at the volunteer and make a show as if you are reading their mind, then, when you think you are ready, pull out the envelope and reveal the strip of paper.",
        "The audience will be astonished as you show the same word as the volunteer called out!",
        "Guessing a Volunteer's Thoughts Tell the spectator to think of a number between 1 and 5.",
        "This awesome trick exploits certain common quirks in human psychology.",
        "Though you give your spectator choices that seem like they have many different possible answers, most people will guess exactly the same thing, which, at the end of the trick, you'll guess, to the likely amazement of your volunteer.",
        "Start by asking the volunteer to think of any number between 1 and 5, but not to reveal it.",
        "Ask the volunteer to multiply the number by nine, then add the two digits of the answer.",
        "For example, if your volunteer picked the number 5, 9 × 5 = 45, so s/he will add 4 + 5 to get 9.",
        "This should be done mentally, not out loud.",
        "Ask the volunteer to subtract 5 from their number.",
        "9 - 5 = 4, so, at this point, your volunteer will have the number 4 in his or her head.",
        "Tell the volunteer to find the letter in the alphabet that corresponds to that number.",
        "For example, the number 1 corresponds to A, 2 to B, etc.",
        "At this point, they will have the number 4, regardless of what number they initially picked, so they will pick the letter D. Tell the volunteer to pick a country that starts with that letter.",
        "Most of the time, people will think of the country Denmark.",
        "Ask the volunteer to think of an animal that starts with the last letter of the country's name.",
        "The last letter in \"Denmark\" is \"K\", and most people will associate the letter K with kangaroos.",
        "Ask the volunteer to think of a color that starts with the last letter of the animal's name.",
        "The last letter in \"Kangaroo\" is \"O\".",
        "Orange is the only common color that starts with O. Pretend to read your subject's mind.",
        "Make a big show of squinting and pressing your fingers to your temples.",
        "Tell your spectator that you are searching deep in the depths of his or her psyche.",
        "Act puzzled and tell your subject that you're seeing an Orange Kangaroo in Denmark.",
        "Nine times out of ten, your volunteer will react with amazement, though occasionally you'll get someone who picks \"Koala\" or \"Djibouti\" or another answer."
    ]
}