{
    "title": "How to Keep Discus",
    "url": "https://www.wikihow.com/Keep-Discus",
    "category_hierarchy": [
        "Pets and Animals",
        "Fish",
        "Fish Breeds"
    ],
    "methods": [
        {
            "name": "Setting Up and Maintaining Their Tank",
            "steps": [
                {
                    "headline": "Provide 7–10 US gal (26–38 L) of tank space per fish.",
                    "description": "A group of 4-6 discus fish makes for a good starting point, so your aquarium should be at least 40 US gal (150 L) total. If you think you might add more discus fish in the future, go bigger—this fish thrives in roomy conditions. Larger tanks take more time, effort, and money to maintain, but consider that you may be helping to protect a rather pricey investment in discus fish."
                },
                {
                    "headline": "Invest in a high-quality filter.",
                    "description": "Discus fish must have clean water to thrive, so don’t skimp on the filter! Make comparisons and read reviews to choose the best filter for your needs, and make sure it is capable of filtering the amount of water that’s in your tank. If you have friends with discus fish, or know of any discus breeders in your area, ask them what type of filter they use. There are 3 main types of filters—chemical, mechanical, and biological—and some discus experts believe that biological filters are the best systems for discus fish. They have very porous biological filter media material with good nitrifying bacteria that remove toxins and impurities."
                },
                {
                    "headline": "Keep the water temperature between 84 and 90 °F (29 and 32 °C).",
                    "description": "Discus are a tropical fish, so they thrive in warmer water temperatures. Install a tank thermometer so you can keep a close eye on the temperature, and add a high-quality aquarium heater in order to maintain the ideal temperature range at all times. Check the temperature several times per day. If the water temperature goes above or (especially) below the ideal range for even a few hours, the discus fish may begin to suffer negative health impacts."
                },
                {
                    "headline": "Maintain the water pH between 5.5 and 6.5.",
                    "description": "Discus fish are sensitive to water acidity as well as temperature, so regularly check the water pH to make sure it’s within the ideal range. Use a digital, chemical, or litmus strip tester to check the pH at least twice per week. Add pH-raising or lowering solutions as needed. You can buy pH-raising (baking soda based) and pH-lowering (muriatic acid based) solutions at pet supply retailers."
                },
                {
                    "headline": "Add an overhead light to the tank.",
                    "description": "Discus fish can be quite skittish, and even shadows cast by external light sources can bother them. Install an overhead aquarium light to limit shadows—and to showcase your beautiful fish! Ideally, the aquarium should be kept away from windows, TVs, and other sources of strong and/or intermittent sources of exterior lighting."
                },
                {
                    "headline": "Include lots of foliage and hiding spots (option 1).",
                    "description": "Discus fish are adapted to swim through foliage, and like hiding under logs, rocks, and plants. As they are originally from the Amazon, adding long stem plants and lower foreground plants will make them feel more comfortable. It'll also soften the water and lower the pH level. You can add natural or artificial hiding spots as well. Natural aquarium pebbles can make a good substrate for a discus fish tank."
                },
                {
                    "headline": "Provide an undecorated tank to keep the water cleaner (option 2).",
                    "description": "Despite the breed’s natural inclination toward ample foliage and hiding spots, some discus fish keepers believe the tank should be kept bare in order to maintain cleanliness. And, true enough, if you only have fish and water in the tank, it is easier to maintain optimal aquarium conditions. Unadorned tanks also further highlight the beautiful shapes and colors of discus fish. You’ll have to decide whether it’s worth more cleaning and maintenance to provide an aquarium that more closely resembles their natural habitat."
                },
                {
                    "headline": "Change 20-30% of the water weekly.",
                    "description": "No matter how well your filter works, it’s important to change out a portion of the tank water on a regular basis. This is the only way to ensure the pristine water conditions that discus fish require. Changing the tank water properly can be a bit time-consuming, but it’s time well-spent if you value the health of your discus fish. Don’t change more than 30% of the total volume of the tank water at a time—a greater change can be too much of a shock for sensitive discus fish."
                }
            ]
        },
        {
            "name": "Feeding Discus Fish",
            "steps": [
                {
                    "headline": "Use live or frozen proteins for 50%-plus of the discus’ diet.",
                    "description": "At least half of a discus fish diet should be comprised of live or frozen proteins, such as bloodworms, brine shrimp, and fine pieces of beef heart. Beef heart can be purchased frozen from fish supply retailers. You can also purchase bloodworms and brine shrimp either live or frozen. Discus fish often prefer live bloodworms and brine shrimp, but these are more likely to carry parasites or bacteria. To reduce this possibility, buy high-quality worms and shrimp from a reputable vendor. Otherwise, use frozen worms and shrimp. Rotate among the proteins you use in order to maintain some variety in the diet."
                },
                {
                    "headline": "Supplement live or frozen proteins with high-quality flake fish food.",
                    "description": "While the live or frozen proteins should make up the majority of the discus’ diet, flakes offer some variety as well as supplemental nutritional value. You can add some flakes with each feeding, or use them as a more occasional change-of-pace. Choose high-quality fish flakes, since these typically have a better nutritional profile. Ask your vet or other fish owners for recommendations."
                },
                {
                    "headline": "Feed discus 2-3 times daily, in a calm setting and on a regular schedule.",
                    "description": "Discus fish prefer consistent timing and limited distractions during feeding times. Feed the fish around the same times each day, and prevent distractions such as a loud TV or rowdy kids playing in the room. Juvenile discus fish should eat 3 times per day, while adults should be feed 2 times daily."
                },
                {
                    "headline": "Remove uneaten food right away to keep the water clean.",
                    "description": "When it comes to the amount of food to offer, aim to give enough for the fish to finish in 10-15 minutes. If there is any food left after 15 minutes, use a net to remove it from the tank. This will help keep the water cleaner for longer. If all the food is eaten in 5-10 minutes, offer more per feeding. If there is quite a bit left over after 15 minutes, reduce the amount offered."
                },
                {
                    "headline": "Note any changes in their eating or defecation habits.",
                    "description": "Because discus fish thrive under a consistent routine, any changes should be carefully noted. If a fish is eating substantially less than usual, for example, this could be a sign of illness. Likewise, if the amount or appearance of the feces they produce changes, don’t ignore it. Contact a vet with experience dealing with tropical fish if you have concerns about the health of your discus fish."
                }
            ]
        },
        {
            "name": "Adding Fish and Watching for Illness",
            "steps": [
                {
                    "headline": "Quarantine new fish in a separate tank for 2-4 weeks.",
                    "description": "New fish should always be quarantined before you add them to your main aquarium, and this is particularly important for the sensitive discus fish. Observe the new fish in the quarantine tank for at least 2 weeks, and ideally 4 weeks, before moving them to the main tank. If the new fish show any signs of illness, do not move them into the main tank. The quarantine tank can be a bit smaller than the main tank, but it should be set up in the same manner. The more similar the tanks are, the easier the transition will be."
                },
                {
                    "headline": "Watch for signs of “discus plague” or other illnesses.",
                    "description": "Discuss fish are very susceptible to this somewhat mysterious illness, which is hard to eradicate and often fatal. To identify “discus plague,” look for a darkening of body color, clamping fins, lethargy, a refusal to eat, or other unexplained physical or behavioral changes. You can try quarantining a fish that displays potential symptoms, but it’s hard to prevent the spread of illnesses like “discus plague.” If you suspect a problem, contact a vet quickly."
                },
                {
                    "headline": "Keep at least 4-6 discus in your main tank whenever possible.",
                    "description": "As a shoaling species that naturally congregates in groups, discus are not suited to solitary living. You should keep a minimum group of 4-6 discus in your main tank, and add more discus in groups of 4-6 as well. So, instead of adding 1 or 2 new discus to your aquarium at a time (after quarantine), try adding them in groups of 4-6. Make sure you have sufficient tank space, however—you’ll need at least a 70 US gal (260 L) tank for 10 discus fish. Discus usually get along well, but you may run into instances of aggression and territoriality. In this case, you may need to separate the fish into different aquariums."
                },
                {
                    "headline": "Consider adding tetras as aquarium companions.",
                    "description": "If you’d like to add some fish variety to your discus aquarium, consider adding 6 or more cardinal or bleeding heart tetras. Both of these tetra varieties tend to get along well with discus fish. You won’t need a larger tank to add 6-12 tetras. You may want to increase the tank size by 10 US gal (38 L) for larger numbers of tetras, though. As with any other fish, quarantine tetras before adding them to the main tank."
                },
                {
                    "headline": "Try your hand at breeding discus fish.",
                    "description": "If you keep both males and females in a clean, well-maintained tank, there’s a good chance you’ll eventually see tiny discus eggs in the aquarium. If you want to increase your number of discus, you can choose to keep the hatchlings with their parents or isolate them in a separate tank. If you keep the hatchlings in the main tank, there isn’t much you need to change from your typical routine. You’ll likely lose a greater number of hatchlings through cannibalism this way, however. To isolate the hatchlings, you’ll either have to move the eggs to a separate tank, or temporarily relocate the adult discus. In either case, the secondary tank should be prepared to the same standards as the main tank."
                }
            ]
        }
    ],
    "tyn": [
        "40 US gal (150 L) or larger aquarium",
        "Aquarium thermometer",
        "Aquarium heater",
        "Testing materials and adjusting solutions for water pH",
        "Quarantine and/or isolation aquarium",
        "Live or frozen proteins",
        "High-quality flake food"
    ],
    "text": " Setting Up and Maintaining Their Tank Provide 7–10 US gal (26–38 L) of tank space per fish. A group of 4-6 discus fish makes for a good starting point, so your aquarium should be at least 40 US gal (150 L) total. If you think you might add more discus fish in the future, go bigger—this fish thrives in roomy conditions. Larger tanks take more time, effort, and money to maintain, but consider that you may be helping to protect a rather pricey investment in discus fish. Invest in a high-quality filter. Discus fish must have clean water to thrive, so don’t skimp on the filter! Make comparisons and read reviews to choose the best filter for your needs, and make sure it is capable of filtering the amount of water that’s in your tank. If you have friends with discus fish, or know of any discus breeders in your area, ask them what type of filter they use. There are 3 main types of filters—chemical, mechanical, and biological—and some discus experts believe that biological filters are the best systems for discus fish. They have very porous biological filter media material with good nitrifying bacteria that remove toxins and impurities. Keep the water temperature between 84 and 90 °F (29 and 32 °C). Discus are a tropical fish, so they thrive in warmer water temperatures. Install a tank thermometer so you can keep a close eye on the temperature, and add a high-quality aquarium heater in order to maintain the ideal temperature range at all times. Check the temperature several times per day. If the water temperature goes above or (especially) below the ideal range for even a few hours, the discus fish may begin to suffer negative health impacts. Maintain the water pH between 5.5 and 6.5. Discus fish are sensitive to water acidity as well as temperature, so regularly check the water pH to make sure it’s within the ideal range. Use a digital, chemical, or litmus strip tester to check the pH at least twice per week. Add pH-raising or lowering solutions as needed. You can buy pH-raising (baking soda based) and pH-lowering (muriatic acid based) solutions at pet supply retailers. Add an overhead light to the tank. Discus fish can be quite skittish, and even shadows cast by external light sources can bother them. Install an overhead aquarium light to limit shadows—and to showcase your beautiful fish! Ideally, the aquarium should be kept away from windows, TVs, and other sources of strong and/or intermittent sources of exterior lighting. Include lots of foliage and hiding spots (option 1). Discus fish are adapted to swim through foliage, and like hiding under logs, rocks, and plants. As they are originally from the Amazon, adding long stem plants and lower foreground plants will make them feel more comfortable. It'll also soften the water and lower the pH level. You can add natural or artificial hiding spots as well. Natural aquarium pebbles can make a good substrate for a discus fish tank. Provide an undecorated tank to keep the water cleaner (option 2). Despite the breed’s natural inclination toward ample foliage and hiding spots, some discus fish keepers believe the tank should be kept bare in order to maintain cleanliness. And, true enough, if you only have fish and water in the tank, it is easier to maintain optimal aquarium conditions. Unadorned tanks also further highlight the beautiful shapes and colors of discus fish. You’ll have to decide whether it’s worth more cleaning and maintenance to provide an aquarium that more closely resembles their natural habitat. Change 20-30% of the water weekly. No matter how well your filter works, it’s important to change out a portion of the tank water on a regular basis. This is the only way to ensure the pristine water conditions that discus fish require. Changing the tank water properly can be a bit time-consuming, but it’s time well-spent if you value the health of your discus fish. Don’t change more than 30% of the total volume of the tank water at a time—a greater change can be too much of a shock for sensitive discus fish. Feeding Discus Fish Use live or frozen proteins for 50%-plus of the discus’ diet. At least half of a discus fish diet should be comprised of live or frozen proteins, such as bloodworms, brine shrimp, and fine pieces of beef heart. Beef heart can be purchased frozen from fish supply retailers. You can also purchase bloodworms and brine shrimp either live or frozen. Discus fish often prefer live bloodworms and brine shrimp, but these are more likely to carry parasites or bacteria. To reduce this possibility, buy high-quality worms and shrimp from a reputable vendor. Otherwise, use frozen worms and shrimp. Rotate among the proteins you use in order to maintain some variety in the diet. Supplement live or frozen proteins with high-quality flake fish food. While the live or frozen proteins should make up the majority of the discus’ diet, flakes offer some variety as well as supplemental nutritional value. You can add some flakes with each feeding, or use them as a more occasional change-of-pace. Choose high-quality fish flakes, since these typically have a better nutritional profile. Ask your vet or other fish owners for recommendations. Feed discus 2-3 times daily, in a calm setting and on a regular schedule. Discus fish prefer consistent timing and limited distractions during feeding times. Feed the fish around the same times each day, and prevent distractions such as a loud TV or rowdy kids playing in the room. Juvenile discus fish should eat 3 times per day, while adults should be feed 2 times daily. Remove uneaten food right away to keep the water clean. When it comes to the amount of food to offer, aim to give enough for the fish to finish in 10-15 minutes. If there is any food left after 15 minutes, use a net to remove it from the tank. This will help keep the water cleaner for longer. If all the food is eaten in 5-10 minutes, offer more per feeding. If there is quite a bit left over after 15 minutes, reduce the amount offered. Note any changes in their eating or defecation habits. Because discus fish thrive under a consistent routine, any changes should be carefully noted. If a fish is eating substantially less than usual, for example, this could be a sign of illness. Likewise, if the amount or appearance of the feces they produce changes, don’t ignore it. Contact a vet with experience dealing with tropical fish if you have concerns about the health of your discus fish. Adding Fish and Watching for Illness Quarantine new fish in a separate tank for 2-4 weeks. New fish should always be quarantined before you add them to your main aquarium, and this is particularly important for the sensitive discus fish. Observe the new fish in the quarantine tank for at least 2 weeks, and ideally 4 weeks, before moving them to the main tank. If the new fish show any signs of illness, do not move them into the main tank. The quarantine tank can be a bit smaller than the main tank, but it should be set up in the same manner. The more similar the tanks are, the easier the transition will be. Watch for signs of “discus plague” or other illnesses. Discuss fish are very susceptible to this somewhat mysterious illness, which is hard to eradicate and often fatal. To identify “discus plague,” look for a darkening of body color, clamping fins, lethargy, a refusal to eat, or other unexplained physical or behavioral changes. You can try quarantining a fish that displays potential symptoms, but it’s hard to prevent the spread of illnesses like “discus plague.” If you suspect a problem, contact a vet quickly. Keep at least 4-6 discus in your main tank whenever possible. As a shoaling species that naturally congregates in groups, discus are not suited to solitary living. You should keep a minimum group of 4-6 discus in your main tank, and add more discus in groups of 4-6 as well. So, instead of adding 1 or 2 new discus to your aquarium at a time (after quarantine), try adding them in groups of 4-6. Make sure you have sufficient tank space, however—you’ll need at least a 70 US gal (260 L) tank for 10 discus fish. Discus usually get along well, but you may run into instances of aggression and territoriality. In this case, you may need to separate the fish into different aquariums. Consider adding tetras as aquarium companions. If you’d like to add some fish variety to your discus aquarium, consider adding 6 or more cardinal or bleeding heart tetras. Both of these tetra varieties tend to get along well with discus fish. You won’t need a larger tank to add 6-12 tetras. You may want to increase the tank size by 10 US gal (38 L) for larger numbers of tetras, though. As with any other fish, quarantine tetras before adding them to the main tank. Try your hand at breeding discus fish. If you keep both males and females in a clean, well-maintained tank, there’s a good chance you’ll eventually see tiny discus eggs in the aquarium. If you want to increase your number of discus, you can choose to keep the hatchlings with their parents or isolate them in a separate tank. If you keep the hatchlings in the main tank, there isn’t much you need to change from your typical routine. You’ll likely lose a greater number of hatchlings through cannibalism this way, however. To isolate the hatchlings, you’ll either have to move the eggs to a separate tank, or temporarily relocate the adult discus. In either case, the secondary tank should be prepared to the same standards as the main tank.",
    "sentences": [
        " Setting Up and Maintaining Their Tank Provide 7–10 US gal (26–38 L) of tank space per fish.",
        "A group of 4-6 discus fish makes for a good starting point, so your aquarium should be at least 40 US gal (150 L) total.",
        "If you think you might add more discus fish in the future, go bigger—this fish thrives in roomy conditions.",
        "Larger tanks take more time, effort, and money to maintain, but consider that you may be helping to protect a rather pricey investment in discus fish.",
        "Invest in a high-quality filter.",
        "Discus fish must have clean water to thrive, so don’t skimp on the filter!",
        "Make comparisons and read reviews to choose the best filter for your needs, and make sure it is capable of filtering the amount of water that’s in your tank.",
        "If you have friends with discus fish, or know of any discus breeders in your area, ask them what type of filter they use.",
        "There are 3 main types of filters—chemical, mechanical, and biological—and some discus experts believe that biological filters are the best systems for discus fish.",
        "They have very porous biological filter media material with good nitrifying bacteria that remove toxins and impurities.",
        "Keep the water temperature between 84 and 90 °F (29 and 32 °C).",
        "Discus are a tropical fish, so they thrive in warmer water temperatures.",
        "Install a tank thermometer so you can keep a close eye on the temperature, and add a high-quality aquarium heater in order to maintain the ideal temperature range at all times.",
        "Check the temperature several times per day.",
        "If the water temperature goes above or (especially) below the ideal range for even a few hours, the discus fish may begin to suffer negative health impacts.",
        "Maintain the water pH between 5.5 and 6.5.",
        "Discus fish are sensitive to water acidity as well as temperature, so regularly check the water pH to make sure it’s within the ideal range.",
        "Use a digital, chemical, or litmus strip tester to check the pH at least twice per week.",
        "Add pH-raising or lowering solutions as needed.",
        "You can buy pH-raising (baking soda based) and pH-lowering (muriatic acid based) solutions at pet supply retailers.",
        "Add an overhead light to the tank.",
        "Discus fish can be quite skittish, and even shadows cast by external light sources can bother them.",
        "Install an overhead aquarium light to limit shadows—and to showcase your beautiful fish!",
        "Ideally, the aquarium should be kept away from windows, TVs, and other sources of strong and/or intermittent sources of exterior lighting.",
        "Include lots of foliage and hiding spots (option 1).",
        "Discus fish are adapted to swim through foliage, and like hiding under logs, rocks, and plants.",
        "As they are originally from the Amazon, adding long stem plants and lower foreground plants will make them feel more comfortable.",
        "It'll also soften the water and lower the pH level.",
        "You can add natural or artificial hiding spots as well.",
        "Natural aquarium pebbles can make a good substrate for a discus fish tank.",
        "Provide an undecorated tank to keep the water cleaner (option 2).",
        "Despite the breed’s natural inclination toward ample foliage and hiding spots, some discus fish keepers believe the tank should be kept bare in order to maintain cleanliness.",
        "And, true enough, if you only have fish and water in the tank, it is easier to maintain optimal aquarium conditions.",
        "Unadorned tanks also further highlight the beautiful shapes and colors of discus fish.",
        "You’ll have to decide whether it’s worth more cleaning and maintenance to provide an aquarium that more closely resembles their natural habitat.",
        "Change 20-30% of the water weekly.",
        "No matter how well your filter works, it’s important to change out a portion of the tank water on a regular basis.",
        "This is the only way to ensure the pristine water conditions that discus fish require.",
        "Changing the tank water properly can be a bit time-consuming, but it’s time well-spent if you value the health of your discus fish.",
        "Don’t change more than 30% of the total volume of the tank water at a time—a greater change can be too much of a shock for sensitive discus fish.",
        "Feeding Discus Fish Use live or frozen proteins for 50%-plus of the discus’ diet.",
        "At least half of a discus fish diet should be comprised of live or frozen proteins, such as bloodworms, brine shrimp, and fine pieces of beef heart.",
        "Beef heart can be purchased frozen from fish supply retailers.",
        "You can also purchase bloodworms and brine shrimp either live or frozen.",
        "Discus fish often prefer live bloodworms and brine shrimp, but these are more likely to carry parasites or bacteria.",
        "To reduce this possibility, buy high-quality worms and shrimp from a reputable vendor.",
        "Otherwise, use frozen worms and shrimp.",
        "Rotate among the proteins you use in order to maintain some variety in the diet.",
        "Supplement live or frozen proteins with high-quality flake fish food.",
        "While the live or frozen proteins should make up the majority of the discus’ diet, flakes offer some variety as well as supplemental nutritional value.",
        "You can add some flakes with each feeding, or use them as a more occasional change-of-pace.",
        "Choose high-quality fish flakes, since these typically have a better nutritional profile.",
        "Ask your vet or other fish owners for recommendations.",
        "Feed discus 2-3 times daily, in a calm setting and on a regular schedule.",
        "Discus fish prefer consistent timing and limited distractions during feeding times.",
        "Feed the fish around the same times each day, and prevent distractions such as a loud TV or rowdy kids playing in the room.",
        "Juvenile discus fish should eat 3 times per day, while adults should be feed 2 times daily.",
        "Remove uneaten food right away to keep the water clean.",
        "When it comes to the amount of food to offer, aim to give enough for the fish to finish in 10-15 minutes.",
        "If there is any food left after 15 minutes, use a net to remove it from the tank.",
        "This will help keep the water cleaner for longer.",
        "If all the food is eaten in 5-10 minutes, offer more per feeding.",
        "If there is quite a bit left over after 15 minutes, reduce the amount offered.",
        "Note any changes in their eating or defecation habits.",
        "Because discus fish thrive under a consistent routine, any changes should be carefully noted.",
        "If a fish is eating substantially less than usual, for example, this could be a sign of illness.",
        "Likewise, if the amount or appearance of the feces they produce changes, don’t ignore it.",
        "Contact a vet with experience dealing with tropical fish if you have concerns about the health of your discus fish.",
        "Adding Fish and Watching for Illness Quarantine new fish in a separate tank for 2-4 weeks.",
        "New fish should always be quarantined before you add them to your main aquarium, and this is particularly important for the sensitive discus fish.",
        "Observe the new fish in the quarantine tank for at least 2 weeks, and ideally 4 weeks, before moving them to the main tank.",
        "If the new fish show any signs of illness, do not move them into the main tank.",
        "The quarantine tank can be a bit smaller than the main tank, but it should be set up in the same manner.",
        "The more similar the tanks are, the easier the transition will be.",
        "Watch for signs of “discus plague” or other illnesses.",
        "Discuss fish are very susceptible to this somewhat mysterious illness, which is hard to eradicate and often fatal.",
        "To identify “discus plague,” look for a darkening of body color, clamping fins, lethargy, a refusal to eat, or other unexplained physical or behavioral changes.",
        "You can try quarantining a fish that displays potential symptoms, but it’s hard to prevent the spread of illnesses like “discus plague.” If you suspect a problem, contact a vet quickly.",
        "Keep at least 4-6 discus in your main tank whenever possible.",
        "As a shoaling species that naturally congregates in groups, discus are not suited to solitary living.",
        "You should keep a minimum group of 4-6 discus in your main tank, and add more discus in groups of 4-6 as well.",
        "So, instead of adding 1 or 2 new discus to your aquarium at a time (after quarantine), try adding them in groups of 4-6.",
        "Make sure you have sufficient tank space, however—you’ll need at least a 70 US gal (260 L) tank for 10 discus fish.",
        "Discus usually get along well, but you may run into instances of aggression and territoriality.",
        "In this case, you may need to separate the fish into different aquariums.",
        "Consider adding tetras as aquarium companions.",
        "If you’d like to add some fish variety to your discus aquarium, consider adding 6 or more cardinal or bleeding heart tetras.",
        "Both of these tetra varieties tend to get along well with discus fish.",
        "You won’t need a larger tank to add 6-12 tetras.",
        "You may want to increase the tank size by 10 US gal (38 L) for larger numbers of tetras, though.",
        "As with any other fish, quarantine tetras before adding them to the main tank.",
        "Try your hand at breeding discus fish.",
        "If you keep both males and females in a clean, well-maintained tank, there’s a good chance you’ll eventually see tiny discus eggs in the aquarium.",
        "If you want to increase your number of discus, you can choose to keep the hatchlings with their parents or isolate them in a separate tank.",
        "If you keep the hatchlings in the main tank, there isn’t much you need to change from your typical routine.",
        "You’ll likely lose a greater number of hatchlings through cannibalism this way, however.",
        "To isolate the hatchlings, you’ll either have to move the eggs to a separate tank, or temporarily relocate the adult discus.",
        "In either case, the secondary tank should be prepared to the same standards as the main tank."
    ]
}