{
    "title": "How to Make a Denim Skirt From Recycled Jeans",
    "url": "https://www.wikihow.com/Make-a-Denim-Skirt-From-Recycled-Jeans",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "methods": [
        {
            "name": "Making a Mini Skirt",
            "steps": [
                {
                    "headline": "Find a pair of jeans that fit you well.",
                    "description": "They can be old and covered with holes, but make sure that they fit you in the waist and hips."
                },
                {
                    "headline": "Cut the pants down to the length you want the skirt to be.",
                    "description": "It would be a very good idea to make the skirt a little longer than you think you want it to be. Remember, it is easier to take away length an to add it again. Set the cut-off pant legs aside for another project. If you want to hem the skirt, cut it 1½ inches (3.81 centimeters) longer than you want it to be. Consider trying the jeans on first, then making a mark with a pen where you want to cut them."
                },
                {
                    "headline": "Cut apart the inseam.",
                    "description": "The inseam is the inside seam on the pant legs. Cut as close as possible to the seam as you can. Be sure to cut the crotch apart as well. The pants should open up on the bottom, almost like a skirt."
                },
                {
                    "headline": "Cut the front and back seams open so that they can lay flat.",
                    "description": "The crotch part on jeans curves so that it can fit your figure better. On a skirt, however, this part needs to lay flat. Cut up along the front and back crotch seams by 1 to 3 inches (2.54 to 7.62 centimeters), or until you reach the end of the curved part. You've cut far enough if you can overlap the cut edges without any buckling."
                },
                {
                    "headline": "Overlap the cut edges to cut the skirt.",
                    "description": "Depending on how short you cut the skirt, you may have a triangular gap in the center, where you cut the pant legs apart. Close this gap as much as possible by moving the two cut edges together and overlapping them. Pin the gap shut, then repeat the process for the back.You can have the bottom inch (2.54 centimeter) or so open. If the bottom of your skirt become too narrow, you will have to add a panel to it. Follow the midi skirt method instead."
                },
                {
                    "headline": "Topstitch the gap shut.",
                    "description": "Load your sewing machine with a thread color that matches the topstitching on your jeans. Begin topstitching the front of your skirt. Start sewing at the top, where the crotch part used to be, and finish sewing at the bottom. Repeat this step for the back of the skirt.Backstitch at the start and end of your sewing to make it nice and strong."
                },
                {
                    "headline": "Trim off any excess fabric.",
                    "description": "You will most likely have little triangular flaps on the front and back of your skirt, where you overlapped the crotch parts. Use a sharp pair of scissors to trim these off. You will also want to trim them off on the inside of the skirt as well."
                },
                {
                    "headline": "Hem the skirt, if desired.",
                    "description": "Turn the skirt inside out and fold the bottom hem up by ¾ inch (1.91 centimeters) two times. Topstitch it down as close to the inside folded edge as you can. Use a thread color that matches the rest of the topstitching on your skirt."
                },
                {
                    "headline": "Turn the skirt right side out.",
                    "description": "It is now ready to wear!"
                }
            ]
        },
        {
            "name": "Making a Midi Skirt",
            "steps": [
                {
                    "headline": "Get a pair of jeans that fit you.",
                    "description": "They can be old and have holes in the knees, but they need to fit you on the waist and hips. You can use this method to make a mini skirt too."
                },
                {
                    "headline": "Cut apart the inside seam.",
                    "description": "Begin cutting from the bottom part of one cuff all the way up to the crotch. Continue cutting along the seam down to the other cuff."
                },
                {
                    "headline": "Cut apart the front and back seams so that they lay flat.",
                    "description": "The crotch part on jeans is typically curved, but it needs to lay flat for a skirt. Cut along the back seam until the curved part ends. This will typically be about 2 to 3 inches (5.08 to 7.62 centimeters). You should be able to overlap the left and right edges and smooth them down without any puckering.Repeat this step for the front crotch seam, if necessary."
                },
                {
                    "headline": "Sew the front and back crotch seams down.",
                    "description": "Overlap the two edges on the front crotch seam until they lay smooth. Topstitch them down using the same thread color as the original top stitching. Try follow the original stitching as much as possible. Trim off the excess fabric from the front flap. Repeat this process for the back seam."
                },
                {
                    "headline": "Cut the legs off where you want the skirt to end.",
                    "description": "Cut no further than halfway down the pant leg. If you cut too much off, you won't have enough fabric to fill the gap in. If you want a longer skirt, use the maxi skirt method instead, then cut it shorter at the end. If you want to hem the bottom of the skirt, cut the skirt 1½ inches (3.81 centimeters) longer than you want it to be. Be sure to leave enough fabric on the pant legs to fill the gaps in."
                },
                {
                    "headline": "Tuck one of the pant legs into the jeans.",
                    "description": "You want the cut inside edges of the jeans to be visible. Pin the panel into place. Repeat this process for the back of the skirt with the other pant leg."
                },
                {
                    "headline": "Topstitch the panels down.",
                    "description": "Sew ½-inch (1.27 centimeters) away from the raw, cut edge. You can use the same thread color as the jeans or a contrasting color. You can also match the thread color to the original topstitching thread on the jeans. In most cases, this will be orange or yellow."
                },
                {
                    "headline": "Turn the jeans inside out and cut off the excess fabric.",
                    "description": "Leave about a ½-inch (1.27-centimeter) seam allowance."
                },
                {
                    "headline": "Hem the skirt, if desired.",
                    "description": "Fold the bottom hem twice by ¾-inch (1.91-centimeters). Topstitch it down as close as possible to the inside folded edge. Match the thread color to the stitching you used on the panels."
                },
                {
                    "headline": "Turn the jeans right side out.",
                    "description": "The skirt is now ready to wear!"
                }
            ]
        },
        {
            "name": "Making a Maxi Skirt",
            "steps": [
                {
                    "headline": "Get two pairs of jeans.",
                    "description": "They can be exactly the same shade, or they can be two different shades. Make sure that at least one of the jeans fits you well, as this will be the top of the skirt."
                },
                {
                    "headline": "Cut open the inside seam on the first pair of jeans.",
                    "description": "Take the pair of jeans that fit you. Starting from one cuff, cut up along the inside seam until you reach the crotch. Repeat the process for the other leg. Cut apart the crotch seam when you are done."
                },
                {
                    "headline": "Cut up partway on the front and back seams.",
                    "description": "You may have noticed that the crotch part on the front and back seams is curving outward. It needs to lay flat. Use a pair of scissors to cut up the curved part of the front and back seam. On most pants, this will only be about 2 to 3 inches (5.08 to 7.62 centimeters). Doing this will help the skirt lay smoother. Set this pair of jeans aside when you are done.You've cut far enough if you can smooth the seam down. The left and right edges will overlap, which is fine."
                },
                {
                    "headline": "Sew the crotch seams down.",
                    "description": "Overlap the left and right edges on the front crotch seam until it lays smooth. Topstitch it down, following the original stitching. Trim off the excess fabric from the top flap. Repeat this step for the back seam."
                },
                {
                    "headline": "Chop the legs off of the second pair of jeans.",
                    "description": "You will be using these legs to fill the gaps on your skirt. Cut up past the crotch to ensure that you have enough fabric."
                },
                {
                    "headline": "Cut apart one of the legs on both seams on the second pair of jeans.",
                    "description": "You will be left with two panels: a front one and a back one. Pick a panel to use for the front of your skirt. Set the second panel aside for another project."
                },
                {
                    "headline": "Slice the second leg apart on the outside seam.",
                    "description": "This will create a wider panel, which you will be using this for the back of the skirt. Do not cut the leg apart on the inside seam."
                },
                {
                    "headline": "Spread the first pair of jeans out.",
                    "description": "Set the first pair of jeans down in front of you, with the right side facing out and the waistband facing away from you. Smooth the legs down so that they lay flat against your work surface. You will have a triangular-shaped hole between both legs. Do not close this hole up. You will fill it in with the panels."
                },
                {
                    "headline": "Pin the panels inside the jeans to fill in the gaps.",
                    "description": "Tuck the narrower panel inside the jeans so that the front gap is no longer visible. Make sure that the bottom cuffs match up and that the side edges overlap. Smooth down the crotch so that it lays flat; you will need to overlap the left and right edges. Pin the panel in place. Repeat this step for the back of the jeans with the wider panels.You may have to scoot the legs closer together. You need the inside seams on the legs to overlap the outside seams on the panel. If you have a gap on top, fill it in with a patch of denim fabric. Don't pin the right sides together like regular sewing. You want the raw, cut edges on the first pair of jeans to be visible."
                },
                {
                    "headline": "Topstitch the seams down.",
                    "description": "Start sewing on the bottom of one cuff and finish sewing on the other. Use a wide enough seam allowance so that you sew through both layers of overlapped fabric. You can use a matching thread color or a contrasting on.Remove the pins as you sew. Backstitch at the start and end of your sewing."
                },
                {
                    "headline": "Cut the hem off, if desired.",
                    "description": "You don't have to do this, but it will help give your jeans a more rustic, bohemian look. You can also cut the skirt down to the length you want it to be. Hem the bottom, or leave it raw."
                }
            ]
        }
    ],
    "tyn": [
        "Making a Mini Skirt",
        "Jeans",
        "Fabric scissors",
        "Sewing pins",
        "Sewing machine",
        "Thread",
        "Making a Midi Skirt",
        "Making a Maxi Skirt",
        "2 pairs of jeans"
    ],
    "text": " Making a Mini Skirt Find a pair of jeans that fit you well. They can be old and covered with holes, but make sure that they fit you in the waist and hips. Cut the pants down to the length you want the skirt to be. It would be a very good idea to make the skirt a little longer than you think you want it to be. Remember, it is easier to take away length an to add it again. Set the cut-off pant legs aside for another project. If you want to hem the skirt, cut it 1½ inches (3.81 centimeters) longer than you want it to be. Consider trying the jeans on first, then making a mark with a pen where you want to cut them. Cut apart the inseam. The inseam is the inside seam on the pant legs. Cut as close as possible to the seam as you can. Be sure to cut the crotch apart as well. The pants should open up on the bottom, almost like a skirt. Cut the front and back seams open so that they can lay flat. The crotch part on jeans curves so that it can fit your figure better. On a skirt, however, this part needs to lay flat. Cut up along the front and back crotch seams by 1 to 3 inches (2.54 to 7.62 centimeters), or until you reach the end of the curved part. You've cut far enough if you can overlap the cut edges without any buckling. Overlap the cut edges to cut the skirt. Depending on how short you cut the skirt, you may have a triangular gap in the center, where you cut the pant legs apart. Close this gap as much as possible by moving the two cut edges together and overlapping them. Pin the gap shut, then repeat the process for the back.You can have the bottom inch (2.54 centimeter) or so open. If the bottom of your skirt become too narrow, you will have to add a panel to it. Follow the midi skirt method instead. Topstitch the gap shut. Load your sewing machine with a thread color that matches the topstitching on your jeans. Begin topstitching the front of your skirt. Start sewing at the top, where the crotch part used to be, and finish sewing at the bottom. Repeat this step for the back of the skirt.Backstitch at the start and end of your sewing to make it nice and strong. Trim off any excess fabric. You will most likely have little triangular flaps on the front and back of your skirt, where you overlapped the crotch parts. Use a sharp pair of scissors to trim these off. You will also want to trim them off on the inside of the skirt as well. Hem the skirt, if desired. Turn the skirt inside out and fold the bottom hem up by ¾ inch (1.91 centimeters) two times. Topstitch it down as close to the inside folded edge as you can. Use a thread color that matches the rest of the topstitching on your skirt. Turn the skirt right side out. It is now ready to wear! Making a Midi Skirt Get a pair of jeans that fit you. They can be old and have holes in the knees, but they need to fit you on the waist and hips. You can use this method to make a mini skirt too. Cut apart the inside seam. Begin cutting from the bottom part of one cuff all the way up to the crotch. Continue cutting along the seam down to the other cuff. Cut apart the front and back seams so that they lay flat. The crotch part on jeans is typically curved, but it needs to lay flat for a skirt. Cut along the back seam until the curved part ends. This will typically be about 2 to 3 inches (5.08 to 7.62 centimeters). You should be able to overlap the left and right edges and smooth them down without any puckering.Repeat this step for the front crotch seam, if necessary. Sew the front and back crotch seams down. Overlap the two edges on the front crotch seam until they lay smooth. Topstitch them down using the same thread color as the original top stitching. Try follow the original stitching as much as possible. Trim off the excess fabric from the front flap. Repeat this process for the back seam. Cut the legs off where you want the skirt to end. Cut no further than halfway down the pant leg. If you cut too much off, you won't have enough fabric to fill the gap in. If you want a longer skirt, use the maxi skirt method instead, then cut it shorter at the end. If you want to hem the bottom of the skirt, cut the skirt 1½ inches (3.81 centimeters) longer than you want it to be. Be sure to leave enough fabric on the pant legs to fill the gaps in. Tuck one of the pant legs into the jeans. You want the cut inside edges of the jeans to be visible. Pin the panel into place. Repeat this process for the back of the skirt with the other pant leg. Topstitch the panels down. Sew ½-inch (1.27 centimeters) away from the raw, cut edge. You can use the same thread color as the jeans or a contrasting color. You can also match the thread color to the original topstitching thread on the jeans. In most cases, this will be orange or yellow. Turn the jeans inside out and cut off the excess fabric. Leave about a ½-inch (1.27-centimeter) seam allowance. Hem the skirt, if desired. Fold the bottom hem twice by ¾-inch (1.91-centimeters). Topstitch it down as close as possible to the inside folded edge. Match the thread color to the stitching you used on the panels. Turn the jeans right side out. The skirt is now ready to wear! Making a Maxi Skirt Get two pairs of jeans. They can be exactly the same shade, or they can be two different shades. Make sure that at least one of the jeans fits you well, as this will be the top of the skirt. Cut open the inside seam on the first pair of jeans. Take the pair of jeans that fit you. Starting from one cuff, cut up along the inside seam until you reach the crotch. Repeat the process for the other leg. Cut apart the crotch seam when you are done. Cut up partway on the front and back seams. You may have noticed that the crotch part on the front and back seams is curving outward. It needs to lay flat. Use a pair of scissors to cut up the curved part of the front and back seam. On most pants, this will only be about 2 to 3 inches (5.08 to 7.62 centimeters). Doing this will help the skirt lay smoother. Set this pair of jeans aside when you are done.You've cut far enough if you can smooth the seam down. The left and right edges will overlap, which is fine. Sew the crotch seams down. Overlap the left and right edges on the front crotch seam until it lays smooth. Topstitch it down, following the original stitching. Trim off the excess fabric from the top flap. Repeat this step for the back seam. Chop the legs off of the second pair of jeans. You will be using these legs to fill the gaps on your skirt. Cut up past the crotch to ensure that you have enough fabric. Cut apart one of the legs on both seams on the second pair of jeans. You will be left with two panels: a front one and a back one. Pick a panel to use for the front of your skirt. Set the second panel aside for another project. Slice the second leg apart on the outside seam. This will create a wider panel, which you will be using this for the back of the skirt. Do not cut the leg apart on the inside seam. Spread the first pair of jeans out. Set the first pair of jeans down in front of you, with the right side facing out and the waistband facing away from you. Smooth the legs down so that they lay flat against your work surface. You will have a triangular-shaped hole between both legs. Do not close this hole up. You will fill it in with the panels. Pin the panels inside the jeans to fill in the gaps. Tuck the narrower panel inside the jeans so that the front gap is no longer visible. Make sure that the bottom cuffs match up and that the side edges overlap. Smooth down the crotch so that it lays flat; you will need to overlap the left and right edges. Pin the panel in place. Repeat this step for the back of the jeans with the wider panels.You may have to scoot the legs closer together. You need the inside seams on the legs to overlap the outside seams on the panel. If you have a gap on top, fill it in with a patch of denim fabric. Don't pin the right sides together like regular sewing. You want the raw, cut edges on the first pair of jeans to be visible. Topstitch the seams down. Start sewing on the bottom of one cuff and finish sewing on the other. Use a wide enough seam allowance so that you sew through both layers of overlapped fabric. You can use a matching thread color or a contrasting on.Remove the pins as you sew. Backstitch at the start and end of your sewing. Cut the hem off, if desired. You don't have to do this, but it will help give your jeans a more rustic, bohemian look. You can also cut the skirt down to the length you want it to be. Hem the bottom, or leave it raw.",
    "sentences": [
        " Making a Mini Skirt Find a pair of jeans that fit you well.",
        "They can be old and covered with holes, but make sure that they fit you in the waist and hips.",
        "Cut the pants down to the length you want the skirt to be.",
        "It would be a very good idea to make the skirt a little longer than you think you want it to be.",
        "Remember, it is easier to take away length an to add it again.",
        "Set the cut-off pant legs aside for another project.",
        "If you want to hem the skirt, cut it 1½ inches (3.81 centimeters) longer than you want it to be.",
        "Consider trying the jeans on first, then making a mark with a pen where you want to cut them.",
        "Cut apart the inseam.",
        "The inseam is the inside seam on the pant legs.",
        "Cut as close as possible to the seam as you can.",
        "Be sure to cut the crotch apart as well.",
        "The pants should open up on the bottom, almost like a skirt.",
        "Cut the front and back seams open so that they can lay flat.",
        "The crotch part on jeans curves so that it can fit your figure better.",
        "On a skirt, however, this part needs to lay flat.",
        "Cut up along the front and back crotch seams by 1 to 3 inches (2.54 to 7.62 centimeters), or until you reach the end of the curved part.",
        "You've cut far enough if you can overlap the cut edges without any buckling.",
        "Overlap the cut edges to cut the skirt.",
        "Depending on how short you cut the skirt, you may have a triangular gap in the center, where you cut the pant legs apart.",
        "Close this gap as much as possible by moving the two cut edges together and overlapping them.",
        "Pin the gap shut, then repeat the process for the back.You can have the bottom inch (2.54 centimeter) or so open.",
        "If the bottom of your skirt become too narrow, you will have to add a panel to it.",
        "Follow the midi skirt method instead.",
        "Topstitch the gap shut.",
        "Load your sewing machine with a thread color that matches the topstitching on your jeans.",
        "Begin topstitching the front of your skirt.",
        "Start sewing at the top, where the crotch part used to be, and finish sewing at the bottom.",
        "Repeat this step for the back of the skirt.Backstitch at the start and end of your sewing to make it nice and strong.",
        "Trim off any excess fabric.",
        "You will most likely have little triangular flaps on the front and back of your skirt, where you overlapped the crotch parts.",
        "Use a sharp pair of scissors to trim these off.",
        "You will also want to trim them off on the inside of the skirt as well.",
        "Hem the skirt, if desired.",
        "Turn the skirt inside out and fold the bottom hem up by ¾ inch (1.91 centimeters) two times.",
        "Topstitch it down as close to the inside folded edge as you can.",
        "Use a thread color that matches the rest of the topstitching on your skirt.",
        "Turn the skirt right side out.",
        "It is now ready to wear!",
        "Making a Midi Skirt Get a pair of jeans that fit you.",
        "They can be old and have holes in the knees, but they need to fit you on the waist and hips.",
        "You can use this method to make a mini skirt too.",
        "Cut apart the inside seam.",
        "Begin cutting from the bottom part of one cuff all the way up to the crotch.",
        "Continue cutting along the seam down to the other cuff.",
        "Cut apart the front and back seams so that they lay flat.",
        "The crotch part on jeans is typically curved, but it needs to lay flat for a skirt.",
        "Cut along the back seam until the curved part ends.",
        "This will typically be about 2 to 3 inches (5.08 to 7.62 centimeters).",
        "You should be able to overlap the left and right edges and smooth them down without any puckering.Repeat this step for the front crotch seam, if necessary.",
        "Sew the front and back crotch seams down.",
        "Overlap the two edges on the front crotch seam until they lay smooth.",
        "Topstitch them down using the same thread color as the original top stitching.",
        "Try follow the original stitching as much as possible.",
        "Trim off the excess fabric from the front flap.",
        "Repeat this process for the back seam.",
        "Cut the legs off where you want the skirt to end.",
        "Cut no further than halfway down the pant leg.",
        "If you cut too much off, you won't have enough fabric to fill the gap in.",
        "If you want a longer skirt, use the maxi skirt method instead, then cut it shorter at the end.",
        "If you want to hem the bottom of the skirt, cut the skirt 1½ inches (3.81 centimeters) longer than you want it to be.",
        "Be sure to leave enough fabric on the pant legs to fill the gaps in.",
        "Tuck one of the pant legs into the jeans.",
        "You want the cut inside edges of the jeans to be visible.",
        "Pin the panel into place.",
        "Repeat this process for the back of the skirt with the other pant leg.",
        "Topstitch the panels down.",
        "Sew ½-inch (1.27 centimeters) away from the raw, cut edge.",
        "You can use the same thread color as the jeans or a contrasting color.",
        "You can also match the thread color to the original topstitching thread on the jeans.",
        "In most cases, this will be orange or yellow.",
        "Turn the jeans inside out and cut off the excess fabric.",
        "Leave about a ½-inch (1.27-centimeter) seam allowance.",
        "Hem the skirt, if desired.",
        "Fold the bottom hem twice by ¾-inch (1.91-centimeters).",
        "Topstitch it down as close as possible to the inside folded edge.",
        "Match the thread color to the stitching you used on the panels.",
        "Turn the jeans right side out.",
        "The skirt is now ready to wear!",
        "Making a Maxi Skirt Get two pairs of jeans.",
        "They can be exactly the same shade, or they can be two different shades.",
        "Make sure that at least one of the jeans fits you well, as this will be the top of the skirt.",
        "Cut open the inside seam on the first pair of jeans.",
        "Take the pair of jeans that fit you.",
        "Starting from one cuff, cut up along the inside seam until you reach the crotch.",
        "Repeat the process for the other leg.",
        "Cut apart the crotch seam when you are done.",
        "Cut up partway on the front and back seams.",
        "You may have noticed that the crotch part on the front and back seams is curving outward.",
        "It needs to lay flat.",
        "Use a pair of scissors to cut up the curved part of the front and back seam.",
        "On most pants, this will only be about 2 to 3 inches (5.08 to 7.62 centimeters).",
        "Doing this will help the skirt lay smoother.",
        "Set this pair of jeans aside when you are done.You've cut far enough if you can smooth the seam down.",
        "The left and right edges will overlap, which is fine.",
        "Sew the crotch seams down.",
        "Overlap the left and right edges on the front crotch seam until it lays smooth.",
        "Topstitch it down, following the original stitching.",
        "Trim off the excess fabric from the top flap.",
        "Repeat this step for the back seam.",
        "Chop the legs off of the second pair of jeans.",
        "You will be using these legs to fill the gaps on your skirt.",
        "Cut up past the crotch to ensure that you have enough fabric.",
        "Cut apart one of the legs on both seams on the second pair of jeans.",
        "You will be left with two panels: a front one and a back one.",
        "Pick a panel to use for the front of your skirt.",
        "Set the second panel aside for another project.",
        "Slice the second leg apart on the outside seam.",
        "This will create a wider panel, which you will be using this for the back of the skirt.",
        "Do not cut the leg apart on the inside seam.",
        "Spread the first pair of jeans out.",
        "Set the first pair of jeans down in front of you, with the right side facing out and the waistband facing away from you.",
        "Smooth the legs down so that they lay flat against your work surface.",
        "You will have a triangular-shaped hole between both legs.",
        "Do not close this hole up.",
        "You will fill it in with the panels.",
        "Pin the panels inside the jeans to fill in the gaps.",
        "Tuck the narrower panel inside the jeans so that the front gap is no longer visible.",
        "Make sure that the bottom cuffs match up and that the side edges overlap.",
        "Smooth down the crotch so that it lays flat; you will need to overlap the left and right edges.",
        "Pin the panel in place.",
        "Repeat this step for the back of the jeans with the wider panels.You may have to scoot the legs closer together.",
        "You need the inside seams on the legs to overlap the outside seams on the panel.",
        "If you have a gap on top, fill it in with a patch of denim fabric.",
        "Don't pin the right sides together like regular sewing.",
        "You want the raw, cut edges on the first pair of jeans to be visible.",
        "Topstitch the seams down.",
        "Start sewing on the bottom of one cuff and finish sewing on the other.",
        "Use a wide enough seam allowance so that you sew through both layers of overlapped fabric.",
        "You can use a matching thread color or a contrasting on.Remove the pins as you sew.",
        "Backstitch at the start and end of your sewing.",
        "Cut the hem off, if desired.",
        "You don't have to do this, but it will help give your jeans a more rustic, bohemian look.",
        "You can also cut the skirt down to the length you want it to be.",
        "Hem the bottom, or leave it raw."
    ]
}