{
    "title": "How to Hold a Guitar",
    "url": "https://www.wikihow.com/Hold-a-Guitar",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Music",
        "Musical Instruments",
        "String Instruments",
        "Guitar"
    ],
    "methods": [
        {
            "name": "Holding a Guitar (Seated)",
            "steps": [
                {
                    "headline": "Sit in an appropriate chair.",
                    "description": "When you're first learning to play the guitar, it's important to practice in a seated position. Before you can duck walk across the stage while ripping a solo, you've got to learn to hold the guitar comfortably, without having to struggle to reach the frets and the strings. The best way to do this is to learn to hold the guitar from a seated position in an appropriate chair. The best practice chairs are hard-backed chairs with no arm rests of any kind, or stools. Sit far forward on the chair, so your back isn't touching the back-rest, your butt right on the edge of the seat. Keep your back very straight. Guitar stools are available at most music stores, and they're perfect for practicing. They're also rather expensive. If you want one, go for it, but practicing in your own kitchen chair should be fine. Just avoid the couch, the La-Z-Boy, and other soft recliners, which will build bad posture and bad guitar habits."
                },
                {
                    "headline": "Orient the guitar correctly.",
                    "description": "Start holding the guitar by orienting it to your body properly. Held correctly, the biggest string on the guitar (the low E string) should be closest to the ceiling, and the skinniest toward the floor. The body of the guitar–the part with the strings and the sound-hole–should be on the side of your dominant hand, which is the hand you write with. The neck, which is the long skinny fretted part of the guitar, should be on your non-dominant side. Your dominant hand is your “strumming hand” or your “picking hand.\" This hand will be used to pluck the strings of guitar and create the sound. While it might seem more comfortable to use that hand for fretting, it's much easier in the long run to learn this way. Your non-dominant hand is your “fretting hand,\" used to press the strings down onto the fretboard and create the individual notes."
                },
                {
                    "headline": "Balance the base of the guitar on your thigh.",
                    "description": "When you pick up the guitar in a seated position, put the leg on your dominant side forward slightly, bending your knee so it forms a right angle, your foot flat on the floor. Your other leg should be back slightly to make it comfortable. Keep your back straight. Balance the tail or base of the guitar–the end opposite the tuning pegs–on the thigh of your dominant side. Some dreadnought-style acoustic guitars have a nice cutout that should seat nicely on your other thigh, helping to orient the guitar properly. Take some time to feel out your guitar and seat it comfortably on your lap. You shouldn't have to hold it up with your hands, when it's balanced properly."
                },
                {
                    "headline": "Angle the neck up.",
                    "description": "Properly held, the neck of the guitar should be held at a 45 degree angle, not parallel with the floor, laying flat on your lap. Though this is sometimes called “classical style,” it’s the best and most comfortable way to learn, regardless of what style you plan on developing in your playing. Some guitar teachers won't emphasize holding the guitar in this manner. Once you get comfortable, you can hold the guitar however you like. For the beginner, though, it's much easier to access the freeboard this way. If your guitar teacher teaches you to play with the neck of the guitar parallel with the ground, try it out the other way."
                },
                {
                    "headline": "Secure the body with the elbow and forearm of your dominant hand.",
                    "description": "Keep the guitar in tight to your body, the back of the guitar touching your torso. The fretboard and the strings should be perfectly perpendicular with the ground, not tilted backward so you can see them better. Under the sound-hole, secure the guitar tight into your body with your strumming forearm and elbow, and keep your wrist on the bridge of the guitar. To make sure you're not hugging too tightly, practice strumming, letting your hand fall comfortably, about an inch below the sound-hole of an acoustic guitar, or even with the pick-ups on an electric guitar. You should think of this less as “holding” a guitar and more as letting the guitar rest comfortably on your lap while you play. The less you “hold” it, the easier it is to play."
                },
                {
                    "headline": "Balance the neck between your thumb and forefinger.",
                    "description": "You shouldn’t have to use your fretting hand to support the guitar. Properly held, a guitar should remain in place by supporting it on the thigh of your dominant side, holding it in tight to your body with the elbow on that side. To keep it steady, form a \"V\" shape with the thumb and forefinger of your fretting hand, and use that hand to balance the neck of the guitar. Some guitar teachers will put a small piece of tape just behind the third fret, on the neck of the guitar as an indication of where you should place your thumb. If you're learning properly, your fretting thumb should always remain on the back of the neck, your other fingers arched over the fretboard. Be careful not to wrap your thumb around. Alternatively, guitar wizards from Hendrix to John Fahey have broken this rule with abandon, incorporating the wrapped-thumb to great effect. If you've got long fingers, you can get away with it. Follow your guitar teacher's instructions, if you're receiving them, or experiment to see what works best for you."
                },
                {
                    "headline": "Keep your back as straight as possible.",
                    "description": "The most important part of holding a guitar properly is maintaining a straight back and keeping the guitar perpendicular with the ground. It's easy to slide into a slouch, tilting the guitar back so you can see the fretboard, but this is a fast-train to poor technique and sloppy playing. If you want to hold it properly, keep your back straight."
                }
            ]
        },
        {
            "name": "Holding a Guitar (Standing)",
            "steps": [
                {
                    "headline": "Buy an adjustable strap.",
                    "description": "If you're ready to take your guitar skills onto the stage, it's common to support the guitar using a guitar strap. Many different styles and arrangements are available, from wrap-around mariachi-style straps to tight banjo-style straps, but the most common varieties are relatively basic and easy to use. Look for a strap of good quality cloth or leather with an adjustable length to allow you the freedom to find a height that works best for you. Make sure your guitar is outfitted with strap pegs before you buy a strap, or consider having them installed at the guitar shop. You'll need at least one strap peg at the base of most guitars to make a strap work. Most guitars will come with them pre-installed."
                },
                {
                    "headline": "Attach the strap correctly.",
                    "description": "Attaching the strap will vary, depending on whether or not you've got one or two strap pegs. Many acoustic guitars will only have one peg, while electric guitars commonly have two. Always start by slipping the base peg through the tab on the end of the strap, then installing the peg closer to the neck. To strap an acoustic guitar with one peg, you'll sometimes need to insert the skinny end of the strap around the head, under the strings where they attach to the tuning pegs. Some straps won't come with this, but you can use a shoestring inserted through the peg-hole on the skinny end of the strap to make do in a pinch. If your acoustic comes with two pegs already, just attach the strap to both pegs at the top and bottom of the guitar body and you're set. To strap an electric guitar, insert the pegs through the tabs on each end of the strap and you're should be ready to rock. Some straps will come with a variety of different tabs to allow for a variety of lengths. Start tight and loosen up if necessary."
                },
                {
                    "headline": "Adjust the guitar strap.",
                    "description": "Most straps can be adjusted by sliding the buckle up or down the length of the strap to make it longer or shorter. Sling the strap over the shoulder of your fretting hand and feel where the guitar falls. If it feels comfortable, you're all set. If not, remove the guitar and adjust the strap until it feels right. Ideally, you want the bottom of the guitar to be about even with your hip on your dominant side. Err on the side of keeping the strap short. You don’t want to have the guitar too low or you’ll struggle to play with your strumming hand. Likewise, if the guitar is too high, it can be tiring to hold your arms up that high to play. The length of the guitar strap will have a lot to do with your playing style. Some players want the guitar as high as possible to allow easy access to the fretboard, while rockers want the guitar as low as possible, because it looks awesome. There's no right way."
                },
                {
                    "headline": "Reinforce the guitar strap.",
                    "description": "The best guitar strap assemblies will come with a strap-enforcement peg or clip on the base of the guitar, which will help to hold the strap onto the guitar. There’s nothing worse than a guitar that slips off the strap pegs and falls to the ground in the middle of a performance. These are usually simple plastic clips that will fit over the peg and keep the end of the strap from slipping off."
                },
                {
                    "headline": "Loop your guitar cable through the strap before plugging in.",
                    "description": "If you're plugging in, a good trick of the trade is to loop your guitar cable through the strap to keep it out of your way. Insert the cable between the base peg and the strap, from the back to the front of the guitar and plug it in. This is especially useful if you've got an input jack on the bottom of your guitar and it gets loose over time. You can keep the cable from slipping out and falling all the way to the ground."
                }
            ]
        }
    ],
    "tyn": [
        "A guitar",
        "A chair or stool",
        "A guitar strap"
    ],
    "text": " Holding a Guitar (Seated) Sit in an appropriate chair. When you're first learning to play the guitar, it's important to practice in a seated position. Before you can duck walk across the stage while ripping a solo, you've got to learn to hold the guitar comfortably, without having to struggle to reach the frets and the strings. The best way to do this is to learn to hold the guitar from a seated position in an appropriate chair. The best practice chairs are hard-backed chairs with no arm rests of any kind, or stools. Sit far forward on the chair, so your back isn't touching the back-rest, your butt right on the edge of the seat. Keep your back very straight. Guitar stools are available at most music stores, and they're perfect for practicing. They're also rather expensive. If you want one, go for it, but practicing in your own kitchen chair should be fine. Just avoid the couch, the La-Z-Boy, and other soft recliners, which will build bad posture and bad guitar habits. Orient the guitar correctly. Start holding the guitar by orienting it to your body properly. Held correctly, the biggest string on the guitar (the low E string) should be closest to the ceiling, and the skinniest toward the floor. The body of the guitar–the part with the strings and the sound-hole–should be on the side of your dominant hand, which is the hand you write with. The neck, which is the long skinny fretted part of the guitar, should be on your non-dominant side. Your dominant hand is your “strumming hand” or your “picking hand.\" This hand will be used to pluck the strings of guitar and create the sound. While it might seem more comfortable to use that hand for fretting, it's much easier in the long run to learn this way. Your non-dominant hand is your “fretting hand,\" used to press the strings down onto the fretboard and create the individual notes. Balance the base of the guitar on your thigh. When you pick up the guitar in a seated position, put the leg on your dominant side forward slightly, bending your knee so it forms a right angle, your foot flat on the floor. Your other leg should be back slightly to make it comfortable. Keep your back straight. Balance the tail or base of the guitar–the end opposite the tuning pegs–on the thigh of your dominant side. Some dreadnought-style acoustic guitars have a nice cutout that should seat nicely on your other thigh, helping to orient the guitar properly. Take some time to feel out your guitar and seat it comfortably on your lap. You shouldn't have to hold it up with your hands, when it's balanced properly. Angle the neck up. Properly held, the neck of the guitar should be held at a 45 degree angle, not parallel with the floor, laying flat on your lap. Though this is sometimes called “classical style,” it’s the best and most comfortable way to learn, regardless of what style you plan on developing in your playing. Some guitar teachers won't emphasize holding the guitar in this manner. Once you get comfortable, you can hold the guitar however you like. For the beginner, though, it's much easier to access the freeboard this way. If your guitar teacher teaches you to play with the neck of the guitar parallel with the ground, try it out the other way. Secure the body with the elbow and forearm of your dominant hand. Keep the guitar in tight to your body, the back of the guitar touching your torso. The fretboard and the strings should be perfectly perpendicular with the ground, not tilted backward so you can see them better. Under the sound-hole, secure the guitar tight into your body with your strumming forearm and elbow, and keep your wrist on the bridge of the guitar. To make sure you're not hugging too tightly, practice strumming, letting your hand fall comfortably, about an inch below the sound-hole of an acoustic guitar, or even with the pick-ups on an electric guitar. You should think of this less as “holding” a guitar and more as letting the guitar rest comfortably on your lap while you play. The less you “hold” it, the easier it is to play. Balance the neck between your thumb and forefinger. You shouldn’t have to use your fretting hand to support the guitar. Properly held, a guitar should remain in place by supporting it on the thigh of your dominant side, holding it in tight to your body with the elbow on that side. To keep it steady, form a \"V\" shape with the thumb and forefinger of your fretting hand, and use that hand to balance the neck of the guitar. Some guitar teachers will put a small piece of tape just behind the third fret, on the neck of the guitar as an indication of where you should place your thumb. If you're learning properly, your fretting thumb should always remain on the back of the neck, your other fingers arched over the fretboard. Be careful not to wrap your thumb around. Alternatively, guitar wizards from Hendrix to John Fahey have broken this rule with abandon, incorporating the wrapped-thumb to great effect. If you've got long fingers, you can get away with it. Follow your guitar teacher's instructions, if you're receiving them, or experiment to see what works best for you. Keep your back as straight as possible. The most important part of holding a guitar properly is maintaining a straight back and keeping the guitar perpendicular with the ground. It's easy to slide into a slouch, tilting the guitar back so you can see the fretboard, but this is a fast-train to poor technique and sloppy playing. If you want to hold it properly, keep your back straight. Holding a Guitar (Standing) Buy an adjustable strap. If you're ready to take your guitar skills onto the stage, it's common to support the guitar using a guitar strap. Many different styles and arrangements are available, from wrap-around mariachi-style straps to tight banjo-style straps, but the most common varieties are relatively basic and easy to use. Look for a strap of good quality cloth or leather with an adjustable length to allow you the freedom to find a height that works best for you. Make sure your guitar is outfitted with strap pegs before you buy a strap, or consider having them installed at the guitar shop. You'll need at least one strap peg at the base of most guitars to make a strap work. Most guitars will come with them pre-installed. Attach the strap correctly. Attaching the strap will vary, depending on whether or not you've got one or two strap pegs. Many acoustic guitars will only have one peg, while electric guitars commonly have two. Always start by slipping the base peg through the tab on the end of the strap, then installing the peg closer to the neck. To strap an acoustic guitar with one peg, you'll sometimes need to insert the skinny end of the strap around the head, under the strings where they attach to the tuning pegs. Some straps won't come with this, but you can use a shoestring inserted through the peg-hole on the skinny end of the strap to make do in a pinch. If your acoustic comes with two pegs already, just attach the strap to both pegs at the top and bottom of the guitar body and you're set. To strap an electric guitar, insert the pegs through the tabs on each end of the strap and you're should be ready to rock. Some straps will come with a variety of different tabs to allow for a variety of lengths. Start tight and loosen up if necessary. Adjust the guitar strap. Most straps can be adjusted by sliding the buckle up or down the length of the strap to make it longer or shorter. Sling the strap over the shoulder of your fretting hand and feel where the guitar falls. If it feels comfortable, you're all set. If not, remove the guitar and adjust the strap until it feels right. Ideally, you want the bottom of the guitar to be about even with your hip on your dominant side. Err on the side of keeping the strap short. You don’t want to have the guitar too low or you’ll struggle to play with your strumming hand. Likewise, if the guitar is too high, it can be tiring to hold your arms up that high to play. The length of the guitar strap will have a lot to do with your playing style. Some players want the guitar as high as possible to allow easy access to the fretboard, while rockers want the guitar as low as possible, because it looks awesome. There's no right way. Reinforce the guitar strap. The best guitar strap assemblies will come with a strap-enforcement peg or clip on the base of the guitar, which will help to hold the strap onto the guitar. There’s nothing worse than a guitar that slips off the strap pegs and falls to the ground in the middle of a performance. These are usually simple plastic clips that will fit over the peg and keep the end of the strap from slipping off. Loop your guitar cable through the strap before plugging in. If you're plugging in, a good trick of the trade is to loop your guitar cable through the strap to keep it out of your way. Insert the cable between the base peg and the strap, from the back to the front of the guitar and plug it in. This is especially useful if you've got an input jack on the bottom of your guitar and it gets loose over time. You can keep the cable from slipping out and falling all the way to the ground.",
    "sentences": [
        " Holding a Guitar (Seated) Sit in an appropriate chair.",
        "When you're first learning to play the guitar, it's important to practice in a seated position.",
        "Before you can duck walk across the stage while ripping a solo, you've got to learn to hold the guitar comfortably, without having to struggle to reach the frets and the strings.",
        "The best way to do this is to learn to hold the guitar from a seated position in an appropriate chair.",
        "The best practice chairs are hard-backed chairs with no arm rests of any kind, or stools.",
        "Sit far forward on the chair, so your back isn't touching the back-rest, your butt right on the edge of the seat.",
        "Keep your back very straight.",
        "Guitar stools are available at most music stores, and they're perfect for practicing.",
        "They're also rather expensive.",
        "If you want one, go for it, but practicing in your own kitchen chair should be fine.",
        "Just avoid the couch, the La-Z-Boy, and other soft recliners, which will build bad posture and bad guitar habits.",
        "Orient the guitar correctly.",
        "Start holding the guitar by orienting it to your body properly.",
        "Held correctly, the biggest string on the guitar (the low E string) should be closest to the ceiling, and the skinniest toward the floor.",
        "The body of the guitar–the part with the strings and the sound-hole–should be on the side of your dominant hand, which is the hand you write with.",
        "The neck, which is the long skinny fretted part of the guitar, should be on your non-dominant side.",
        "Your dominant hand is your “strumming hand” or your “picking hand.\"",
        "This hand will be used to pluck the strings of guitar and create the sound.",
        "While it might seem more comfortable to use that hand for fretting, it's much easier in the long run to learn this way.",
        "Your non-dominant hand is your “fretting hand,\" used to press the strings down onto the fretboard and create the individual notes.",
        "Balance the base of the guitar on your thigh.",
        "When you pick up the guitar in a seated position, put the leg on your dominant side forward slightly, bending your knee so it forms a right angle, your foot flat on the floor.",
        "Your other leg should be back slightly to make it comfortable.",
        "Keep your back straight.",
        "Balance the tail or base of the guitar–the end opposite the tuning pegs–on the thigh of your dominant side.",
        "Some dreadnought-style acoustic guitars have a nice cutout that should seat nicely on your other thigh, helping to orient the guitar properly.",
        "Take some time to feel out your guitar and seat it comfortably on your lap.",
        "You shouldn't have to hold it up with your hands, when it's balanced properly.",
        "Angle the neck up.",
        "Properly held, the neck of the guitar should be held at a 45 degree angle, not parallel with the floor, laying flat on your lap.",
        "Though this is sometimes called “classical style,” it’s the best and most comfortable way to learn, regardless of what style you plan on developing in your playing.",
        "Some guitar teachers won't emphasize holding the guitar in this manner.",
        "Once you get comfortable, you can hold the guitar however you like.",
        "For the beginner, though, it's much easier to access the freeboard this way.",
        "If your guitar teacher teaches you to play with the neck of the guitar parallel with the ground, try it out the other way.",
        "Secure the body with the elbow and forearm of your dominant hand.",
        "Keep the guitar in tight to your body, the back of the guitar touching your torso.",
        "The fretboard and the strings should be perfectly perpendicular with the ground, not tilted backward so you can see them better.",
        "Under the sound-hole, secure the guitar tight into your body with your strumming forearm and elbow, and keep your wrist on the bridge of the guitar.",
        "To make sure you're not hugging too tightly, practice strumming, letting your hand fall comfortably, about an inch below the sound-hole of an acoustic guitar, or even with the pick-ups on an electric guitar.",
        "You should think of this less as “holding” a guitar and more as letting the guitar rest comfortably on your lap while you play.",
        "The less you “hold” it, the easier it is to play.",
        "Balance the neck between your thumb and forefinger.",
        "You shouldn’t have to use your fretting hand to support the guitar.",
        "Properly held, a guitar should remain in place by supporting it on the thigh of your dominant side, holding it in tight to your body with the elbow on that side.",
        "To keep it steady, form a \"V\" shape with the thumb and forefinger of your fretting hand, and use that hand to balance the neck of the guitar.",
        "Some guitar teachers will put a small piece of tape just behind the third fret, on the neck of the guitar as an indication of where you should place your thumb.",
        "If you're learning properly, your fretting thumb should always remain on the back of the neck, your other fingers arched over the fretboard.",
        "Be careful not to wrap your thumb around.",
        "Alternatively, guitar wizards from Hendrix to John Fahey have broken this rule with abandon, incorporating the wrapped-thumb to great effect.",
        "If you've got long fingers, you can get away with it.",
        "Follow your guitar teacher's instructions, if you're receiving them, or experiment to see what works best for you.",
        "Keep your back as straight as possible.",
        "The most important part of holding a guitar properly is maintaining a straight back and keeping the guitar perpendicular with the ground.",
        "It's easy to slide into a slouch, tilting the guitar back so you can see the fretboard, but this is a fast-train to poor technique and sloppy playing.",
        "If you want to hold it properly, keep your back straight.",
        "Holding a Guitar (Standing) Buy an adjustable strap.",
        "If you're ready to take your guitar skills onto the stage, it's common to support the guitar using a guitar strap.",
        "Many different styles and arrangements are available, from wrap-around mariachi-style straps to tight banjo-style straps, but the most common varieties are relatively basic and easy to use.",
        "Look for a strap of good quality cloth or leather with an adjustable length to allow you the freedom to find a height that works best for you.",
        "Make sure your guitar is outfitted with strap pegs before you buy a strap, or consider having them installed at the guitar shop.",
        "You'll need at least one strap peg at the base of most guitars to make a strap work.",
        "Most guitars will come with them pre-installed.",
        "Attach the strap correctly.",
        "Attaching the strap will vary, depending on whether or not you've got one or two strap pegs.",
        "Many acoustic guitars will only have one peg, while electric guitars commonly have two.",
        "Always start by slipping the base peg through the tab on the end of the strap, then installing the peg closer to the neck.",
        "To strap an acoustic guitar with one peg, you'll sometimes need to insert the skinny end of the strap around the head, under the strings where they attach to the tuning pegs.",
        "Some straps won't come with this, but you can use a shoestring inserted through the peg-hole on the skinny end of the strap to make do in a pinch.",
        "If your acoustic comes with two pegs already, just attach the strap to both pegs at the top and bottom of the guitar body and you're set.",
        "To strap an electric guitar, insert the pegs through the tabs on each end of the strap and you're should be ready to rock.",
        "Some straps will come with a variety of different tabs to allow for a variety of lengths.",
        "Start tight and loosen up if necessary.",
        "Adjust the guitar strap.",
        "Most straps can be adjusted by sliding the buckle up or down the length of the strap to make it longer or shorter.",
        "Sling the strap over the shoulder of your fretting hand and feel where the guitar falls.",
        "If it feels comfortable, you're all set.",
        "If not, remove the guitar and adjust the strap until it feels right.",
        "Ideally, you want the bottom of the guitar to be about even with your hip on your dominant side.",
        "Err on the side of keeping the strap short.",
        "You don’t want to have the guitar too low or you’ll struggle to play with your strumming hand.",
        "Likewise, if the guitar is too high, it can be tiring to hold your arms up that high to play.",
        "The length of the guitar strap will have a lot to do with your playing style.",
        "Some players want the guitar as high as possible to allow easy access to the fretboard, while rockers want the guitar as low as possible, because it looks awesome.",
        "There's no right way.",
        "Reinforce the guitar strap.",
        "The best guitar strap assemblies will come with a strap-enforcement peg or clip on the base of the guitar, which will help to hold the strap onto the guitar.",
        "There’s nothing worse than a guitar that slips off the strap pegs and falls to the ground in the middle of a performance.",
        "These are usually simple plastic clips that will fit over the peg and keep the end of the strap from slipping off.",
        "Loop your guitar cable through the strap before plugging in.",
        "If you're plugging in, a good trick of the trade is to loop your guitar cable through the strap to keep it out of your way.",
        "Insert the cable between the base peg and the strap, from the back to the front of the guitar and plug it in.",
        "This is especially useful if you've got an input jack on the bottom of your guitar and it gets loose over time.",
        "You can keep the cable from slipping out and falling all the way to the ground."
    ]
}