{
    "title": "How to Do a Simple Mass Balance",
    "url": "https://www.wikihow.com/Do-a-Simple-Mass-Balance",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Science",
        "Chemistry"
    ],
    "parts": [
        {
            "name": "Understanding the Definitions",
            "steps": [
                {
                    "headline": "Know the definition of a material balance.",
                    "description": "A material balance is accounting for all materials entering and exiting a system."
                },
                {
                    "headline": "Know the definition of a mass flow rate.",
                    "description": "A mass flow rate is how much unit of mass is flowing through a process per unit of time."
                },
                {
                    "headline": "Know the definition of a mass fraction.",
                    "description": "A mass fraction is (mass of a substance)/(total mass). This can also be called weight percent, wt%."
                },
                {
                    "headline": "Know the definition of a mass ratio.",
                    "description": "A mass ratio is how much of a substance in a system relative to another substance."
                },
                {
                    "headline": "Know the definition of a flow chart.",
                    "description": "A flow chart is a drawn representation of the system you are working with."
                },
                {
                    "headline": "Know the definition of a degrees of freedom analysis.",
                    "description": "A degrees of freedom analysis is meant to make sure the problem is solvable. The user needs to compare the number of unknown variables to the number of independent equations they can use. The degrees of freedom equation is given by:"
                }
            ]
        },
        {
            "name": "Setting Up",
            "steps": [
                {
                    "headline": "Read problem carefully.",
                    "description": "Try to understand what the author is asking us to find. For example, your question might be:\nStrawberries contain about 15 wt% sugar and 85 wt% water. To make strawberry jam, crushed strawberries and sugar are mixed in a 45:55 mass ratio, and the mixture is heated to evaporate water until the residue contains one-third water by mass. Draw and label a flowchart of this process\nDo the degree-of-freedom analysis and show that the system has zero degrees of freedom (i.e. the number of unknown process variables equals the number of equations relating them). If you have too many unknowns, think about what you might have forgotten to do. Calculate how many pounds of strawberries are needed to make a pound of jam."
                },
                {
                    "headline": "Write down what is \"known\".",
                    "description": "Write down what is know from the problem description. Knowns:\nMass fraction of the solid (sugar) in the strawberries is 0.15 and mass fraction of water in the strawberries is 0.85. The mass fraction of sugar in 1.00lb of jam is 0.667 (lb Suagr)/(lb Jam) and the mass fraction of water is 0.333 (lb water)/(lb Jam)\nYou know this because we are told that the jam is heated until (1/3) of the mass of the jam is water. The  mass of strawberry to mass of sugar ratio is 45:55 ratio."
                },
                {
                    "headline": "Draw a flow chart.",
                    "description": "Draw the mixer. Draw stream 1 entering the mixer: m1 (lb of strawberries)\n0.85  (lb water)/(lb Jam)\n0.15 (lb Suagr)/(lb Jam)\n\nDraw stream 2 entering the mixer: m2 (lb of sugar)\nDraw stream 3 leaving the mixer: m3(1/3) lb of water left\nSo, 0.333 (lb water)/(lb Jam)\n0.667 (lb Suagr)/(lb Jam)\n\nDraw Stream 4 coming out of the mixer: m4 (lb of evaporated water)\nStream 4 is the excess water that is evaporated."
                },
                {
                    "headline": "Complete a degrees of freedom analysis.",
                    "description": "Unknowns:\nm1 (mass of strawberries), m2 (mass of sugar), m3 (mass of evaporated water)\nTherefore, nunknowns = 3\n\n\nIndependent Equations:\nThe mass balance equation for water and sugar, the mass ratio of sugar to strawberries. nind.eqns = 3\n\nPlug in these numbers into the degrees of freedom equation. Therefore there are no degrees of freedom and the problem is solvable."
                }
            ]
        },
        {
            "name": "Finding the Solution",
            "steps": [
                {
                    "headline": "Know your goal.",
                    "description": "In this case, you are asked to calculate how many pounds of strawberry is needed for 1lb of jam."
                },
                {
                    "headline": "Set up equations you know.",
                    "description": "You know the above ratio. You can solve for m1."
                },
                {
                    "headline": "Create a mass balance over the entire mixer.",
                    "description": "Here you need to realize that we know that amount of sugar in stream 1 and stream 3."
                },
                {
                    "headline": "Create a mass balance with only sugar.",
                    "description": ""
                },
                {
                    "headline": "Substitute values.",
                    "description": "You must realize that you know the flow rate out of stream 3."
                },
                {
                    "headline": "Substitute 1lb for m3.",
                    "description": "You have to realize that you know what m1 is in terms of m2"
                },
                {
                    "headline": "Write m1 in terms of m2",
                    "description": ""
                },
                {
                    "headline": "Rearrange terms.",
                    "description": ""
                },
                {
                    "headline": "Solve for m1.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Pencil",
        "Several Pieces Paper",
        "Eraser"
    ],
    "text": " Understanding the Definitions Know the definition of a material balance. A material balance is accounting for all materials entering and exiting a system. Know the definition of a mass flow rate. A mass flow rate is how much unit of mass is flowing through a process per unit of time. Know the definition of a mass fraction. A mass fraction is (mass of a substance)/(total mass). This can also be called weight percent, wt%. Know the definition of a mass ratio. A mass ratio is how much of a substance in a system relative to another substance. Know the definition of a flow chart. A flow chart is a drawn representation of the system you are working with. Know the definition of a degrees of freedom analysis. A degrees of freedom analysis is meant to make sure the problem is solvable. The user needs to compare the number of unknown variables to the number of independent equations they can use. The degrees of freedom equation is given by: Setting Up Read problem carefully. Try to understand what the author is asking us to find. For example, your question might be:\nStrawberries contain about 15 wt% sugar and 85 wt% water. To make strawberry jam, crushed strawberries and sugar are mixed in a 45:55 mass ratio, and the mixture is heated to evaporate water until the residue contains one-third water by mass. Draw and label a flowchart of this process\nDo the degree-of-freedom analysis and show that the system has zero degrees of freedom (i.e. the number of unknown process variables equals the number of equations relating them). If you have too many unknowns, think about what you might have forgotten to do. Calculate how many pounds of strawberries are needed to make a pound of jam. Write down what is \"known\". Write down what is know from the problem description. Knowns:\nMass fraction of the solid (sugar) in the strawberries is 0.15 and mass fraction of water in the strawberries is 0.85. The mass fraction of sugar in 1.00lb of jam is 0.667 (lb Suagr)/(lb Jam) and the mass fraction of water is 0.333 (lb water)/(lb Jam)\nYou know this because we are told that the jam is heated until (1/3) of the mass of the jam is water. The  mass of strawberry to mass of sugar ratio is 45:55 ratio. Draw a flow chart. Draw the mixer. Draw stream 1 entering the mixer: m1 (lb of strawberries)\n0.85  (lb water)/(lb Jam)\n0.15 (lb Suagr)/(lb Jam)\n\nDraw stream 2 entering the mixer: m2 (lb of sugar)\nDraw stream 3 leaving the mixer: m3(1/3) lb of water left\nSo, 0.333 (lb water)/(lb Jam)\n0.667 (lb Suagr)/(lb Jam)\n\nDraw Stream 4 coming out of the mixer: m4 (lb of evaporated water)\nStream 4 is the excess water that is evaporated. Complete a degrees of freedom analysis. Unknowns:\nm1 (mass of strawberries), m2 (mass of sugar), m3 (mass of evaporated water)\nTherefore, nunknowns = 3\n\n\nIndependent Equations:\nThe mass balance equation for water and sugar, the mass ratio of sugar to strawberries. nind.eqns = 3\n\nPlug in these numbers into the degrees of freedom equation. Therefore there are no degrees of freedom and the problem is solvable. Finding the Solution Know your goal. In this case, you are asked to calculate how many pounds of strawberry is needed for 1lb of jam. Set up equations you know. You know the above ratio. You can solve for m1. Create a mass balance over the entire mixer. Here you need to realize that we know that amount of sugar in stream 1 and stream 3. Create a mass balance with only sugar.  Substitute values. You must realize that you know the flow rate out of stream 3. Substitute 1lb for m3. You have to realize that you know what m1 is in terms of m2 Write m1 in terms of m2  Rearrange terms.  Solve for m1. ",
    "sentences": [
        " Understanding the Definitions Know the definition of a material balance.",
        "A material balance is accounting for all materials entering and exiting a system.",
        "Know the definition of a mass flow rate.",
        "A mass flow rate is how much unit of mass is flowing through a process per unit of time.",
        "Know the definition of a mass fraction.",
        "A mass fraction is (mass of a substance)/(total mass).",
        "This can also be called weight percent, wt%.",
        "Know the definition of a mass ratio.",
        "A mass ratio is how much of a substance in a system relative to another substance.",
        "Know the definition of a flow chart.",
        "A flow chart is a drawn representation of the system you are working with.",
        "Know the definition of a degrees of freedom analysis.",
        "A degrees of freedom analysis is meant to make sure the problem is solvable.",
        "The user needs to compare the number of unknown variables to the number of independent equations they can use.",
        "The degrees of freedom equation is given by: Setting Up Read problem carefully.",
        "Try to understand what the author is asking us to find.",
        "For example, your question might be:\nStrawberries contain about 15 wt% sugar and 85 wt% water.",
        "To make strawberry jam, crushed strawberries and sugar are mixed in a 45:55 mass ratio, and the mixture is heated to evaporate water until the residue contains one-third water by mass.",
        "Draw and label a flowchart of this process\nDo the degree-of-freedom analysis and show that the system has zero degrees of freedom (i.e.",
        "the number of unknown process variables equals the number of equations relating them).",
        "If you have too many unknowns, think about what you might have forgotten to do.",
        "Calculate how many pounds of strawberries are needed to make a pound of jam.",
        "Write down what is \"known\".",
        "Write down what is know from the problem description.",
        "Knowns:\nMass fraction of the solid (sugar) in the strawberries is 0.15 and mass fraction of water in the strawberries is 0.85.",
        "The mass fraction of sugar in 1.00lb of jam is 0.667 (lb Suagr)/(lb Jam) and the mass fraction of water is 0.333 (lb water)/(lb Jam)\nYou know this because we are told that the jam is heated until (1/3) of the mass of the jam is water.",
        "The  mass of strawberry to mass of sugar ratio is 45:55 ratio.",
        "Draw a flow chart.",
        "Draw the mixer.",
        "Draw stream 1 entering the mixer: m1 (lb of strawberries)\n0.85  (lb water)/(lb Jam)\n0.15 (lb Suagr)/(lb Jam)\n\nDraw stream 2 entering the mixer: m2 (lb of sugar)\nDraw stream 3 leaving the mixer: m3(1/3) lb of water left\nSo, 0.333 (lb water)/(lb Jam)\n0.667 (lb Suagr)/(lb Jam)\n\nDraw Stream 4 coming out of the mixer: m4 (lb of evaporated water)\nStream 4 is the excess water that is evaporated.",
        "Complete a degrees of freedom analysis.",
        "Unknowns:\nm1 (mass of strawberries), m2 (mass of sugar), m3 (mass of evaporated water)\nTherefore, nunknowns = 3\n\n\nIndependent Equations:\nThe mass balance equation for water and sugar, the mass ratio of sugar to strawberries.",
        "nind.eqns = 3\n\nPlug in these numbers into the degrees of freedom equation.",
        "Therefore there are no degrees of freedom and the problem is solvable.",
        "Finding the Solution Know your goal.",
        "In this case, you are asked to calculate how many pounds of strawberry is needed for 1lb of jam.",
        "Set up equations you know.",
        "You know the above ratio.",
        "You can solve for m1.",
        "Create a mass balance over the entire mixer.",
        "Here you need to realize that we know that amount of sugar in stream 1 and stream 3.",
        "Create a mass balance with only sugar.",
        "Substitute values.",
        "You must realize that you know the flow rate out of stream 3.",
        "Substitute 1lb for m3.",
        "You have to realize that you know what m1 is in terms of m2 Write m1 in terms of m2  Rearrange terms.",
        "Solve for m1."
    ]
}