{
    "title": "How to Torch Creme Brulee",
    "url": "https://www.wikihow.com/Torch-Creme-Brulee",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation"
    ],
    "methods": [
        {
            "name": "Caramelizing Crème Brûlée With a Blowtorch",
            "steps": [
                {
                    "headline": "Buy a culinary torch from a kitchen supplies retailer for approximately $30.",
                    "description": "The torch is fueled by butane, which is usually sold separately."
                },
                {
                    "headline": "Remove the chilled crème brûlée from the refrigerator right before you are ready to torch it.",
                    "description": ""
                },
                {
                    "headline": "Sprinkle granulated sugar evenly over the top of the crème brûlée until it is completely covered.",
                    "description": ""
                },
                {
                    "headline": "Take the safety off the torch, press the ignition to turn it on and lock it in the “on” position.",
                    "description": ""
                },
                {
                    "headline": "Hold the flame approximately 2 inches (5 centimeters) away from the sugar, and move it back and forth or in circles across the surface.",
                    "description": "As the sugar heats, it will turn brown and bubble. Concentrate the flame around the edges of the crème brûlée first, and then do the center. Although the center is typically darker than around the edges, you don’t want the sugar to burn too much."
                },
                {
                    "headline": "Serve the torched crème brûlée immediately.",
                    "description": "The sugar quickly begins to soften, and you want the caramelized sugar to have a nice crackle when you cut into it with the edge of a spoon."
                }
            ]
        },
        {
            "name": "Caramelizing Crème Brûlée With a Broiler",
            "steps": [
                {
                    "headline": "Preheat the broiler.",
                    "description": ""
                },
                {
                    "headline": "Place the crème brûlée in the freezer for 20 minutes to make sure it is well chilled.",
                    "description": ""
                },
                {
                    "headline": "Remove the crème brûlée from the freezer, and sprinkle granulated sugar evenly over the top until it is completely covered.",
                    "description": ""
                },
                {
                    "headline": "Set the individual crème brûlée molds in a shallow pan.",
                    "description": ""
                },
                {
                    "headline": "Fill the shallow pan with a layer of ice cubes so the molds are surrounded.",
                    "description": ""
                },
                {
                    "headline": "Broil the crème brûlée for 1 minute, and then rotate the pan and broil for another 1 to 2 minutes, or until the sugar is browned.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Culinary torch",
        "Butane",
        "Granulated sugar",
        "Shallow pan"
    ],
    "text": " Caramelizing Crème Brûlée With a Blowtorch Buy a culinary torch from a kitchen supplies retailer for approximately $30. The torch is fueled by butane, which is usually sold separately. Remove the chilled crème brûlée from the refrigerator right before you are ready to torch it.  Sprinkle granulated sugar evenly over the top of the crème brûlée until it is completely covered.  Take the safety off the torch, press the ignition to turn it on and lock it in the “on” position.  Hold the flame approximately 2 inches (5 centimeters) away from the sugar, and move it back and forth or in circles across the surface. As the sugar heats, it will turn brown and bubble. Concentrate the flame around the edges of the crème brûlée first, and then do the center. Although the center is typically darker than around the edges, you don’t want the sugar to burn too much. Serve the torched crème brûlée immediately. The sugar quickly begins to soften, and you want the caramelized sugar to have a nice crackle when you cut into it with the edge of a spoon. Caramelizing Crème Brûlée With a Broiler Preheat the broiler.  Place the crème brûlée in the freezer for 20 minutes to make sure it is well chilled.  Remove the crème brûlée from the freezer, and sprinkle granulated sugar evenly over the top until it is completely covered.  Set the individual crème brûlée molds in a shallow pan.  Fill the shallow pan with a layer of ice cubes so the molds are surrounded.  Broil the crème brûlée for 1 minute, and then rotate the pan and broil for another 1 to 2 minutes, or until the sugar is browned. ",
    "sentences": [
        " Caramelizing Crème Brûlée With a Blowtorch Buy a culinary torch from a kitchen supplies retailer for approximately $30.",
        "The torch is fueled by butane, which is usually sold separately.",
        "Remove the chilled crème brûlée from the refrigerator right before you are ready to torch it.",
        "Sprinkle granulated sugar evenly over the top of the crème brûlée until it is completely covered.",
        "Take the safety off the torch, press the ignition to turn it on and lock it in the “on” position.",
        "Hold the flame approximately 2 inches (5 centimeters) away from the sugar, and move it back and forth or in circles across the surface.",
        "As the sugar heats, it will turn brown and bubble.",
        "Concentrate the flame around the edges of the crème brûlée first, and then do the center.",
        "Although the center is typically darker than around the edges, you don’t want the sugar to burn too much.",
        "Serve the torched crème brûlée immediately.",
        "The sugar quickly begins to soften, and you want the caramelized sugar to have a nice crackle when you cut into it with the edge of a spoon.",
        "Caramelizing Crème Brûlée With a Broiler Preheat the broiler.",
        "Place the crème brûlée in the freezer for 20 minutes to make sure it is well chilled.",
        "Remove the crème brûlée from the freezer, and sprinkle granulated sugar evenly over the top until it is completely covered.",
        "Set the individual crème brûlée molds in a shallow pan.",
        "Fill the shallow pan with a layer of ice cubes so the molds are surrounded.",
        "Broil the crème brûlée for 1 minute, and then rotate the pan and broil for another 1 to 2 minutes, or until the sugar is browned."
    ]
}