{
    "title": "How to Play Pool Like a Pro",
    "url": "https://www.wikihow.com/Play-Pool-Like-a-Pro",
    "category_hierarchy": [
        "Sports and Fitness",
        "Individual Sports",
        "Cue Sports"
    ],
    "parts": [
        {
            "name": "Keeping Proper Form",
            "steps": [
                {
                    "headline": "Check your hand position.",
                    "description": "Hold the thick end of the cue in your dominant hand with your palm facing upward. Find the spot on the wrap where the cue evenly balances. Grip your cue about 1\" behind that spot. Make a circle with the thumb and index finger of your non-dominant hand. Put the cue through the circle and rest it on the top of your middle finger, behind the knuckle. Spread out your \"pinky\", ring and middle finger tips to create a tripod-like support. Place the ridge of your hand should on the table. Lift the other side of your hand a bit higher."
                },
                {
                    "headline": "Assume the proper stance.",
                    "description": "Place the foot that is on the same side as your non-dominant hand in front. Position your other foot about 2 feet (60 cm) behind the front foot. Turn your body slightly away from the table so that it doesn't interfere with the shot. Position yourself close to the table but not too close to it. You want to lean into the shots a bit for more control. Proper form requires the cue stick to be directly below your chin during a stroke. If you compare the form of a professional pool player with that of a novice pool player, the professional player will always keep their head down also known as \"being down on the ball\" with the cue directly below his or her chin during the stroke."
                }
            ]
        },
        {
            "name": "Striking the Ball",
            "steps": [
                {
                    "headline": "Chalk the cue tip before every shot as though you're brushing the chalk on with a paintbrush.",
                    "description": "Avoid twisting the chalk on top of the cue."
                },
                {
                    "headline": "Hold your cue parallel to the table for maximum control.",
                    "description": ""
                },
                {
                    "headline": "Accelerate gradually as you approach the ball.",
                    "description": "Imagine that you are moving your arm through the water in a swimming pool instead of hitting the ball with a quick strike. A longer stroke imparts more momentum to the ball."
                },
                {
                    "headline": "Keep your follow-through straight and relaxed.",
                    "description": "The cue should continue on its course and almost hit the table ahead of the ball's starting position. Your cue shouldn't slow down until the tip has actually hit the ball."
                },
                {
                    "headline": "Stay down after the shot.",
                    "description": "This position allows you to analyze the angle of the ball and the direction of every other ball that it strikes. It also ensures that you don't cause the shot to deviate by accidentally introducing a jumpy motion."
                },
                {
                    "headline": "Practice your stroke without actually striking balls until it feels comfortable.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Perfecting Your Aim",
            "steps": [
                {
                    "headline": "Imagine an invisible ball next to the ball that you want to sink into the pocket.",
                    "description": ""
                },
                {
                    "headline": "Place your cue above the target.",
                    "description": "Angle the cue so that it creates a parallel line from right above the cue ball to the target."
                },
                {
                    "headline": "Back your cue up and place the tip on the table where the center of the invisible ball (the one you imagined next to the real ball) would be.",
                    "description": "Maintain the angle that you just made when you lined up the ball and the pocket."
                },
                {
                    "headline": "Keep the cue tip on the table.",
                    "description": "Pull the rest of the cue around to the right or left until the cue is positioned over the white ball. You now have the angle at which you need to hit the white ball to sink the other ball."
                },
                {
                    "headline": "Set your shot up at the angle you just calculated.",
                    "description": "Strike the center of the white ball so that it makes contact with the other ball."
                },
                {
                    "headline": "Start playing with your non-dominant hand all the time until a little after the time you become ambidextrous.",
                    "description": "It will make you less likely to win the current game but more likely to win future games. Sometimes in pool, you get a shot that would be an awkward angle with your dominant hand, but your non-dominant hand will gain skill faster for those awkward shots if you play with your non-dominant hand all the time than if you just do it for those shots. In fact, skill transfers somewhat from one task to another task to your non-dominant hand will gain skill for pool faster if you you do everything with your non-dominant hand than if you just play pool with your non-dominant hand like in other activities."
                }
            ]
        },
        {
            "name": "Choosing a Good Pool Cue",
            "steps": [
                {
                    "headline": "Feel the wrap or butt of the cue.",
                    "description": "Choose a larger wrap if you have large hands and a smaller wrap if you have small hands. The most important point is to find a wrap that feels good in your hands. If your hands sweat, choose a cue wrapped in Irish linen for absorption. Otherwise, choose a leather wrap or a cue with no wrap."
                },
                {
                    "headline": "Check the shaft.",
                    "description": "Most shafts have a diameter of 12mm to 13mm. While 13mm is the most commonly selected size, a smaller shaft can make the bridge position more comfortable for people with smaller hands."
                },
                {
                    "headline": "Measure the pro taper.",
                    "description": "The shaft maintains its diameter for 10\" to 15\" before it starts to taper toward the cue. A shorter taper gives you a firmer hit."
                },
                {
                    "headline": "Know the cue weight.",
                    "description": "Most players choose a weight between 19 and 20 ounces."
                },
                {
                    "headline": "Check cue length.",
                    "description": "Most cues are 57\" or 58\" long, but you can special order different lengths."
                },
                {
                    "headline": "Pick your cue tip.",
                    "description": "Cue tips are made of leather and generally rated medium to hard. A tip that will wear well gives you better control of the ball."
                },
                {
                    "headline": "Make sure no parts are loose.",
                    "description": "Any loose parts will absorb the energy from your shots and will hamper your ability to strike the ball well."
                }
            ]
        }
    ],
    "tyn": [
        "Pool cue",
        "Pool table",
        "Billiard balls",
        "Chalk"
    ],
    "text": " Keeping Proper Form Check your hand position. Hold the thick end of the cue in your dominant hand with your palm facing upward. Find the spot on the wrap where the cue evenly balances. Grip your cue about 1\" behind that spot. Make a circle with the thumb and index finger of your non-dominant hand. Put the cue through the circle and rest it on the top of your middle finger, behind the knuckle. Spread out your \"pinky\", ring and middle finger tips to create a tripod-like support. Place the ridge of your hand should on the table. Lift the other side of your hand a bit higher. Assume the proper stance. Place the foot that is on the same side as your non-dominant hand in front. Position your other foot about 2 feet (60 cm) behind the front foot. Turn your body slightly away from the table so that it doesn't interfere with the shot. Position yourself close to the table but not too close to it. You want to lean into the shots a bit for more control. Proper form requires the cue stick to be directly below your chin during a stroke. If you compare the form of a professional pool player with that of a novice pool player, the professional player will always keep their head down also known as \"being down on the ball\" with the cue directly below his or her chin during the stroke. Striking the Ball Chalk the cue tip before every shot as though you're brushing the chalk on with a paintbrush. Avoid twisting the chalk on top of the cue. Hold your cue parallel to the table for maximum control.  Accelerate gradually as you approach the ball. Imagine that you are moving your arm through the water in a swimming pool instead of hitting the ball with a quick strike. A longer stroke imparts more momentum to the ball. Keep your follow-through straight and relaxed. The cue should continue on its course and almost hit the table ahead of the ball's starting position. Your cue shouldn't slow down until the tip has actually hit the ball. Stay down after the shot. This position allows you to analyze the angle of the ball and the direction of every other ball that it strikes. It also ensures that you don't cause the shot to deviate by accidentally introducing a jumpy motion. Practice your stroke without actually striking balls until it feels comfortable.  Perfecting Your Aim Imagine an invisible ball next to the ball that you want to sink into the pocket.  Place your cue above the target. Angle the cue so that it creates a parallel line from right above the cue ball to the target. Back your cue up and place the tip on the table where the center of the invisible ball (the one you imagined next to the real ball) would be. Maintain the angle that you just made when you lined up the ball and the pocket. Keep the cue tip on the table. Pull the rest of the cue around to the right or left until the cue is positioned over the white ball. You now have the angle at which you need to hit the white ball to sink the other ball. Set your shot up at the angle you just calculated. Strike the center of the white ball so that it makes contact with the other ball. Start playing with your non-dominant hand all the time until a little after the time you become ambidextrous. It will make you less likely to win the current game but more likely to win future games. Sometimes in pool, you get a shot that would be an awkward angle with your dominant hand, but your non-dominant hand will gain skill faster for those awkward shots if you play with your non-dominant hand all the time than if you just do it for those shots. In fact, skill transfers somewhat from one task to another task to your non-dominant hand will gain skill for pool faster if you you do everything with your non-dominant hand than if you just play pool with your non-dominant hand like in other activities. Choosing a Good Pool Cue Feel the wrap or butt of the cue. Choose a larger wrap if you have large hands and a smaller wrap if you have small hands. The most important point is to find a wrap that feels good in your hands. If your hands sweat, choose a cue wrapped in Irish linen for absorption. Otherwise, choose a leather wrap or a cue with no wrap. Check the shaft. Most shafts have a diameter of 12mm to 13mm. While 13mm is the most commonly selected size, a smaller shaft can make the bridge position more comfortable for people with smaller hands. Measure the pro taper. The shaft maintains its diameter for 10\" to 15\" before it starts to taper toward the cue. A shorter taper gives you a firmer hit. Know the cue weight. Most players choose a weight between 19 and 20 ounces. Check cue length. Most cues are 57\" or 58\" long, but you can special order different lengths. Pick your cue tip. Cue tips are made of leather and generally rated medium to hard. A tip that will wear well gives you better control of the ball. Make sure no parts are loose. Any loose parts will absorb the energy from your shots and will hamper your ability to strike the ball well.",
    "sentences": [
        " Keeping Proper Form Check your hand position.",
        "Hold the thick end of the cue in your dominant hand with your palm facing upward.",
        "Find the spot on the wrap where the cue evenly balances.",
        "Grip your cue about 1\" behind that spot.",
        "Make a circle with the thumb and index finger of your non-dominant hand.",
        "Put the cue through the circle and rest it on the top of your middle finger, behind the knuckle.",
        "Spread out your \"pinky\", ring and middle finger tips to create a tripod-like support.",
        "Place the ridge of your hand should on the table.",
        "Lift the other side of your hand a bit higher.",
        "Assume the proper stance.",
        "Place the foot that is on the same side as your non-dominant hand in front.",
        "Position your other foot about 2 feet (60 cm) behind the front foot.",
        "Turn your body slightly away from the table so that it doesn't interfere with the shot.",
        "Position yourself close to the table but not too close to it.",
        "You want to lean into the shots a bit for more control.",
        "Proper form requires the cue stick to be directly below your chin during a stroke.",
        "If you compare the form of a professional pool player with that of a novice pool player, the professional player will always keep their head down also known as \"being down on the ball\" with the cue directly below his or her chin during the stroke.",
        "Striking the Ball Chalk the cue tip before every shot as though you're brushing the chalk on with a paintbrush.",
        "Avoid twisting the chalk on top of the cue.",
        "Hold your cue parallel to the table for maximum control.",
        "Accelerate gradually as you approach the ball.",
        "Imagine that you are moving your arm through the water in a swimming pool instead of hitting the ball with a quick strike.",
        "A longer stroke imparts more momentum to the ball.",
        "Keep your follow-through straight and relaxed.",
        "The cue should continue on its course and almost hit the table ahead of the ball's starting position.",
        "Your cue shouldn't slow down until the tip has actually hit the ball.",
        "Stay down after the shot.",
        "This position allows you to analyze the angle of the ball and the direction of every other ball that it strikes.",
        "It also ensures that you don't cause the shot to deviate by accidentally introducing a jumpy motion.",
        "Practice your stroke without actually striking balls until it feels comfortable.",
        "Perfecting Your Aim Imagine an invisible ball next to the ball that you want to sink into the pocket.",
        "Place your cue above the target.",
        "Angle the cue so that it creates a parallel line from right above the cue ball to the target.",
        "Back your cue up and place the tip on the table where the center of the invisible ball (the one you imagined next to the real ball) would be.",
        "Maintain the angle that you just made when you lined up the ball and the pocket.",
        "Keep the cue tip on the table.",
        "Pull the rest of the cue around to the right or left until the cue is positioned over the white ball.",
        "You now have the angle at which you need to hit the white ball to sink the other ball.",
        "Set your shot up at the angle you just calculated.",
        "Strike the center of the white ball so that it makes contact with the other ball.",
        "Start playing with your non-dominant hand all the time until a little after the time you become ambidextrous.",
        "It will make you less likely to win the current game but more likely to win future games.",
        "Sometimes in pool, you get a shot that would be an awkward angle with your dominant hand, but your non-dominant hand will gain skill faster for those awkward shots if you play with your non-dominant hand all the time than if you just do it for those shots.",
        "In fact, skill transfers somewhat from one task to another task to your non-dominant hand will gain skill for pool faster if you you do everything with your non-dominant hand than if you just play pool with your non-dominant hand like in other activities.",
        "Choosing a Good Pool Cue Feel the wrap or butt of the cue.",
        "Choose a larger wrap if you have large hands and a smaller wrap if you have small hands.",
        "The most important point is to find a wrap that feels good in your hands.",
        "If your hands sweat, choose a cue wrapped in Irish linen for absorption.",
        "Otherwise, choose a leather wrap or a cue with no wrap.",
        "Check the shaft.",
        "Most shafts have a diameter of 12mm to 13mm.",
        "While 13mm is the most commonly selected size, a smaller shaft can make the bridge position more comfortable for people with smaller hands.",
        "Measure the pro taper.",
        "The shaft maintains its diameter for 10\" to 15\" before it starts to taper toward the cue.",
        "A shorter taper gives you a firmer hit.",
        "Know the cue weight.",
        "Most players choose a weight between 19 and 20 ounces.",
        "Check cue length.",
        "Most cues are 57\" or 58\" long, but you can special order different lengths.",
        "Pick your cue tip.",
        "Cue tips are made of leather and generally rated medium to hard.",
        "A tip that will wear well gives you better control of the ball.",
        "Make sure no parts are loose.",
        "Any loose parts will absorb the energy from your shots and will hamper your ability to strike the ball well."
    ]
}