{
    "title": "How to Sew a Colonial Knot Embroidery Stitch",
    "url": "https://www.wikihow.com/Sew-a-Colonial-Knot-Embroidery-Stitch",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework",
        "Embroidery"
    ],
    "steps": [
        {
            "headline": "Thread your needle and tie a knot.",
            "description": ""
        },
        {
            "headline": "Place your fabric in an embroidery hoop to help maintain tension on the fabric and keep the stitches from puckering the fabric.",
            "description": ""
        },
        {
            "headline": "Pull the threaded needle up through the cloth from the back side.",
            "description": ""
        },
        {
            "headline": "Make a backwards \"C\" shape with your yarn.",
            "description": ""
        },
        {
            "headline": "Lay your needle down over the curve, and tuck the point in behind the yarn next to where you came up from the back side.",
            "description": ""
        },
        {
            "headline": "Wrap the \"working end\" of the yarn around the tip of the needle to form a \"figure eight\" on the needle.",
            "description": ""
        },
        {
            "headline": "Pull on the working end of the yarn to snug down the figure eight.",
            "description": ""
        },
        {
            "headline": "Poke the loaded needle down next to where it came up (not in the same hole, but just next to it).",
            "description": ""
        },
        {
            "headline": "Keep a gentle tension on the working end of the thread as you pull the needle through and snug down the knot.",
            "description": ""
        },
        {
            "headline": "Repeat as often as you like for a very easy \"French knot\" substitute!",
            "description": ""
        }
    ],
    "tyn": [
        "Linen",
        "Embroidery hoop",
        "Embroidery needle",
        "Heavy thread or yarn"
    ],
    "text": " Thread your needle and tie a knot.  Place your fabric in an embroidery hoop to help maintain tension on the fabric and keep the stitches from puckering the fabric.  Pull the threaded needle up through the cloth from the back side.  Make a backwards \"C\" shape with your yarn.  Lay your needle down over the curve, and tuck the point in behind the yarn next to where you came up from the back side.  Wrap the \"working end\" of the yarn around the tip of the needle to form a \"figure eight\" on the needle.  Pull on the working end of the yarn to snug down the figure eight.  Poke the loaded needle down next to where it came up (not in the same hole, but just next to it).  Keep a gentle tension on the working end of the thread as you pull the needle through and snug down the knot.  Repeat as often as you like for a very easy \"French knot\" substitute! ",
    "sentences": [
        " Thread your needle and tie a knot.",
        "Place your fabric in an embroidery hoop to help maintain tension on the fabric and keep the stitches from puckering the fabric.",
        "Pull the threaded needle up through the cloth from the back side.",
        "Make a backwards \"C\" shape with your yarn.",
        "Lay your needle down over the curve, and tuck the point in behind the yarn next to where you came up from the back side.",
        "Wrap the \"working end\" of the yarn around the tip of the needle to form a \"figure eight\" on the needle.",
        "Pull on the working end of the yarn to snug down the figure eight.",
        "Poke the loaded needle down next to where it came up (not in the same hole, but just next to it).",
        "Keep a gentle tension on the working end of the thread as you pull the needle through and snug down the knot.",
        "Repeat as often as you like for a very easy \"French knot\" substitute!"
    ]
}