{
    "title": "How to Install Travertine Tile",
    "url": "https://www.wikihow.com/Install-Travertine-Tile",
    "category_hierarchy": [
        "Home and Garden",
        "DIY",
        "Tiles and Tiling",
        "Travertine"
    ],
    "parts": [
        {
            "name": "Preparing the Area for Tile",
            "steps": [
                {
                    "headline": "Remove any previous covering.",
                    "description": "Regardless of whether you are tiling a floor or a backsplash, you will have to remove any previous covering. This can include pulling up carpet or vinyl flooring, removing previous tile flooring, taking down wallpaper, etc. Many of these removal jobs can be a project unto themselves, but you can find help at How to: Remove Floor Tile, Take Out Carpet, and Remove Wallpaper."
                },
                {
                    "headline": "Measure the area you intend to tile.",
                    "description": "Take exact measurements of the area you plan to tile. You will need to know the total area in square feet (or square meters), so you can purchase the correct amount of tile."
                },
                {
                    "headline": "Purchase all the supplies.",
                    "description": "Once you’ve started on the project, you don’t want to have to stop to purchase more tile, thin-set mortar, or anything else, so purchase everything you need in advance. Consult with the tile vendor or a home improvement store regarding how much thin-set you will need for your particular job. You’ll additionally need buckets to mix the mortar, trowels to spread it, sponges to clean as you go, and a tile cutter to make exact cuts for corner and edge pieces. Inevitably, you will lose some tile to breakage (dropping, cracking, chipping, etc.) during the process, so make sure to purchase extra. Due to the unique coloring of travertine, it also also doesn’t hurt to have extra matching tiles in storage in case any of the tiles chip or crack down the road."
                },
                {
                    "headline": "Prepare the surface for tiling.",
                    "description": "Once you have your previous covering removed and all of your materials on hand, you should prepare the surface for tile. If you’re applying the tile to a wall as a backsplash, then you should remove all switch plates and use 80-grit sandpaper to sand the wall by hand. This will create a rough surface on the paint that will bind better to the thin-set mortar. Make sure to use a damp rag to remove any dust from the wall after sanding. For travertine flooring, you need a clean, even surface, so remove any leftover residue from the previous flooring and mop to remove any debris. For a wood rather than concrete subfloor, lay down 0.5” cement fiberboard to create an even subfloor."
                }
            ]
        },
        {
            "name": "Installing Travertine Tiles",
            "steps": [
                {
                    "headline": "Mark the midpoint of the area to be tiled.",
                    "description": "Whether you’re tiling flooring or a backsplash, you want to mark the midpoint of the surface. This is to ensure that you’re starting with the focal point of the room and that the tile feels symmetrical across. For flooring, you want to mark both the X and Y axis along the flooring in order to find the exact center of the room. Make chalk lines and double check the angles with a carpenter’s angle. For a backsplash, you only need to find the horizontal middle, but mark this middle with a vertical chalk line down the wall. Use a carpenter’s level to ensure the line is straight."
                },
                {
                    "headline": "Lay out the tile design.",
                    "description": "With the floor prepped and the center marked, you can lay out the design of the tile. Start with the center gridline(s) and place additional tiles leaving the appropriate amount of room for the spacers, which will later be grout lines. For a backsplash, you will have to measure the exact space and lay the tiles out on the ground to match it since you cannot hold the tiles to the wall to check the design. For floor tiling, you can use the space you left for the grout to chalk in an entire grid for the project if you so choose."
                },
                {
                    "headline": "Mix your thin-set mortar.",
                    "description": "You will not be able to mix the thin-set for the entire project at once. Instead mix small batches in a five-gallon bucket. As you get going, you’ll gain a pretty quick understanding of the pace you go and how much you use. Whatever you mix must be used within two hours. Regardless of whether you’re installing floor or wall tiling, the thin-set should have the consistency of mashed potatoes when you mix it."
                },
                {
                    "headline": "Apply the thin-set to a small area.",
                    "description": "Start with the area where you measured your initial chalk lines and spread enough thin-set to place two or three tiles to start. Use the edge of a V-notched trowel at roughly a 45-degree angle to spread the thin-set. You want to have an evenly, thinly covered space before putting down a tile. You want to actually scrape the trowel along the surface slightly to achieve the even spread. There will be slight furrows in the thin-set from the notches in the edge of the trowel. They are supposed to be there as they help air escape as the mortar sets."
                },
                {
                    "headline": "Apply the first tiles.",
                    "description": "Place the first tile flush with your chalk centerline(s). For a backsplash, the process is easiest to do in rows. For a flooring job, it’s easiest to start at one of the 90-degree angles in the center lines and work in quadrants based on those lines."
                },
                {
                    "headline": "Place spacers.",
                    "description": "As you place the tiles, make sure you’re putting spacers between each to help keep consistent lines for grouting later."
                },
                {
                    "headline": "Check for level placement.",
                    "description": "Every two or three tiles, use a carpenter’s level to ensure flat, even placement of the tiles. If you want to take extra precautions to maintain the level surface, you can also purchase a leveling system, which consists of threaded pegs that go between the spacers and knobs that you can gently tighten down against the tops of the tiles to help perfectly level them and hold them in place."
                },
                {
                    "headline": "Wipe excess thin-set as you go.",
                    "description": "Don’t worry if any thin-set ends up on the top surface of a tile as you trowel it. You can use a damp sponge to wipe it away."
                },
                {
                    "headline": "Cut tiles around baseboards.",
                    "description": "As you work toward the edges of your surface, you will likely have to cut some of the tiles to fit them. Take the exact measurement to which you need to cut the tile accounting for any spacers and transfer the measurement to the tile with a pencil. Then use a wet saw to make the cuts. If you are unfamiliar with how to use a wet saw, then you can find more at Use a Tile Saw. Since the saws aren’t cheap, you will probably prefer to rent one from a hardware store for your project. For dealing with placing tiles around electrical outlets, you can find more information at Tile Around Outlets."
                }
            ]
        },
        {
            "name": "Grouting and Sealing Tiles",
            "steps": [
                {
                    "headline": "Wait for the thin-set mortar to cure.",
                    "description": "You must wait until the thin-set mortar has cured completely before applying grout, which based on your brand, the consistency to which you mixed, the temperature, and the humidity can take anywhere from 24 to 48 hours. Since the spaces between the tiles allow air to escape as the mortar sets, it is imperative not to grout until the process is complete."
                },
                {
                    "headline": "Apply grout.",
                    "description": "After you have removed the spacers and any leveling system pegs, you can apply the grout. You’ll mix the grout with water into a thick paste and apply it with a grout float, which allows you both to push grout into the joints and even it as you go. Because travertine is a porous tile and can stain, you should use white grout with travertine."
                },
                {
                    "headline": "Remove excess grout with a damp sponge.",
                    "description": "Since grout begins to set quickly, work on small sections at a time and use a damp sponge to clear any excess grout on the tiles. The amount of tile to let the grout dry will depend on the brand, but it will be clearly marked on the packaging."
                },
                {
                    "headline": "Use a travertine sealer.",
                    "description": "To extend the life of your new travertine floor or backsplash, you should apply a sealant to it. Though most sealants require waiting at least two weeks before application. For more information on that process, visit Seal Travertine."
                }
            ]
        }
    ],
    "tyn": [
        "Thin-set, flexible is the best.",
        "Knee pads",
        "1/2\" notch trowel",
        "Measuring tape",
        "Wet saw",
        "Chalk (to mark the floor)",
        "Stone sealer",
        "Enough tile for the job",
        "Pencil",
        "Grout"
    ],
    "text": " Preparing the Area for Tile Remove any previous covering. Regardless of whether you are tiling a floor or a backsplash, you will have to remove any previous covering. This can include pulling up carpet or vinyl flooring, removing previous tile flooring, taking down wallpaper, etc. Many of these removal jobs can be a project unto themselves, but you can find help at How to: Remove Floor Tile, Take Out Carpet, and Remove Wallpaper. Measure the area you intend to tile. Take exact measurements of the area you plan to tile. You will need to know the total area in square feet (or square meters), so you can purchase the correct amount of tile. Purchase all the supplies. Once you’ve started on the project, you don’t want to have to stop to purchase more tile, thin-set mortar, or anything else, so purchase everything you need in advance. Consult with the tile vendor or a home improvement store regarding how much thin-set you will need for your particular job. You’ll additionally need buckets to mix the mortar, trowels to spread it, sponges to clean as you go, and a tile cutter to make exact cuts for corner and edge pieces. Inevitably, you will lose some tile to breakage (dropping, cracking, chipping, etc.) during the process, so make sure to purchase extra. Due to the unique coloring of travertine, it also also doesn’t hurt to have extra matching tiles in storage in case any of the tiles chip or crack down the road. Prepare the surface for tiling. Once you have your previous covering removed and all of your materials on hand, you should prepare the surface for tile. If you’re applying the tile to a wall as a backsplash, then you should remove all switch plates and use 80-grit sandpaper to sand the wall by hand. This will create a rough surface on the paint that will bind better to the thin-set mortar. Make sure to use a damp rag to remove any dust from the wall after sanding. For travertine flooring, you need a clean, even surface, so remove any leftover residue from the previous flooring and mop to remove any debris. For a wood rather than concrete subfloor, lay down 0.5” cement fiberboard to create an even subfloor. Installing Travertine Tiles Mark the midpoint of the area to be tiled. Whether you’re tiling flooring or a backsplash, you want to mark the midpoint of the surface. This is to ensure that you’re starting with the focal point of the room and that the tile feels symmetrical across. For flooring, you want to mark both the X and Y axis along the flooring in order to find the exact center of the room. Make chalk lines and double check the angles with a carpenter’s angle. For a backsplash, you only need to find the horizontal middle, but mark this middle with a vertical chalk line down the wall. Use a carpenter’s level to ensure the line is straight. Lay out the tile design. With the floor prepped and the center marked, you can lay out the design of the tile. Start with the center gridline(s) and place additional tiles leaving the appropriate amount of room for the spacers, which will later be grout lines. For a backsplash, you will have to measure the exact space and lay the tiles out on the ground to match it since you cannot hold the tiles to the wall to check the design. For floor tiling, you can use the space you left for the grout to chalk in an entire grid for the project if you so choose. Mix your thin-set mortar. You will not be able to mix the thin-set for the entire project at once. Instead mix small batches in a five-gallon bucket. As you get going, you’ll gain a pretty quick understanding of the pace you go and how much you use. Whatever you mix must be used within two hours. Regardless of whether you’re installing floor or wall tiling, the thin-set should have the consistency of mashed potatoes when you mix it. Apply the thin-set to a small area. Start with the area where you measured your initial chalk lines and spread enough thin-set to place two or three tiles to start. Use the edge of a V-notched trowel at roughly a 45-degree angle to spread the thin-set. You want to have an evenly, thinly covered space before putting down a tile. You want to actually scrape the trowel along the surface slightly to achieve the even spread. There will be slight furrows in the thin-set from the notches in the edge of the trowel. They are supposed to be there as they help air escape as the mortar sets. Apply the first tiles. Place the first tile flush with your chalk centerline(s). For a backsplash, the process is easiest to do in rows. For a flooring job, it’s easiest to start at one of the 90-degree angles in the center lines and work in quadrants based on those lines. Place spacers. As you place the tiles, make sure you’re putting spacers between each to help keep consistent lines for grouting later. Check for level placement. Every two or three tiles, use a carpenter’s level to ensure flat, even placement of the tiles. If you want to take extra precautions to maintain the level surface, you can also purchase a leveling system, which consists of threaded pegs that go between the spacers and knobs that you can gently tighten down against the tops of the tiles to help perfectly level them and hold them in place. Wipe excess thin-set as you go. Don’t worry if any thin-set ends up on the top surface of a tile as you trowel it. You can use a damp sponge to wipe it away. Cut tiles around baseboards. As you work toward the edges of your surface, you will likely have to cut some of the tiles to fit them. Take the exact measurement to which you need to cut the tile accounting for any spacers and transfer the measurement to the tile with a pencil. Then use a wet saw to make the cuts. If you are unfamiliar with how to use a wet saw, then you can find more at Use a Tile Saw. Since the saws aren’t cheap, you will probably prefer to rent one from a hardware store for your project. For dealing with placing tiles around electrical outlets, you can find more information at Tile Around Outlets. Grouting and Sealing Tiles Wait for the thin-set mortar to cure. You must wait until the thin-set mortar has cured completely before applying grout, which based on your brand, the consistency to which you mixed, the temperature, and the humidity can take anywhere from 24 to 48 hours. Since the spaces between the tiles allow air to escape as the mortar sets, it is imperative not to grout until the process is complete. Apply grout. After you have removed the spacers and any leveling system pegs, you can apply the grout. You’ll mix the grout with water into a thick paste and apply it with a grout float, which allows you both to push grout into the joints and even it as you go. Because travertine is a porous tile and can stain, you should use white grout with travertine. Remove excess grout with a damp sponge. Since grout begins to set quickly, work on small sections at a time and use a damp sponge to clear any excess grout on the tiles. The amount of tile to let the grout dry will depend on the brand, but it will be clearly marked on the packaging. Use a travertine sealer. To extend the life of your new travertine floor or backsplash, you should apply a sealant to it. Though most sealants require waiting at least two weeks before application. For more information on that process, visit Seal Travertine.",
    "sentences": [
        " Preparing the Area for Tile Remove any previous covering.",
        "Regardless of whether you are tiling a floor or a backsplash, you will have to remove any previous covering.",
        "This can include pulling up carpet or vinyl flooring, removing previous tile flooring, taking down wallpaper, etc.",
        "Many of these removal jobs can be a project unto themselves, but you can find help at How to: Remove Floor Tile, Take Out Carpet, and Remove Wallpaper.",
        "Measure the area you intend to tile.",
        "Take exact measurements of the area you plan to tile.",
        "You will need to know the total area in square feet (or square meters), so you can purchase the correct amount of tile.",
        "Purchase all the supplies.",
        "Once you’ve started on the project, you don’t want to have to stop to purchase more tile, thin-set mortar, or anything else, so purchase everything you need in advance.",
        "Consult with the tile vendor or a home improvement store regarding how much thin-set you will need for your particular job.",
        "You’ll additionally need buckets to mix the mortar, trowels to spread it, sponges to clean as you go, and a tile cutter to make exact cuts for corner and edge pieces.",
        "Inevitably, you will lose some tile to breakage (dropping, cracking, chipping, etc.)",
        "during the process, so make sure to purchase extra.",
        "Due to the unique coloring of travertine, it also also doesn’t hurt to have extra matching tiles in storage in case any of the tiles chip or crack down the road.",
        "Prepare the surface for tiling.",
        "Once you have your previous covering removed and all of your materials on hand, you should prepare the surface for tile.",
        "If you’re applying the tile to a wall as a backsplash, then you should remove all switch plates and use 80-grit sandpaper to sand the wall by hand.",
        "This will create a rough surface on the paint that will bind better to the thin-set mortar.",
        "Make sure to use a damp rag to remove any dust from the wall after sanding.",
        "For travertine flooring, you need a clean, even surface, so remove any leftover residue from the previous flooring and mop to remove any debris.",
        "For a wood rather than concrete subfloor, lay down 0.5” cement fiberboard to create an even subfloor.",
        "Installing Travertine Tiles Mark the midpoint of the area to be tiled.",
        "Whether you’re tiling flooring or a backsplash, you want to mark the midpoint of the surface.",
        "This is to ensure that you’re starting with the focal point of the room and that the tile feels symmetrical across.",
        "For flooring, you want to mark both the X and Y axis along the flooring in order to find the exact center of the room.",
        "Make chalk lines and double check the angles with a carpenter’s angle.",
        "For a backsplash, you only need to find the horizontal middle, but mark this middle with a vertical chalk line down the wall.",
        "Use a carpenter’s level to ensure the line is straight.",
        "Lay out the tile design.",
        "With the floor prepped and the center marked, you can lay out the design of the tile.",
        "Start with the center gridline(s) and place additional tiles leaving the appropriate amount of room for the spacers, which will later be grout lines.",
        "For a backsplash, you will have to measure the exact space and lay the tiles out on the ground to match it since you cannot hold the tiles to the wall to check the design.",
        "For floor tiling, you can use the space you left for the grout to chalk in an entire grid for the project if you so choose.",
        "Mix your thin-set mortar.",
        "You will not be able to mix the thin-set for the entire project at once.",
        "Instead mix small batches in a five-gallon bucket.",
        "As you get going, you’ll gain a pretty quick understanding of the pace you go and how much you use.",
        "Whatever you mix must be used within two hours.",
        "Regardless of whether you’re installing floor or wall tiling, the thin-set should have the consistency of mashed potatoes when you mix it.",
        "Apply the thin-set to a small area.",
        "Start with the area where you measured your initial chalk lines and spread enough thin-set to place two or three tiles to start.",
        "Use the edge of a V-notched trowel at roughly a 45-degree angle to spread the thin-set.",
        "You want to have an evenly, thinly covered space before putting down a tile.",
        "You want to actually scrape the trowel along the surface slightly to achieve the even spread.",
        "There will be slight furrows in the thin-set from the notches in the edge of the trowel.",
        "They are supposed to be there as they help air escape as the mortar sets.",
        "Apply the first tiles.",
        "Place the first tile flush with your chalk centerline(s).",
        "For a backsplash, the process is easiest to do in rows.",
        "For a flooring job, it’s easiest to start at one of the 90-degree angles in the center lines and work in quadrants based on those lines.",
        "Place spacers.",
        "As you place the tiles, make sure you’re putting spacers between each to help keep consistent lines for grouting later.",
        "Check for level placement.",
        "Every two or three tiles, use a carpenter’s level to ensure flat, even placement of the tiles.",
        "If you want to take extra precautions to maintain the level surface, you can also purchase a leveling system, which consists of threaded pegs that go between the spacers and knobs that you can gently tighten down against the tops of the tiles to help perfectly level them and hold them in place.",
        "Wipe excess thin-set as you go.",
        "Don’t worry if any thin-set ends up on the top surface of a tile as you trowel it.",
        "You can use a damp sponge to wipe it away.",
        "Cut tiles around baseboards.",
        "As you work toward the edges of your surface, you will likely have to cut some of the tiles to fit them.",
        "Take the exact measurement to which you need to cut the tile accounting for any spacers and transfer the measurement to the tile with a pencil.",
        "Then use a wet saw to make the cuts.",
        "If you are unfamiliar with how to use a wet saw, then you can find more at Use a Tile Saw.",
        "Since the saws aren’t cheap, you will probably prefer to rent one from a hardware store for your project.",
        "For dealing with placing tiles around electrical outlets, you can find more information at Tile Around Outlets.",
        "Grouting and Sealing Tiles Wait for the thin-set mortar to cure.",
        "You must wait until the thin-set mortar has cured completely before applying grout, which based on your brand, the consistency to which you mixed, the temperature, and the humidity can take anywhere from 24 to 48 hours.",
        "Since the spaces between the tiles allow air to escape as the mortar sets, it is imperative not to grout until the process is complete.",
        "Apply grout.",
        "After you have removed the spacers and any leveling system pegs, you can apply the grout.",
        "You’ll mix the grout with water into a thick paste and apply it with a grout float, which allows you both to push grout into the joints and even it as you go.",
        "Because travertine is a porous tile and can stain, you should use white grout with travertine.",
        "Remove excess grout with a damp sponge.",
        "Since grout begins to set quickly, work on small sections at a time and use a damp sponge to clear any excess grout on the tiles.",
        "The amount of tile to let the grout dry will depend on the brand, but it will be clearly marked on the packaging.",
        "Use a travertine sealer.",
        "To extend the life of your new travertine floor or backsplash, you should apply a sealant to it.",
        "Though most sealants require waiting at least two weeks before application.",
        "For more information on that process, visit Seal Travertine."
    ]
}