{
    "title": "How to Massage Someone's Back",
    "url": "https://www.wikihow.com/Massage-Someone%27s-Back",
    "category_hierarchy": [
        "Personal Care and Style",
        "Massage",
        "Back Massage"
    ],
    "methods": [
        {
            "name": "Preparation",
            "steps": [
                {
                    "headline": "Get a bed.",
                    "description": "The first thing you will need is a nice, clean bed (firm is best). Fresh linens are essential."
                },
                {
                    "headline": "Ask the client to lie down on his/her stomach, with their shirt off.",
                    "description": ""
                },
                {
                    "headline": "Clean and disinfect your hands.",
                    "description": ""
                },
                {
                    "headline": "Obtain some massage oil and pour a generous amount into your hands.",
                    "description": "Start rubbing your hands together until they are warm. If you do not have massage oil, you can use baby oil or petroleum jelly."
                }
            ]
        },
        {
            "name": "Back Massage",
            "steps": [
                {
                    "headline": "Start in the very middle of the client's back, with your hands clasped together (in a 'clap' type position).",
                    "description": ""
                },
                {
                    "headline": "Keep body contact at all times, including when you are getting more lotion.",
                    "description": "This avoids a startling response when resuming touch."
                },
                {
                    "headline": "Begin to run  your palms of both hands in opposite directions: One hand sliding towards right shoulder, other hand towards left hip.",
                    "description": "Then slide back, until hands meet again in another 'clap' position. Repeat this for a while."
                },
                {
                    "headline": "Place your arms onto the back of the client.",
                    "description": "Rub back & forth on back with both arms, up and down."
                },
                {
                    "headline": "Move up to the front of client, but keep your hands on client's back.",
                    "description": ""
                },
                {
                    "headline": "Squeeze and push the client's lower back.",
                    "description": ""
                },
                {
                    "headline": "Start making circular motions along the back of client, towards his/her shoulder.",
                    "description": ""
                },
                {
                    "headline": "Grasp the shoulder firmly and \"wring\" it, pressing your fingertips into them.",
                    "description": ""
                },
                {
                    "headline": "Make circular motions along the collar bone, going back and forth repeatedly.",
                    "description": ""
                },
                {
                    "headline": "Slide back down to middle of back, and make your hands meet in \"clap\" position.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Varied Touch Massage",
            "steps": [
                {
                    "headline": "Vary touch from light to firm, you can drag fingers lightly as if tickling, then alternate with firm or intermediate levels of touch.",
                    "description": ""
                },
                {
                    "headline": "Gentle chops are another way to vary the touch.",
                    "description": "Relax your hand and in a chopping motion pat the clients back. Keep in mind the motion should come from the arm and you should offer no resistance from the fingers or wrist."
                },
                {
                    "headline": "Don't limit touch to hands alone, another useful way to alternate touch is to use your elbow.",
                    "description": "This must be used gently to avoid causing pain. Do not cross the client's spine when using this technique! This technique is especially effective for masseurs who have weak or fatigued hands."
                },
                {
                    "headline": "A knuckle massage is also effective, but like the elbow technique caution must be taken (in intensity and location).",
                    "description": ""
                },
                {
                    "headline": "Skin rolling is another way to vary your technique.",
                    "description": "If the client has skin that is not hyper extended, it often feels very good. Pinch with both hands starting by placing your thumb and forefingers about four inches apart. Then \"pinch\" down to about half the distance. Then grab the next couple of inches a finger at a time allowing the previous grab to slide under your thumb. Your forefingers end up crawling and your thumb keeps the \"roll\" in check and sliding forward. The easiest area to do this is side by side the spine, but not on it. You end (or don't begin) when it is difficult to grab a roll."
                }
            ]
        },
        {
            "name": "Hot Stone Massage",
            "steps": [
                {
                    "headline": "Collect at least six smooth stones that fit comfortably in your palm.",
                    "description": "Cleanse them thoroughly before using them."
                },
                {
                    "headline": "Heat the stones in water using a crock pot.",
                    "description": ""
                },
                {
                    "headline": "Heat the stones at a low temperature for about half an hour.",
                    "description": ""
                },
                {
                    "headline": "Use tongs to retrieve the stones.",
                    "description": "Pour away water."
                },
                {
                    "headline": "Place a small pile of stones on the lower part of the client's back.",
                    "description": ""
                },
                {
                    "headline": "Place larger stones along the client's spine and shoulders.",
                    "description": ""
                },
                {
                    "headline": "With one hot stone, glide along lower part of back.",
                    "description": "Do not cross along spine, bones, or joints."
                },
                {
                    "headline": "Glide the same stone along the upper part of the client's back and along the neck.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Clean bed",
        "Clean sheets and towels",
        "Massage cream or oil",
        "Massage stones",
        "Aromatherapy oils (optional)",
        "lotion (optional)"
    ],
    "text": " Preparation Get a bed. The first thing you will need is a nice, clean bed (firm is best). Fresh linens are essential. Ask the client to lie down on his/her stomach, with their shirt off.  Clean and disinfect your hands.  Obtain some massage oil and pour a generous amount into your hands. Start rubbing your hands together until they are warm. If you do not have massage oil, you can use baby oil or petroleum jelly. Back Massage Start in the very middle of the client's back, with your hands clasped together (in a 'clap' type position).  Keep body contact at all times, including when you are getting more lotion. This avoids a startling response when resuming touch. Begin to run  your palms of both hands in opposite directions: One hand sliding towards right shoulder, other hand towards left hip. Then slide back, until hands meet again in another 'clap' position. Repeat this for a while. Place your arms onto the back of the client. Rub back & forth on back with both arms, up and down. Move up to the front of client, but keep your hands on client's back.  Squeeze and push the client's lower back.  Start making circular motions along the back of client, towards his/her shoulder.  Grasp the shoulder firmly and \"wring\" it, pressing your fingertips into them.  Make circular motions along the collar bone, going back and forth repeatedly.  Slide back down to middle of back, and make your hands meet in \"clap\" position.  Varied Touch Massage Vary touch from light to firm, you can drag fingers lightly as if tickling, then alternate with firm or intermediate levels of touch.  Gentle chops are another way to vary the touch. Relax your hand and in a chopping motion pat the clients back. Keep in mind the motion should come from the arm and you should offer no resistance from the fingers or wrist. Don't limit touch to hands alone, another useful way to alternate touch is to use your elbow. This must be used gently to avoid causing pain. Do not cross the client's spine when using this technique! This technique is especially effective for masseurs who have weak or fatigued hands. A knuckle massage is also effective, but like the elbow technique caution must be taken (in intensity and location).  Skin rolling is another way to vary your technique. If the client has skin that is not hyper extended, it often feels very good. Pinch with both hands starting by placing your thumb and forefingers about four inches apart. Then \"pinch\" down to about half the distance. Then grab the next couple of inches a finger at a time allowing the previous grab to slide under your thumb. Your forefingers end up crawling and your thumb keeps the \"roll\" in check and sliding forward. The easiest area to do this is side by side the spine, but not on it. You end (or don't begin) when it is difficult to grab a roll. Hot Stone Massage Collect at least six smooth stones that fit comfortably in your palm. Cleanse them thoroughly before using them. Heat the stones in water using a crock pot.  Heat the stones at a low temperature for about half an hour.  Use tongs to retrieve the stones. Pour away water. Place a small pile of stones on the lower part of the client's back.  Place larger stones along the client's spine and shoulders.  With one hot stone, glide along lower part of back. Do not cross along spine, bones, or joints. Glide the same stone along the upper part of the client's back and along the neck. ",
    "sentences": [
        " Preparation Get a bed.",
        "The first thing you will need is a nice, clean bed (firm is best).",
        "Fresh linens are essential.",
        "Ask the client to lie down on his/her stomach, with their shirt off.",
        "Clean and disinfect your hands.",
        "Obtain some massage oil and pour a generous amount into your hands.",
        "Start rubbing your hands together until they are warm.",
        "If you do not have massage oil, you can use baby oil or petroleum jelly.",
        "Back Massage Start in the very middle of the client's back, with your hands clasped together (in a 'clap' type position).",
        "Keep body contact at all times, including when you are getting more lotion.",
        "This avoids a startling response when resuming touch.",
        "Begin to run  your palms of both hands in opposite directions: One hand sliding towards right shoulder, other hand towards left hip.",
        "Then slide back, until hands meet again in another 'clap' position.",
        "Repeat this for a while.",
        "Place your arms onto the back of the client.",
        "Rub back & forth on back with both arms, up and down.",
        "Move up to the front of client, but keep your hands on client's back.",
        "Squeeze and push the client's lower back.",
        "Start making circular motions along the back of client, towards his/her shoulder.",
        "Grasp the shoulder firmly and \"wring\" it, pressing your fingertips into them.",
        "Make circular motions along the collar bone, going back and forth repeatedly.",
        "Slide back down to middle of back, and make your hands meet in \"clap\" position.",
        "Varied Touch Massage Vary touch from light to firm, you can drag fingers lightly as if tickling, then alternate with firm or intermediate levels of touch.",
        "Gentle chops are another way to vary the touch.",
        "Relax your hand and in a chopping motion pat the clients back.",
        "Keep in mind the motion should come from the arm and you should offer no resistance from the fingers or wrist.",
        "Don't limit touch to hands alone, another useful way to alternate touch is to use your elbow.",
        "This must be used gently to avoid causing pain.",
        "Do not cross the client's spine when using this technique!",
        "This technique is especially effective for masseurs who have weak or fatigued hands.",
        "A knuckle massage is also effective, but like the elbow technique caution must be taken (in intensity and location).",
        "Skin rolling is another way to vary your technique.",
        "If the client has skin that is not hyper extended, it often feels very good.",
        "Pinch with both hands starting by placing your thumb and forefingers about four inches apart.",
        "Then \"pinch\" down to about half the distance.",
        "Then grab the next couple of inches a finger at a time allowing the previous grab to slide under your thumb.",
        "Your forefingers end up crawling and your thumb keeps the \"roll\" in check and sliding forward.",
        "The easiest area to do this is side by side the spine, but not on it.",
        "You end (or don't begin) when it is difficult to grab a roll.",
        "Hot Stone Massage Collect at least six smooth stones that fit comfortably in your palm.",
        "Cleanse them thoroughly before using them.",
        "Heat the stones in water using a crock pot.",
        "Heat the stones at a low temperature for about half an hour.",
        "Use tongs to retrieve the stones.",
        "Pour away water.",
        "Place a small pile of stones on the lower part of the client's back.",
        "Place larger stones along the client's spine and shoulders.",
        "With one hot stone, glide along lower part of back.",
        "Do not cross along spine, bones, or joints.",
        "Glide the same stone along the upper part of the client's back and along the neck."
    ]
}