{
    "title": "How to Dress up As an Evil Witch for Halloween",
    "url": "https://www.wikihow.com/Dress-up-As-an-Evil-Witch-for-Halloween",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Costumes"
    ],
    "steps": [
        {
            "headline": "Gather the items listed in the Things You Need section.",
            "description": "Nothing needs to be in perfect condition! A poorly kept, decrepit witch is no less evil than a well turned out one."
        },
        {
            "headline": "Put on the dress first.",
            "description": "Your evil witch dress can be inspired by any period in time. Wear a sleek, elegant modern evening dress if you wish, you can be the type of evil witch who uses her stunning looks to achieve her evil desires. Find something with a touch of the puritanical, as would of been seen in the Times of the Salem Witch Trials or go further back in history and go for something even older and take inspiration from the late 1400s."
        },
        {
            "headline": "Put on the stockings if your dress is full length, you can skip these if you like.",
            "description": "Add some boots to your outfit."
        },
        {
            "headline": "Put on the cape or cloak.",
            "description": "Improvise with a shawl, blanket or throw if you can't find a suitably evil looking cape."
        },
        {
            "headline": "If you want you can do something crazy with your hair.",
            "description": "Wear a long black wig, or even a bald wig! In the Roald Dahl book, The Witches, all the terribly evil witches are actually bald! If you have long dark hair already, you could add a white or grey streak. Make your hair look like you've been for a wild ride on your broom stick if you like."
        },
        {
            "headline": "Prepare your witches hat.",
            "description": "Go traditional brimmed, pointed hat if you want to be traditional. Wear a Puritan's bonnet, or, a jaunty mini witches hat, for a more modern, sophisticated evil witch look."
        },
        {
            "headline": "Carefully paint your nails if you want to.",
            "description": "Black nail polish can stain, apparently. If you want to go for the evil, unkempt witch look, you could rub coffee grounds into your nails to make them look dirty, like you've Bern mixing poison potions."
        },
        {
            "headline": "Put on your make up, if appropriate.",
            "description": "If you are being a witch from 1480 or so, makeup isn't really required. You can make yourself look glamourous and evil, or raddled, aged and evil."
        },
        {
            "headline": "Put on your evil witch mascara.",
            "description": ""
        },
        {
            "headline": "Last but not least your trick or treat bag.",
            "description": ""
        },
        {
            "headline": "Have fun!",
            "description": ""
        }
    ],
    "tyn": [
        "Outfit",
        "Black dress / outfit",
        "Black stockings",
        "Black shoes",
        "Witch’s hat",
        "Makeup and Hair",
        "Green face paint or black eyeshadow and lipstick",
        "Black wig or small comb",
        "Black nail polish",
        "Accessories and Props",
        "Old broomstick",
        "Crystal ball",
        "Staff",
        "Stuffed animal"
    ],
    "text": " Gather the items listed in the Things You Need section. Nothing needs to be in perfect condition! A poorly kept, decrepit witch is no less evil than a well turned out one. Put on the dress first. Your evil witch dress can be inspired by any period in time. Wear a sleek, elegant modern evening dress if you wish, you can be the type of evil witch who uses her stunning looks to achieve her evil desires. Find something with a touch of the puritanical, as would of been seen in the Times of the Salem Witch Trials or go further back in history and go for something even older and take inspiration from the late 1400s. Put on the stockings if your dress is full length, you can skip these if you like. Add some boots to your outfit. Put on the cape or cloak. Improvise with a shawl, blanket or throw if you can't find a suitably evil looking cape. If you want you can do something crazy with your hair. Wear a long black wig, or even a bald wig! In the Roald Dahl book, The Witches, all the terribly evil witches are actually bald! If you have long dark hair already, you could add a white or grey streak. Make your hair look like you've been for a wild ride on your broom stick if you like. Prepare your witches hat. Go traditional brimmed, pointed hat if you want to be traditional. Wear a Puritan's bonnet, or, a jaunty mini witches hat, for a more modern, sophisticated evil witch look. Carefully paint your nails if you want to. Black nail polish can stain, apparently. If you want to go for the evil, unkempt witch look, you could rub coffee grounds into your nails to make them look dirty, like you've Bern mixing poison potions. Put on your make up, if appropriate. If you are being a witch from 1480 or so, makeup isn't really required. You can make yourself look glamourous and evil, or raddled, aged and evil. Put on your evil witch mascara.  Last but not least your trick or treat bag.  Have fun! ",
    "sentences": [
        " Gather the items listed in the Things You Need section.",
        "Nothing needs to be in perfect condition!",
        "A poorly kept, decrepit witch is no less evil than a well turned out one.",
        "Put on the dress first.",
        "Your evil witch dress can be inspired by any period in time.",
        "Wear a sleek, elegant modern evening dress if you wish, you can be the type of evil witch who uses her stunning looks to achieve her evil desires.",
        "Find something with a touch of the puritanical, as would of been seen in the Times of the Salem Witch Trials or go further back in history and go for something even older and take inspiration from the late 1400s.",
        "Put on the stockings if your dress is full length, you can skip these if you like.",
        "Add some boots to your outfit.",
        "Put on the cape or cloak.",
        "Improvise with a shawl, blanket or throw if you can't find a suitably evil looking cape.",
        "If you want you can do something crazy with your hair.",
        "Wear a long black wig, or even a bald wig!",
        "In the Roald Dahl book, The Witches, all the terribly evil witches are actually bald!",
        "If you have long dark hair already, you could add a white or grey streak.",
        "Make your hair look like you've been for a wild ride on your broom stick if you like.",
        "Prepare your witches hat.",
        "Go traditional brimmed, pointed hat if you want to be traditional.",
        "Wear a Puritan's bonnet, or, a jaunty mini witches hat, for a more modern, sophisticated evil witch look.",
        "Carefully paint your nails if you want to.",
        "Black nail polish can stain, apparently.",
        "If you want to go for the evil, unkempt witch look, you could rub coffee grounds into your nails to make them look dirty, like you've Bern mixing poison potions.",
        "Put on your make up, if appropriate.",
        "If you are being a witch from 1480 or so, makeup isn't really required.",
        "You can make yourself look glamourous and evil, or raddled, aged and evil.",
        "Put on your evil witch mascara.",
        "Last but not least your trick or treat bag.",
        "Have fun!"
    ]
}