{
    "title": "How to Fill a Punching Bag",
    "url": "https://www.wikihow.com/Fill-a-Punching-Bag",
    "category_hierarchy": [
        "Sports and Fitness",
        "Individual Sports",
        "Combat Sports",
        "Martial Arts"
    ],
    "parts": [
        {
            "name": "Choosing a Filling",
            "steps": [
                {
                    "headline": "Consider how heavy and dense you want your punching bag to be.",
                    "description": "A punching bag with a higher weight and density will be harder to move, and it will require stronger punches. A lighter punching bag that’s less dense will sway more when you hit it, and you won’t have to hit it as hard. The right filling you should use will depend on how heavy and dense you want your punching bag to be. If you’re new to boxing, start out with a lightweight punching bag. You can add more filling to make it heavier and denser as you get stronger. Generally, your punching bag should weigh around 0.5 pounds (0.23 kg) per 1 pound (0.45 kg) you weigh. However, you can increase or decrease the weight depending on your experience level and physical strength."
                },
                {
                    "headline": "Use clothes as the only filling if you want a lightweight punching bag.",
                    "description": "Many pre-filled punching bags are stuffed with cut-up strips of fabric. You can get the same effect at home using old clothes or other scrap fabric you have. Adding just fabric to your punching bag will limit how heavy and dense you can make it, so it’s a good filling if you want your punching bag to sway when you hit it.Tip: If you don’t have a lot of old clothes or fabric lying around, buy some for cheap at a secondhand store. Any kind of clothing or fabric will work."
                },
                {
                    "headline": "Add sand or sawdust in addition to clothes to make your punching bag heavier.",
                    "description": "Sand and sawdust will add weight and density to your punching bag that you wouldn’t be able to get with just clothes. If you’re looking for a punching bag that requires more force, sand or sawdust is an easy, affordable option. Don’t use just sand or sawdust to fill up your punching bag. It will make it too heavy and dense. Instead, add it in addition to clothes or fabric. You can buy bags of sand and sawdust online or at your local home improvement store."
                }
            ]
        },
        {
            "name": "Preparing the Filling",
            "steps": [
                {
                    "headline": "Cut buttons, zippers, and other metal pieces off of the clothes you’ll be using.",
                    "description": "This will prevent your punching bag from tearing. Don’t worry if you cut the clothes up into pieces during the process. You won’t be able to see them once they’re in the bag.Tip: To make your punching bag denser, cut the clothes or fabric up into small strips. Just keep in mind that you’ll need more clothing or fabric if you do this."
                },
                {
                    "headline": "Pour your sand or sawdust into resealable bags if you’re using any.",
                    "description": "Don’t pour sand or sawdust directly into your punching bag since it can damage the bag over time. Instead, pour it into plastic resealable bags, like 1 US quart (950 mL) sandwich bags. After you add the sand or sawdust, seal the bags all the way so nothing pours out."
                },
                {
                    "headline": "Wrap any sand or sawdust bags you’re using with duct tape so they don’t rip.",
                    "description": "The duct tape will make the bags more resistant to your punches. Wrap the duct tape all the way around the bags, including the sealed openings, so they’re completely covered with tape."
                },
                {
                    "headline": "Weigh the filling to make sure you have enough for your bag.",
                    "description": "To weigh clothes or pieces of fabric, place them in large trash bags and weigh each trash bag on a scale. If you’re adding sand or sawdust to your punching bag, weigh the individual bags on a scale. Then, add up all of the individual weights to get the total weight of your filling. If the total weight is less than your desired punching bag weight, you’ll need to prepare more filling. Add more sand or sawdust to make your punching bag denser, or add more clothes or fabric to increase the weight without significantly increasing the density. Remember that your punching bag should weigh around 0.5 pounds (0.23 kg) per 1 pound (0.45 kg) you weigh, but the ideal weight ultimately depends on your skill level and fitness goals. For example, if you weigh 200 pounds (91 kg), your punching bag should weigh around 100 pounds (45 kg). If you’re new to boxing, you could try 80–90 pounds (36–41 kg) to start."
                }
            ]
        },
        {
            "name": "Adding the Filling to Your Bag",
            "steps": [
                {
                    "headline": "Unzip the opening at the top of your punching bag.",
                    "description": "Most punching bags will have a round opening at one end of the bag that’s zipped closed. That’s where you’ll add the filling. If your punching bag doesn’t have a zipper on one end, check the manual that came with it or look online to see how it opens."
                },
                {
                    "headline": "Add the first layer of filling to the bottom of the bag.",
                    "description": "If you’re just using clothes or fabric, drop some into the opening of the bag so the bottom of the bag is completely covered. If you’re using sand or sawdust bags too, drop one of those in first, then add clothes around it to fill in the bottom layer. Surrounding the sand or sawdust bags with clothes will help protect them from tearing."
                },
                {
                    "headline": "Use a long tool, like a baseball bat, to pack the filling down.",
                    "description": "Packing the filling down will get rid of empty space in the bag and make the finished product more uniform. You can use any kind of long tool, as long as it reaches all the way down to the bottom of your punching bag.Warning: Avoid pushing down directly on sand or sawdust bags if you’re using them so you don’t tear them."
                },
                {
                    "headline": "Continue to add layers of filling, packing them down as you go.",
                    "description": "If you’re just using clothes or pieces of fabric, drop some into the bag over the previous layer, then pack them down with the tool. For sand or sawdust bags, continue to drop them into the center of your punching bag and surround them with clothes or fabric. Try to space the bags evenly up and down the length of your punching bag. You might not need to add a bag to every layer, depending on how many you’re using. For example, if you’re adding 5 sand or sawdust bags, and your punching bag is 5 feet (1.5 m) long, you would add 1 bag per 1 foot (0.30 m) of length. If each layer you’re making is 0.5 feet (0.15 m), you would add a bag to every other layer."
                },
                {
                    "headline": "Zip your punching bag closed once you reach the top with the filling.",
                    "description": "Make sure you fill the bag all the way to the top so there isn’t any empty space. However, if you’re struggling to zip the top closed because the bag is too stuffed, you might need to pack to filling down more or take out the top layer."
                }
            ]
        }
    ],
    "tyn": [
        "Clothes",
        "Sand (optional)",
        "Sawdust (optional)",
        "Scissors",
        "Sealable plastic bags",
        "Duct tape",
        "Scale",
        "Baseball bat or other long tool"
    ],
    "text": " Choosing a Filling Consider how heavy and dense you want your punching bag to be. A punching bag with a higher weight and density will be harder to move, and it will require stronger punches. A lighter punching bag that’s less dense will sway more when you hit it, and you won’t have to hit it as hard. The right filling you should use will depend on how heavy and dense you want your punching bag to be. If you’re new to boxing, start out with a lightweight punching bag. You can add more filling to make it heavier and denser as you get stronger. Generally, your punching bag should weigh around 0.5 pounds (0.23 kg) per 1 pound (0.45 kg) you weigh. However, you can increase or decrease the weight depending on your experience level and physical strength. Use clothes as the only filling if you want a lightweight punching bag. Many pre-filled punching bags are stuffed with cut-up strips of fabric. You can get the same effect at home using old clothes or other scrap fabric you have. Adding just fabric to your punching bag will limit how heavy and dense you can make it, so it’s a good filling if you want your punching bag to sway when you hit it.Tip: If you don’t have a lot of old clothes or fabric lying around, buy some for cheap at a secondhand store. Any kind of clothing or fabric will work. Add sand or sawdust in addition to clothes to make your punching bag heavier. Sand and sawdust will add weight and density to your punching bag that you wouldn’t be able to get with just clothes. If you’re looking for a punching bag that requires more force, sand or sawdust is an easy, affordable option. Don’t use just sand or sawdust to fill up your punching bag. It will make it too heavy and dense. Instead, add it in addition to clothes or fabric. You can buy bags of sand and sawdust online or at your local home improvement store. Preparing the Filling Cut buttons, zippers, and other metal pieces off of the clothes you’ll be using. This will prevent your punching bag from tearing. Don’t worry if you cut the clothes up into pieces during the process. You won’t be able to see them once they’re in the bag.Tip: To make your punching bag denser, cut the clothes or fabric up into small strips. Just keep in mind that you’ll need more clothing or fabric if you do this. Pour your sand or sawdust into resealable bags if you’re using any. Don’t pour sand or sawdust directly into your punching bag since it can damage the bag over time. Instead, pour it into plastic resealable bags, like 1 US quart (950 mL) sandwich bags. After you add the sand or sawdust, seal the bags all the way so nothing pours out. Wrap any sand or sawdust bags you’re using with duct tape so they don’t rip. The duct tape will make the bags more resistant to your punches. Wrap the duct tape all the way around the bags, including the sealed openings, so they’re completely covered with tape. Weigh the filling to make sure you have enough for your bag. To weigh clothes or pieces of fabric, place them in large trash bags and weigh each trash bag on a scale. If you’re adding sand or sawdust to your punching bag, weigh the individual bags on a scale. Then, add up all of the individual weights to get the total weight of your filling. If the total weight is less than your desired punching bag weight, you’ll need to prepare more filling. Add more sand or sawdust to make your punching bag denser, or add more clothes or fabric to increase the weight without significantly increasing the density. Remember that your punching bag should weigh around 0.5 pounds (0.23 kg) per 1 pound (0.45 kg) you weigh, but the ideal weight ultimately depends on your skill level and fitness goals. For example, if you weigh 200 pounds (91 kg), your punching bag should weigh around 100 pounds (45 kg). If you’re new to boxing, you could try 80–90 pounds (36–41 kg) to start. Adding the Filling to Your Bag Unzip the opening at the top of your punching bag. Most punching bags will have a round opening at one end of the bag that’s zipped closed. That’s where you’ll add the filling. If your punching bag doesn’t have a zipper on one end, check the manual that came with it or look online to see how it opens. Add the first layer of filling to the bottom of the bag. If you’re just using clothes or fabric, drop some into the opening of the bag so the bottom of the bag is completely covered. If you’re using sand or sawdust bags too, drop one of those in first, then add clothes around it to fill in the bottom layer. Surrounding the sand or sawdust bags with clothes will help protect them from tearing. Use a long tool, like a baseball bat, to pack the filling down. Packing the filling down will get rid of empty space in the bag and make the finished product more uniform. You can use any kind of long tool, as long as it reaches all the way down to the bottom of your punching bag.Warning: Avoid pushing down directly on sand or sawdust bags if you’re using them so you don’t tear them. Continue to add layers of filling, packing them down as you go. If you’re just using clothes or pieces of fabric, drop some into the bag over the previous layer, then pack them down with the tool. For sand or sawdust bags, continue to drop them into the center of your punching bag and surround them with clothes or fabric. Try to space the bags evenly up and down the length of your punching bag. You might not need to add a bag to every layer, depending on how many you’re using. For example, if you’re adding 5 sand or sawdust bags, and your punching bag is 5 feet (1.5 m) long, you would add 1 bag per 1 foot (0.30 m) of length. If each layer you’re making is 0.5 feet (0.15 m), you would add a bag to every other layer. Zip your punching bag closed once you reach the top with the filling. Make sure you fill the bag all the way to the top so there isn’t any empty space. However, if you’re struggling to zip the top closed because the bag is too stuffed, you might need to pack to filling down more or take out the top layer.",
    "sentences": [
        " Choosing a Filling Consider how heavy and dense you want your punching bag to be.",
        "A punching bag with a higher weight and density will be harder to move, and it will require stronger punches.",
        "A lighter punching bag that’s less dense will sway more when you hit it, and you won’t have to hit it as hard.",
        "The right filling you should use will depend on how heavy and dense you want your punching bag to be.",
        "If you’re new to boxing, start out with a lightweight punching bag.",
        "You can add more filling to make it heavier and denser as you get stronger.",
        "Generally, your punching bag should weigh around 0.5 pounds (0.23 kg) per 1 pound (0.45 kg) you weigh.",
        "However, you can increase or decrease the weight depending on your experience level and physical strength.",
        "Use clothes as the only filling if you want a lightweight punching bag.",
        "Many pre-filled punching bags are stuffed with cut-up strips of fabric.",
        "You can get the same effect at home using old clothes or other scrap fabric you have.",
        "Adding just fabric to your punching bag will limit how heavy and dense you can make it, so it’s a good filling if you want your punching bag to sway when you hit it.Tip: If you don’t have a lot of old clothes or fabric lying around, buy some for cheap at a secondhand store.",
        "Any kind of clothing or fabric will work.",
        "Add sand or sawdust in addition to clothes to make your punching bag heavier.",
        "Sand and sawdust will add weight and density to your punching bag that you wouldn’t be able to get with just clothes.",
        "If you’re looking for a punching bag that requires more force, sand or sawdust is an easy, affordable option.",
        "Don’t use just sand or sawdust to fill up your punching bag.",
        "It will make it too heavy and dense.",
        "Instead, add it in addition to clothes or fabric.",
        "You can buy bags of sand and sawdust online or at your local home improvement store.",
        "Preparing the Filling Cut buttons, zippers, and other metal pieces off of the clothes you’ll be using.",
        "This will prevent your punching bag from tearing.",
        "Don’t worry if you cut the clothes up into pieces during the process.",
        "You won’t be able to see them once they’re in the bag.Tip: To make your punching bag denser, cut the clothes or fabric up into small strips.",
        "Just keep in mind that you’ll need more clothing or fabric if you do this.",
        "Pour your sand or sawdust into resealable bags if you’re using any.",
        "Don’t pour sand or sawdust directly into your punching bag since it can damage the bag over time.",
        "Instead, pour it into plastic resealable bags, like 1 US quart (950 mL) sandwich bags.",
        "After you add the sand or sawdust, seal the bags all the way so nothing pours out.",
        "Wrap any sand or sawdust bags you’re using with duct tape so they don’t rip.",
        "The duct tape will make the bags more resistant to your punches.",
        "Wrap the duct tape all the way around the bags, including the sealed openings, so they’re completely covered with tape.",
        "Weigh the filling to make sure you have enough for your bag.",
        "To weigh clothes or pieces of fabric, place them in large trash bags and weigh each trash bag on a scale.",
        "If you’re adding sand or sawdust to your punching bag, weigh the individual bags on a scale.",
        "Then, add up all of the individual weights to get the total weight of your filling.",
        "If the total weight is less than your desired punching bag weight, you’ll need to prepare more filling.",
        "Add more sand or sawdust to make your punching bag denser, or add more clothes or fabric to increase the weight without significantly increasing the density.",
        "Remember that your punching bag should weigh around 0.5 pounds (0.23 kg) per 1 pound (0.45 kg) you weigh, but the ideal weight ultimately depends on your skill level and fitness goals.",
        "For example, if you weigh 200 pounds (91 kg), your punching bag should weigh around 100 pounds (45 kg).",
        "If you’re new to boxing, you could try 80–90 pounds (36–41 kg) to start.",
        "Adding the Filling to Your Bag Unzip the opening at the top of your punching bag.",
        "Most punching bags will have a round opening at one end of the bag that’s zipped closed.",
        "That’s where you’ll add the filling.",
        "If your punching bag doesn’t have a zipper on one end, check the manual that came with it or look online to see how it opens.",
        "Add the first layer of filling to the bottom of the bag.",
        "If you’re just using clothes or fabric, drop some into the opening of the bag so the bottom of the bag is completely covered.",
        "If you’re using sand or sawdust bags too, drop one of those in first, then add clothes around it to fill in the bottom layer.",
        "Surrounding the sand or sawdust bags with clothes will help protect them from tearing.",
        "Use a long tool, like a baseball bat, to pack the filling down.",
        "Packing the filling down will get rid of empty space in the bag and make the finished product more uniform.",
        "You can use any kind of long tool, as long as it reaches all the way down to the bottom of your punching bag.Warning: Avoid pushing down directly on sand or sawdust bags if you’re using them so you don’t tear them.",
        "Continue to add layers of filling, packing them down as you go.",
        "If you’re just using clothes or pieces of fabric, drop some into the bag over the previous layer, then pack them down with the tool.",
        "For sand or sawdust bags, continue to drop them into the center of your punching bag and surround them with clothes or fabric.",
        "Try to space the bags evenly up and down the length of your punching bag.",
        "You might not need to add a bag to every layer, depending on how many you’re using.",
        "For example, if you’re adding 5 sand or sawdust bags, and your punching bag is 5 feet (1.5 m) long, you would add 1 bag per 1 foot (0.30 m) of length.",
        "If each layer you’re making is 0.5 feet (0.15 m), you would add a bag to every other layer.",
        "Zip your punching bag closed once you reach the top with the filling.",
        "Make sure you fill the bag all the way to the top so there isn’t any empty space.",
        "However, if you’re struggling to zip the top closed because the bag is too stuffed, you might need to pack to filling down more or take out the top layer."
    ]
}