{
    "title": "How to Make Leg Warmers from Old Sweaters",
    "url": "https://www.wikihow.com/Make-Leg-Warmers-from-Old-Sweaters",
    "category_hierarchy": [
        "Personal Care and Style",
        "Fashion",
        "Fashion Accessories",
        "Leg Warmers"
    ],
    "steps": [
        {
            "headline": "Decide how long you want your leg warmers to be.",
            "description": "In this example, the warmers are as long as the sleeves are. Cut the sleeves off at the desired length."
        },
        {
            "headline": "Turn the sleeves inside out and try them on to see how they fit.",
            "description": "They'll probably be a little baggy. The following steps are for tightening the leg warmers, if you need to or want to (some people like them baggy)."
        },
        {
            "headline": "Find the seam and pull the extra fabric together.",
            "description": "Pull it as tight as you need, then pin the excess fabric together. This is where the new seam will be, so try to be as precise as possible."
        },
        {
            "headline": "Create a path using fabric chalk.",
            "description": "Use the pins as a guide for your path; this is where you'll be sewing."
        },
        {
            "headline": "Sew the fabric along the path you created in the previous steps.",
            "description": ""
        },
        {
            "headline": "Try them on to make sure they fit the way you want them to.",
            "description": "Be sure to turn them right-side out before hand."
        },
        {
            "headline": "Turn them inside out again and cut off the fabric just outside of the stitching if you're happy with the fit.",
            "description": "If not, pull out the thread and fit the leg warmers again."
        }
    ],
    "tyn": [
        "An old sweater",
        "Fabric chalk",
        "Scissors",
        "Sewing machine"
    ],
    "text": " Decide how long you want your leg warmers to be. In this example, the warmers are as long as the sleeves are. Cut the sleeves off at the desired length. Turn the sleeves inside out and try them on to see how they fit. They'll probably be a little baggy. The following steps are for tightening the leg warmers, if you need to or want to (some people like them baggy). Find the seam and pull the extra fabric together. Pull it as tight as you need, then pin the excess fabric together. This is where the new seam will be, so try to be as precise as possible. Create a path using fabric chalk. Use the pins as a guide for your path; this is where you'll be sewing. Sew the fabric along the path you created in the previous steps.  Try them on to make sure they fit the way you want them to. Be sure to turn them right-side out before hand. Turn them inside out again and cut off the fabric just outside of the stitching if you're happy with the fit. If not, pull out the thread and fit the leg warmers again.",
    "sentences": [
        " Decide how long you want your leg warmers to be.",
        "In this example, the warmers are as long as the sleeves are.",
        "Cut the sleeves off at the desired length.",
        "Turn the sleeves inside out and try them on to see how they fit.",
        "They'll probably be a little baggy.",
        "The following steps are for tightening the leg warmers, if you need to or want to (some people like them baggy).",
        "Find the seam and pull the extra fabric together.",
        "Pull it as tight as you need, then pin the excess fabric together.",
        "This is where the new seam will be, so try to be as precise as possible.",
        "Create a path using fabric chalk.",
        "Use the pins as a guide for your path; this is where you'll be sewing.",
        "Sew the fabric along the path you created in the previous steps.",
        "Try them on to make sure they fit the way you want them to.",
        "Be sure to turn them right-side out before hand.",
        "Turn them inside out again and cut off the fabric just outside of the stitching if you're happy with the fit.",
        "If not, pull out the thread and fit the leg warmers again."
    ]
}