{
    "title": "How to Make Coffee Icing",
    "url": "https://www.wikihow.com/Make-Coffee-Icing",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking"
    ],
    "methods": [
        {
            "name": "Making Coffee Glaze",
            "steps": [
                {
                    "headline": "Prepare the strong-brewed coffee and set it aside.",
                    "description": "You can make some using a coffee maker or one part instant coffee and one part hot water. You can also use a shot of espresso."
                },
                {
                    "headline": "Pour the powdered sugar through a sieve into a bowl.",
                    "description": "This will break up any clumps that might be in the sugar, resulting in a smoother texture when you finish."
                },
                {
                    "headline": "Mix in the strongly-brewed coffee.",
                    "description": "Pour the coffee into the sugar while mixing the sugar briskly with a fork or a small whisk. You will get a thick, syrup-like consistency."
                },
                {
                    "headline": "Pour the glaze over your cake, cupcake, or pastry.",
                    "description": "Work quickly, as this glaze will harden up."
                }
            ]
        },
        {
            "name": "Making Coffee Buttercream Icing",
            "steps": [
                {
                    "headline": "Combine the coffee, water, and vanilla extract and set aside.",
                    "description": "Measure out your instant coffee and put it into a small cup. Add the vanilla extract and pour in the water. Mix everything with a spoon until the coffee granules are dissolved."
                },
                {
                    "headline": "Mix the butter until it is smooth and fluffy.",
                    "description": "You can use a handheld mixer or even a food processor with a whisk attachment. Use a medium speed. You will need to beat the butter for about one minute until it achieves the right consistency."
                },
                {
                    "headline": "Lower the speed and add the sugar one cup at a time.",
                    "description": "This will prevent the sugar from flying out everywhere. Keep beating the mixture until it becomes smooth. Keep mixing for a few more minutes."
                },
                {
                    "headline": "Pour in the coffee and milk and mix at medium speed for four more minutes.",
                    "description": "Make sure that the instant coffee has cooled completely before you add it in, or it will melt the butter. You may have to scrape down the sides of the bowl from time to time with a spatula to ensure that everything gets mixed together."
                },
                {
                    "headline": "Store or use the buttercream immediately.",
                    "description": "At this point, you can spread the coffee buttercream on top of cakes, cupcakes, or cookies. You can also store it in an airtight container for about a week."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Small cup",
        "Mixing bow",
        "Handheld mixer"
    ],
    "text": " Making Coffee Glaze Prepare the strong-brewed coffee and set it aside. You can make some using a coffee maker or one part instant coffee and one part hot water. You can also use a shot of espresso. Pour the powdered sugar through a sieve into a bowl. This will break up any clumps that might be in the sugar, resulting in a smoother texture when you finish. Mix in the strongly-brewed coffee. Pour the coffee into the sugar while mixing the sugar briskly with a fork or a small whisk. You will get a thick, syrup-like consistency. Pour the glaze over your cake, cupcake, or pastry. Work quickly, as this glaze will harden up. Making Coffee Buttercream Icing Combine the coffee, water, and vanilla extract and set aside. Measure out your instant coffee and put it into a small cup. Add the vanilla extract and pour in the water. Mix everything with a spoon until the coffee granules are dissolved. Mix the butter until it is smooth and fluffy. You can use a handheld mixer or even a food processor with a whisk attachment. Use a medium speed. You will need to beat the butter for about one minute until it achieves the right consistency. Lower the speed and add the sugar one cup at a time. This will prevent the sugar from flying out everywhere. Keep beating the mixture until it becomes smooth. Keep mixing for a few more minutes. Pour in the coffee and milk and mix at medium speed for four more minutes. Make sure that the instant coffee has cooled completely before you add it in, or it will melt the butter. You may have to scrape down the sides of the bowl from time to time with a spatula to ensure that everything gets mixed together. Store or use the buttercream immediately. At this point, you can spread the coffee buttercream on top of cakes, cupcakes, or cookies. You can also store it in an airtight container for about a week. Finished. ",
    "sentences": [
        " Making Coffee Glaze Prepare the strong-brewed coffee and set it aside.",
        "You can make some using a coffee maker or one part instant coffee and one part hot water.",
        "You can also use a shot of espresso.",
        "Pour the powdered sugar through a sieve into a bowl.",
        "This will break up any clumps that might be in the sugar, resulting in a smoother texture when you finish.",
        "Mix in the strongly-brewed coffee.",
        "Pour the coffee into the sugar while mixing the sugar briskly with a fork or a small whisk.",
        "You will get a thick, syrup-like consistency.",
        "Pour the glaze over your cake, cupcake, or pastry.",
        "Work quickly, as this glaze will harden up.",
        "Making Coffee Buttercream Icing Combine the coffee, water, and vanilla extract and set aside.",
        "Measure out your instant coffee and put it into a small cup.",
        "Add the vanilla extract and pour in the water.",
        "Mix everything with a spoon until the coffee granules are dissolved.",
        "Mix the butter until it is smooth and fluffy.",
        "You can use a handheld mixer or even a food processor with a whisk attachment.",
        "Use a medium speed.",
        "You will need to beat the butter for about one minute until it achieves the right consistency.",
        "Lower the speed and add the sugar one cup at a time.",
        "This will prevent the sugar from flying out everywhere.",
        "Keep beating the mixture until it becomes smooth.",
        "Keep mixing for a few more minutes.",
        "Pour in the coffee and milk and mix at medium speed for four more minutes.",
        "Make sure that the instant coffee has cooled completely before you add it in, or it will melt the butter.",
        "You may have to scrape down the sides of the bowl from time to time with a spatula to ensure that everything gets mixed together.",
        "Store or use the buttercream immediately.",
        "At this point, you can spread the coffee buttercream on top of cakes, cupcakes, or cookies.",
        "You can also store it in an airtight container for about a week.",
        "Finished."
    ]
}