{
    "title": "How to Code HTML on Chrome OS",
    "url": "https://www.wikihow.com/Code-HTML-on-Chrome-OS",
    "category_hierarchy": [
        "Computers and Electronics",
        "Internet",
        "Website and Blog Creation",
        "Markup Languages",
        "HTML"
    ],
    "parts": [
        {
            "name": "Downloading a Text Editor",
            "steps": [
                {
                    "headline": "Open the internet by starting Google Chrome on the bottom shelf of the home screen.",
                    "description": "Google Chrome looks like a rainbow ball icon."
                },
                {
                    "headline": "Search for the Chrome Web Store in the top search bar, and click on the first link.",
                    "description": "Alternatively you can use this link:  https://chrome.google.com/webstore/category/apps"
                },
                {
                    "headline": "Search for a text editor in the top left search bar.",
                    "description": "Keywords to search by include: text editor, HTML\nFind an app that has plenty of good reviews. Thankfully, Chrome organizes suggestions by highly rated apps. Make sure it is an app, not an extension."
                },
                {
                    "headline": "Add it to Chrome.",
                    "description": "Once an app has been found that will code in HTML, add it to chrome by click on the blue button that says “add it to chrome”. A pop-up will appear after clicking it. Read and accept any permissions it requests by clicking add app."
                }
            ]
        },
        {
            "name": "Coding Your HTML",
            "steps": [
                {
                    "headline": "Find the newly installed app and open it.",
                    "description": "At the bottom shelf, click on the magnifying glass icon. Click on “All Apps” on the right and scroll over till you find it. For newly installed apps on some versions, a pop-up will automatically display where the app is located. Depending on the version, you might need to go looking for it manually."
                },
                {
                    "headline": "Create a new document by clicking new.",
                    "description": "This will open up a blank text page ready for typing."
                },
                {
                    "headline": "Code in the <html> tag to give the browser a notice of what language your using, and then close it off a few lines down with </html>.",
                    "description": "Tags that start with the “/” are the ending tags. Tags cannot work without the opposite pair. Tags are case-sensitive. Make sure that they are typed in lower-case lettering."
                },
                {
                    "headline": "Add the heading tags within the <html> tags by typing <head>, and then a few lines down, type </head> to close it.",
                    "description": ""
                },
                {
                    "headline": "Create the title tags in the within the head by coding <title> and </title> immediately following the initial tag.",
                    "description": "Title tags let users know which site they are on."
                },
                {
                    "headline": "Code some body tags after the closing head tag with <body>, while giving yourself some lines before you close it off with </body>.",
                    "description": "The body is where the bulk of the information goes."
                },
                {
                    "headline": "Add a title to the webpage.",
                    "description": "In between each title tag put a title to help users know where they are. Make it welcoming!"
                },
                {
                    "headline": "Compose some text in the body.",
                    "description": "In between the body tags type a sentence or two."
                },
                {
                    "headline": "Check one last time.",
                    "description": "Scan through the document and make sure that everything is closed. If tags are not closed, the page will not display properly."
                },
                {
                    "headline": "Save the document, and make sure to put the .html extension directly after.",
                    "description": "Click “save\" after you named it correctly. For example: “MyFirstWebsite.html”."
                },
                {
                    "headline": "Find the saved document.",
                    "description": "Click on the magnifying glass on the shelf and search for the Files icon. You may need to go into All Apps again.#* Open up the file explorer and locate the saved HTML. Open the document by clicking on it."
                },
                {
                    "headline": "Admire the newly created webpage coded by yourself!",
                    "description": "The document will open up in your default browser."
                }
            ]
        }
    ],
    "tyn": [
        "Chrome OS",
        "An Internet connection"
    ],
    "text": " Downloading a Text Editor Open the internet by starting Google Chrome on the bottom shelf of the home screen. Google Chrome looks like a rainbow ball icon. Search for the Chrome Web Store in the top search bar, and click on the first link. Alternatively you can use this link:  https://chrome.google.com/webstore/category/apps Search for a text editor in the top left search bar. Keywords to search by include: text editor, HTML\nFind an app that has plenty of good reviews. Thankfully, Chrome organizes suggestions by highly rated apps. Make sure it is an app, not an extension. Add it to Chrome. Once an app has been found that will code in HTML, add it to chrome by click on the blue button that says “add it to chrome”. A pop-up will appear after clicking it. Read and accept any permissions it requests by clicking add app. Coding Your HTML Find the newly installed app and open it. At the bottom shelf, click on the magnifying glass icon. Click on “All Apps” on the right and scroll over till you find it. For newly installed apps on some versions, a pop-up will automatically display where the app is located. Depending on the version, you might need to go looking for it manually. Create a new document by clicking new. This will open up a blank text page ready for typing. Code in the <html> tag to give the browser a notice of what language your using, and then close it off a few lines down with </html>. Tags that start with the “/” are the ending tags. Tags cannot work without the opposite pair. Tags are case-sensitive. Make sure that they are typed in lower-case lettering. Add the heading tags within the <html> tags by typing <head>, and then a few lines down, type </head> to close it.  Create the title tags in the within the head by coding <title> and </title> immediately following the initial tag. Title tags let users know which site they are on. Code some body tags after the closing head tag with <body>, while giving yourself some lines before you close it off with </body>. The body is where the bulk of the information goes. Add a title to the webpage. In between each title tag put a title to help users know where they are. Make it welcoming! Compose some text in the body. In between the body tags type a sentence or two. Check one last time. Scan through the document and make sure that everything is closed. If tags are not closed, the page will not display properly. Save the document, and make sure to put the .html extension directly after. Click “save\" after you named it correctly. For example: “MyFirstWebsite.html”. Find the saved document. Click on the magnifying glass on the shelf and search for the Files icon. You may need to go into All Apps again.#* Open up the file explorer and locate the saved HTML. Open the document by clicking on it. Admire the newly created webpage coded by yourself! The document will open up in your default browser.",
    "sentences": [
        " Downloading a Text Editor Open the internet by starting Google Chrome on the bottom shelf of the home screen.",
        "Google Chrome looks like a rainbow ball icon.",
        "Search for the Chrome Web Store in the top search bar, and click on the first link.",
        "Alternatively you can use this link:  https://chrome.google.com/webstore/category/apps Search for a text editor in the top left search bar.",
        "Keywords to search by include: text editor, HTML\nFind an app that has plenty of good reviews.",
        "Thankfully, Chrome organizes suggestions by highly rated apps.",
        "Make sure it is an app, not an extension.",
        "Add it to Chrome.",
        "Once an app has been found that will code in HTML, add it to chrome by click on the blue button that says “add it to chrome”.",
        "A pop-up will appear after clicking it.",
        "Read and accept any permissions it requests by clicking add app.",
        "Coding Your HTML Find the newly installed app and open it.",
        "At the bottom shelf, click on the magnifying glass icon.",
        "Click on “All Apps” on the right and scroll over till you find it.",
        "For newly installed apps on some versions, a pop-up will automatically display where the app is located.",
        "Depending on the version, you might need to go looking for it manually.",
        "Create a new document by clicking new.",
        "This will open up a blank text page ready for typing.",
        "Code in the <html> tag to give the browser a notice of what language your using, and then close it off a few lines down with </html>.",
        "Tags that start with the “/” are the ending tags.",
        "Tags cannot work without the opposite pair.",
        "Tags are case-sensitive.",
        "Make sure that they are typed in lower-case lettering.",
        "Add the heading tags within the <html> tags by typing <head>, and then a few lines down, type </head> to close it.",
        "Create the title tags in the within the head by coding <title> and </title> immediately following the initial tag.",
        "Title tags let users know which site they are on.",
        "Code some body tags after the closing head tag with <body>, while giving yourself some lines before you close it off with </body>.",
        "The body is where the bulk of the information goes.",
        "Add a title to the webpage.",
        "In between each title tag put a title to help users know where they are.",
        "Make it welcoming!",
        "Compose some text in the body.",
        "In between the body tags type a sentence or two.",
        "Check one last time.",
        "Scan through the document and make sure that everything is closed.",
        "If tags are not closed, the page will not display properly.",
        "Save the document, and make sure to put the .html extension directly after.",
        "Click “save\" after you named it correctly.",
        "For example: “MyFirstWebsite.html”.",
        "Find the saved document.",
        "Click on the magnifying glass on the shelf and search for the Files icon.",
        "You may need to go into All Apps again.#* Open up the file explorer and locate the saved HTML.",
        "Open the document by clicking on it.",
        "Admire the newly created webpage coded by yourself!",
        "The document will open up in your default browser."
    ]
}