{
    "title": "How to Salt Peanuts",
    "url": "https://www.wikihow.com/Salt-Peanuts",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Basic Cooking Skills"
    ],
    "methods": [
        {
            "name": "Soaking the Peanuts",
            "steps": [
                {
                    "headline": "Rinse the peanuts.",
                    "description": "Fresh, raw peanuts actually grow underground, so they often have dirt and other residue on their shells. Before salting 2 pounds (907 g) of peanuts, place them in a colander and run them under cool water. Toss the nuts gently to ensure that they’re all rinsed well. Even if the peanuts look clean, you should still rinse them. All of the dirt may not be visible."
                },
                {
                    "headline": "Fill a large stockpot with water and salt.",
                    "description": "To create the brine, fill a large stockpot with 2 gallons (7.5 l) of water. Add 4 tablespoons (68 g) of salt to the pot, and stir well to ensure that the brine is well mixed. The brine requires 2 tablespoons (34 g) of salt for every gallon (3.8 l) of water. You can adjust the recipe based on how many peanuts you’re salting."
                },
                {
                    "headline": "Add the peanuts and soak them for several hours.",
                    "description": "When the brine is mixed, place the peanuts in the pot. Let the nuts soak for at least 8 hours or overnight. The longer you allow the peanuts to soak in the brine, the saltier they’ll be."
                },
                {
                    "headline": "Drain and dry the peanuts.",
                    "description": "After the peanuts have soaked in the brine for at least 8 hours, pour them into a colander to drain the water. Shake the nuts well to remove the excess water, and then spread them out on clean kitchen towel or paper towel to dry."
                }
            ]
        },
        {
            "name": "Roasting the Peanuts",
            "steps": [
                {
                    "headline": "Preheat the oven.",
                    "description": "It’s common to roast peanuts after soaking them in a salt brine. To ensure that the oven is hot enough, set the temperature to 350 degrees Fahrenheit (177 degrees Celsius) and allow the oven to fully heat. Depending on your oven, it should take approximately 10 to 15 minutes for it to preheat. Keep an eye on your oven so you know when it’s reached the proper temperature. Most models will beep or flash an indicator light to alert you."
                },
                {
                    "headline": "Spread the peanuts out on baking sheets.",
                    "description": "When the peanuts are dry, divide them between two half sheet pans. Make sure to place them in a single layer so the peanuts aren’t piled on top of one another. If you don’t have half sheet pans, you can use smaller pans. However, you may need to roast the peanuts in multiple batches so you can spread the peanuts out in a single layer."
                },
                {
                    "headline": "Roast the peanuts for a half hour.",
                    "description": "Once the peanuts are the half sheet pans, place them in the preheated oven. Allow them to roast for 30 to 35 minutes, making sure to rotate the pans approximately halfway through roasting. During the last 10 minutes of roasting, start checking the peanuts to see if they’re done. Use a pair of tongs to remove one from the pan and allow it to cool for several minutes. When it’s cool enough to handle, open it -- the inside of the shell should be a little darker than the outside."
                },
                {
                    "headline": "Allow the nuts to cool.",
                    "description": "After you remove the pans from the oven, the peanuts continue to cook for several minutes and will become crunchy. Let them cool for 10 to 15 minutes before eating them."
                }
            ]
        },
        {
            "name": "Boiling Peanuts",
            "steps": [
                {
                    "headline": "Rinse the peanuts.",
                    "description": "Fresh, raw peanuts often have dirt on them, even if it isn't visible. Place 2 pounds (907 g) of peanuts in a colander, and use cool water from the sink to rinse them. Shake the colander well to ensure that all of the peanuts are cleaned. There's no need to dry the peanuts after rinsing them if you plan to boil them."
                },
                {
                    "headline": "Place the peanuts, water, and salt in a stock pot.",
                    "description": "Add the peanuts to a large stockpot, and cover them with 3 gallons (11 l) of water. Mix in 5 tablespoons (85 g) of salt, and stir well to ensure that it’s completely incorporated. You can use any type of salt that you like, including regular table salt, but kosher salt is usually the best option."
                },
                {
                    "headline": "Simmer the peanuts for several hours.",
                    "description": "Place the pot on the stove, and turn the burner to high. Cover the pot, and allow the peanuts to simmer for 4 hours."
                },
                {
                    "headline": "Test the peanuts and cook longer if necessary.",
                    "description": "After four hours, remove a peanut from the pot and open it. It should have the texture of a cooked, dried bean and should hold its shape but not crunch when you bite it. If the peanuts aren’t done, allow them to simmer for another 3 to 4 hours until they reach the proper texture. The cooking time will vary based on how fresh the peanuts are. Fresher peanuts take less time to cook. You may need to add additional water to the pot during the cooking process."
                },
                {
                    "headline": "Drain the peanuts and allow them to cool.",
                    "description": "When the peanuts are done boiling, drain them in a colander. Shake well to remove the excess water, and set them out on a clean towel or piece of paper towel to dry. Place them in a covered container and store in the refrigerator for up to a week."
                }
            ]
        }
    ],
    "tyn": [
        "A colander",
        "A large stockpot",
        "A wooden spoon",
        "A clean towel or paper towel",
        "2 half sheet pans",
        "A pair of tongs"
    ],
    "text": " Soaking the Peanuts Rinse the peanuts. Fresh, raw peanuts actually grow underground, so they often have dirt and other residue on their shells. Before salting 2 pounds (907 g) of peanuts, place them in a colander and run them under cool water. Toss the nuts gently to ensure that they’re all rinsed well. Even if the peanuts look clean, you should still rinse them. All of the dirt may not be visible. Fill a large stockpot with water and salt. To create the brine, fill a large stockpot with 2 gallons (7.5 l) of water. Add 4 tablespoons (68 g) of salt to the pot, and stir well to ensure that the brine is well mixed. The brine requires 2 tablespoons (34 g) of salt for every gallon (3.8 l) of water. You can adjust the recipe based on how many peanuts you’re salting. Add the peanuts and soak them for several hours. When the brine is mixed, place the peanuts in the pot. Let the nuts soak for at least 8 hours or overnight. The longer you allow the peanuts to soak in the brine, the saltier they’ll be. Drain and dry the peanuts. After the peanuts have soaked in the brine for at least 8 hours, pour them into a colander to drain the water. Shake the nuts well to remove the excess water, and then spread them out on clean kitchen towel or paper towel to dry. Roasting the Peanuts Preheat the oven. It’s common to roast peanuts after soaking them in a salt brine. To ensure that the oven is hot enough, set the temperature to 350 degrees Fahrenheit (177 degrees Celsius) and allow the oven to fully heat. Depending on your oven, it should take approximately 10 to 15 minutes for it to preheat. Keep an eye on your oven so you know when it’s reached the proper temperature. Most models will beep or flash an indicator light to alert you. Spread the peanuts out on baking sheets. When the peanuts are dry, divide them between two half sheet pans. Make sure to place them in a single layer so the peanuts aren’t piled on top of one another. If you don’t have half sheet pans, you can use smaller pans. However, you may need to roast the peanuts in multiple batches so you can spread the peanuts out in a single layer. Roast the peanuts for a half hour. Once the peanuts are the half sheet pans, place them in the preheated oven. Allow them to roast for 30 to 35 minutes, making sure to rotate the pans approximately halfway through roasting. During the last 10 minutes of roasting, start checking the peanuts to see if they’re done. Use a pair of tongs to remove one from the pan and allow it to cool for several minutes. When it’s cool enough to handle, open it -- the inside of the shell should be a little darker than the outside. Allow the nuts to cool. After you remove the pans from the oven, the peanuts continue to cook for several minutes and will become crunchy. Let them cool for 10 to 15 minutes before eating them. Boiling Peanuts Rinse the peanuts. Fresh, raw peanuts often have dirt on them, even if it isn't visible. Place 2 pounds (907 g) of peanuts in a colander, and use cool water from the sink to rinse them. Shake the colander well to ensure that all of the peanuts are cleaned. There's no need to dry the peanuts after rinsing them if you plan to boil them. Place the peanuts, water, and salt in a stock pot. Add the peanuts to a large stockpot, and cover them with 3 gallons (11 l) of water. Mix in 5 tablespoons (85 g) of salt, and stir well to ensure that it’s completely incorporated. You can use any type of salt that you like, including regular table salt, but kosher salt is usually the best option. Simmer the peanuts for several hours. Place the pot on the stove, and turn the burner to high. Cover the pot, and allow the peanuts to simmer for 4 hours. Test the peanuts and cook longer if necessary. After four hours, remove a peanut from the pot and open it. It should have the texture of a cooked, dried bean and should hold its shape but not crunch when you bite it. If the peanuts aren’t done, allow them to simmer for another 3 to 4 hours until they reach the proper texture. The cooking time will vary based on how fresh the peanuts are. Fresher peanuts take less time to cook. You may need to add additional water to the pot during the cooking process. Drain the peanuts and allow them to cool. When the peanuts are done boiling, drain them in a colander. Shake well to remove the excess water, and set them out on a clean towel or piece of paper towel to dry. Place them in a covered container and store in the refrigerator for up to a week.",
    "sentences": [
        " Soaking the Peanuts Rinse the peanuts.",
        "Fresh, raw peanuts actually grow underground, so they often have dirt and other residue on their shells.",
        "Before salting 2 pounds (907 g) of peanuts, place them in a colander and run them under cool water.",
        "Toss the nuts gently to ensure that they’re all rinsed well.",
        "Even if the peanuts look clean, you should still rinse them.",
        "All of the dirt may not be visible.",
        "Fill a large stockpot with water and salt.",
        "To create the brine, fill a large stockpot with 2 gallons (7.5 l) of water.",
        "Add 4 tablespoons (68 g) of salt to the pot, and stir well to ensure that the brine is well mixed.",
        "The brine requires 2 tablespoons (34 g) of salt for every gallon (3.8 l) of water.",
        "You can adjust the recipe based on how many peanuts you’re salting.",
        "Add the peanuts and soak them for several hours.",
        "When the brine is mixed, place the peanuts in the pot.",
        "Let the nuts soak for at least 8 hours or overnight.",
        "The longer you allow the peanuts to soak in the brine, the saltier they’ll be.",
        "Drain and dry the peanuts.",
        "After the peanuts have soaked in the brine for at least 8 hours, pour them into a colander to drain the water.",
        "Shake the nuts well to remove the excess water, and then spread them out on clean kitchen towel or paper towel to dry.",
        "Roasting the Peanuts Preheat the oven.",
        "It’s common to roast peanuts after soaking them in a salt brine.",
        "To ensure that the oven is hot enough, set the temperature to 350 degrees Fahrenheit (177 degrees Celsius) and allow the oven to fully heat.",
        "Depending on your oven, it should take approximately 10 to 15 minutes for it to preheat.",
        "Keep an eye on your oven so you know when it’s reached the proper temperature.",
        "Most models will beep or flash an indicator light to alert you.",
        "Spread the peanuts out on baking sheets.",
        "When the peanuts are dry, divide them between two half sheet pans.",
        "Make sure to place them in a single layer so the peanuts aren’t piled on top of one another.",
        "If you don’t have half sheet pans, you can use smaller pans.",
        "However, you may need to roast the peanuts in multiple batches so you can spread the peanuts out in a single layer.",
        "Roast the peanuts for a half hour.",
        "Once the peanuts are the half sheet pans, place them in the preheated oven.",
        "Allow them to roast for 30 to 35 minutes, making sure to rotate the pans approximately halfway through roasting.",
        "During the last 10 minutes of roasting, start checking the peanuts to see if they’re done.",
        "Use a pair of tongs to remove one from the pan and allow it to cool for several minutes.",
        "When it’s cool enough to handle, open it -- the inside of the shell should be a little darker than the outside.",
        "Allow the nuts to cool.",
        "After you remove the pans from the oven, the peanuts continue to cook for several minutes and will become crunchy.",
        "Let them cool for 10 to 15 minutes before eating them.",
        "Boiling Peanuts Rinse the peanuts.",
        "Fresh, raw peanuts often have dirt on them, even if it isn't visible.",
        "Place 2 pounds (907 g) of peanuts in a colander, and use cool water from the sink to rinse them.",
        "Shake the colander well to ensure that all of the peanuts are cleaned.",
        "There's no need to dry the peanuts after rinsing them if you plan to boil them.",
        "Place the peanuts, water, and salt in a stock pot.",
        "Add the peanuts to a large stockpot, and cover them with 3 gallons (11 l) of water.",
        "Mix in 5 tablespoons (85 g) of salt, and stir well to ensure that it’s completely incorporated.",
        "You can use any type of salt that you like, including regular table salt, but kosher salt is usually the best option.",
        "Simmer the peanuts for several hours.",
        "Place the pot on the stove, and turn the burner to high.",
        "Cover the pot, and allow the peanuts to simmer for 4 hours.",
        "Test the peanuts and cook longer if necessary.",
        "After four hours, remove a peanut from the pot and open it.",
        "It should have the texture of a cooked, dried bean and should hold its shape but not crunch when you bite it.",
        "If the peanuts aren’t done, allow them to simmer for another 3 to 4 hours until they reach the proper texture.",
        "The cooking time will vary based on how fresh the peanuts are.",
        "Fresher peanuts take less time to cook.",
        "You may need to add additional water to the pot during the cooking process.",
        "Drain the peanuts and allow them to cool.",
        "When the peanuts are done boiling, drain them in a colander.",
        "Shake well to remove the excess water, and set them out on a clean towel or piece of paper towel to dry.",
        "Place them in a covered container and store in the refrigerator for up to a week."
    ]
}