{
    "title": "How to Make a Carton Wallet",
    "url": "https://www.wikihow.com/Make-a-Carton-Wallet",
    "category_hierarchy": [
        "Personal Care and Style",
        "Bags"
    ],
    "steps": [
        {
            "headline": "Print out the required template from here.",
            "description": "If you don't have it, download and install the latest Adobe Reader from here."
        },
        {
            "headline": "Prepare the milk or juice carton.",
            "description": "Rinse the carton, and cut it open so it lies completely flat. Wipe it down with paper towels, or, if you have time, place it in a dish rack to let dry."
        },
        {
            "headline": "Prepare the template.",
            "description": "Cut along the solid outside lines from the paper. Also, cut out the bottom white circle. Tape both sides together."
        },
        {
            "headline": "Place the template on the carton.",
            "description": "Make sure that the gray shaded circle is aligned with the carton opening. Use a small piece of tape on the top and bottom of the template to adhere it to the carton."
        },
        {
            "headline": "Trace the template on the carton.",
            "description": "Using a ballpoint pen or pencil, trace the outside lining and bottom circle. Use firm pressure to trace the dotted lines onto the carton. Using the pressure helps to mark the lines where you're going to fold."
        },
        {
            "headline": "Cut out the traced outlining from the carton.",
            "description": "Carefully cut out the bottom circle."
        },
        {
            "headline": "Score along the dotted lines.",
            "description": "You may use a butter knife, craft knife, or scissors blade with a ruler to score them."
        },
        {
            "headline": "Make an accordion out of the two half circles.",
            "description": "This is the hardest part of the steps. You'll need to focus on your pre-scored lines and avoid getting the carton's folds altogether, as they may get in the way. Re-score the lines if needed."
        },
        {
            "headline": "Secure the wallet.",
            "description": "When forming a tight accordion fold on both sides, it should resemble a rectangle. Fold the top down (the bottom circle should fit into the carton's spout) and secure it with the plastic cap."
        },
        {
            "headline": "Add money and cards to your new recycled wallet.",
            "description": ""
        }
    ],
    "tyn": [
        "Half gallon (2 quarts or 64 fl. oz) juice or milk carton with a plastic cap",
        "Scissors",
        "Wallet template",
        "Clear adhesive tape",
        "Ruler",
        "Ballpoint pen"
    ],
    "text": " Print out the required template from here. If you don't have it, download and install the latest Adobe Reader from here. Prepare the milk or juice carton. Rinse the carton, and cut it open so it lies completely flat. Wipe it down with paper towels, or, if you have time, place it in a dish rack to let dry. Prepare the template. Cut along the solid outside lines from the paper. Also, cut out the bottom white circle. Tape both sides together. Place the template on the carton. Make sure that the gray shaded circle is aligned with the carton opening. Use a small piece of tape on the top and bottom of the template to adhere it to the carton. Trace the template on the carton. Using a ballpoint pen or pencil, trace the outside lining and bottom circle. Use firm pressure to trace the dotted lines onto the carton. Using the pressure helps to mark the lines where you're going to fold. Cut out the traced outlining from the carton. Carefully cut out the bottom circle. Score along the dotted lines. You may use a butter knife, craft knife, or scissors blade with a ruler to score them. Make an accordion out of the two half circles. This is the hardest part of the steps. You'll need to focus on your pre-scored lines and avoid getting the carton's folds altogether, as they may get in the way. Re-score the lines if needed. Secure the wallet. When forming a tight accordion fold on both sides, it should resemble a rectangle. Fold the top down (the bottom circle should fit into the carton's spout) and secure it with the plastic cap. Add money and cards to your new recycled wallet. ",
    "sentences": [
        " Print out the required template from here.",
        "If you don't have it, download and install the latest Adobe Reader from here.",
        "Prepare the milk or juice carton.",
        "Rinse the carton, and cut it open so it lies completely flat.",
        "Wipe it down with paper towels, or, if you have time, place it in a dish rack to let dry.",
        "Prepare the template.",
        "Cut along the solid outside lines from the paper.",
        "Also, cut out the bottom white circle.",
        "Tape both sides together.",
        "Place the template on the carton.",
        "Make sure that the gray shaded circle is aligned with the carton opening.",
        "Use a small piece of tape on the top and bottom of the template to adhere it to the carton.",
        "Trace the template on the carton.",
        "Using a ballpoint pen or pencil, trace the outside lining and bottom circle.",
        "Use firm pressure to trace the dotted lines onto the carton.",
        "Using the pressure helps to mark the lines where you're going to fold.",
        "Cut out the traced outlining from the carton.",
        "Carefully cut out the bottom circle.",
        "Score along the dotted lines.",
        "You may use a butter knife, craft knife, or scissors blade with a ruler to score them.",
        "Make an accordion out of the two half circles.",
        "This is the hardest part of the steps.",
        "You'll need to focus on your pre-scored lines and avoid getting the carton's folds altogether, as they may get in the way.",
        "Re-score the lines if needed.",
        "Secure the wallet.",
        "When forming a tight accordion fold on both sides, it should resemble a rectangle.",
        "Fold the top down (the bottom circle should fit into the carton's spout) and secure it with the plastic cap.",
        "Add money and cards to your new recycled wallet."
    ]
}