{
    "title": "How to Move to Switzerland",
    "url": "https://www.wikihow.com/Move-to-Switzerland",
    "category_hierarchy": [
        "Travel",
        "Destinations",
        "Europe Travel",
        "Switzerland Travel"
    ],
    "parts": [
        {
            "name": "Making Your Decision",
            "steps": [
                {
                    "headline": "Determine your motivations for moving.",
                    "description": "Are you trying to get a better job? To get a better lifestyle? To get a better education? To escape from unhappiness at home? Understand your motives, and evaluate alternatives to see whether moving to Switzerland is the best option."
                },
                {
                    "headline": "Write down all the reasons you want to move to Switzerland.",
                    "description": "For example:\nSwitzerland is famous for its beautiful mountains. The temperate climate in Switzerland, varying from glacial mountaintops to pleasant Mediterranean climate at the southern tip. Summers tend to be warm and humid, with periodic rainfall, so they are ideal for pastures and grazing. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b8\\/Zurich-panorama2_594.jpg\\/460px-Zurich-panorama2_594.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b8\\/Zurich-panorama2_594.jpg\\/759px-Zurich-panorama2_594.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":504.85714285714283,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p><a rel=\\\"nofollow\\\" class=\\\"external free\\\" href=\\\"http:\\/\\/upload.wikimedia.org\\/wikipedia\\/commons\\/a\\/a0\\/Zurich-panorama2.jpg\\\">http:\\/\\/upload.wikimedia.org\\/wikipedia\\/commons\\/a\\/a0\\/Zurich-panorama2.jpg<\\/a>\\n<\\/p><p>License: <a href=\\\"\\/wikiHow:GNU-Free-Documentation-License\\\" title=\\\"wikiHow:GNU Free Documentation License\\\">GNU Free Documentation<\\/a><br>\\n<\\/p><\\/div>\"}  The Greater Zürich Area, which has 1.5 million inhabitants and 150,000 companies, has taken top position in some life quality surveys. Switzerland has one of the most stable economies in the world. The Swiss franc remains one of the world's strongest currencies with the lowest inflation rate. Switzerland remains very open to foreigners and has a diverse population. Resident foreigners and temporary foreign workers make up about 22% of the population. Religious freedom: Switzerland has no official state religion. Christianity is the predominant religion of Switzerland, divided between the Catholic Church (41.8% of the population) and various Protestant denominations (35.3%). Islam (4.3%) and Eastern Orthodoxy (1.8%) are sizable minority religions. Greeley (2003) found that 27% of Swiss are atheists. Switzerland is particularly suited for skiing, snowboarding and mountaineering, which are enjoyed by both locals and tourists."
                },
                {
                    "headline": "Research Switzerland.",
                    "description": "Check out books from your local library or bookstore, search the internet, ask around people who have been to Switzerland or know about the country. Be familiar with the country's cultures, traditions, laws, religions, cost of living, climate, language, transportation, etc."
                },
                {
                    "headline": "Make your decision.",
                    "description": "Moving to another country is a big decision in your life, so be sure to take your time and consult with your friends and loved ones. You must be absolutely convinced that moving to Switzerland is better than staying where you are, and that it is the best country for you to move to."
                }
            ]
        },
        {
            "name": "Making It Happen",
            "steps": [
                {
                    "headline": "Get your documentation in order.",
                    "description": "A  passport is a must for Americans. You will probably require a passport to travel by plane to Switzerland wherever you travel from if you live in Europe already, a passport may not be required, you may be able to cross the border from another European country unchallenged. Remember Switzerland is not part of the European Union. Get all required legal documents, such as passports, visa and work permits. This is essential, or you cannot gain entry into Switzerland. Visit the Federal Office of Immigration, Integration and Emigration if it helps, for all questions pertaining to visas and regulations. It is very easy to follow and has detailed information in four languages."
                },
                {
                    "headline": "Secure a job, preferably from a large international company based in Switzerland.",
                    "description": "They will typically help you get a work permit. There are many internet resources that can help you find a job in Switzerland.Excellent job search tool, with many international positions including Switzerland.</ref> Most Swiss employers are great employers, and many of them are even willing to hire someone with the technical skills they need regardless of language proficiency. (The Swiss languages are German, French, and Italian, each spoken primarily in areas of the Switzerland neighboring the respective countries.) If you work for a company in the US that has an office in Switzerland, you may be able to apply for a transfer. If not, consider looking for such company. Know that highly qualified specialists and top executives are awarded work and residence permits, in lieu of the above step. If that applies to you, you may apply for such permit. Be aware that this type of permit is extremely hard to obtain and even harder to get renewed. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2d\\/Move-to-Switzerland-Step-5.jpg\\/v4-460px-Move-to-Switzerland-Step-5.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2d\\/Move-to-Switzerland-Step-5.jpg\\/v4-760px-Move-to-Switzerland-Step-5.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nTake advantage of the three month rule: you are allowed to stay in the country legally for up to three months. Ensure that you are entitled to work during the three months. Take small jobs such as babysitting or English teachers, while looking for permanent work during the three month period. If you fail to find permanent work, don't be discouraged, but simply try again. When the three month period is up, leave the country for a while, then return for another three month visit to resume the job search."
                },
                {
                    "headline": "Establish a budget.",
                    "description": "Switzerland is the wealthiest country in the world, with an average per-capita income about £28,000 a year, and is one of the most expensive country to live in. If this does not deter you, you need to bring enough money to get a good start once you arrive, and be very conservative with spending every penny."
                },
                {
                    "headline": "Book your transportation to Switzerland.",
                    "description": "For example:\nFrom Britain: Flying is by far the easiest, cheapest, and most convenient way to get from Britain to Switzerland. Travelling by train is comfortable and scenic, but is more expensive and takes more than a day. Trains and buses are worth considering if you are interested in visiting other parts of Europe during the trip. From North America: Several airlines fly direct from North America to Zürich; many other airlines offer flights to Zürich via other major European cities. From Australia and New Zealand: Flying is the cheapest and easiest option. Fares vary significantly with the season: low season runs from mid-January to the end of February and during October and November; high season runs from mid-May to the end of August and from December to mid-January; the rest of the year is considered \"shoulder season\". So plan to travel during low season if possible. Find the best deal. Travel agents often offer better deals than buying direct from airlines."
                },
                {
                    "headline": "Convert your currency into Swiss francs.",
                    "description": "Note that the symbol for the Swiss franc is CHF, which stands for Confoederatio Helvetica Franc; the official name of Switzerland is Confoederatio Helvetica, or Swiss Confederation. Remember, the more money you bring, the better start that you will get in Switzerland. The rate of currency conversion may fluctuate, so keep a look out on the foreign exchange market, as you may be able to get a little bit extra money (especially if you are converting a lot of money)."
                },
                {
                    "headline": "Import your belongings.",
                    "description": "For example:\n\nPets: You may freely import cats and dogs without a permit. Obtain a rabies vaccination certificate from a veterinarian. The certificate must be written in German, French, Italian, or English can contain name and address of animal owner, description of the animal (breed, sex, age, color), confirmation that the animal was submitted to a veterinary examination prior to vaccination and found in good health, date of rabies vaccination, type of vaccine used, name of manufacturer and batch number, & signature of the veterinarian. Certificates in other languages are accepted if accompanied by a legal translation. Guinea pigs, hamsters, rats, mice, aquarium fish, and canaries can be imported without a veterinary certificate. Domestic animals and dangerous animals require import permits from the Federal Veterinary Office. Weapons: Obtain authorization from your place of origin to import weapons. Cars: You must pay import duty (consisting of customs duties based on weight of the vehicle and engine capacity; 4% consumption tax; 7.5% Value added tax; and 15-Fr for the report) to import a car that you owned for less than six months. Contact is the customs authority for full details. Cars you owned for more than six months are exempt from import duty and will simply require filling out a clearance request form. Also consider selling your cars and buying a car in Switzerland, or use a bike or public transportation."
                },
                {
                    "headline": "Pack your luggage.",
                    "description": "Big items can be imported separately, so pack only what you can fit into a bag, such as books, clothes, personal care items and money."
                },
                {
                    "headline": "Say goodbye to loved ones who will not accompanying you on the move.",
                    "description": "This is likely to be very emotional, so remember to bring tissues. Hug each other and tell them you love them, and invite them to come visit any time they want. Promise to keep in regular touch, and do so."
                },
                {
                    "headline": "Board your mode of transport, and go to Switzerland.",
                    "description": "Relax on the trip, and feel excited about starting a new life, in a new country. Do not worry too much about friends or family, as they will come and visit often, and you will make plenty of new friends."
                }
            ]
        },
        {
            "name": "Living in Switzerland",
            "steps": [
                {
                    "headline": "Look for a house/apartment in Switzerland.",
                    "description": "Visiting the country will offer you an opportunity to find a place. Real estate agents can help you in the process; alternatively, you can read books and search the internet."
                },
                {
                    "headline": "Have utilities installed, find a school for your children, etc.",
                    "description": "once you get there."
                },
                {
                    "headline": "Meet new people everywhere you go: at work, in the library, at the gym, at school, or at your hobby club.",
                    "description": "Check out all the resources available to help you integrate into the community\ngroups.yahoo.com/group/Expats-in-Switzerland/ - A discussion forum full of good advice about many practical issues], from moving to Switzerland to finding peanut butter and maple syrup. Here you can find a large list of more specific newsgroups and online communities for Switzerland. xpatxchange.ch/ - A one-stop shop for English speaking ex-pats in Switzerland, full of advice, businesses, addresses. It is perhaps more useful once you have arrived in Switzerland."
                },
                {
                    "headline": "Obtain Swiss citizenship.",
                    "description": "Not only will becoming a Swiss citizen help you integrate into the country permanently, you will also be able to start your own businesses, no longer need to re-apply for residence permits when changing jobs, no longer need special permission before purchasing residential property, and be able to move freely within the country. There are two ways to become a Swiss citizen:\nBy birth, if both parents are Swiss. Children born in Switzerland from non-Swiss parents do not automatically become Swiss. By naturalization. Make your request to the Aliens Police in the municipality of residence. From there, it will then be sent to the Federal Department of Justice and Police, who will give a principle authorization if you meet the following conditions:\nYou have resided in Switzerland for at least twelve years, three of which are within the five years prior to the request. Time spent in Switzerland between the ages of 10 and 20 years counts double. You are integrated in the Swiss community. You are accustomed to Swiss way of life and practices. You comply with the Swiss legal system. You do not compromise the internal or external security of Switzerland. You are able to afford it. Since Switzerland is a federal country, authorization must then be obtained from the canton and the municipality, which may add further conditions and set the cost of acquiring citizenship before approving it. Some municipalities apply rather open policies, while others will go as far as granting nationality by means of a local population vote. Cost varies according to municipality and canton."
                }
            ]
        }
    ],
    "tyn": [
        "Work and residence permit",
        "Passport and legal documents",
        "Money",
        "Tickets for transport (should you need any)",
        "Furniture (if you are not bringing your furniture over)",
        "Map"
    ],
    "text": " Making Your Decision Determine your motivations for moving. Are you trying to get a better job? To get a better lifestyle? To get a better education? To escape from unhappiness at home? Understand your motives, and evaluate alternatives to see whether moving to Switzerland is the best option. Write down all the reasons you want to move to Switzerland. For example:\nSwitzerland is famous for its beautiful mountains. The temperate climate in Switzerland, varying from glacial mountaintops to pleasant Mediterranean climate at the southern tip. Summers tend to be warm and humid, with periodic rainfall, so they are ideal for pastures and grazing. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b8\\/Zurich-panorama2_594.jpg\\/460px-Zurich-panorama2_594.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b8\\/Zurich-panorama2_594.jpg\\/759px-Zurich-panorama2_594.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":504.85714285714283,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p><a rel=\\\"nofollow\\\" class=\\\"external free\\\" href=\\\"http:\\/\\/upload.wikimedia.org\\/wikipedia\\/commons\\/a\\/a0\\/Zurich-panorama2.jpg\\\">http:\\/\\/upload.wikimedia.org\\/wikipedia\\/commons\\/a\\/a0\\/Zurich-panorama2.jpg<\\/a>\\n<\\/p><p>License: <a href=\\\"\\/wikiHow:GNU-Free-Documentation-License\\\" title=\\\"wikiHow:GNU Free Documentation License\\\">GNU Free Documentation<\\/a><br>\\n<\\/p><\\/div>\"}  The Greater Zürich Area, which has 1.5 million inhabitants and 150,000 companies, has taken top position in some life quality surveys. Switzerland has one of the most stable economies in the world. The Swiss franc remains one of the world's strongest currencies with the lowest inflation rate. Switzerland remains very open to foreigners and has a diverse population. Resident foreigners and temporary foreign workers make up about 22% of the population. Religious freedom: Switzerland has no official state religion. Christianity is the predominant religion of Switzerland, divided between the Catholic Church (41.8% of the population) and various Protestant denominations (35.3%). Islam (4.3%) and Eastern Orthodoxy (1.8%) are sizable minority religions. Greeley (2003) found that 27% of Swiss are atheists. Switzerland is particularly suited for skiing, snowboarding and mountaineering, which are enjoyed by both locals and tourists. Research Switzerland. Check out books from your local library or bookstore, search the internet, ask around people who have been to Switzerland or know about the country. Be familiar with the country's cultures, traditions, laws, religions, cost of living, climate, language, transportation, etc. Make your decision. Moving to another country is a big decision in your life, so be sure to take your time and consult with your friends and loved ones. You must be absolutely convinced that moving to Switzerland is better than staying where you are, and that it is the best country for you to move to. Making It Happen Get your documentation in order. A  passport is a must for Americans. You will probably require a passport to travel by plane to Switzerland wherever you travel from if you live in Europe already, a passport may not be required, you may be able to cross the border from another European country unchallenged. Remember Switzerland is not part of the European Union. Get all required legal documents, such as passports, visa and work permits. This is essential, or you cannot gain entry into Switzerland. Visit the Federal Office of Immigration, Integration and Emigration if it helps, for all questions pertaining to visas and regulations. It is very easy to follow and has detailed information in four languages. Secure a job, preferably from a large international company based in Switzerland. They will typically help you get a work permit. There are many internet resources that can help you find a job in Switzerland.Excellent job search tool, with many international positions including Switzerland.</ref> Most Swiss employers are great employers, and many of them are even willing to hire someone with the technical skills they need regardless of language proficiency. (The Swiss languages are German, French, and Italian, each spoken primarily in areas of the Switzerland neighboring the respective countries.) If you work for a company in the US that has an office in Switzerland, you may be able to apply for a transfer. If not, consider looking for such company. Know that highly qualified specialists and top executives are awarded work and residence permits, in lieu of the above step. If that applies to you, you may apply for such permit. Be aware that this type of permit is extremely hard to obtain and even harder to get renewed. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2d\\/Move-to-Switzerland-Step-5.jpg\\/v4-460px-Move-to-Switzerland-Step-5.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2d\\/Move-to-Switzerland-Step-5.jpg\\/v4-760px-Move-to-Switzerland-Step-5.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nTake advantage of the three month rule: you are allowed to stay in the country legally for up to three months. Ensure that you are entitled to work during the three months. Take small jobs such as babysitting or English teachers, while looking for permanent work during the three month period. If you fail to find permanent work, don't be discouraged, but simply try again. When the three month period is up, leave the country for a while, then return for another three month visit to resume the job search. Establish a budget. Switzerland is the wealthiest country in the world, with an average per-capita income about £28,000 a year, and is one of the most expensive country to live in. If this does not deter you, you need to bring enough money to get a good start once you arrive, and be very conservative with spending every penny. Book your transportation to Switzerland. For example:\nFrom Britain: Flying is by far the easiest, cheapest, and most convenient way to get from Britain to Switzerland. Travelling by train is comfortable and scenic, but is more expensive and takes more than a day. Trains and buses are worth considering if you are interested in visiting other parts of Europe during the trip. From North America: Several airlines fly direct from North America to Zürich; many other airlines offer flights to Zürich via other major European cities. From Australia and New Zealand: Flying is the cheapest and easiest option. Fares vary significantly with the season: low season runs from mid-January to the end of February and during October and November; high season runs from mid-May to the end of August and from December to mid-January; the rest of the year is considered \"shoulder season\". So plan to travel during low season if possible. Find the best deal. Travel agents often offer better deals than buying direct from airlines. Convert your currency into Swiss francs. Note that the symbol for the Swiss franc is CHF, which stands for Confoederatio Helvetica Franc; the official name of Switzerland is Confoederatio Helvetica, or Swiss Confederation. Remember, the more money you bring, the better start that you will get in Switzerland. The rate of currency conversion may fluctuate, so keep a look out on the foreign exchange market, as you may be able to get a little bit extra money (especially if you are converting a lot of money). Import your belongings. For example:\n\nPets: You may freely import cats and dogs without a permit. Obtain a rabies vaccination certificate from a veterinarian. The certificate must be written in German, French, Italian, or English can contain name and address of animal owner, description of the animal (breed, sex, age, color), confirmation that the animal was submitted to a veterinary examination prior to vaccination and found in good health, date of rabies vaccination, type of vaccine used, name of manufacturer and batch number, & signature of the veterinarian. Certificates in other languages are accepted if accompanied by a legal translation. Guinea pigs, hamsters, rats, mice, aquarium fish, and canaries can be imported without a veterinary certificate. Domestic animals and dangerous animals require import permits from the Federal Veterinary Office. Weapons: Obtain authorization from your place of origin to import weapons. Cars: You must pay import duty (consisting of customs duties based on weight of the vehicle and engine capacity; 4% consumption tax; 7.5% Value added tax; and 15-Fr for the report) to import a car that you owned for less than six months. Contact is the customs authority for full details. Cars you owned for more than six months are exempt from import duty and will simply require filling out a clearance request form. Also consider selling your cars and buying a car in Switzerland, or use a bike or public transportation. Pack your luggage. Big items can be imported separately, so pack only what you can fit into a bag, such as books, clothes, personal care items and money. Say goodbye to loved ones who will not accompanying you on the move. This is likely to be very emotional, so remember to bring tissues. Hug each other and tell them you love them, and invite them to come visit any time they want. Promise to keep in regular touch, and do so. Board your mode of transport, and go to Switzerland. Relax on the trip, and feel excited about starting a new life, in a new country. Do not worry too much about friends or family, as they will come and visit often, and you will make plenty of new friends. Living in Switzerland Look for a house/apartment in Switzerland. Visiting the country will offer you an opportunity to find a place. Real estate agents can help you in the process; alternatively, you can read books and search the internet. Have utilities installed, find a school for your children, etc. once you get there. Meet new people everywhere you go: at work, in the library, at the gym, at school, or at your hobby club. Check out all the resources available to help you integrate into the community\ngroups.yahoo.com/group/Expats-in-Switzerland/ - A discussion forum full of good advice about many practical issues], from moving to Switzerland to finding peanut butter and maple syrup. Here you can find a large list of more specific newsgroups and online communities for Switzerland. xpatxchange.ch/ - A one-stop shop for English speaking ex-pats in Switzerland, full of advice, businesses, addresses. It is perhaps more useful once you have arrived in Switzerland. Obtain Swiss citizenship. Not only will becoming a Swiss citizen help you integrate into the country permanently, you will also be able to start your own businesses, no longer need to re-apply for residence permits when changing jobs, no longer need special permission before purchasing residential property, and be able to move freely within the country. There are two ways to become a Swiss citizen:\nBy birth, if both parents are Swiss. Children born in Switzerland from non-Swiss parents do not automatically become Swiss. By naturalization. Make your request to the Aliens Police in the municipality of residence. From there, it will then be sent to the Federal Department of Justice and Police, who will give a principle authorization if you meet the following conditions:\nYou have resided in Switzerland for at least twelve years, three of which are within the five years prior to the request. Time spent in Switzerland between the ages of 10 and 20 years counts double. You are integrated in the Swiss community. You are accustomed to Swiss way of life and practices. You comply with the Swiss legal system. You do not compromise the internal or external security of Switzerland. You are able to afford it. Since Switzerland is a federal country, authorization must then be obtained from the canton and the municipality, which may add further conditions and set the cost of acquiring citizenship before approving it. Some municipalities apply rather open policies, while others will go as far as granting nationality by means of a local population vote. Cost varies according to municipality and canton.",
    "sentences": [
        " Making Your Decision Determine your motivations for moving.",
        "Are you trying to get a better job?",
        "To get a better lifestyle?",
        "To get a better education?",
        "To escape from unhappiness at home?",
        "Understand your motives, and evaluate alternatives to see whether moving to Switzerland is the best option.",
        "Write down all the reasons you want to move to Switzerland.",
        "For example:\nSwitzerland is famous for its beautiful mountains.",
        "The temperate climate in Switzerland, varying from glacial mountaintops to pleasant Mediterranean climate at the southern tip.",
        "Summers tend to be warm and humid, with periodic rainfall, so they are ideal for pastures and grazing.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b8\\/Zurich-panorama2_594.jpg\\/460px-Zurich-panorama2_594.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b8\\/Zurich-panorama2_594.jpg\\/759px-Zurich-panorama2_594.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":504.85714285714283,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p><a rel=\\\"nofollow\\\" class=\\\"external free\\\" href=\\\"http:\\/\\/upload.wikimedia.org\\/wikipedia\\/commons\\/a\\/a0\\/Zurich-panorama2.jpg\\\">http:\\/\\/upload.wikimedia.org\\/wikipedia\\/commons\\/a\\/a0\\/Zurich-panorama2.jpg<\\/a>\\n<\\/p><p>License: <a href=\\\"\\/wikiHow:GNU-Free-Documentation-License\\\" title=\\\"wikiHow:GNU Free Documentation License\\\">GNU Free Documentation<\\/a><br>\\n<\\/p><\\/div>\"}  The Greater Zürich Area, which has 1.5 million inhabitants and 150,000 companies, has taken top position in some life quality surveys.",
        "Switzerland has one of the most stable economies in the world.",
        "The Swiss franc remains one of the world's strongest currencies with the lowest inflation rate.",
        "Switzerland remains very open to foreigners and has a diverse population.",
        "Resident foreigners and temporary foreign workers make up about 22% of the population.",
        "Religious freedom: Switzerland has no official state religion.",
        "Christianity is the predominant religion of Switzerland, divided between the Catholic Church (41.8% of the population) and various Protestant denominations (35.3%).",
        "Islam (4.3%) and Eastern Orthodoxy (1.8%) are sizable minority religions.",
        "Greeley (2003) found that 27% of Swiss are atheists.",
        "Switzerland is particularly suited for skiing, snowboarding and mountaineering, which are enjoyed by both locals and tourists.",
        "Research Switzerland.",
        "Check out books from your local library or bookstore, search the internet, ask around people who have been to Switzerland or know about the country.",
        "Be familiar with the country's cultures, traditions, laws, religions, cost of living, climate, language, transportation, etc.",
        "Make your decision.",
        "Moving to another country is a big decision in your life, so be sure to take your time and consult with your friends and loved ones.",
        "You must be absolutely convinced that moving to Switzerland is better than staying where you are, and that it is the best country for you to move to.",
        "Making It Happen Get your documentation in order.",
        "A  passport is a must for Americans.",
        "You will probably require a passport to travel by plane to Switzerland wherever you travel from if you live in Europe already, a passport may not be required, you may be able to cross the border from another European country unchallenged.",
        "Remember Switzerland is not part of the European Union.",
        "Get all required legal documents, such as passports, visa and work permits.",
        "This is essential, or you cannot gain entry into Switzerland.",
        "Visit the Federal Office of Immigration, Integration and Emigration if it helps, for all questions pertaining to visas and regulations.",
        "It is very easy to follow and has detailed information in four languages.",
        "Secure a job, preferably from a large international company based in Switzerland.",
        "They will typically help you get a work permit.",
        "There are many internet resources that can help you find a job in Switzerland.Excellent job search tool, with many international positions including Switzerland.</ref> Most Swiss employers are great employers, and many of them are even willing to hire someone with the technical skills they need regardless of language proficiency.",
        "(The Swiss languages are German, French, and Italian, each spoken primarily in areas of the Switzerland neighboring the respective countries.)",
        "If you work for a company in the US that has an office in Switzerland, you may be able to apply for a transfer.",
        "If not, consider looking for such company.",
        "Know that highly qualified specialists and top executives are awarded work and residence permits, in lieu of the above step.",
        "If that applies to you, you may apply for such permit.",
        "Be aware that this type of permit is extremely hard to obtain and even harder to get renewed.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2d\\/Move-to-Switzerland-Step-5.jpg\\/v4-460px-Move-to-Switzerland-Step-5.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2d\\/Move-to-Switzerland-Step-5.jpg\\/v4-760px-Move-to-Switzerland-Step-5.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nTake advantage of the three month rule: you are allowed to stay in the country legally for up to three months.",
        "Ensure that you are entitled to work during the three months.",
        "Take small jobs such as babysitting or English teachers, while looking for permanent work during the three month period.",
        "If you fail to find permanent work, don't be discouraged, but simply try again.",
        "When the three month period is up, leave the country for a while, then return for another three month visit to resume the job search.",
        "Establish a budget.",
        "Switzerland is the wealthiest country in the world, with an average per-capita income about £28,000 a year, and is one of the most expensive country to live in.",
        "If this does not deter you, you need to bring enough money to get a good start once you arrive, and be very conservative with spending every penny.",
        "Book your transportation to Switzerland.",
        "For example:\nFrom Britain: Flying is by far the easiest, cheapest, and most convenient way to get from Britain to Switzerland.",
        "Travelling by train is comfortable and scenic, but is more expensive and takes more than a day.",
        "Trains and buses are worth considering if you are interested in visiting other parts of Europe during the trip.",
        "From North America: Several airlines fly direct from North America to Zürich; many other airlines offer flights to Zürich via other major European cities.",
        "From Australia and New Zealand: Flying is the cheapest and easiest option.",
        "Fares vary significantly with the season: low season runs from mid-January to the end of February and during October and November; high season runs from mid-May to the end of August and from December to mid-January; the rest of the year is considered \"shoulder season\".",
        "So plan to travel during low season if possible.",
        "Find the best deal.",
        "Travel agents often offer better deals than buying direct from airlines.",
        "Convert your currency into Swiss francs.",
        "Note that the symbol for the Swiss franc is CHF, which stands for Confoederatio Helvetica Franc; the official name of Switzerland is Confoederatio Helvetica, or Swiss Confederation.",
        "Remember, the more money you bring, the better start that you will get in Switzerland.",
        "The rate of currency conversion may fluctuate, so keep a look out on the foreign exchange market, as you may be able to get a little bit extra money (especially if you are converting a lot of money).",
        "Import your belongings.",
        "For example:\n\nPets: You may freely import cats and dogs without a permit.",
        "Obtain a rabies vaccination certificate from a veterinarian.",
        "The certificate must be written in German, French, Italian, or English can contain name and address of animal owner, description of the animal (breed, sex, age, color), confirmation that the animal was submitted to a veterinary examination prior to vaccination and found in good health, date of rabies vaccination, type of vaccine used, name of manufacturer and batch number, & signature of the veterinarian.",
        "Certificates in other languages are accepted if accompanied by a legal translation.",
        "Guinea pigs, hamsters, rats, mice, aquarium fish, and canaries can be imported without a veterinary certificate.",
        "Domestic animals and dangerous animals require import permits from the Federal Veterinary Office.",
        "Weapons: Obtain authorization from your place of origin to import weapons.",
        "Cars: You must pay import duty (consisting of customs duties based on weight of the vehicle and engine capacity; 4% consumption tax; 7.5% Value added tax; and 15-Fr for the report) to import a car that you owned for less than six months.",
        "Contact is the customs authority for full details.",
        "Cars you owned for more than six months are exempt from import duty and will simply require filling out a clearance request form.",
        "Also consider selling your cars and buying a car in Switzerland, or use a bike or public transportation.",
        "Pack your luggage.",
        "Big items can be imported separately, so pack only what you can fit into a bag, such as books, clothes, personal care items and money.",
        "Say goodbye to loved ones who will not accompanying you on the move.",
        "This is likely to be very emotional, so remember to bring tissues.",
        "Hug each other and tell them you love them, and invite them to come visit any time they want.",
        "Promise to keep in regular touch, and do so.",
        "Board your mode of transport, and go to Switzerland.",
        "Relax on the trip, and feel excited about starting a new life, in a new country.",
        "Do not worry too much about friends or family, as they will come and visit often, and you will make plenty of new friends.",
        "Living in Switzerland Look for a house/apartment in Switzerland.",
        "Visiting the country will offer you an opportunity to find a place.",
        "Real estate agents can help you in the process; alternatively, you can read books and search the internet.",
        "Have utilities installed, find a school for your children, etc.",
        "once you get there.",
        "Meet new people everywhere you go: at work, in the library, at the gym, at school, or at your hobby club.",
        "Check out all the resources available to help you integrate into the community\ngroups.yahoo.com/group/Expats-in-Switzerland/ - A discussion forum full of good advice about many practical issues], from moving to Switzerland to finding peanut butter and maple syrup.",
        "Here you can find a large list of more specific newsgroups and online communities for Switzerland.",
        "xpatxchange.ch/ - A one-stop shop for English speaking ex-pats in Switzerland, full of advice, businesses, addresses.",
        "It is perhaps more useful once you have arrived in Switzerland.",
        "Obtain Swiss citizenship.",
        "Not only will becoming a Swiss citizen help you integrate into the country permanently, you will also be able to start your own businesses, no longer need to re-apply for residence permits when changing jobs, no longer need special permission before purchasing residential property, and be able to move freely within the country.",
        "There are two ways to become a Swiss citizen:\nBy birth, if both parents are Swiss.",
        "Children born in Switzerland from non-Swiss parents do not automatically become Swiss.",
        "By naturalization.",
        "Make your request to the Aliens Police in the municipality of residence.",
        "From there, it will then be sent to the Federal Department of Justice and Police, who will give a principle authorization if you meet the following conditions:\nYou have resided in Switzerland for at least twelve years, three of which are within the five years prior to the request.",
        "Time spent in Switzerland between the ages of 10 and 20 years counts double.",
        "You are integrated in the Swiss community.",
        "You are accustomed to Swiss way of life and practices.",
        "You comply with the Swiss legal system.",
        "You do not compromise the internal or external security of Switzerland.",
        "You are able to afford it.",
        "Since Switzerland is a federal country, authorization must then be obtained from the canton and the municipality, which may add further conditions and set the cost of acquiring citizenship before approving it.",
        "Some municipalities apply rather open policies, while others will go as far as granting nationality by means of a local population vote.",
        "Cost varies according to municipality and canton."
    ]
}