{
    "title": "How to Become Student Council President of Middle School",
    "url": "https://www.wikihow.com/Become-Student-Council-President-of-Middle-School",
    "category_hierarchy": [
        "Youth",
        "School Stuff",
        "Surviving School",
        "Surviving Middle School"
    ],
    "steps": [
        {
            "headline": "Show that you are a leader outside of student council of friends boosts your popularity and chances of winning.",
            "description": "Though you certainly don't have to become lifelong best friends with every student, you must be polite to everyone and eliminate any shyness you might have. If you see someone sitting alone, strike up a conversation with them."
        },
        {
            "headline": "Make sure you're actually running before you try anything else (by officially getting your name on the ballot).",
            "description": "Putting up posters for a make-believe campaign is not a good start to your career in politics."
        },
        {
            "headline": "After making sure your school is okay with you putting up posters, make a ton of colorful, bright posters.",
            "description": "Make sure they are eye-catching and have cute slogans. Being original shows people you can have original ideas in the future. For example: Making the world a better place since (insert birth year). (insert name)."
        },
        {
            "headline": "When you write your speech, make sure it isn't too dull but be serious with your ideas.",
            "description": "Don't say you'll bring a unicorn to school or anything your school's funds can't easily afford. Give the reasons you're qualified (do you volunteer with Habitat For Humanity? Have you been in student council since sixth grade? Things like that. ), why you want to run, a sample of your ideas, and some of the steps you would take to achieve them. Spend time on your speech, and be sure to edit it several times. Finally, make sure you know your speech well enough to make contact with your audience while saying it in a confident voice (memorizing it might be a good idea, but you certainly don't have to)."
        },
        {
            "headline": "This may not seem right, but buy the bribes.",
            "description": "Candy, chips, cute accessories, etc. More people will think, Oh yeah, she's/he's cool. Make sure you're not violating any school rules by doing this before you go ahead with it, though; being disqualified won't exactly help your chances at being elected."
        },
        {
            "headline": "Try making stickers, fliers, or buttons, and get your friends to wear them.",
            "description": "It will surely increase the number of votes you get."
        },
        {
            "headline": "Be a leader.",
            "description": ""
        },
        {
            "headline": "Be a good influence on others.",
            "description": ""
        }
    ],
    "tyn": [
        "Good Speech",
        "Beautiful Slogans",
        "Posters (if allowed)",
        "Popularity"
    ],
    "text": " Show that you are a leader outside of student council of friends boosts your popularity and chances of winning. Though you certainly don't have to become lifelong best friends with every student, you must be polite to everyone and eliminate any shyness you might have. If you see someone sitting alone, strike up a conversation with them. Make sure you're actually running before you try anything else (by officially getting your name on the ballot). Putting up posters for a make-believe campaign is not a good start to your career in politics. After making sure your school is okay with you putting up posters, make a ton of colorful, bright posters. Make sure they are eye-catching and have cute slogans. Being original shows people you can have original ideas in the future. For example: Making the world a better place since (insert birth year). (insert name). When you write your speech, make sure it isn't too dull but be serious with your ideas. Don't say you'll bring a unicorn to school or anything your school's funds can't easily afford. Give the reasons you're qualified (do you volunteer with Habitat For Humanity? Have you been in student council since sixth grade? Things like that. ), why you want to run, a sample of your ideas, and some of the steps you would take to achieve them. Spend time on your speech, and be sure to edit it several times. Finally, make sure you know your speech well enough to make contact with your audience while saying it in a confident voice (memorizing it might be a good idea, but you certainly don't have to). This may not seem right, but buy the bribes. Candy, chips, cute accessories, etc. More people will think, Oh yeah, she's/he's cool. Make sure you're not violating any school rules by doing this before you go ahead with it, though; being disqualified won't exactly help your chances at being elected. Try making stickers, fliers, or buttons, and get your friends to wear them. It will surely increase the number of votes you get. Be a leader.  Be a good influence on others. ",
    "sentences": [
        " Show that you are a leader outside of student council of friends boosts your popularity and chances of winning.",
        "Though you certainly don't have to become lifelong best friends with every student, you must be polite to everyone and eliminate any shyness you might have.",
        "If you see someone sitting alone, strike up a conversation with them.",
        "Make sure you're actually running before you try anything else (by officially getting your name on the ballot).",
        "Putting up posters for a make-believe campaign is not a good start to your career in politics.",
        "After making sure your school is okay with you putting up posters, make a ton of colorful, bright posters.",
        "Make sure they are eye-catching and have cute slogans.",
        "Being original shows people you can have original ideas in the future.",
        "For example: Making the world a better place since (insert birth year).",
        "(insert name).",
        "When you write your speech, make sure it isn't too dull but be serious with your ideas.",
        "Don't say you'll bring a unicorn to school or anything your school's funds can't easily afford.",
        "Give the reasons you're qualified (do you volunteer with Habitat For Humanity?",
        "Have you been in student council since sixth grade?",
        "Things like that.",
        "), why you want to run, a sample of your ideas, and some of the steps you would take to achieve them.",
        "Spend time on your speech, and be sure to edit it several times.",
        "Finally, make sure you know your speech well enough to make contact with your audience while saying it in a confident voice (memorizing it might be a good idea, but you certainly don't have to).",
        "This may not seem right, but buy the bribes.",
        "Candy, chips, cute accessories, etc.",
        "More people will think, Oh yeah, she's/he's cool.",
        "Make sure you're not violating any school rules by doing this before you go ahead with it, though; being disqualified won't exactly help your chances at being elected.",
        "Try making stickers, fliers, or buttons, and get your friends to wear them.",
        "It will surely increase the number of votes you get.",
        "Be a leader.",
        "Be a good influence on others."
    ]
}