{
    "title": "How to Make Rainbow Slime",
    "url": "https://www.wikihow.com/Make-Rainbow-Slime",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Craft for Kids",
        "Putty Dough and Slime"
    ],
    "methods": [
        {
            "name": "Making Easy Rainbow Slime",
            "steps": [
                {
                    "headline": "Pour  liquid starch and school glue into a large bowl.",
                    "description": "Make your slime using equal parts liquid starch and school glue. Use a measuring cup to add 4  c (0.95 L) each of starch and glue to the bowl to make sure you have the correct amounts."
                },
                {
                    "headline": "Mix well using your hands or a wooden spoon.",
                    "description": "The mixture will start to get gooey and resemble slime."
                },
                {
                    "headline": "Separate the white slime into five small bowls.",
                    "description": "Using your hands or a wooden spoon, scoop about .5  c (120 mL) of slime into each bowl."
                },
                {
                    "headline": "Add different colors into each bowl.",
                    "description": "Add a couple drops of liquid watercolor paint or food coloring into each bowl. This will make a rainbow of colors. If you want dark rainbow slime, add 10-15 drops. If you would prefer a lighter-colored rainbow slime, add 6-10 drops."
                },
                {
                    "headline": "Mix the color into the slime using your hands or a wooden spoon.",
                    "description": "Stir until the color is vibrant and bright. It should resemble a rainbow."
                },
                {
                    "headline": "Enjoy playing with your slime.",
                    "description": "Have fun playing with the rainbow slime and looking at its bright colors. You may enjoy slightly combining multiple slime colors to make the slime really resemble a rainbow. Be careful when mixing colors because your slime may turn gray."
                }
            ]
        },
        {
            "name": "Creating Sparkly Rainbow Slime",
            "steps": [
                {
                    "headline": "Pour 1  fl oz (30 mL) of clear glue into 4-5 medium-sized bowls.",
                    "description": "Use a measuring cup to add glue to each bowl."
                },
                {
                    "headline": "Add a teaspoon of warm water into each bowl.",
                    "description": "Stir them together with a craft stick."
                },
                {
                    "headline": "Add different colors into each bowl.",
                    "description": "Add a couple of drops of liquid watercolor paint or food coloring into each bowl, making a rainbow of colors. If you want dark rainbow slime, add 10-15 drops of color. If you'd prefer a lighter-colored rainbow slime, add 6-10 drops of color."
                },
                {
                    "headline": "Add a tablespoon of glitter into each bowl of slime.",
                    "description": "Use a measuring spoon to measure out the glitter. Then, pour it into each bowl."
                },
                {
                    "headline": "Combine the borax and 5  c (1.2 L) of warm water in a separate bowl.",
                    "description": "Stir the ingredients together with a spoon. Mix until the borax is completely dissolved."
                },
                {
                    "headline": "Pour 1  c (240 mL) of the borax mixture into each bowl.",
                    "description": "Stir the ingredients right away to make them combine. The mixture will start to thicken and turn to slime."
                },
                {
                    "headline": "Continue to stir until the slime starts to grab and stick onto the craft stick while you mix.",
                    "description": ""
                },
                {
                    "headline": "Remove the slime from all of the bowls.",
                    "description": ""
                },
                {
                    "headline": "Start kneading the slime until it is dry and no longer wet.",
                    "description": ""
                },
                {
                    "headline": "Enjoy playing with your slime.",
                    "description": "Have fun playing with the rainbow slime and looking at its bright colors. You may enjoy combining multiple slime colors to make the slime really resemble a rainbow. However, be careful not to fully mix them together, or the slime will turn gray."
                }
            ]
        },
        {
            "name": "Crafting Glowing Rainbow Slime",
            "steps": [
                {
                    "headline": "Combine only the 1⅓ cup of warm water and the borax in a small bowl.",
                    "description": "Mix until the borax dissolves."
                },
                {
                    "headline": "Mix the rest of water and the glue in a separate bowl.",
                    "description": "Stir them together using a large craft stick."
                },
                {
                    "headline": "Combine the borax mixture with the glue mixture.",
                    "description": "Fold and mix well with a craft stick until the mixture is gooey and resembles slime."
                },
                {
                    "headline": "Roll the slime into 6 medium-sized balls and add them into 6 small bowls.",
                    "description": ""
                },
                {
                    "headline": "Add different paint colors into each bowl.",
                    "description": "Add a couple drops of fluorescent paint into each bowl, making a rainbow of colors. If you want dark rainbow slime, add 10-15 drops, but if you prefer a lighter rainbow slime, add 6-10 drops."
                },
                {
                    "headline": "Enjoy playing with your slime.",
                    "description": "Turn on the black light and have fun playing with the glowing rainbow slime and looking at its bright colors. You may like combining multiple slime colors to make the slime really resemble a rainbow. However, be careful not to fully mix them together, or the slime will turn gray."
                }
            ]
        }
    ],
    "tyn": [
        "Basic Rainbow Slime",
        "Glass bowl",
        "Measuring cups and spoons",
        "Spoon or spatula",
        "Small bowls",
        "Spoons",
        "Rubber gloves (optional)",
        "Glitter or other add-ins (optional)",
        "Fluffy Rainbow Slime",
        "Bowls"
    ],
    "text": " Making Easy Rainbow Slime Pour  liquid starch and school glue into a large bowl. Make your slime using equal parts liquid starch and school glue. Use a measuring cup to add 4  c (0.95 L) each of starch and glue to the bowl to make sure you have the correct amounts. Mix well using your hands or a wooden spoon. The mixture will start to get gooey and resemble slime. Separate the white slime into five small bowls. Using your hands or a wooden spoon, scoop about .5  c (120 mL) of slime into each bowl. Add different colors into each bowl. Add a couple drops of liquid watercolor paint or food coloring into each bowl. This will make a rainbow of colors. If you want dark rainbow slime, add 10-15 drops. If you would prefer a lighter-colored rainbow slime, add 6-10 drops. Mix the color into the slime using your hands or a wooden spoon. Stir until the color is vibrant and bright. It should resemble a rainbow. Enjoy playing with your slime. Have fun playing with the rainbow slime and looking at its bright colors. You may enjoy slightly combining multiple slime colors to make the slime really resemble a rainbow. Be careful when mixing colors because your slime may turn gray. Creating Sparkly Rainbow Slime Pour 1  fl oz (30 mL) of clear glue into 4-5 medium-sized bowls. Use a measuring cup to add glue to each bowl. Add a teaspoon of warm water into each bowl. Stir them together with a craft stick. Add different colors into each bowl. Add a couple of drops of liquid watercolor paint or food coloring into each bowl, making a rainbow of colors. If you want dark rainbow slime, add 10-15 drops of color. If you'd prefer a lighter-colored rainbow slime, add 6-10 drops of color. Add a tablespoon of glitter into each bowl of slime. Use a measuring spoon to measure out the glitter. Then, pour it into each bowl. Combine the borax and 5  c (1.2 L) of warm water in a separate bowl. Stir the ingredients together with a spoon. Mix until the borax is completely dissolved. Pour 1  c (240 mL) of the borax mixture into each bowl. Stir the ingredients right away to make them combine. The mixture will start to thicken and turn to slime. Continue to stir until the slime starts to grab and stick onto the craft stick while you mix.  Remove the slime from all of the bowls.  Start kneading the slime until it is dry and no longer wet.  Enjoy playing with your slime. Have fun playing with the rainbow slime and looking at its bright colors. You may enjoy combining multiple slime colors to make the slime really resemble a rainbow. However, be careful not to fully mix them together, or the slime will turn gray. Crafting Glowing Rainbow Slime Combine only the 1⅓ cup of warm water and the borax in a small bowl. Mix until the borax dissolves. Mix the rest of water and the glue in a separate bowl. Stir them together using a large craft stick. Combine the borax mixture with the glue mixture. Fold and mix well with a craft stick until the mixture is gooey and resembles slime. Roll the slime into 6 medium-sized balls and add them into 6 small bowls.  Add different paint colors into each bowl. Add a couple drops of fluorescent paint into each bowl, making a rainbow of colors. If you want dark rainbow slime, add 10-15 drops, but if you prefer a lighter rainbow slime, add 6-10 drops. Enjoy playing with your slime. Turn on the black light and have fun playing with the glowing rainbow slime and looking at its bright colors. You may like combining multiple slime colors to make the slime really resemble a rainbow. However, be careful not to fully mix them together, or the slime will turn gray.",
    "sentences": [
        " Making Easy Rainbow Slime Pour  liquid starch and school glue into a large bowl.",
        "Make your slime using equal parts liquid starch and school glue.",
        "Use a measuring cup to add 4  c (0.95 L) each of starch and glue to the bowl to make sure you have the correct amounts.",
        "Mix well using your hands or a wooden spoon.",
        "The mixture will start to get gooey and resemble slime.",
        "Separate the white slime into five small bowls.",
        "Using your hands or a wooden spoon, scoop about .5  c (120 mL) of slime into each bowl.",
        "Add different colors into each bowl.",
        "Add a couple drops of liquid watercolor paint or food coloring into each bowl.",
        "This will make a rainbow of colors.",
        "If you want dark rainbow slime, add 10-15 drops.",
        "If you would prefer a lighter-colored rainbow slime, add 6-10 drops.",
        "Mix the color into the slime using your hands or a wooden spoon.",
        "Stir until the color is vibrant and bright.",
        "It should resemble a rainbow.",
        "Enjoy playing with your slime.",
        "Have fun playing with the rainbow slime and looking at its bright colors.",
        "You may enjoy slightly combining multiple slime colors to make the slime really resemble a rainbow.",
        "Be careful when mixing colors because your slime may turn gray.",
        "Creating Sparkly Rainbow Slime Pour 1  fl oz (30 mL) of clear glue into 4-5 medium-sized bowls.",
        "Use a measuring cup to add glue to each bowl.",
        "Add a teaspoon of warm water into each bowl.",
        "Stir them together with a craft stick.",
        "Add different colors into each bowl.",
        "Add a couple of drops of liquid watercolor paint or food coloring into each bowl, making a rainbow of colors.",
        "If you want dark rainbow slime, add 10-15 drops of color.",
        "If you'd prefer a lighter-colored rainbow slime, add 6-10 drops of color.",
        "Add a tablespoon of glitter into each bowl of slime.",
        "Use a measuring spoon to measure out the glitter.",
        "Then, pour it into each bowl.",
        "Combine the borax and 5  c (1.2 L) of warm water in a separate bowl.",
        "Stir the ingredients together with a spoon.",
        "Mix until the borax is completely dissolved.",
        "Pour 1  c (240 mL) of the borax mixture into each bowl.",
        "Stir the ingredients right away to make them combine.",
        "The mixture will start to thicken and turn to slime.",
        "Continue to stir until the slime starts to grab and stick onto the craft stick while you mix.",
        "Remove the slime from all of the bowls.",
        "Start kneading the slime until it is dry and no longer wet.",
        "Enjoy playing with your slime.",
        "Have fun playing with the rainbow slime and looking at its bright colors.",
        "You may enjoy combining multiple slime colors to make the slime really resemble a rainbow.",
        "However, be careful not to fully mix them together, or the slime will turn gray.",
        "Crafting Glowing Rainbow Slime Combine only the 1⅓ cup of warm water and the borax in a small bowl.",
        "Mix until the borax dissolves.",
        "Mix the rest of water and the glue in a separate bowl.",
        "Stir them together using a large craft stick.",
        "Combine the borax mixture with the glue mixture.",
        "Fold and mix well with a craft stick until the mixture is gooey and resembles slime.",
        "Roll the slime into 6 medium-sized balls and add them into 6 small bowls.",
        "Add different paint colors into each bowl.",
        "Add a couple drops of fluorescent paint into each bowl, making a rainbow of colors.",
        "If you want dark rainbow slime, add 10-15 drops, but if you prefer a lighter rainbow slime, add 6-10 drops.",
        "Enjoy playing with your slime.",
        "Turn on the black light and have fun playing with the glowing rainbow slime and looking at its bright colors.",
        "You may like combining multiple slime colors to make the slime really resemble a rainbow.",
        "However, be careful not to fully mix them together, or the slime will turn gray."
    ]
}