{
    "title": "How to Clean Blueberries",
    "url": "https://www.wikihow.com/Clean-Blueberries",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables",
        "Berries"
    ],
    "methods": [
        {
            "name": "Washing with Water",
            "steps": [
                {
                    "headline": "Check for damaged berries and debris by hand.",
                    "description": "Remove any berries you don't want to eat as well as stems and other debris. Take out any berries with green spots, since the mold on them can spread to other berries. Red berries are unripened and should be removed along with any berries that look wrinkled or crushed. Good blueberries are plump with a deep, dark blue coloring. As you wash the berries, you may find more that feel soft to the touch. Take them out as you go."
                },
                {
                    "headline": "Load the blueberries into a strainer.",
                    "description": "A colander also works if you have one. Fill it with as many berries as possible, making sure they won’t spill out the top and roll across the floor. Pick out any stems you see loose in the strainer."
                },
                {
                    "headline": "Rinse the blueberries under cold water.",
                    "description": "Turn on the cold tap in your sink, but make sure the water stream is very gentle. If the water stream is too strong, it may crush some of the berries. Then, briefly hold the strainer underneath the running water until all the berries are wet. To avoid crushing any of your blueberries, you can also wash them by dipping the strainer in a bowl filled with cold water."
                },
                {
                    "headline": "Shake the strainer to drain out the water.",
                    "description": "Move the blueberries around so they aren’t soaking in any excess water left in the strainer. If you have your blueberries in a bowl, you can pick the berries up with a strainer and dump out the water. It’s important to avoid leaving your blueberries in water for a long time, since this leads to mushy berries that are unpleasant to eat."
                }
            ]
        },
        {
            "name": "Cleaning with Vinegar",
            "steps": [
                {
                    "headline": "Remove any moldy or mushy berries left in the batch.",
                    "description": "Sort through the berries by hand, looking for any signs of damage. The moldy and unripe ones are easy to spot, since they will look green and red, respectively. Also take out any that are crushed or wrinkled. Take out any soft, mushy berries, but don’t worry if you miss some. You have another chance when you’re washing them."
                },
                {
                    "headline": "Fill a bowl half-full with cold water.",
                    "description": "A large mixing bowl or salad spinner is a good choice for this. If you have a lot of berries to wash, you can fill a sink instead. Pour at least 3 cups, or 24  fl oz (710 mL), of cold water into the bowl."
                },
                {
                    "headline": "Mix 1 part vinegar into the cold water to preserve the blueberries.",
                    "description": "To ensure the vinegar solution is strong enough to eliminate mold and bacteria, keep it at a ratio of 1 part vinegar to 3 parts water. You can use a bottle of basic white vinegar purchased from a grocer or general store. Your berries may last longer in the fridge after being washed this way. For example, if you poured 3 cups (710 mL) of water into the bowl earlier, add 1 cup (240 mL) of vinegar. Instead of vinegar, you can purchase and use a commercial fruit wash from the supermarket."
                },
                {
                    "headline": "Pour the blueberries into the bowl with the vinegar mixture.",
                    "description": "Place as many berries in the bowl as you can. If your bowl is too small, set some of the berries aside. You can wash them later without replacing the mixture."
                },
                {
                    "headline": "Stir the blueberries in the bowl for 1 minute.",
                    "description": "You can use your hand to swish the berries around in the bowl. Soak them as evenly as possible in the vinegar mixture. You can soak the blueberries for up to 10 minutes to ensure they get cleaned. However, this may cause some of them to go mushy."
                },
                {
                    "headline": "Drain the water from the bowl.",
                    "description": "The easiest way to do this is to lift the blueberries out of the bowl with a strainer. You can also dump the bowl’s contents into a strainer to ensure the excess water drains. Avoid letting the blueberries sit in the water for very long. Begin drying them immediately."
                },
                {
                    "headline": "Rinse the berries under cold water.",
                    "description": "Your blueberries will reek of vinegar at this point. To get rid of the unpleasant smell, run some cold water in your sink. Wash the berries until you can no longer smell the vinegar. Make sure you use a gentle stream of water to avoid crushing the berries."
                }
            ]
        },
        {
            "name": "Drying Blueberries",
            "steps": [
                {
                    "headline": "Line a baking sheet with paper towels.",
                    "description": "Arrange the paper towels over a flat surface. The baking sheet will neatly catch any excess water while the paper towels will absorb moisture from the blueberries. If you do not have a baking sheet, you can leave the berries in a bowl or strainer. Simply pat them dry with paper towels."
                },
                {
                    "headline": "Spread the blueberries in a layer on the baking sheet.",
                    "description": "Set the blueberries on top of the paper towels. You want them to be in a single, even layer. If you have a lot of blueberries to dry, dry them in multiple batches."
                },
                {
                    "headline": "Pat the blueberries dry with paper towels.",
                    "description": "Hold a fresh paper towel over the blueberries. Gently dab the blueberries dry, rolling them around in the paper towel if you can. Replace your paper towel as it becomes saturated. If some blueberries are still left in a bowl or strainer, you may find rolling them around in the paper towel to be easier. Make sure all the moisture is removed so the berries are less likely to soften."
                }
            ]
        }
    ],
    "tyn": [
        "Washing with Water",
        "Strainer",
        "Sink",
        "Cold water",
        "Cleaning with Vinegar",
        "Bowl or sink",
        "Measuring cup",
        "White vinegar",
        "Water",
        "Drying Blueberries",
        "Baking tray",
        "Paper towels"
    ],
    "text": " Washing with Water Check for damaged berries and debris by hand. Remove any berries you don't want to eat as well as stems and other debris. Take out any berries with green spots, since the mold on them can spread to other berries. Red berries are unripened and should be removed along with any berries that look wrinkled or crushed. Good blueberries are plump with a deep, dark blue coloring. As you wash the berries, you may find more that feel soft to the touch. Take them out as you go. Load the blueberries into a strainer. A colander also works if you have one. Fill it with as many berries as possible, making sure they won’t spill out the top and roll across the floor. Pick out any stems you see loose in the strainer. Rinse the blueberries under cold water. Turn on the cold tap in your sink, but make sure the water stream is very gentle. If the water stream is too strong, it may crush some of the berries. Then, briefly hold the strainer underneath the running water until all the berries are wet. To avoid crushing any of your blueberries, you can also wash them by dipping the strainer in a bowl filled with cold water. Shake the strainer to drain out the water. Move the blueberries around so they aren’t soaking in any excess water left in the strainer. If you have your blueberries in a bowl, you can pick the berries up with a strainer and dump out the water. It’s important to avoid leaving your blueberries in water for a long time, since this leads to mushy berries that are unpleasant to eat. Cleaning with Vinegar Remove any moldy or mushy berries left in the batch. Sort through the berries by hand, looking for any signs of damage. The moldy and unripe ones are easy to spot, since they will look green and red, respectively. Also take out any that are crushed or wrinkled. Take out any soft, mushy berries, but don’t worry if you miss some. You have another chance when you’re washing them. Fill a bowl half-full with cold water. A large mixing bowl or salad spinner is a good choice for this. If you have a lot of berries to wash, you can fill a sink instead. Pour at least 3 cups, or 24  fl oz (710 mL), of cold water into the bowl. Mix 1 part vinegar into the cold water to preserve the blueberries. To ensure the vinegar solution is strong enough to eliminate mold and bacteria, keep it at a ratio of 1 part vinegar to 3 parts water. You can use a bottle of basic white vinegar purchased from a grocer or general store. Your berries may last longer in the fridge after being washed this way. For example, if you poured 3 cups (710 mL) of water into the bowl earlier, add 1 cup (240 mL) of vinegar. Instead of vinegar, you can purchase and use a commercial fruit wash from the supermarket. Pour the blueberries into the bowl with the vinegar mixture. Place as many berries in the bowl as you can. If your bowl is too small, set some of the berries aside. You can wash them later without replacing the mixture. Stir the blueberries in the bowl for 1 minute. You can use your hand to swish the berries around in the bowl. Soak them as evenly as possible in the vinegar mixture. You can soak the blueberries for up to 10 minutes to ensure they get cleaned. However, this may cause some of them to go mushy. Drain the water from the bowl. The easiest way to do this is to lift the blueberries out of the bowl with a strainer. You can also dump the bowl’s contents into a strainer to ensure the excess water drains. Avoid letting the blueberries sit in the water for very long. Begin drying them immediately. Rinse the berries under cold water. Your blueberries will reek of vinegar at this point. To get rid of the unpleasant smell, run some cold water in your sink. Wash the berries until you can no longer smell the vinegar. Make sure you use a gentle stream of water to avoid crushing the berries. Drying Blueberries Line a baking sheet with paper towels. Arrange the paper towels over a flat surface. The baking sheet will neatly catch any excess water while the paper towels will absorb moisture from the blueberries. If you do not have a baking sheet, you can leave the berries in a bowl or strainer. Simply pat them dry with paper towels. Spread the blueberries in a layer on the baking sheet. Set the blueberries on top of the paper towels. You want them to be in a single, even layer. If you have a lot of blueberries to dry, dry them in multiple batches. Pat the blueberries dry with paper towels. Hold a fresh paper towel over the blueberries. Gently dab the blueberries dry, rolling them around in the paper towel if you can. Replace your paper towel as it becomes saturated. If some blueberries are still left in a bowl or strainer, you may find rolling them around in the paper towel to be easier. Make sure all the moisture is removed so the berries are less likely to soften.",
    "sentences": [
        " Washing with Water Check for damaged berries and debris by hand.",
        "Remove any berries you don't want to eat as well as stems and other debris.",
        "Take out any berries with green spots, since the mold on them can spread to other berries.",
        "Red berries are unripened and should be removed along with any berries that look wrinkled or crushed.",
        "Good blueberries are plump with a deep, dark blue coloring.",
        "As you wash the berries, you may find more that feel soft to the touch.",
        "Take them out as you go.",
        "Load the blueberries into a strainer.",
        "A colander also works if you have one.",
        "Fill it with as many berries as possible, making sure they won’t spill out the top and roll across the floor.",
        "Pick out any stems you see loose in the strainer.",
        "Rinse the blueberries under cold water.",
        "Turn on the cold tap in your sink, but make sure the water stream is very gentle.",
        "If the water stream is too strong, it may crush some of the berries.",
        "Then, briefly hold the strainer underneath the running water until all the berries are wet.",
        "To avoid crushing any of your blueberries, you can also wash them by dipping the strainer in a bowl filled with cold water.",
        "Shake the strainer to drain out the water.",
        "Move the blueberries around so they aren’t soaking in any excess water left in the strainer.",
        "If you have your blueberries in a bowl, you can pick the berries up with a strainer and dump out the water.",
        "It’s important to avoid leaving your blueberries in water for a long time, since this leads to mushy berries that are unpleasant to eat.",
        "Cleaning with Vinegar Remove any moldy or mushy berries left in the batch.",
        "Sort through the berries by hand, looking for any signs of damage.",
        "The moldy and unripe ones are easy to spot, since they will look green and red, respectively.",
        "Also take out any that are crushed or wrinkled.",
        "Take out any soft, mushy berries, but don’t worry if you miss some.",
        "You have another chance when you’re washing them.",
        "Fill a bowl half-full with cold water.",
        "A large mixing bowl or salad spinner is a good choice for this.",
        "If you have a lot of berries to wash, you can fill a sink instead.",
        "Pour at least 3 cups, or 24  fl oz (710 mL), of cold water into the bowl.",
        "Mix 1 part vinegar into the cold water to preserve the blueberries.",
        "To ensure the vinegar solution is strong enough to eliminate mold and bacteria, keep it at a ratio of 1 part vinegar to 3 parts water.",
        "You can use a bottle of basic white vinegar purchased from a grocer or general store.",
        "Your berries may last longer in the fridge after being washed this way.",
        "For example, if you poured 3 cups (710 mL) of water into the bowl earlier, add 1 cup (240 mL) of vinegar.",
        "Instead of vinegar, you can purchase and use a commercial fruit wash from the supermarket.",
        "Pour the blueberries into the bowl with the vinegar mixture.",
        "Place as many berries in the bowl as you can.",
        "If your bowl is too small, set some of the berries aside.",
        "You can wash them later without replacing the mixture.",
        "Stir the blueberries in the bowl for 1 minute.",
        "You can use your hand to swish the berries around in the bowl.",
        "Soak them as evenly as possible in the vinegar mixture.",
        "You can soak the blueberries for up to 10 minutes to ensure they get cleaned.",
        "However, this may cause some of them to go mushy.",
        "Drain the water from the bowl.",
        "The easiest way to do this is to lift the blueberries out of the bowl with a strainer.",
        "You can also dump the bowl’s contents into a strainer to ensure the excess water drains.",
        "Avoid letting the blueberries sit in the water for very long.",
        "Begin drying them immediately.",
        "Rinse the berries under cold water.",
        "Your blueberries will reek of vinegar at this point.",
        "To get rid of the unpleasant smell, run some cold water in your sink.",
        "Wash the berries until you can no longer smell the vinegar.",
        "Make sure you use a gentle stream of water to avoid crushing the berries.",
        "Drying Blueberries Line a baking sheet with paper towels.",
        "Arrange the paper towels over a flat surface.",
        "The baking sheet will neatly catch any excess water while the paper towels will absorb moisture from the blueberries.",
        "If you do not have a baking sheet, you can leave the berries in a bowl or strainer.",
        "Simply pat them dry with paper towels.",
        "Spread the blueberries in a layer on the baking sheet.",
        "Set the blueberries on top of the paper towels.",
        "You want them to be in a single, even layer.",
        "If you have a lot of blueberries to dry, dry them in multiple batches.",
        "Pat the blueberries dry with paper towels.",
        "Hold a fresh paper towel over the blueberries.",
        "Gently dab the blueberries dry, rolling them around in the paper towel if you can.",
        "Replace your paper towel as it becomes saturated.",
        "If some blueberries are still left in a bowl or strainer, you may find rolling them around in the paper towel to be easier.",
        "Make sure all the moisture is removed so the berries are less likely to soften."
    ]
}