{
    "title": "How to Set Up a Hissing Cockroach House",
    "url": "https://www.wikihow.com/Set-Up-a-Hissing-Cockroach-House",
    "category_hierarchy": [
        "Pets and Animals",
        "Bugs"
    ],
    "methods": [
        {
            "name": "Setting up a Tank for Your Cockroach",
            "steps": [
                {
                    "headline": "Get a glass or plastic aquarium to house your hissing cockroach in.",
                    "description": "A 10 US gal (38 L) aquarium will provide enough space for your cockroach to roam around in. You can get a glass or plastic aquarium online or at your local pet store. If you have more than 1 cockroach, this size tank will still work. You can keep up to 30 adult cockroaches in a 10 US gal (38 L) tank! Get an aquarium that comes with a secure screen lid since hissing cockroaches can climb vertical surfaces and escape without one. Just make sure the lid is ventilated so air can get into the tank."
                },
                {
                    "headline": "Line the bottom of the tank with a substrate for your cockroach to burrow in.",
                    "description": "Cockroaches are nocturnal, and they avoid sources of light. A 2–3 in (5.1–7.6 cm) layer of substrate at the bottom of the tank will give your cockroach a place to burrow and hide from the light during the daytime. You can use wood chips, moist peat, or sphagnum moss for the substrate. Don't use cedar or pine bark as a substrate since it's toxic to cockroaches. You can find a substrate for your hissing cockroach online or at your local pet store."
                },
                {
                    "headline": "Add decorations and shelters for your cockroach to hide in and climb on.",
                    "description": "You can use store-bought decorations and shelters, like artificial branches and caves. Or, you can make your own using things like empty egg cartons and empty toilet paper rolls.Tip: Avoid overcrowding your cockroach’s tank with decorations and shelters. If there are too many hiding places in the tank, it will be hard for you to see your cockroach. One or 2 shelters should be enough."
                },
                {
                    "headline": "Set up a heating pad under two-thirds of the tank to regulate the temperature.",
                    "description": "Hissing cockroaches thrive in warm environments. Unless you’re able to keep the tank in a specially heated room, you’ll need to use a heating pad. Only place the heating pad under two-thirds of the tank so there’s a warm end and a cool end in the tank for your cockroach to choose between. Use a heating pad that’s designed for reptile tanks. You can find one online or at your local pet store. Alternatively, you can place a heating rock (an artificial rock with a heat source inside of it) on one side of your cockroach’s tank."
                },
                {
                    "headline": "Provide a water dish with a sponge inside for your cockroach to drink from.",
                    "description": "Wild hissing cockroaches get a lot of their water from the food they eat, but they require a fresh water supply in captivity. The sponge in the dish will absorb the water, making it easier for your cockroach to drink. It will also prevent your cockroach from falling into the dish and drowning.You’ll need to add more water to the dish whenever it gets low and replace the sponge whenever it gets dirty. Check on the water and sponge daily to make sure they don't need to be replaced. Use dechlorinated water so you don’t make your cockroach sick."
                }
            ]
        },
        {
            "name": "Maintaining Your Cockroach House",
            "steps": [
                {
                    "headline": "Mist the substrate in your cockroach’s tank whenever it starts to dry out.",
                    "description": "Hissing cockroaches thrive in a warm, humid environment, so it’s important that your cockroach’s substrate doesn’t dry out completely. Check on it daily, and if it starts to look and feel dry, mist it with water using a spray bottle so it's wet but not soaked. Make sure you use dechlorinated water since tap water and water with chlorine in it aren’t safe for cockroaches."
                },
                {
                    "headline": "Keep the tank at 72–76 °F (22–24 °C).",
                    "description": "Temperatures can exceed 100 °F (38 °C) in the hissing cockroach's natural habitat, so it's evolved to thrive in a warm climate. While you don’t want to make the tank that warm, you do want to make sure it doesn’t drop below 70 °F (21 °C) since temperatures that low can make your cockroach sluggish and could be fatal. Increasing the temperature to 80 °F (27 °C) or higher will make your cockroach more active. Use the heating pad or heating stone you set up the regulate the temperature in the tank.Tip: Attach a thermometer to the inside of your cockroach’s tank so you can easily monitor the temperature."
                },
                {
                    "headline": "Provide food for your cockroach at all times.",
                    "description": "Hissing cockroaches are omnivores (they eat both meat and plants). In captivity, they do best on a diet of dried pet food that’s supplemented with fruits and vegetables. Make sure your cockroach has access to fresh food at all times so it doesn’t start eating things in the cage, like its shelters and substrate. To feed your cockroach fruits and vegetables, cut them up into 1 inch (2.5 cm) pieces before placing them in the tank. Always remove uneaten fruits and vegetables before they go bad so mold doesn’t grow in the tank."
                },
                {
                    "headline": "Clean your cockroach’s entire tank once every 6 months.",
                    "description": "In addition to removing uneaten food in the tank on a daily basis, you’ll want to replace all of the substrate and disinfect the tank (including any decorations and shelters) twice a year to keep your cockroach healthy. To disinfect the tank, start by moving your cockroach to a ventilated, secure container. Then, take everything out of the tank, and spray a solution of 1 part bleach and 16 parts water on the tank and accessories. Then, let them sit for 10 minutes before thoroughly rinsing everything off with water. Let the tank and accessories air dry a few hours before setting up the tank again."
                }
            ]
        }
    ],
    "tyn": [
        "10 US gal (38 L) glass or plastic aquarium",
        "Wood chips, moist peat, or sphagnum moss for substrate",
        "Rocks, branches, and other decorations",
        "Reptile heating pad",
        "Water dish",
        "Small sponge",
        "Thermometer",
        "Spray bottle"
    ],
    "text": " Setting up a Tank for Your Cockroach Get a glass or plastic aquarium to house your hissing cockroach in. A 10 US gal (38 L) aquarium will provide enough space for your cockroach to roam around in. You can get a glass or plastic aquarium online or at your local pet store. If you have more than 1 cockroach, this size tank will still work. You can keep up to 30 adult cockroaches in a 10 US gal (38 L) tank! Get an aquarium that comes with a secure screen lid since hissing cockroaches can climb vertical surfaces and escape without one. Just make sure the lid is ventilated so air can get into the tank. Line the bottom of the tank with a substrate for your cockroach to burrow in. Cockroaches are nocturnal, and they avoid sources of light. A 2–3 in (5.1–7.6 cm) layer of substrate at the bottom of the tank will give your cockroach a place to burrow and hide from the light during the daytime. You can use wood chips, moist peat, or sphagnum moss for the substrate. Don't use cedar or pine bark as a substrate since it's toxic to cockroaches. You can find a substrate for your hissing cockroach online or at your local pet store. Add decorations and shelters for your cockroach to hide in and climb on. You can use store-bought decorations and shelters, like artificial branches and caves. Or, you can make your own using things like empty egg cartons and empty toilet paper rolls.Tip: Avoid overcrowding your cockroach’s tank with decorations and shelters. If there are too many hiding places in the tank, it will be hard for you to see your cockroach. One or 2 shelters should be enough. Set up a heating pad under two-thirds of the tank to regulate the temperature. Hissing cockroaches thrive in warm environments. Unless you’re able to keep the tank in a specially heated room, you’ll need to use a heating pad. Only place the heating pad under two-thirds of the tank so there’s a warm end and a cool end in the tank for your cockroach to choose between. Use a heating pad that’s designed for reptile tanks. You can find one online or at your local pet store. Alternatively, you can place a heating rock (an artificial rock with a heat source inside of it) on one side of your cockroach’s tank. Provide a water dish with a sponge inside for your cockroach to drink from. Wild hissing cockroaches get a lot of their water from the food they eat, but they require a fresh water supply in captivity. The sponge in the dish will absorb the water, making it easier for your cockroach to drink. It will also prevent your cockroach from falling into the dish and drowning.You’ll need to add more water to the dish whenever it gets low and replace the sponge whenever it gets dirty. Check on the water and sponge daily to make sure they don't need to be replaced. Use dechlorinated water so you don’t make your cockroach sick. Maintaining Your Cockroach House Mist the substrate in your cockroach’s tank whenever it starts to dry out. Hissing cockroaches thrive in a warm, humid environment, so it’s important that your cockroach’s substrate doesn’t dry out completely. Check on it daily, and if it starts to look and feel dry, mist it with water using a spray bottle so it's wet but not soaked. Make sure you use dechlorinated water since tap water and water with chlorine in it aren’t safe for cockroaches. Keep the tank at 72–76 °F (22–24 °C). Temperatures can exceed 100 °F (38 °C) in the hissing cockroach's natural habitat, so it's evolved to thrive in a warm climate. While you don’t want to make the tank that warm, you do want to make sure it doesn’t drop below 70 °F (21 °C) since temperatures that low can make your cockroach sluggish and could be fatal. Increasing the temperature to 80 °F (27 °C) or higher will make your cockroach more active. Use the heating pad or heating stone you set up the regulate the temperature in the tank.Tip: Attach a thermometer to the inside of your cockroach’s tank so you can easily monitor the temperature. Provide food for your cockroach at all times. Hissing cockroaches are omnivores (they eat both meat and plants). In captivity, they do best on a diet of dried pet food that’s supplemented with fruits and vegetables. Make sure your cockroach has access to fresh food at all times so it doesn’t start eating things in the cage, like its shelters and substrate. To feed your cockroach fruits and vegetables, cut them up into 1 inch (2.5 cm) pieces before placing them in the tank. Always remove uneaten fruits and vegetables before they go bad so mold doesn’t grow in the tank. Clean your cockroach’s entire tank once every 6 months. In addition to removing uneaten food in the tank on a daily basis, you’ll want to replace all of the substrate and disinfect the tank (including any decorations and shelters) twice a year to keep your cockroach healthy. To disinfect the tank, start by moving your cockroach to a ventilated, secure container. Then, take everything out of the tank, and spray a solution of 1 part bleach and 16 parts water on the tank and accessories. Then, let them sit for 10 minutes before thoroughly rinsing everything off with water. Let the tank and accessories air dry a few hours before setting up the tank again.",
    "sentences": [
        " Setting up a Tank for Your Cockroach Get a glass or plastic aquarium to house your hissing cockroach in.",
        "A 10 US gal (38 L) aquarium will provide enough space for your cockroach to roam around in.",
        "You can get a glass or plastic aquarium online or at your local pet store.",
        "If you have more than 1 cockroach, this size tank will still work.",
        "You can keep up to 30 adult cockroaches in a 10 US gal (38 L) tank!",
        "Get an aquarium that comes with a secure screen lid since hissing cockroaches can climb vertical surfaces and escape without one.",
        "Just make sure the lid is ventilated so air can get into the tank.",
        "Line the bottom of the tank with a substrate for your cockroach to burrow in.",
        "Cockroaches are nocturnal, and they avoid sources of light.",
        "A 2–3 in (5.1–7.6 cm) layer of substrate at the bottom of the tank will give your cockroach a place to burrow and hide from the light during the daytime.",
        "You can use wood chips, moist peat, or sphagnum moss for the substrate.",
        "Don't use cedar or pine bark as a substrate since it's toxic to cockroaches.",
        "You can find a substrate for your hissing cockroach online or at your local pet store.",
        "Add decorations and shelters for your cockroach to hide in and climb on.",
        "You can use store-bought decorations and shelters, like artificial branches and caves.",
        "Or, you can make your own using things like empty egg cartons and empty toilet paper rolls.Tip: Avoid overcrowding your cockroach’s tank with decorations and shelters.",
        "If there are too many hiding places in the tank, it will be hard for you to see your cockroach.",
        "One or 2 shelters should be enough.",
        "Set up a heating pad under two-thirds of the tank to regulate the temperature.",
        "Hissing cockroaches thrive in warm environments.",
        "Unless you’re able to keep the tank in a specially heated room, you’ll need to use a heating pad.",
        "Only place the heating pad under two-thirds of the tank so there’s a warm end and a cool end in the tank for your cockroach to choose between.",
        "Use a heating pad that’s designed for reptile tanks.",
        "You can find one online or at your local pet store.",
        "Alternatively, you can place a heating rock (an artificial rock with a heat source inside of it) on one side of your cockroach’s tank.",
        "Provide a water dish with a sponge inside for your cockroach to drink from.",
        "Wild hissing cockroaches get a lot of their water from the food they eat, but they require a fresh water supply in captivity.",
        "The sponge in the dish will absorb the water, making it easier for your cockroach to drink.",
        "It will also prevent your cockroach from falling into the dish and drowning.You’ll need to add more water to the dish whenever it gets low and replace the sponge whenever it gets dirty.",
        "Check on the water and sponge daily to make sure they don't need to be replaced.",
        "Use dechlorinated water so you don’t make your cockroach sick.",
        "Maintaining Your Cockroach House Mist the substrate in your cockroach’s tank whenever it starts to dry out.",
        "Hissing cockroaches thrive in a warm, humid environment, so it’s important that your cockroach’s substrate doesn’t dry out completely.",
        "Check on it daily, and if it starts to look and feel dry, mist it with water using a spray bottle so it's wet but not soaked.",
        "Make sure you use dechlorinated water since tap water and water with chlorine in it aren’t safe for cockroaches.",
        "Keep the tank at 72–76 °F (22–24 °C).",
        "Temperatures can exceed 100 °F (38 °C) in the hissing cockroach's natural habitat, so it's evolved to thrive in a warm climate.",
        "While you don’t want to make the tank that warm, you do want to make sure it doesn’t drop below 70 °F (21 °C) since temperatures that low can make your cockroach sluggish and could be fatal.",
        "Increasing the temperature to 80 °F (27 °C) or higher will make your cockroach more active.",
        "Use the heating pad or heating stone you set up the regulate the temperature in the tank.Tip: Attach a thermometer to the inside of your cockroach’s tank so you can easily monitor the temperature.",
        "Provide food for your cockroach at all times.",
        "Hissing cockroaches are omnivores (they eat both meat and plants).",
        "In captivity, they do best on a diet of dried pet food that’s supplemented with fruits and vegetables.",
        "Make sure your cockroach has access to fresh food at all times so it doesn’t start eating things in the cage, like its shelters and substrate.",
        "To feed your cockroach fruits and vegetables, cut them up into 1 inch (2.5 cm) pieces before placing them in the tank.",
        "Always remove uneaten fruits and vegetables before they go bad so mold doesn’t grow in the tank.",
        "Clean your cockroach’s entire tank once every 6 months.",
        "In addition to removing uneaten food in the tank on a daily basis, you’ll want to replace all of the substrate and disinfect the tank (including any decorations and shelters) twice a year to keep your cockroach healthy.",
        "To disinfect the tank, start by moving your cockroach to a ventilated, secure container.",
        "Then, take everything out of the tank, and spray a solution of 1 part bleach and 16 parts water on the tank and accessories.",
        "Then, let them sit for 10 minutes before thoroughly rinsing everything off with water.",
        "Let the tank and accessories air dry a few hours before setting up the tank again."
    ]
}