{
    "title": "How to Make a Microwaved Oreo Cake",
    "url": "https://www.wikihow.com/Make-a-Microwaved-Oreo-Cake",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking",
        "Cakes",
        "Chocolate Cakes"
    ],
    "methods": [
        {
            "name": "5-Ingredient Oreo Microwave Cake",
            "steps": [
                {
                    "headline": "Grease the inside of a large, microwave-safe mug or bowl.",
                    "description": "You can use vegetable oil or spray the interior with non-stick cooking spray to lightly grease the inside. If you don’t have an oversized mug or large bowl, grease 2 standard sized mugs or 2 small bowls. The cake will rise as it cooks in the microwave, so its important to choose a mug or bowl with plenty of extra space."
                },
                {
                    "headline": "Crush the Oreo cookies into ⁄4 inch (6.4 mm) pieces.",
                    "description": "Put the Oreos in a food processor or blender and pulse for a few seconds until the cookies are crushed. If you don’t have a food processor or blender, put the Oreos in a large Ziploc bag, seal it tightly, and use a rolling pin to crush the cookies."
                },
                {
                    "headline": "Combine the crushed Oreos, baking powder, and milk.",
                    "description": "Put the crushed Oreos in the medium-sized bowl first, then stir in ½ teaspoon (2 grams) of baking power. Once the dry ingredients are combined, add 1 cup (240 mL) of milk and stir the mixture until the ingredients are fully incorporated."
                },
                {
                    "headline": "Pour the batter into your greased mug until it’s filled up about halfway.",
                    "description": "Place the mug in your microwave, uncovered. Be sure to position the mug or bowl right in the middle of the microwave so that the cake cooks evenly, then close the microwave door. Remember that the cake will rise as it cooks, so filling the mug or bowl halfway allows plenty of space for that."
                },
                {
                    "headline": "Microwave the cake on HIGH for 1 minute and 45 seconds.",
                    "description": "Keep an eye on the batter to make sure it doesn’t overflow, but as long as you filled the mug or bowl only halfway, it should be fine. If you used 2 mugs or bowls instead of 1 large mug or bowl, microwave the mixture on HIGH for 2 minutes."
                },
                {
                    "headline": "Let the cake cool for 10 minutes before serving it.",
                    "description": "Carefully take the mug out of the microwave and place it on a heat-safe surface. After about 10 minutes, top the cake with a scoop of vanilla ice cream and dig in with a spoon! You can also try adding icing, frosting, or extra crushed Oreos on top! Microwaved cake is best when served immediately. Since this kind of cake doesn’t preserve well, it’s best to enjoy it in one sitting!"
                }
            ]
        },
        {
            "name": "Cookies and Cream 1-Minute Mug Cake",
            "steps": [
                {
                    "headline": "Mix all of the dry ingredients together in a large bowl.",
                    "description": "Measure out 5 ½ tablespoons (82.5 grams) of flour, 4 tablespoons (60 grams) of sugar, and 1/8 teaspoon (1/2 gram) of baking powder. Then, stir the ingredients together until they’re fully incorporated. This recipe makes 2 servings. If you only want to make a single mug cake, you can halve these ingredients."
                },
                {
                    "headline": "Stir the wet ingredients into the dry ingredients.",
                    "description": "Crack 1 egg into the mug. Then, add 3 tablespoons (44 ml) of milk, 3 tablespoons (44 ml) of vegetable oil, and 1 teaspoon (4.9 ml) of vanilla to the mug and stir the ingredients thoroughly until the batter looks smooth. If you're making 1 mug cake instead of 2, don't forget to halve these ingredients!"
                },
                {
                    "headline": "Add 2 Oreos to the mug and mash them into the batter.",
                    "description": "Add the cookies to the batter and use a spoon or spatula to crush the cookies while simultaneously mixing them into the mixture. Feel free to use more than 2 Oreos if you want a richer dessert!"
                },
                {
                    "headline": "Divide the batter between 2 microwave-safe mugs or bowls.",
                    "description": "Use a spatula to transfer the cake batter into 2 mugs or bowls. The cake will rise a bit as it cooks, so make sure you only fill the mugs or bowls up halfway with batter."
                },
                {
                    "headline": "Microwave the cake on HIGH for 1 minute.",
                    "description": "Place the mugs or bowls in your microwave, uncovered. Microwave the cake on HIGH for 1 minute, then use a toothpick to check the middle of the cake. If the toothpick comes out clean, the cake is done. If crumbs cling to the toothpick, microwave the cake on HIGH for about 20 more seconds. Try not to overcook the cake to avoid a rubbery texture."
                },
                {
                    "headline": "Let the cake cool for 5-10 minutes before serving it.",
                    "description": "Take the mugs out of the microwave and set them aside for several minutes so the cake can cool. Then, dig right in with a spoon, or you can top the cake with vanilla ice cream and extra crushed Oreos first! Enjoy the cake immediately for the best flavor and texture. Since microwaved cake doesn’t make good leftovers, eat what you can and toss the rest out."
                }
            ]
        }
    ],
    "tyn": [
        "5-Ingredient Oreo Microwave Cake",
        "Microwave-safe mug or bowl",
        "Non-stick cooking spray",
        "Food processor or blender",
        "Large spoon or spatula",
        "Ice cream scoop",
        "2 serving spoons",
        "Cookies and Cream 1-Minute Mug Cake",
        "Large bowl",
        "Spoon or spatula",
        "2 microwave-safe mugs"
    ],
    "text": " 5-Ingredient Oreo Microwave Cake Grease the inside of a large, microwave-safe mug or bowl. You can use vegetable oil or spray the interior with non-stick cooking spray to lightly grease the inside. If you don’t have an oversized mug or large bowl, grease 2 standard sized mugs or 2 small bowls. The cake will rise as it cooks in the microwave, so its important to choose a mug or bowl with plenty of extra space. Crush the Oreo cookies into ⁄4 inch (6.4 mm) pieces. Put the Oreos in a food processor or blender and pulse for a few seconds until the cookies are crushed. If you don’t have a food processor or blender, put the Oreos in a large Ziploc bag, seal it tightly, and use a rolling pin to crush the cookies. Combine the crushed Oreos, baking powder, and milk. Put the crushed Oreos in the medium-sized bowl first, then stir in ½ teaspoon (2 grams) of baking power. Once the dry ingredients are combined, add 1 cup (240 mL) of milk and stir the mixture until the ingredients are fully incorporated. Pour the batter into your greased mug until it’s filled up about halfway. Place the mug in your microwave, uncovered. Be sure to position the mug or bowl right in the middle of the microwave so that the cake cooks evenly, then close the microwave door. Remember that the cake will rise as it cooks, so filling the mug or bowl halfway allows plenty of space for that. Microwave the cake on HIGH for 1 minute and 45 seconds. Keep an eye on the batter to make sure it doesn’t overflow, but as long as you filled the mug or bowl only halfway, it should be fine. If you used 2 mugs or bowls instead of 1 large mug or bowl, microwave the mixture on HIGH for 2 minutes. Let the cake cool for 10 minutes before serving it. Carefully take the mug out of the microwave and place it on a heat-safe surface. After about 10 minutes, top the cake with a scoop of vanilla ice cream and dig in with a spoon! You can also try adding icing, frosting, or extra crushed Oreos on top! Microwaved cake is best when served immediately. Since this kind of cake doesn’t preserve well, it’s best to enjoy it in one sitting! Cookies and Cream 1-Minute Mug Cake Mix all of the dry ingredients together in a large bowl. Measure out 5 ½ tablespoons (82.5 grams) of flour, 4 tablespoons (60 grams) of sugar, and 1/8 teaspoon (1/2 gram) of baking powder. Then, stir the ingredients together until they’re fully incorporated. This recipe makes 2 servings. If you only want to make a single mug cake, you can halve these ingredients. Stir the wet ingredients into the dry ingredients. Crack 1 egg into the mug. Then, add 3 tablespoons (44 ml) of milk, 3 tablespoons (44 ml) of vegetable oil, and 1 teaspoon (4.9 ml) of vanilla to the mug and stir the ingredients thoroughly until the batter looks smooth. If you're making 1 mug cake instead of 2, don't forget to halve these ingredients! Add 2 Oreos to the mug and mash them into the batter. Add the cookies to the batter and use a spoon or spatula to crush the cookies while simultaneously mixing them into the mixture. Feel free to use more than 2 Oreos if you want a richer dessert! Divide the batter between 2 microwave-safe mugs or bowls. Use a spatula to transfer the cake batter into 2 mugs or bowls. The cake will rise a bit as it cooks, so make sure you only fill the mugs or bowls up halfway with batter. Microwave the cake on HIGH for 1 minute. Place the mugs or bowls in your microwave, uncovered. Microwave the cake on HIGH for 1 minute, then use a toothpick to check the middle of the cake. If the toothpick comes out clean, the cake is done. If crumbs cling to the toothpick, microwave the cake on HIGH for about 20 more seconds. Try not to overcook the cake to avoid a rubbery texture. Let the cake cool for 5-10 minutes before serving it. Take the mugs out of the microwave and set them aside for several minutes so the cake can cool. Then, dig right in with a spoon, or you can top the cake with vanilla ice cream and extra crushed Oreos first! Enjoy the cake immediately for the best flavor and texture. Since microwaved cake doesn’t make good leftovers, eat what you can and toss the rest out.",
    "sentences": [
        " 5-Ingredient Oreo Microwave Cake Grease the inside of a large, microwave-safe mug or bowl.",
        "You can use vegetable oil or spray the interior with non-stick cooking spray to lightly grease the inside.",
        "If you don’t have an oversized mug or large bowl, grease 2 standard sized mugs or 2 small bowls.",
        "The cake will rise as it cooks in the microwave, so its important to choose a mug or bowl with plenty of extra space.",
        "Crush the Oreo cookies into ⁄4 inch (6.4 mm) pieces.",
        "Put the Oreos in a food processor or blender and pulse for a few seconds until the cookies are crushed.",
        "If you don’t have a food processor or blender, put the Oreos in a large Ziploc bag, seal it tightly, and use a rolling pin to crush the cookies.",
        "Combine the crushed Oreos, baking powder, and milk.",
        "Put the crushed Oreos in the medium-sized bowl first, then stir in ½ teaspoon (2 grams) of baking power.",
        "Once the dry ingredients are combined, add 1 cup (240 mL) of milk and stir the mixture until the ingredients are fully incorporated.",
        "Pour the batter into your greased mug until it’s filled up about halfway.",
        "Place the mug in your microwave, uncovered.",
        "Be sure to position the mug or bowl right in the middle of the microwave so that the cake cooks evenly, then close the microwave door.",
        "Remember that the cake will rise as it cooks, so filling the mug or bowl halfway allows plenty of space for that.",
        "Microwave the cake on HIGH for 1 minute and 45 seconds.",
        "Keep an eye on the batter to make sure it doesn’t overflow, but as long as you filled the mug or bowl only halfway, it should be fine.",
        "If you used 2 mugs or bowls instead of 1 large mug or bowl, microwave the mixture on HIGH for 2 minutes.",
        "Let the cake cool for 10 minutes before serving it.",
        "Carefully take the mug out of the microwave and place it on a heat-safe surface.",
        "After about 10 minutes, top the cake with a scoop of vanilla ice cream and dig in with a spoon!",
        "You can also try adding icing, frosting, or extra crushed Oreos on top!",
        "Microwaved cake is best when served immediately.",
        "Since this kind of cake doesn’t preserve well, it’s best to enjoy it in one sitting!",
        "Cookies and Cream 1-Minute Mug Cake Mix all of the dry ingredients together in a large bowl.",
        "Measure out 5 ½ tablespoons (82.5 grams) of flour, 4 tablespoons (60 grams) of sugar, and 1/8 teaspoon (1/2 gram) of baking powder.",
        "Then, stir the ingredients together until they’re fully incorporated.",
        "This recipe makes 2 servings.",
        "If you only want to make a single mug cake, you can halve these ingredients.",
        "Stir the wet ingredients into the dry ingredients.",
        "Crack 1 egg into the mug.",
        "Then, add 3 tablespoons (44 ml) of milk, 3 tablespoons (44 ml) of vegetable oil, and 1 teaspoon (4.9 ml) of vanilla to the mug and stir the ingredients thoroughly until the batter looks smooth.",
        "If you're making 1 mug cake instead of 2, don't forget to halve these ingredients!",
        "Add 2 Oreos to the mug and mash them into the batter.",
        "Add the cookies to the batter and use a spoon or spatula to crush the cookies while simultaneously mixing them into the mixture.",
        "Feel free to use more than 2 Oreos if you want a richer dessert!",
        "Divide the batter between 2 microwave-safe mugs or bowls.",
        "Use a spatula to transfer the cake batter into 2 mugs or bowls.",
        "The cake will rise a bit as it cooks, so make sure you only fill the mugs or bowls up halfway with batter.",
        "Microwave the cake on HIGH for 1 minute.",
        "Place the mugs or bowls in your microwave, uncovered.",
        "Microwave the cake on HIGH for 1 minute, then use a toothpick to check the middle of the cake.",
        "If the toothpick comes out clean, the cake is done.",
        "If crumbs cling to the toothpick, microwave the cake on HIGH for about 20 more seconds.",
        "Try not to overcook the cake to avoid a rubbery texture.",
        "Let the cake cool for 5-10 minutes before serving it.",
        "Take the mugs out of the microwave and set them aside for several minutes so the cake can cool.",
        "Then, dig right in with a spoon, or you can top the cake with vanilla ice cream and extra crushed Oreos first!",
        "Enjoy the cake immediately for the best flavor and texture.",
        "Since microwaved cake doesn’t make good leftovers, eat what you can and toss the rest out."
    ]
}