{
    "title": "How to Make Vegetarian Pho",
    "url": "https://www.wikihow.com/Make-Vegetarian-Pho",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "World Cuisines",
        "Asian Cuisine",
        "Vietnamese Dishes"
    ],
    "parts": [
        {
            "name": "Making the Broth",
            "steps": [
                {
                    "headline": "Char or broil the onion and ginger until lightly blackened.",
                    "description": "Grab 1-2 pieces of onion and ginger with tongs and hold them over an open flame until they’ve blackened slightly. Place the charred pieces on a plate and pick up a few more pieces with your tongs. Continue in this way until you’ve charred all of the onion and ginger. To broil, place the onion and ginger in a shallow pan and slide the pan under your broiler. Broil for 5 minutes, flip the pieces with tongs, and broil for another 5 minutes. The onion and ginger should be lightly blackened on both sides."
                },
                {
                    "headline": "Dry-roast the 4 spices in a large pot over medium-low heat.",
                    "description": "Add the cinnamon, star anise, cloves, and coriander to your pot and place the pot on the stove. Turn the burner on medium-low. Continue dry-roasting until the spices smell toasty and fragrant. Stir the spices constantly as they dry-roast to prevent burning. Choose a pot with a lid. Make sure it's large enough to easily contain 4 cups of broth."
                },
                {
                    "headline": "Add the stock, sauce, and vegetables to the pot.",
                    "description": "Pour in the vegetable stock first, so the spices will stop dry-roasting. Then add your tamari or soy sauce, carrots, and the charred onion and ginger to the pot. Stir gently."
                },
                {
                    "headline": "Bring the broth to a boil over medium heat.",
                    "description": "Turn up the heat to medium. Do not put a lid on the pot yet. Let the vegetable stock heat up until the liquid begins to boil. You don’t need to do any stirring at this time."
                },
                {
                    "headline": "Reduce the heat, cover, and simmer the broth for 30 minutes.",
                    "description": "Once the broth is boiling, turn the heat down to low. Place a lid on your pot. Let the broth simmer while you move on to preparing the noodles."
                },
                {
                    "headline": "Strain the veggies and spices out of the broth.",
                    "description": "After simmering for 30 minutes, use a handheld fine-mesh strainer to fish out the solids in the broth. Remove all vegetable pieces and large spices until you're left with only liquid broth. Alternatively, you can place a large bowl under a larger strainer and pour the broth through it. Transfer the broth back into the pot."
                },
                {
                    "headline": "Replace the lid and keep the broth hot until the pho is ready to serve.",
                    "description": "You can turn off the burner after replacing the lid on the pot – the broth should stay warm while you finish preparing the rest of the pho. If you’re worried the broth will cool down too much, you can always keep the pot over the lowest heat possible until you’re ready to serve the pho."
                }
            ]
        },
        {
            "name": "Softening the Noodles",
            "steps": [
                {
                    "headline": "Place all of the noodles in a large, heat-safe bowl.",
                    "description": "Remove the rice noodles from their packaging. Put the noodles in a bowl large enough to easily contain the noodles and enough water to completely cover them. Keep in mind the noodles will plump up a little after soaking in the water. Use a heat-safe bowl, since you’ll be adding hot water."
                },
                {
                    "headline": "Heat up water in a kettle or separate pot until it’s near-boiling.",
                    "description": "Add water to a kettle or pot and place the pot over medium heat. There are no exact measurements for the water, just make sure to use enough to fully cover the noodles once you pour the water in. It’s better to err on the side of caution and heat up too much water rather than too little!"
                },
                {
                    "headline": "Pour the hot water over the noodles in the bowl.",
                    "description": "Remove the water from heat before it begins to boil. Turn off the burner. Carefully pour the hot water into the bowl with the noodles. The noodles should be fully submerged in the water."
                },
                {
                    "headline": "Let the noodles soak in the hot water for 20 to 30 minutes.",
                    "description": "Stir the noodles every few minutes to ensure they separate in the bowl. Otherwise, they may stick together in clumps! Leave the bowl uncovered and let the noodles soak until they are tender but still a bit chewy."
                },
                {
                    "headline": "Strain the noodles.",
                    "description": "Place a large strainer in your sink, then pour the bowl of softened noodles into it. Let the noodles sit in the strainer and drain while you work on preparing the toppings."
                }
            ]
        },
        {
            "name": "Preparing Toppings and Garnishes",
            "steps": [
                {
                    "headline": "Slice your extra-firm tofu into 1-inch cubes.",
                    "description": "Remove the tofu from the packaging. You can use as much or as little as you like – 1 serving is usually considered ½ cup (4 oz). This recipe makes 2 servings of pho, so you could go with 1 cup of tofu. You can also cube more or less than that, if you like. Extra-firm tofu works best. You can also use bean curd skin or seitan instead of tofu, if preferred."
                },
                {
                    "headline": "Bake or fry your tofu cubes until they’re golden brown.",
                    "description": "You can bake the cubes at 377°F (191°C) for 15 minutes, flip them, and bake them for 15 more minutes. You can also fry the cubes, if you prefer. Heat up some vegetable oil in a wok, then fry the cubes in batches until they’re golden brown. Do not add any seasoning to the tofu while baking or frying it."
                },
                {
                    "headline": "Slice your fresh mushrooms.",
                    "description": "Brush any dirt off your mushrooms – if needed, you can lightly rinse them with water first. Cut the mushrooms into thin slivers. The amount of mushrooms and how thin you slice them is completely up to you! Porcini and shiitake mushrooms are the most traditional choices."
                },
                {
                    "headline": "Blanch or lightly steam your chosen vegetables.",
                    "description": "You don’t need to prepare a large variety of vegetables -- just choose 2 or 3. Traditional choices are baby carrots, broccoli florets, napa cabbage, and bok choy. Lightly steam or blanch your chosen veggies to your liking. There are no precise measurements here, so prepare the amount that you want. Some people like their pho chunky, and others like to keep veggies to a minimum so the broth’s flavor can take center stage."
                },
                {
                    "headline": "Choose 3 or 4 vegetable garnishes.",
                    "description": "Thinly sliced onion, chopped scallions, bean sprouts, and sliced chile peppers are all popular garnishes. You can prepare as much as you like – just make sure there’s enough for 2 people! Leave the chopped veggies on the cutting board or transfer them to a bowl  and set them aside. It’s better to prep more veggies than you need rather than end up with too few. You can always refrigerate the leftovers and use them in salads and sandwiches for the next few days."
                },
                {
                    "headline": "Rinse off a large handful of your chosen herbs.",
                    "description": "Fresh cilantro and Thai basil are the traditional choices for pho. Rinse off a large handful of 1 or both of the herbs. You can keep the leaves whole or chop them up if you prefer smaller pieces."
                },
                {
                    "headline": "Arrange the prepped veggies and herbs on a large plate.",
                    "description": "Keep the veggies and herbs separated so that guests can pick and choose what they want to use. Arrange all of the garnishes attractively on a large plate or serving dish."
                },
                {
                    "headline": "Choose a spicy sauce to go with your pho (optional).",
                    "description": "You don’t have to serve your pho with a spicy sauce, but it’s very popular. Hoisin sauce and Sriracha are the most traditional options. You can leave the sauce in the bottles for guests, or ladle the sauce into small bowls and include a small spoon for guests to use. Be sure to check the ingredients on the Hoisin sauce to make sure it’s vegetarian. Some brands aren’t."
                }
            ]
        },
        {
            "name": "Serving the Pho",
            "steps": [
                {
                    "headline": "Divide the noodles between 2 serving bowls.",
                    "description": "Grab the softened rice noodles that are still sitting in your strainer and divide them up evenly into 2 portions. Place the portions into 2 separate serving bowls. Go with bowls that are relatively deep so you can fill them with broth and toppings easily."
                },
                {
                    "headline": "Arrange the prepped toppings on top of the noodles.",
                    "description": "You can use as much as you want of whatever toppings you like best. It’s customary to thinly layer the toppings so that they completely cover the noodles, but it’s really up to you. The great thing about pho is that it’s completely customizable!"
                },
                {
                    "headline": "Ladle the warm broth into the 2 bowls.",
                    "description": "Remove the lid from the pot of broth. You can put as much broth in each bowl as you want. If you prefer your pho chunky, use less broth. If you want to savor the broth with fewer veggies in it, ladle the broth generously into the 2 bowls."
                },
                {
                    "headline": "Serve the pho with the garnish plate on the side.",
                    "description": "Add a spoon or a pair of chopsticks to each bowl and serve! Place the garnish plate on the table so guests can add whatever they like best to their soup. If you’re serving Hoisin sauce or Sriracha, make sure that is also within your guests’ reach. Store leftover broth in an airtight container in the fridge for up to 4 days."
                }
            ]
        }
    ],
    "tyn": [
        "Sharp knife",
        "Tongs",
        "Shallow baking pan",
        "Large pot with a lid",
        "Large spoon",
        "Strainer",
        "Large serving dish",
        "2 bowls",
        "2 spoons or 2 pairs of chopsticks"
    ],
    "text": " Making the Broth Char or broil the onion and ginger until lightly blackened. Grab 1-2 pieces of onion and ginger with tongs and hold them over an open flame until they’ve blackened slightly. Place the charred pieces on a plate and pick up a few more pieces with your tongs. Continue in this way until you’ve charred all of the onion and ginger. To broil, place the onion and ginger in a shallow pan and slide the pan under your broiler. Broil for 5 minutes, flip the pieces with tongs, and broil for another 5 minutes. The onion and ginger should be lightly blackened on both sides. Dry-roast the 4 spices in a large pot over medium-low heat. Add the cinnamon, star anise, cloves, and coriander to your pot and place the pot on the stove. Turn the burner on medium-low. Continue dry-roasting until the spices smell toasty and fragrant. Stir the spices constantly as they dry-roast to prevent burning. Choose a pot with a lid. Make sure it's large enough to easily contain 4 cups of broth. Add the stock, sauce, and vegetables to the pot. Pour in the vegetable stock first, so the spices will stop dry-roasting. Then add your tamari or soy sauce, carrots, and the charred onion and ginger to the pot. Stir gently. Bring the broth to a boil over medium heat. Turn up the heat to medium. Do not put a lid on the pot yet. Let the vegetable stock heat up until the liquid begins to boil. You don’t need to do any stirring at this time. Reduce the heat, cover, and simmer the broth for 30 minutes. Once the broth is boiling, turn the heat down to low. Place a lid on your pot. Let the broth simmer while you move on to preparing the noodles. Strain the veggies and spices out of the broth. After simmering for 30 minutes, use a handheld fine-mesh strainer to fish out the solids in the broth. Remove all vegetable pieces and large spices until you're left with only liquid broth. Alternatively, you can place a large bowl under a larger strainer and pour the broth through it. Transfer the broth back into the pot. Replace the lid and keep the broth hot until the pho is ready to serve. You can turn off the burner after replacing the lid on the pot – the broth should stay warm while you finish preparing the rest of the pho. If you’re worried the broth will cool down too much, you can always keep the pot over the lowest heat possible until you’re ready to serve the pho. Softening the Noodles Place all of the noodles in a large, heat-safe bowl. Remove the rice noodles from their packaging. Put the noodles in a bowl large enough to easily contain the noodles and enough water to completely cover them. Keep in mind the noodles will plump up a little after soaking in the water. Use a heat-safe bowl, since you’ll be adding hot water. Heat up water in a kettle or separate pot until it’s near-boiling. Add water to a kettle or pot and place the pot over medium heat. There are no exact measurements for the water, just make sure to use enough to fully cover the noodles once you pour the water in. It’s better to err on the side of caution and heat up too much water rather than too little! Pour the hot water over the noodles in the bowl. Remove the water from heat before it begins to boil. Turn off the burner. Carefully pour the hot water into the bowl with the noodles. The noodles should be fully submerged in the water. Let the noodles soak in the hot water for 20 to 30 minutes. Stir the noodles every few minutes to ensure they separate in the bowl. Otherwise, they may stick together in clumps! Leave the bowl uncovered and let the noodles soak until they are tender but still a bit chewy. Strain the noodles. Place a large strainer in your sink, then pour the bowl of softened noodles into it. Let the noodles sit in the strainer and drain while you work on preparing the toppings. Preparing Toppings and Garnishes Slice your extra-firm tofu into 1-inch cubes. Remove the tofu from the packaging. You can use as much or as little as you like – 1 serving is usually considered ½ cup (4 oz). This recipe makes 2 servings of pho, so you could go with 1 cup of tofu. You can also cube more or less than that, if you like. Extra-firm tofu works best. You can also use bean curd skin or seitan instead of tofu, if preferred. Bake or fry your tofu cubes until they’re golden brown. You can bake the cubes at 377°F (191°C) for 15 minutes, flip them, and bake them for 15 more minutes. You can also fry the cubes, if you prefer. Heat up some vegetable oil in a wok, then fry the cubes in batches until they’re golden brown. Do not add any seasoning to the tofu while baking or frying it. Slice your fresh mushrooms. Brush any dirt off your mushrooms – if needed, you can lightly rinse them with water first. Cut the mushrooms into thin slivers. The amount of mushrooms and how thin you slice them is completely up to you! Porcini and shiitake mushrooms are the most traditional choices. Blanch or lightly steam your chosen vegetables. You don’t need to prepare a large variety of vegetables -- just choose 2 or 3. Traditional choices are baby carrots, broccoli florets, napa cabbage, and bok choy. Lightly steam or blanch your chosen veggies to your liking. There are no precise measurements here, so prepare the amount that you want. Some people like their pho chunky, and others like to keep veggies to a minimum so the broth’s flavor can take center stage. Choose 3 or 4 vegetable garnishes. Thinly sliced onion, chopped scallions, bean sprouts, and sliced chile peppers are all popular garnishes. You can prepare as much as you like – just make sure there’s enough for 2 people! Leave the chopped veggies on the cutting board or transfer them to a bowl  and set them aside. It’s better to prep more veggies than you need rather than end up with too few. You can always refrigerate the leftovers and use them in salads and sandwiches for the next few days. Rinse off a large handful of your chosen herbs. Fresh cilantro and Thai basil are the traditional choices for pho. Rinse off a large handful of 1 or both of the herbs. You can keep the leaves whole or chop them up if you prefer smaller pieces. Arrange the prepped veggies and herbs on a large plate. Keep the veggies and herbs separated so that guests can pick and choose what they want to use. Arrange all of the garnishes attractively on a large plate or serving dish. Choose a spicy sauce to go with your pho (optional). You don’t have to serve your pho with a spicy sauce, but it’s very popular. Hoisin sauce and Sriracha are the most traditional options. You can leave the sauce in the bottles for guests, or ladle the sauce into small bowls and include a small spoon for guests to use. Be sure to check the ingredients on the Hoisin sauce to make sure it’s vegetarian. Some brands aren’t. Serving the Pho Divide the noodles between 2 serving bowls. Grab the softened rice noodles that are still sitting in your strainer and divide them up evenly into 2 portions. Place the portions into 2 separate serving bowls. Go with bowls that are relatively deep so you can fill them with broth and toppings easily. Arrange the prepped toppings on top of the noodles. You can use as much as you want of whatever toppings you like best. It’s customary to thinly layer the toppings so that they completely cover the noodles, but it’s really up to you. The great thing about pho is that it’s completely customizable! Ladle the warm broth into the 2 bowls. Remove the lid from the pot of broth. You can put as much broth in each bowl as you want. If you prefer your pho chunky, use less broth. If you want to savor the broth with fewer veggies in it, ladle the broth generously into the 2 bowls. Serve the pho with the garnish plate on the side. Add a spoon or a pair of chopsticks to each bowl and serve! Place the garnish plate on the table so guests can add whatever they like best to their soup. If you’re serving Hoisin sauce or Sriracha, make sure that is also within your guests’ reach. Store leftover broth in an airtight container in the fridge for up to 4 days.",
    "sentences": [
        " Making the Broth Char or broil the onion and ginger until lightly blackened.",
        "Grab 1-2 pieces of onion and ginger with tongs and hold them over an open flame until they’ve blackened slightly.",
        "Place the charred pieces on a plate and pick up a few more pieces with your tongs.",
        "Continue in this way until you’ve charred all of the onion and ginger.",
        "To broil, place the onion and ginger in a shallow pan and slide the pan under your broiler.",
        "Broil for 5 minutes, flip the pieces with tongs, and broil for another 5 minutes.",
        "The onion and ginger should be lightly blackened on both sides.",
        "Dry-roast the 4 spices in a large pot over medium-low heat.",
        "Add the cinnamon, star anise, cloves, and coriander to your pot and place the pot on the stove.",
        "Turn the burner on medium-low.",
        "Continue dry-roasting until the spices smell toasty and fragrant.",
        "Stir the spices constantly as they dry-roast to prevent burning.",
        "Choose a pot with a lid.",
        "Make sure it's large enough to easily contain 4 cups of broth.",
        "Add the stock, sauce, and vegetables to the pot.",
        "Pour in the vegetable stock first, so the spices will stop dry-roasting.",
        "Then add your tamari or soy sauce, carrots, and the charred onion and ginger to the pot.",
        "Stir gently.",
        "Bring the broth to a boil over medium heat.",
        "Turn up the heat to medium.",
        "Do not put a lid on the pot yet.",
        "Let the vegetable stock heat up until the liquid begins to boil.",
        "You don’t need to do any stirring at this time.",
        "Reduce the heat, cover, and simmer the broth for 30 minutes.",
        "Once the broth is boiling, turn the heat down to low.",
        "Place a lid on your pot.",
        "Let the broth simmer while you move on to preparing the noodles.",
        "Strain the veggies and spices out of the broth.",
        "After simmering for 30 minutes, use a handheld fine-mesh strainer to fish out the solids in the broth.",
        "Remove all vegetable pieces and large spices until you're left with only liquid broth.",
        "Alternatively, you can place a large bowl under a larger strainer and pour the broth through it.",
        "Transfer the broth back into the pot.",
        "Replace the lid and keep the broth hot until the pho is ready to serve.",
        "You can turn off the burner after replacing the lid on the pot – the broth should stay warm while you finish preparing the rest of the pho.",
        "If you’re worried the broth will cool down too much, you can always keep the pot over the lowest heat possible until you’re ready to serve the pho.",
        "Softening the Noodles Place all of the noodles in a large, heat-safe bowl.",
        "Remove the rice noodles from their packaging.",
        "Put the noodles in a bowl large enough to easily contain the noodles and enough water to completely cover them.",
        "Keep in mind the noodles will plump up a little after soaking in the water.",
        "Use a heat-safe bowl, since you’ll be adding hot water.",
        "Heat up water in a kettle or separate pot until it’s near-boiling.",
        "Add water to a kettle or pot and place the pot over medium heat.",
        "There are no exact measurements for the water, just make sure to use enough to fully cover the noodles once you pour the water in.",
        "It’s better to err on the side of caution and heat up too much water rather than too little!",
        "Pour the hot water over the noodles in the bowl.",
        "Remove the water from heat before it begins to boil.",
        "Turn off the burner.",
        "Carefully pour the hot water into the bowl with the noodles.",
        "The noodles should be fully submerged in the water.",
        "Let the noodles soak in the hot water for 20 to 30 minutes.",
        "Stir the noodles every few minutes to ensure they separate in the bowl.",
        "Otherwise, they may stick together in clumps!",
        "Leave the bowl uncovered and let the noodles soak until they are tender but still a bit chewy.",
        "Strain the noodles.",
        "Place a large strainer in your sink, then pour the bowl of softened noodles into it.",
        "Let the noodles sit in the strainer and drain while you work on preparing the toppings.",
        "Preparing Toppings and Garnishes Slice your extra-firm tofu into 1-inch cubes.",
        "Remove the tofu from the packaging.",
        "You can use as much or as little as you like – 1 serving is usually considered ½ cup (4 oz).",
        "This recipe makes 2 servings of pho, so you could go with 1 cup of tofu.",
        "You can also cube more or less than that, if you like.",
        "Extra-firm tofu works best.",
        "You can also use bean curd skin or seitan instead of tofu, if preferred.",
        "Bake or fry your tofu cubes until they’re golden brown.",
        "You can bake the cubes at 377°F (191°C) for 15 minutes, flip them, and bake them for 15 more minutes.",
        "You can also fry the cubes, if you prefer.",
        "Heat up some vegetable oil in a wok, then fry the cubes in batches until they’re golden brown.",
        "Do not add any seasoning to the tofu while baking or frying it.",
        "Slice your fresh mushrooms.",
        "Brush any dirt off your mushrooms – if needed, you can lightly rinse them with water first.",
        "Cut the mushrooms into thin slivers.",
        "The amount of mushrooms and how thin you slice them is completely up to you!",
        "Porcini and shiitake mushrooms are the most traditional choices.",
        "Blanch or lightly steam your chosen vegetables.",
        "You don’t need to prepare a large variety of vegetables -- just choose 2 or 3.",
        "Traditional choices are baby carrots, broccoli florets, napa cabbage, and bok choy.",
        "Lightly steam or blanch your chosen veggies to your liking.",
        "There are no precise measurements here, so prepare the amount that you want.",
        "Some people like their pho chunky, and others like to keep veggies to a minimum so the broth’s flavor can take center stage.",
        "Choose 3 or 4 vegetable garnishes.",
        "Thinly sliced onion, chopped scallions, bean sprouts, and sliced chile peppers are all popular garnishes.",
        "You can prepare as much as you like – just make sure there’s enough for 2 people!",
        "Leave the chopped veggies on the cutting board or transfer them to a bowl  and set them aside.",
        "It’s better to prep more veggies than you need rather than end up with too few.",
        "You can always refrigerate the leftovers and use them in salads and sandwiches for the next few days.",
        "Rinse off a large handful of your chosen herbs.",
        "Fresh cilantro and Thai basil are the traditional choices for pho.",
        "Rinse off a large handful of 1 or both of the herbs.",
        "You can keep the leaves whole or chop them up if you prefer smaller pieces.",
        "Arrange the prepped veggies and herbs on a large plate.",
        "Keep the veggies and herbs separated so that guests can pick and choose what they want to use.",
        "Arrange all of the garnishes attractively on a large plate or serving dish.",
        "Choose a spicy sauce to go with your pho (optional).",
        "You don’t have to serve your pho with a spicy sauce, but it’s very popular.",
        "Hoisin sauce and Sriracha are the most traditional options.",
        "You can leave the sauce in the bottles for guests, or ladle the sauce into small bowls and include a small spoon for guests to use.",
        "Be sure to check the ingredients on the Hoisin sauce to make sure it’s vegetarian.",
        "Some brands aren’t.",
        "Serving the Pho Divide the noodles between 2 serving bowls.",
        "Grab the softened rice noodles that are still sitting in your strainer and divide them up evenly into 2 portions.",
        "Place the portions into 2 separate serving bowls.",
        "Go with bowls that are relatively deep so you can fill them with broth and toppings easily.",
        "Arrange the prepped toppings on top of the noodles.",
        "You can use as much as you want of whatever toppings you like best.",
        "It’s customary to thinly layer the toppings so that they completely cover the noodles, but it’s really up to you.",
        "The great thing about pho is that it’s completely customizable!",
        "Ladle the warm broth into the 2 bowls.",
        "Remove the lid from the pot of broth.",
        "You can put as much broth in each bowl as you want.",
        "If you prefer your pho chunky, use less broth.",
        "If you want to savor the broth with fewer veggies in it, ladle the broth generously into the 2 bowls.",
        "Serve the pho with the garnish plate on the side.",
        "Add a spoon or a pair of chopsticks to each bowl and serve!",
        "Place the garnish plate on the table so guests can add whatever they like best to their soup.",
        "If you’re serving Hoisin sauce or Sriracha, make sure that is also within your guests’ reach.",
        "Store leftover broth in an airtight container in the fridge for up to 4 days."
    ]
}