{
    "title": "How to Colorwash Your Walls",
    "url": "https://www.wikihow.com/Colorwash-Your-Walls",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "steps": [
        {
            "headline": "Know how to paint a wall.",
            "description": ""
        },
        {
            "headline": "Assemble the paint, etc.",
            "description": "See \"Things You'll Need\" below."
        },
        {
            "headline": "Paint the wall completely with the base coat paint.",
            "description": "Paint and leave to dry according to the manufacturer's instructions."
        },
        {
            "headline": "In a separate container, dilute one part vinyl matt emulsion with four parts water.",
            "description": ""
        },
        {
            "headline": "Paint the wash or apply it using either the decorating brush or the cloth.",
            "description": "Use random, generous, large strokes."
        },
        {
            "headline": "Keep your work to one area and work quickly.",
            "description": "Emulsion paint dries very quickly. The aim should be to work a square meter area at a time only."
        },
        {
            "headline": "Staying within the same meter area, go back over the work straight away to brush lightly over the surface.",
            "description": "The aim is to blur the brush marks."
        },
        {
            "headline": "Continue to the next area.",
            "description": "Repeat until the whole wall has been completed. Leave to dry and start enjoying your newly colored room."
        }
    ],
    "tyn": [
        "White vinyl matt emulsion base coat paint",
        "Vinyl matt emulsion top coat, color of choice",
        "Separate container for diluting",
        "Water",
        "Decorating brush or a clean, lint-free cloth"
    ],
    "text": " Know how to paint a wall.  Assemble the paint, etc. See \"Things You'll Need\" below. Paint the wall completely with the base coat paint. Paint and leave to dry according to the manufacturer's instructions. In a separate container, dilute one part vinyl matt emulsion with four parts water.  Paint the wash or apply it using either the decorating brush or the cloth. Use random, generous, large strokes. Keep your work to one area and work quickly. Emulsion paint dries very quickly. The aim should be to work a square meter area at a time only. Staying within the same meter area, go back over the work straight away to brush lightly over the surface. The aim is to blur the brush marks. Continue to the next area. Repeat until the whole wall has been completed. Leave to dry and start enjoying your newly colored room.",
    "sentences": [
        " Know how to paint a wall.",
        "Assemble the paint, etc.",
        "See \"Things You'll Need\" below.",
        "Paint the wall completely with the base coat paint.",
        "Paint and leave to dry according to the manufacturer's instructions.",
        "In a separate container, dilute one part vinyl matt emulsion with four parts water.",
        "Paint the wash or apply it using either the decorating brush or the cloth.",
        "Use random, generous, large strokes.",
        "Keep your work to one area and work quickly.",
        "Emulsion paint dries very quickly.",
        "The aim should be to work a square meter area at a time only.",
        "Staying within the same meter area, go back over the work straight away to brush lightly over the surface.",
        "The aim is to blur the brush marks.",
        "Continue to the next area.",
        "Repeat until the whole wall has been completed.",
        "Leave to dry and start enjoying your newly colored room."
    ]
}