{
    "title": "How to Receive Power from God (Christianity)",
    "url": "https://www.wikihow.com/Receive-Power-from-God-(Christianity)",
    "category_hierarchy": [
        "Philosophy and Religion",
        "Religion",
        "Christianity"
    ],
    "steps": [
        {
            "headline": "Find the promises given by Jesus about receiving power from God.",
            "description": "They are in Luke 24:49 \"And, behold, I send the promise of my Father upon you: but tarry ye in the city of Jerusalem, until ye be endued with power  from on high\", and Acts 1:8  \"But ye shall receive power, after that the Holy Ghost is come upon you: and ye shall be witnesses unto me both in Jerusalem, and in all Judea, and in Samaria, and unto the uttermost part of the earth.\""
        },
        {
            "headline": "Notice that the verse in Luke associates power with \"the promise of my (Jesus) Father\" and the one in Acts associates the power with  receiving the Holy Spirit.",
            "description": ""
        },
        {
            "headline": "Notice that in Acts 1:4-5 Jesus identified the promise of the Father as the baptism of the Holy Spirit, so that we can now see that the \"power\" comes from the same source: the baptism (or receiving) of the Holy Spirit.",
            "description": "In Acts 2:4 The disciples received power when they received the Holy Spirit; they also spoke in tongues. In Acts 2:38 Peter tells us how to receive power by telling us how to receive the Holy Spirit."
        },
        {
            "headline": "Seek more information on how to receive this power, the Holy Spirit, go to How to Receive the Holy Spirit as per The Bible.",
            "description": "Then when you have received the power from God you can start using it to glorify God and win people to Him"
        },
        {
            "headline": "Understand that when you receive the Holy Spirit you've entered into something so big it's beyond comprehension..  And I pray that you and all God’s holy people will have the power to understand the greatness of Christ’s love—how wide, how long, how high, and how deep that love is.",
            "description": "Christ’s love is greater than anyone can ever know, but I pray that you will be able to know that love. Then you can be filled with everything God has for you. With God’s power working in us, he can do much, much more than anything we can ask or think of. Ephesians 3:18-20"
        },
        {
            "headline": "Use the power to heal the sick.",
            "description": "John 14:12 Verily, verily, I say unto you, He that believeth on me, the works that I do shall he do also; and greater works than these shall he do; because I go unto my Father. Ephesians 3:20 Now unto him that is able to do exceeding abundantly above all that we ask or think, according to the power that worketh in us"
        },
        {
            "headline": "Use the power to preach God's word.",
            "description": "Acts 1:8 But ye shall receive power, after that the Holy Ghost is come upon you: and ye shall be witnesses unto me both in Jerusalem, and in all Judaea, and in Samaria, and unto the uttermost part of the earth. Corinthians 2:4 And my speech and my preaching was not with enticing words of man’s wisdom, but in demonstration of the Spirit and of power:"
        },
        {
            "headline": "Use the power to rejoice in the Spirit.",
            "description": "Romans 15:13 Now the God of hope fill you with all joy and peace in believing, that ye may abound in hope, through the power of the Holy Ghost. Timothy 1:7 For God hath not given us the spirit of fear; but of power, and of love, and of a sound mind."
        },
        {
            "headline": "Use the power to give witness to Jesus and attract people to God.",
            "description": "John 2:23 Now when he was in Jerusalem at the passover, in the feast day, many believed in his name, when they saw the miracles which he did. Acts 8:6 And the people with one accord gave heed unto those things which Philip spake, hearing and seeing the miracles which he did. Thessalonians 1:5 For our gospel came not unto you in word only, but also in power, and in the Holy Ghost, and in much assurance; as ye know what manner of men we were among you for your sake."
        },
        {
            "headline": "Use the power to give witness of salvation.",
            "description": "Romans 1:16 For I am not ashamed of the gospel of Christ: for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek. Corinthians 1:18 For the preaching of the cross is to them that perish foolishness; but unto us which are saved it is the power of God."
        },
        {
            "headline": "Understand also that this power comes with some conditions.",
            "description": "This power is not power or authority over other people. (see Matthew 20:25-28)\nThe power is always to promote and glorify Jesus name, never for personal glory. (John 7:18, 2 Corinthians 10:17-18)\nNeither does it make the person more important than other people Jesus said \"he who humbles Himself shall be exalted\". (Luke 14:11)\nReceiving power is not an excuse to do wrong rather it gives us strength to do right \"I can do all things through Christ who strengthens (empowers) me\". (Philippians 4:13)(see also Philippians 4:8)"
        }
    ],
    "tyn": [
        "A willing attitude",
        "The Holy Bible (to check the reference given for yourself)",
        "Trust in God"
    ],
    "text": " Find the promises given by Jesus about receiving power from God. They are in Luke 24:49 \"And, behold, I send the promise of my Father upon you: but tarry ye in the city of Jerusalem, until ye be endued with power  from on high\", and Acts 1:8  \"But ye shall receive power, after that the Holy Ghost is come upon you: and ye shall be witnesses unto me both in Jerusalem, and in all Judea, and in Samaria, and unto the uttermost part of the earth.\" Notice that the verse in Luke associates power with \"the promise of my (Jesus) Father\" and the one in Acts associates the power with  receiving the Holy Spirit.  Notice that in Acts 1:4-5 Jesus identified the promise of the Father as the baptism of the Holy Spirit, so that we can now see that the \"power\" comes from the same source: the baptism (or receiving) of the Holy Spirit. In Acts 2:4 The disciples received power when they received the Holy Spirit; they also spoke in tongues. In Acts 2:38 Peter tells us how to receive power by telling us how to receive the Holy Spirit. Seek more information on how to receive this power, the Holy Spirit, go to How to Receive the Holy Spirit as per The Bible. Then when you have received the power from God you can start using it to glorify God and win people to Him Understand that when you receive the Holy Spirit you've entered into something so big it's beyond comprehension..  And I pray that you and all God’s holy people will have the power to understand the greatness of Christ’s love—how wide, how long, how high, and how deep that love is. Christ’s love is greater than anyone can ever know, but I pray that you will be able to know that love. Then you can be filled with everything God has for you. With God’s power working in us, he can do much, much more than anything we can ask or think of. Ephesians 3:18-20 Use the power to heal the sick. John 14:12 Verily, verily, I say unto you, He that believeth on me, the works that I do shall he do also; and greater works than these shall he do; because I go unto my Father. Ephesians 3:20 Now unto him that is able to do exceeding abundantly above all that we ask or think, according to the power that worketh in us Use the power to preach God's word. Acts 1:8 But ye shall receive power, after that the Holy Ghost is come upon you: and ye shall be witnesses unto me both in Jerusalem, and in all Judaea, and in Samaria, and unto the uttermost part of the earth. Corinthians 2:4 And my speech and my preaching was not with enticing words of man’s wisdom, but in demonstration of the Spirit and of power: Use the power to rejoice in the Spirit. Romans 15:13 Now the God of hope fill you with all joy and peace in believing, that ye may abound in hope, through the power of the Holy Ghost. Timothy 1:7 For God hath not given us the spirit of fear; but of power, and of love, and of a sound mind. Use the power to give witness to Jesus and attract people to God. John 2:23 Now when he was in Jerusalem at the passover, in the feast day, many believed in his name, when they saw the miracles which he did. Acts 8:6 And the people with one accord gave heed unto those things which Philip spake, hearing and seeing the miracles which he did. Thessalonians 1:5 For our gospel came not unto you in word only, but also in power, and in the Holy Ghost, and in much assurance; as ye know what manner of men we were among you for your sake. Use the power to give witness of salvation. Romans 1:16 For I am not ashamed of the gospel of Christ: for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek. Corinthians 1:18 For the preaching of the cross is to them that perish foolishness; but unto us which are saved it is the power of God. Understand also that this power comes with some conditions. This power is not power or authority over other people. (see Matthew 20:25-28)\nThe power is always to promote and glorify Jesus name, never for personal glory. (John 7:18, 2 Corinthians 10:17-18)\nNeither does it make the person more important than other people Jesus said \"he who humbles Himself shall be exalted\". (Luke 14:11)\nReceiving power is not an excuse to do wrong rather it gives us strength to do right \"I can do all things through Christ who strengthens (empowers) me\". (Philippians 4:13)(see also Philippians 4:8)",
    "sentences": [
        " Find the promises given by Jesus about receiving power from God.",
        "They are in Luke 24:49 \"And, behold, I send the promise of my Father upon you: but tarry ye in the city of Jerusalem, until ye be endued with power  from on high\", and Acts 1:8  \"But ye shall receive power, after that the Holy Ghost is come upon you: and ye shall be witnesses unto me both in Jerusalem, and in all Judea, and in Samaria, and unto the uttermost part of the earth.\"",
        "Notice that the verse in Luke associates power with \"the promise of my (Jesus) Father\" and the one in Acts associates the power with  receiving the Holy Spirit.",
        "Notice that in Acts 1:4-5 Jesus identified the promise of the Father as the baptism of the Holy Spirit, so that we can now see that the \"power\" comes from the same source: the baptism (or receiving) of the Holy Spirit.",
        "In Acts 2:4 The disciples received power when they received the Holy Spirit; they also spoke in tongues.",
        "In Acts 2:38 Peter tells us how to receive power by telling us how to receive the Holy Spirit.",
        "Seek more information on how to receive this power, the Holy Spirit, go to How to Receive the Holy Spirit as per The Bible.",
        "Then when you have received the power from God you can start using it to glorify God and win people to Him Understand that when you receive the Holy Spirit you've entered into something so big it's beyond comprehension..  And I pray that you and all God’s holy people will have the power to understand the greatness of Christ’s love—how wide, how long, how high, and how deep that love is.",
        "Christ’s love is greater than anyone can ever know, but I pray that you will be able to know that love.",
        "Then you can be filled with everything God has for you.",
        "With God’s power working in us, he can do much, much more than anything we can ask or think of.",
        "Ephesians 3:18-20 Use the power to heal the sick.",
        "John 14:12 Verily, verily, I say unto you, He that believeth on me, the works that I do shall he do also; and greater works than these shall he do; because I go unto my Father.",
        "Ephesians 3:20 Now unto him that is able to do exceeding abundantly above all that we ask or think, according to the power that worketh in us Use the power to preach God's word.",
        "Acts 1:8 But ye shall receive power, after that the Holy Ghost is come upon you: and ye shall be witnesses unto me both in Jerusalem, and in all Judaea, and in Samaria, and unto the uttermost part of the earth.",
        "Corinthians 2:4 And my speech and my preaching was not with enticing words of man’s wisdom, but in demonstration of the Spirit and of power: Use the power to rejoice in the Spirit.",
        "Romans 15:13 Now the God of hope fill you with all joy and peace in believing, that ye may abound in hope, through the power of the Holy Ghost.",
        "Timothy 1:7 For God hath not given us the spirit of fear; but of power, and of love, and of a sound mind.",
        "Use the power to give witness to Jesus and attract people to God.",
        "John 2:23 Now when he was in Jerusalem at the passover, in the feast day, many believed in his name, when they saw the miracles which he did.",
        "Acts 8:6 And the people with one accord gave heed unto those things which Philip spake, hearing and seeing the miracles which he did.",
        "Thessalonians 1:5 For our gospel came not unto you in word only, but also in power, and in the Holy Ghost, and in much assurance; as ye know what manner of men we were among you for your sake.",
        "Use the power to give witness of salvation.",
        "Romans 1:16 For I am not ashamed of the gospel of Christ: for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek.",
        "Corinthians 1:18 For the preaching of the cross is to them that perish foolishness; but unto us which are saved it is the power of God.",
        "Understand also that this power comes with some conditions.",
        "This power is not power or authority over other people.",
        "(see Matthew 20:25-28)\nThe power is always to promote and glorify Jesus name, never for personal glory.",
        "(John 7:18, 2 Corinthians 10:17-18)\nNeither does it make the person more important than other people Jesus said \"he who humbles Himself shall be exalted\".",
        "(Luke 14:11)\nReceiving power is not an excuse to do wrong rather it gives us strength to do right \"I can do all things through Christ who strengthens (empowers) me\".",
        "(Philippians 4:13)(see also Philippians 4:8)"
    ]
}