{
    "title": "How to Create a Dish Garden",
    "url": "https://www.wikihow.com/Create-a-Dish-Garden",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening"
    ],
    "parts": [
        {
            "name": "Setting Up the Dish",
            "steps": [
                {
                    "headline": "Choose a shallow dish that is about 3–4 in (7.6–10.2 cm) deep.",
                    "description": "It needs to have room for a layer of gravel and about 2–3 in (5.1–7.6 cm) of soil. It’s up to you how wide you want the dish, depending on how many plants you want to put in it.Tip: Your container doesn’t have to be ceramic. Try using metal, glass, or plastic lined wood or baskets. Antique items also make unique and interesting dish gardens. It helps drainage if the dish has a hole in the bottom, but not totally necessary since you will be putting a layer of gravel in the bottom. You can use any kind of dish that you want to create your miniature garden. It can be meant for plants, or it can be an old ceramic kitchen dish of some kind. It’s up to you to get creative!"
                },
                {
                    "headline": "Cover the bottom of the dish with a thin layer of gravel.",
                    "description": "Position a pottery shard or pebble directly over the drainage hole, if there is one, to prevent soil from falling out through the bottom of the dish. Put down just enough gravel to cover the bottom so you can’t see it. Pebbles, charcoal, or broken pottery shards are other options you can use to create a drainage layer."
                },
                {
                    "headline": "Fill the dish almost to the top with planting soil.",
                    "description": "Use an appropriate soil mix for the type of plants you want to grow. Fill up the dish to about ⁄4 in (0.64 cm) from the top of the rim to leave enough room for the plants and finishing touches. For example, if you want to create a succulent dish garden, then use cactus soil mix. If you want to grow other types of indoor plants, then use a standard peat-based potting mix. If you aren’t sure what the best soil to use is, then ask the employees at a gardening center to help you choose."
                }
            ]
        },
        {
            "name": "Choosing the Plants",
            "steps": [
                {
                    "headline": "Choose plants that you can grow indoors and have similar requirements.",
                    "description": "Opt for different indoor plants that have similar lighting and watering needs. This will make your garden easy to care for.Tip: Garden centers usually keep similar plants near each other, and even list the growing requirements on the pots or tags. If you aren’t sure, you can always consult with the garden center employees to help you pick. For example, plant cacti with other succulents or put plants that like the shade together."
                },
                {
                    "headline": "Select plants that come in pots no deeper than the dish you are using.",
                    "description": "Plants that come in pots that are deeper probably won’t fit into the dish. The plants will ideally come in pots that are slightly shallower than the dish you are using to ensure that the whole root systems fit into your dish. It’s also a good idea to choose plants that grow on the slow side. If you choose fast growing plants, you will have to transplant them more frequently and your dish garden won’t last as long. Most garden centers have a large variety of cheap starter plants that come in small pots that are about 2 ⁄2 in (6.4 cm) deep."
                },
                {
                    "headline": "Purchase a few extra plants to use in case you change your mind.",
                    "description": "You might decide that some of the plants don’t go well together in your dish garden once you start planting. Buy a couple extras to give yourself options to play with while you are putting your garden together. You can always plant the leftover plants on their own or use them to create another dish garden later on."
                }
            ]
        },
        {
            "name": "Planting the Garden",
            "steps": [
                {
                    "headline": "Remove the plants from the pots that you purchased them in.",
                    "description": "Use a knife or other thin, sharp object to loosen the soil around the edges if necessary. Turn the pots upside down carefully over your hand and gently slide out each plant. Water the plants before you remove them from their pots to make them easier to remove and help keep their root structure intact. Wear gloves if you are handling any prickly plants, such as cacti."
                },
                {
                    "headline": "Put the plants on top of the soil and arrange them until you like the look.",
                    "description": "Start with the tallest plants and put them towards the middle of the dish. Put shorter plants closer to the edges so that the dish garden can be viewed from all sides.Tip: Play with a few different arrangements to find the one you like best. This is where it comes in handy to have a few alternate plants that you can swap in and out to find your favorite combination. If you want your dish garden to only be viewed from one side, then you can put the taller plants at one side to create a backdrop, and place the shorter plants in front of them towards the other side. Try looking at your arrangement from different angles and distances to get different perspectives."
                },
                {
                    "headline": "Dig small holes in the soil to fit the root system of each plant.",
                    "description": "Scoop out just enough soil under each plant to accommodate the root systems. Place the plants in the holes so they are more or less even with the top of the soil in the dish. Normally, you would want to loosen the root system at this point when repotting plants to encourage growth. However, you don’t want the plants in your dish garden to grow too fast and outgrow the garden, so it’s best to leave the roots alone. You can angle plants slightly out around the edges if you don’t want them all to grow straight up."
                },
                {
                    "headline": "Pack the soil tightly around each plant when they are all in position.",
                    "description": "Add extra soil to fill in the dish around the plants if needed. Use your fingers to carefully tap down the soil around the plants to set the roots in place. Your dish garden will now have an even layer of soil and all the plants will be set firmly in place. It’s time for the finishing touches to add some character to your dish garden!"
                },
                {
                    "headline": "Put a layer of mulch, pebbles, or other finishing touches on top of the soil.",
                    "description": "Other options include moss, bark, or glass chips. Add accent pieces such as miniature sculptures to create a truly unique garden. This step is not necessary, but will make your dish garden that much more interesting! For example, you could try combining moss with some miniature garden gnome figurines to create a miniature magical landscape."
                },
                {
                    "headline": "Water the garden enough to dampen it without flooding it.",
                    "description": "Start with about 1 cup (236.58 mL) and slowly pour it in. Water just enough to get all the soil wet, without creating a pool on top or displacing any of the finishing touch features you added. After the initial watering, let the soil partially dry out between each watering. In general, you don’t want the soil to get totally dry (unless you planted succulents) or completely soggy."
                }
            ]
        }
    ],
    "tyn": [
        "Dish about 3–4 in (7.6–10.2 cm) deep",
        "Gravel or other drainage material",
        "Potting soil mix",
        "Small starter plants",
        "Pebbles or other top layer (optional)",
        "Small ornaments (optional)",
        "Water"
    ],
    "text": " Setting Up the Dish Choose a shallow dish that is about 3–4 in (7.6–10.2 cm) deep. It needs to have room for a layer of gravel and about 2–3 in (5.1–7.6 cm) of soil. It’s up to you how wide you want the dish, depending on how many plants you want to put in it.Tip: Your container doesn’t have to be ceramic. Try using metal, glass, or plastic lined wood or baskets. Antique items also make unique and interesting dish gardens. It helps drainage if the dish has a hole in the bottom, but not totally necessary since you will be putting a layer of gravel in the bottom. You can use any kind of dish that you want to create your miniature garden. It can be meant for plants, or it can be an old ceramic kitchen dish of some kind. It’s up to you to get creative! Cover the bottom of the dish with a thin layer of gravel. Position a pottery shard or pebble directly over the drainage hole, if there is one, to prevent soil from falling out through the bottom of the dish. Put down just enough gravel to cover the bottom so you can’t see it. Pebbles, charcoal, or broken pottery shards are other options you can use to create a drainage layer. Fill the dish almost to the top with planting soil. Use an appropriate soil mix for the type of plants you want to grow. Fill up the dish to about ⁄4 in (0.64 cm) from the top of the rim to leave enough room for the plants and finishing touches. For example, if you want to create a succulent dish garden, then use cactus soil mix. If you want to grow other types of indoor plants, then use a standard peat-based potting mix. If you aren’t sure what the best soil to use is, then ask the employees at a gardening center to help you choose. Choosing the Plants Choose plants that you can grow indoors and have similar requirements. Opt for different indoor plants that have similar lighting and watering needs. This will make your garden easy to care for.Tip: Garden centers usually keep similar plants near each other, and even list the growing requirements on the pots or tags. If you aren’t sure, you can always consult with the garden center employees to help you pick. For example, plant cacti with other succulents or put plants that like the shade together. Select plants that come in pots no deeper than the dish you are using. Plants that come in pots that are deeper probably won’t fit into the dish. The plants will ideally come in pots that are slightly shallower than the dish you are using to ensure that the whole root systems fit into your dish. It’s also a good idea to choose plants that grow on the slow side. If you choose fast growing plants, you will have to transplant them more frequently and your dish garden won’t last as long. Most garden centers have a large variety of cheap starter plants that come in small pots that are about 2 ⁄2 in (6.4 cm) deep. Purchase a few extra plants to use in case you change your mind. You might decide that some of the plants don’t go well together in your dish garden once you start planting. Buy a couple extras to give yourself options to play with while you are putting your garden together. You can always plant the leftover plants on their own or use them to create another dish garden later on. Planting the Garden Remove the plants from the pots that you purchased them in. Use a knife or other thin, sharp object to loosen the soil around the edges if necessary. Turn the pots upside down carefully over your hand and gently slide out each plant. Water the plants before you remove them from their pots to make them easier to remove and help keep their root structure intact. Wear gloves if you are handling any prickly plants, such as cacti. Put the plants on top of the soil and arrange them until you like the look. Start with the tallest plants and put them towards the middle of the dish. Put shorter plants closer to the edges so that the dish garden can be viewed from all sides.Tip: Play with a few different arrangements to find the one you like best. This is where it comes in handy to have a few alternate plants that you can swap in and out to find your favorite combination. If you want your dish garden to only be viewed from one side, then you can put the taller plants at one side to create a backdrop, and place the shorter plants in front of them towards the other side. Try looking at your arrangement from different angles and distances to get different perspectives. Dig small holes in the soil to fit the root system of each plant. Scoop out just enough soil under each plant to accommodate the root systems. Place the plants in the holes so they are more or less even with the top of the soil in the dish. Normally, you would want to loosen the root system at this point when repotting plants to encourage growth. However, you don’t want the plants in your dish garden to grow too fast and outgrow the garden, so it’s best to leave the roots alone. You can angle plants slightly out around the edges if you don’t want them all to grow straight up. Pack the soil tightly around each plant when they are all in position. Add extra soil to fill in the dish around the plants if needed. Use your fingers to carefully tap down the soil around the plants to set the roots in place. Your dish garden will now have an even layer of soil and all the plants will be set firmly in place. It’s time for the finishing touches to add some character to your dish garden! Put a layer of mulch, pebbles, or other finishing touches on top of the soil. Other options include moss, bark, or glass chips. Add accent pieces such as miniature sculptures to create a truly unique garden. This step is not necessary, but will make your dish garden that much more interesting! For example, you could try combining moss with some miniature garden gnome figurines to create a miniature magical landscape. Water the garden enough to dampen it without flooding it. Start with about 1 cup (236.58 mL) and slowly pour it in. Water just enough to get all the soil wet, without creating a pool on top or displacing any of the finishing touch features you added. After the initial watering, let the soil partially dry out between each watering. In general, you don’t want the soil to get totally dry (unless you planted succulents) or completely soggy.",
    "sentences": [
        " Setting Up the Dish Choose a shallow dish that is about 3–4 in (7.6–10.2 cm) deep.",
        "It needs to have room for a layer of gravel and about 2–3 in (5.1–7.6 cm) of soil.",
        "It’s up to you how wide you want the dish, depending on how many plants you want to put in it.Tip: Your container doesn’t have to be ceramic.",
        "Try using metal, glass, or plastic lined wood or baskets.",
        "Antique items also make unique and interesting dish gardens.",
        "It helps drainage if the dish has a hole in the bottom, but not totally necessary since you will be putting a layer of gravel in the bottom.",
        "You can use any kind of dish that you want to create your miniature garden.",
        "It can be meant for plants, or it can be an old ceramic kitchen dish of some kind.",
        "It’s up to you to get creative!",
        "Cover the bottom of the dish with a thin layer of gravel.",
        "Position a pottery shard or pebble directly over the drainage hole, if there is one, to prevent soil from falling out through the bottom of the dish.",
        "Put down just enough gravel to cover the bottom so you can’t see it.",
        "Pebbles, charcoal, or broken pottery shards are other options you can use to create a drainage layer.",
        "Fill the dish almost to the top with planting soil.",
        "Use an appropriate soil mix for the type of plants you want to grow.",
        "Fill up the dish to about ⁄4 in (0.64 cm) from the top of the rim to leave enough room for the plants and finishing touches.",
        "For example, if you want to create a succulent dish garden, then use cactus soil mix.",
        "If you want to grow other types of indoor plants, then use a standard peat-based potting mix.",
        "If you aren’t sure what the best soil to use is, then ask the employees at a gardening center to help you choose.",
        "Choosing the Plants Choose plants that you can grow indoors and have similar requirements.",
        "Opt for different indoor plants that have similar lighting and watering needs.",
        "This will make your garden easy to care for.Tip: Garden centers usually keep similar plants near each other, and even list the growing requirements on the pots or tags.",
        "If you aren’t sure, you can always consult with the garden center employees to help you pick.",
        "For example, plant cacti with other succulents or put plants that like the shade together.",
        "Select plants that come in pots no deeper than the dish you are using.",
        "Plants that come in pots that are deeper probably won’t fit into the dish.",
        "The plants will ideally come in pots that are slightly shallower than the dish you are using to ensure that the whole root systems fit into your dish.",
        "It’s also a good idea to choose plants that grow on the slow side.",
        "If you choose fast growing plants, you will have to transplant them more frequently and your dish garden won’t last as long.",
        "Most garden centers have a large variety of cheap starter plants that come in small pots that are about 2 ⁄2 in (6.4 cm) deep.",
        "Purchase a few extra plants to use in case you change your mind.",
        "You might decide that some of the plants don’t go well together in your dish garden once you start planting.",
        "Buy a couple extras to give yourself options to play with while you are putting your garden together.",
        "You can always plant the leftover plants on their own or use them to create another dish garden later on.",
        "Planting the Garden Remove the plants from the pots that you purchased them in.",
        "Use a knife or other thin, sharp object to loosen the soil around the edges if necessary.",
        "Turn the pots upside down carefully over your hand and gently slide out each plant.",
        "Water the plants before you remove them from their pots to make them easier to remove and help keep their root structure intact.",
        "Wear gloves if you are handling any prickly plants, such as cacti.",
        "Put the plants on top of the soil and arrange them until you like the look.",
        "Start with the tallest plants and put them towards the middle of the dish.",
        "Put shorter plants closer to the edges so that the dish garden can be viewed from all sides.Tip: Play with a few different arrangements to find the one you like best.",
        "This is where it comes in handy to have a few alternate plants that you can swap in and out to find your favorite combination.",
        "If you want your dish garden to only be viewed from one side, then you can put the taller plants at one side to create a backdrop, and place the shorter plants in front of them towards the other side.",
        "Try looking at your arrangement from different angles and distances to get different perspectives.",
        "Dig small holes in the soil to fit the root system of each plant.",
        "Scoop out just enough soil under each plant to accommodate the root systems.",
        "Place the plants in the holes so they are more or less even with the top of the soil in the dish.",
        "Normally, you would want to loosen the root system at this point when repotting plants to encourage growth.",
        "However, you don’t want the plants in your dish garden to grow too fast and outgrow the garden, so it’s best to leave the roots alone.",
        "You can angle plants slightly out around the edges if you don’t want them all to grow straight up.",
        "Pack the soil tightly around each plant when they are all in position.",
        "Add extra soil to fill in the dish around the plants if needed.",
        "Use your fingers to carefully tap down the soil around the plants to set the roots in place.",
        "Your dish garden will now have an even layer of soil and all the plants will be set firmly in place.",
        "It’s time for the finishing touches to add some character to your dish garden!",
        "Put a layer of mulch, pebbles, or other finishing touches on top of the soil.",
        "Other options include moss, bark, or glass chips.",
        "Add accent pieces such as miniature sculptures to create a truly unique garden.",
        "This step is not necessary, but will make your dish garden that much more interesting!",
        "For example, you could try combining moss with some miniature garden gnome figurines to create a miniature magical landscape.",
        "Water the garden enough to dampen it without flooding it.",
        "Start with about 1 cup (236.58 mL) and slowly pour it in.",
        "Water just enough to get all the soil wet, without creating a pool on top or displacing any of the finishing touch features you added.",
        "After the initial watering, let the soil partially dry out between each watering.",
        "In general, you don’t want the soil to get totally dry (unless you planted succulents) or completely soggy."
    ]
}