{
    "title": "How to Exhale Scream",
    "url": "https://www.wikihow.com/Exhale-Scream",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Music",
        "Music Genres",
        "Heavy Metal Music"
    ],
    "steps": [
        {
            "headline": "Make the grudge noise by breathing out the air which you have breathed in using your diaphragm if you find it hard to make the grudge sound then focus more on the vowels when your trying to make the sound example: A E  I O U scream either the letters by them self's carry out the vowel Example: \"ooo...\" a word that starts with one of these letters will be easier to scream if you can get the vowel to sound good on its own.",
            "description": "(it sounds creaky like your humming but faster)."
        },
        {
            "headline": "Breathe from the diaphragm before you scream.",
            "description": "It's located in your stomach Region, Do NOT breath from your chest."
        },
        {
            "headline": "Keep your shoulders straight and do not move them keep your hands beside you or position them directly in front of you to allow better air flow.",
            "description": ""
        },
        {
            "headline": "To start, ensure that you are breathing from your diaphragm.",
            "description": "Try imitating some famous sounds to get a feel for what this is. Try to imitate the grudge sound or a zombie's moan."
        },
        {
            "headline": "If you got the grudge noise down, add more pressure and air until it becomes louder and distorts.",
            "description": ""
        },
        {
            "headline": "Keep practicing until it actually turns into a scream.",
            "description": ""
        },
        {
            "headline": "To make it higher open your mouth more and add more air.",
            "description": "Tightening the throat. Try to imitate meat wads voice from Aqua Teen for a good starting point. ."
        },
        {
            "headline": "To make it go lower, slow down and open your throat a little more and make a small o shape with your mouth as you project the air from your diaphragm threw your vocal cords.",
            "description": ""
        },
        {
            "headline": "Understand that a lot of professional screamers are over produced.",
            "description": "If you can't get that signature sound you desire understand that a good deal of it has to do with studio magic. Screamers use very high amounts of compression to even out their sounds. EQ also plays a role. Many famous harsh vocalist record in layers or line by line."
        }
    ],
    "tyn": [
        "Warm water (cold water will only make it harder to scream)",
        "Tea.  Note: If your drinking tea avoid adding milk if possible because it will cause your throat to get lined and it will make your screams sound raspy and it won't aid you very much so to speak.",
        "Music with screaming in it."
    ],
    "text": " Make the grudge noise by breathing out the air which you have breathed in using your diaphragm if you find it hard to make the grudge sound then focus more on the vowels when your trying to make the sound example: A E  I O U scream either the letters by them self's carry out the vowel Example: \"ooo...\" a word that starts with one of these letters will be easier to scream if you can get the vowel to sound good on its own. (it sounds creaky like your humming but faster). Breathe from the diaphragm before you scream. It's located in your stomach Region, Do NOT breath from your chest. Keep your shoulders straight and do not move them keep your hands beside you or position them directly in front of you to allow better air flow.  To start, ensure that you are breathing from your diaphragm. Try imitating some famous sounds to get a feel for what this is. Try to imitate the grudge sound or a zombie's moan. If you got the grudge noise down, add more pressure and air until it becomes louder and distorts.  Keep practicing until it actually turns into a scream.  To make it higher open your mouth more and add more air. Tightening the throat. Try to imitate meat wads voice from Aqua Teen for a good starting point. . To make it go lower, slow down and open your throat a little more and make a small o shape with your mouth as you project the air from your diaphragm threw your vocal cords.  Understand that a lot of professional screamers are over produced. If you can't get that signature sound you desire understand that a good deal of it has to do with studio magic. Screamers use very high amounts of compression to even out their sounds. EQ also plays a role. Many famous harsh vocalist record in layers or line by line.",
    "sentences": [
        " Make the grudge noise by breathing out the air which you have breathed in using your diaphragm if you find it hard to make the grudge sound then focus more on the vowels when your trying to make the sound example: A E  I O U scream either the letters by them self's carry out the vowel Example: \"ooo...\" a word that starts with one of these letters will be easier to scream if you can get the vowel to sound good on its own.",
        "(it sounds creaky like your humming but faster).",
        "Breathe from the diaphragm before you scream.",
        "It's located in your stomach Region, Do NOT breath from your chest.",
        "Keep your shoulders straight and do not move them keep your hands beside you or position them directly in front of you to allow better air flow.",
        "To start, ensure that you are breathing from your diaphragm.",
        "Try imitating some famous sounds to get a feel for what this is.",
        "Try to imitate the grudge sound or a zombie's moan.",
        "If you got the grudge noise down, add more pressure and air until it becomes louder and distorts.",
        "Keep practicing until it actually turns into a scream.",
        "To make it higher open your mouth more and add more air.",
        "Tightening the throat.",
        "Try to imitate meat wads voice from Aqua Teen for a good starting point.",
        ".",
        "To make it go lower, slow down and open your throat a little more and make a small o shape with your mouth as you project the air from your diaphragm threw your vocal cords.",
        "Understand that a lot of professional screamers are over produced.",
        "If you can't get that signature sound you desire understand that a good deal of it has to do with studio magic.",
        "Screamers use very high amounts of compression to even out their sounds.",
        "EQ also plays a role.",
        "Many famous harsh vocalist record in layers or line by line."
    ]
}