{
    "title": "How to Entertain a Toddler",
    "url": "https://www.wikihow.com/Entertain-a-Toddler",
    "category_hierarchy": [
        "Family Life",
        "Parenting",
        "Development Stages",
        "Toddlers"
    ],
    "methods": [
        {
            "name": "Sharing Fun Activities in Your Home",
            "steps": [
                {
                    "headline": "Play dress-up together.",
                    "description": "If a toddler sees you putting on a tie or a necklace, they usually want to do the same thing. Pile up some clothes near a big mirror and have a dress-up fashion show! Or, get fancied up for a tea party or a “business meeting.”\nToddlers also like to mimic adults doing things like shaving or styling their hair. Look for a toddler-friendly shaving or hair styling kit so they can follow along with you."
                },
                {
                    "headline": "Write cards or letters to friends and family.",
                    "description": "Toddlers can add a unique artistic touch to any card or letter. Give them their own sheet of paper or card to work on while you write yours, then send them both to a friend or loved one. Or, write the card or letter, then let them “spruce it up” a bit."
                },
                {
                    "headline": "Let them choose the stories you'll read.",
                    "description": "This is one of the simplest ways to let a toddler feel like they're in control. Be warned, though—this may mean you'll read the same book over and over again! To make things a bit easier, you can present them with 2 options and let them decide—“Do you want to read this book or this one?” They'll still feel like they're the one making the call."
                },
                {
                    "headline": "Play “follow the leader” as the follower.",
                    "description": "Most toddlers will relish the chance to be the one giving you orders. Let them lead you (and anyone else playing along) around the house, throughout the yard, or both! If they're able to get the hang of the game “Simon says” as the follower, you can also give them the chance to be the one giving the commands. You can also get your toddler used to following and giving directions by starting out with follow-along songs like “If You're Happy and You Know It.”"
                },
                {
                    "headline": "Create music with them as the composer.",
                    "description": "Pull out some musical toys to play with, or just get out some pots and pans to bang away on. Ask them to make up the song and start playing, and then you can join in and make a beautiful racket together! You may want to set up a recital or concert for an audience of stuffed animals."
                },
                {
                    "headline": "Let them pick from a rotating selection of toys.",
                    "description": "Toddlers like to choose which toys to play with, but letting them choose from everything can be overwhelming for them—and for you when it's time to clean up! Instead of keeping every toy accessible, rotate some of the toys in and out of circulation every few days. This can make old toys feel like new again. It can also make storing toys easier, as only a certain number of toys need to be kept in spots easily accessible to your toddler."
                },
                {
                    "headline": "Have a dance party to their favorite music.",
                    "description": "Put on a CD of their favorite toddler tunes, or pull up a toddler music channel on your favorite streaming app. But don't just sit back and watch them create new dance moves—join in! Record them dancing on your smartphone and then play it back to them. Kids usually love watching themselves get down!"
                }
            ]
        },
        {
            "name": "Entertaining Them Outdoors and Away from Home",
            "steps": [
                {
                    "headline": "Take a walk and let them choose the route.",
                    "description": "This helps them burn off some energy and be the person in charge. Depending on their age, they can either direct you from their stroller or lead you by the hand. Consider limiting them to 2 options in order to make things a little easier—“Should we turn this way or this way?”"
                },
                {
                    "headline": "Go for a nature walk and collect items.",
                    "description": "Bring along a bag or bucket and let them decide (within reason) what to pick up. You could look for pine cones, leaves, rocks, dandelions, or whatever else interests them. You might help them create a nature collage or leaf book when you get back home. If they're collecting things you don't really want to drag home, you can usually discard items as you go without them noticing."
                },
                {
                    "headline": "Set up a sandbox in your yard.",
                    "description": "If you're handy, you can build one yourself, or buy a pre-made one. In any case, toddlers will love to dig in, fill buckets, build castles, and have a sandy good time! Grab a bag of sand toys, or just use some plastic measuring cups, drinking cups, spoons, etc. Make sure the sandbox has a cover for when it's not being used. It can be a health hazard if animals start using it as a litter box."
                },
                {
                    "headline": "Go with them to a toddler-friendly playground.",
                    "description": "Toddlers can have a blast on slides, swings, and other playground classics, but look for playgrounds that are designed with toddlers in mind. Look for swings that have deep seats with leg openings to secure a toddler in place, and slides that aren't too high or fast. The playground should also have a soft surface for them to run (and inevitably fall) on. Toddlers need close supervision at all times while on a playground, even if it is designed for kids their age. Don't just sit on the bench and check in occasionally—walk around with them and help them enjoy their playtime safely."
                },
                {
                    "headline": "Put on rain boots and jump in puddles.",
                    "description": "A rainy day does not need to be an impediment to a toddler having fun outside. Grab their raincoat, boots, and umbrella and let them find the biggest puddles around. Even better, put your rain gear on and splash along with them. Use common sense, of course. Taking a toddler out in a light rain shower is fine; in a thunderstorm, not so much."
                },
                {
                    "headline": "Find a pool, gym, or indoor play area nearby.",
                    "description": "If the weather simply isn't cooperating, don't feel like you have to keep a toddler cooped up in the house. If they're familiar with the water and you have the proper gear, take them to an indoor or outdoor swimming pool. During a summer heat wave or a cold winter, an indoor play area at your local shopping mall can make a nice retreat. Never take pool safety for granted with toddlers. Make sure they have an approved life jacket that fits properly, and supervise them closely at all times."
                },
                {
                    "headline": "Take them to a children's museum.",
                    "description": "If you have a children's museum nearby, you'll find it to be a great place for keeping a toddler actively engaged for hours. Children's museums have lots of hands-on activities geared toward younger kids, and you don't have to worry too much about them breaking anything! While not as fully kid-centric, science, art, and history museums often have kid-friendly areas or programs as well. Your local library might also have an area where kids can read and play."
                },
                {
                    "headline": "Play classic games in cars, planes, or restaurants.",
                    "description": "It's hard for a toddler to remain cooped up in any one spot for more than a few minutes. Keeping them engaged with simple games like “I spy” can help distract them from the boredom of being stuck in the same spot. You can also try putting a selection of items on the restaurant table or airplane seat tray, taking something away while the toddler covers their eyes, and asking them to figure out what's missing. Sing-alongs, whether backed up by your stereo or not, are a great choice for car rides."
                }
            ]
        },
        {
            "name": "Keeping Them Occupied While You Work a Bit",
            "steps": [
                {
                    "headline": "Let them help you clean.",
                    "description": "If you need to dust, give them their own little dusting wand and let them clean off low shelves and non-breakable items. If you're doing laundry, work on color recognition together while sorting clothes. If you want to vacuum, get them a toy vacuum so they can follow you around with it. Generally speaking, they won't actually be helping you clean, and will often make things a little bit less clean in the process. Learn to embrace it, and enjoy watching them try! Offer your toddler toy versions of your broom, dustpan, or other cleaning supplies, and let them follow along with you as you clean."
                },
                {
                    "headline": "Help them “bake cookies” with play dough.",
                    "description": "Older toddlers may be able to help you with your baking by stirring batters or using plastic cookie cutters. For younger toddlers, you can set up a workstation on the kitchen table or floor and let them do their own “baking” while you do yours. Buy or make play dough for them to use and provide plastic cookie cutters and utensils, and a few old baking sheets. You can compare the looks of your resulting cookie creations! Even if you do make homemade play dough out of ingredients in your pantry, make sure your toddler doesn't eat it. If your toddler is old enough, let them use plastic cookie cutters to cut out real cookie dough and help you put the cookies on the baking sheet."
                },
                {
                    "headline": "Rake leaves or do other yard work together.",
                    "description": "Instead of trying to squeeze in some yard work while they're napping, bring your toddler outside to help. While they'll probably make it take longer to actually rake the leaves, you'll both enjoy it when they start jumping in the leaf pile! Some toddlers might also like to help pick up sticks and twigs, pull weeds, or clear small amounts of snow."
                },
                {
                    "headline": "Create a safe play space for them.",
                    "description": "If you need to get some work done, it's important to remember that you can't really take your eyes off a toddler for more than a few seconds at a time. You need to make sure you're situated in a spot where you can see them clearly, and that the play area is properly toddler-proofed. If you're letting them play in your home office, for instance, make sure you protect or remove any electrical or wiring hazards, sharp objects, hard surfaces, and choking hazards. It may be better, in fact, to set up a mini workspace for yourself in the child's typical play area."
                },
                {
                    "headline": "Record yourself reading their favorite books.",
                    "description": "Reading directly to a toddler is much more interactive and personal, of course. But, when you need to get a few things done, handing them one of their books while you play audio of you reading it can provide a useful distraction. You could also create a video of yourself reading the book and holding up the pictures, then play it back on a TV or other screen."
                },
                {
                    "headline": "Give them a cardboard box to play with.",
                    "description": "Every parent of a toddler has seen it happen—their kid ends up more interested in the box the toy came in than the toy itself. So, at least sometimes, just skip the toy part and provide them with an empty cardboard box or 2 to create and play with. With a little help from you, toddlers can find nearly limitless uses for a simple box. It can be a spaceship, a puppet stage, a mailbox, a hiding spot, and so much more! Play with your toddler and give them some ideas about how to use the box. This will inspire their creativity, and they may soon start coming up with ideas on their own!"
                },
                {
                    "headline": "Set up play-dates with other toddlers.",
                    "description": "When you're tired and frazzled, adding more toddlers to the mix may seem like the last thing you want to do. However, the kids will help to keep each other occupied, meaning you can become more of a supervisor than an active participant for at least a little while. And, if you invite other parent(s) with their toddler(s) for a play-date, you can take turns with them being the primary lookout for the kids. See if you can set up weekly play-dates at a local park, or rotate them among several homes with toddlers."
                },
                {
                    "headline": "Have the next activity ready to go when they get bored.",
                    "description": "Toddlers have short attention spans, so you have to plan ahead if you want to keep them occupied for more than a couple minutes at a time. When they suddenly lose interest in the pots and pans they were banging on, for example, have some building blocks or art supplies ready to go. There is one thing that can invariably keep a toddler occupied for a long stretch of time—you! Make the most of the full attention your toddler wants to give you—they'll be off to school and making friends before you know it!"
                },
                {
                    "headline": "Rely on TV or screen time only as a temporary last resort.",
                    "description": "Plopping a toddler in front of a TV or other screen to keep them occupied should only be a short-term alternative when you don't have better options. The American Academy of Pediatrics recommends no screen time for kids under 18 months, very limited screen time with an adult watching along at 18-24 months, and no more than 1 hour per day of solo screen time from 2-5 years. Choose educational programming with limited or no advertising, and watch along with them whenever possible. To make things a bit more engaging, help them set up their dolls or stuffed animals in chairs to create a \"movie theater.\" You might even make up tickets to sell for the show! Or, drag out some home movies for them to watch. Toddlers are often fascinated by seeing themselves on the big screen, and they might be especially intrigued by seeing themselves as a tiny baby!"
                }
            ]
        }
    ],
    "tyn": [
        "Craft supplies",
        "CD player and CDs",
        "Favorite movies",
        "Dress-up clothes",
        "Games",
        "Plenty of patience"
    ],
    "text": " Sharing Fun Activities in Your Home Play dress-up together. If a toddler sees you putting on a tie or a necklace, they usually want to do the same thing. Pile up some clothes near a big mirror and have a dress-up fashion show! Or, get fancied up for a tea party or a “business meeting.”\nToddlers also like to mimic adults doing things like shaving or styling their hair. Look for a toddler-friendly shaving or hair styling kit so they can follow along with you. Write cards or letters to friends and family. Toddlers can add a unique artistic touch to any card or letter. Give them their own sheet of paper or card to work on while you write yours, then send them both to a friend or loved one. Or, write the card or letter, then let them “spruce it up” a bit. Let them choose the stories you'll read. This is one of the simplest ways to let a toddler feel like they're in control. Be warned, though—this may mean you'll read the same book over and over again! To make things a bit easier, you can present them with 2 options and let them decide—“Do you want to read this book or this one?” They'll still feel like they're the one making the call. Play “follow the leader” as the follower. Most toddlers will relish the chance to be the one giving you orders. Let them lead you (and anyone else playing along) around the house, throughout the yard, or both! If they're able to get the hang of the game “Simon says” as the follower, you can also give them the chance to be the one giving the commands. You can also get your toddler used to following and giving directions by starting out with follow-along songs like “If You're Happy and You Know It.” Create music with them as the composer. Pull out some musical toys to play with, or just get out some pots and pans to bang away on. Ask them to make up the song and start playing, and then you can join in and make a beautiful racket together! You may want to set up a recital or concert for an audience of stuffed animals. Let them pick from a rotating selection of toys. Toddlers like to choose which toys to play with, but letting them choose from everything can be overwhelming for them—and for you when it's time to clean up! Instead of keeping every toy accessible, rotate some of the toys in and out of circulation every few days. This can make old toys feel like new again. It can also make storing toys easier, as only a certain number of toys need to be kept in spots easily accessible to your toddler. Have a dance party to their favorite music. Put on a CD of their favorite toddler tunes, or pull up a toddler music channel on your favorite streaming app. But don't just sit back and watch them create new dance moves—join in! Record them dancing on your smartphone and then play it back to them. Kids usually love watching themselves get down! Entertaining Them Outdoors and Away from Home Take a walk and let them choose the route. This helps them burn off some energy and be the person in charge. Depending on their age, they can either direct you from their stroller or lead you by the hand. Consider limiting them to 2 options in order to make things a little easier—“Should we turn this way or this way?” Go for a nature walk and collect items. Bring along a bag or bucket and let them decide (within reason) what to pick up. You could look for pine cones, leaves, rocks, dandelions, or whatever else interests them. You might help them create a nature collage or leaf book when you get back home. If they're collecting things you don't really want to drag home, you can usually discard items as you go without them noticing. Set up a sandbox in your yard. If you're handy, you can build one yourself, or buy a pre-made one. In any case, toddlers will love to dig in, fill buckets, build castles, and have a sandy good time! Grab a bag of sand toys, or just use some plastic measuring cups, drinking cups, spoons, etc. Make sure the sandbox has a cover for when it's not being used. It can be a health hazard if animals start using it as a litter box. Go with them to a toddler-friendly playground. Toddlers can have a blast on slides, swings, and other playground classics, but look for playgrounds that are designed with toddlers in mind. Look for swings that have deep seats with leg openings to secure a toddler in place, and slides that aren't too high or fast. The playground should also have a soft surface for them to run (and inevitably fall) on. Toddlers need close supervision at all times while on a playground, even if it is designed for kids their age. Don't just sit on the bench and check in occasionally—walk around with them and help them enjoy their playtime safely. Put on rain boots and jump in puddles. A rainy day does not need to be an impediment to a toddler having fun outside. Grab their raincoat, boots, and umbrella and let them find the biggest puddles around. Even better, put your rain gear on and splash along with them. Use common sense, of course. Taking a toddler out in a light rain shower is fine; in a thunderstorm, not so much. Find a pool, gym, or indoor play area nearby. If the weather simply isn't cooperating, don't feel like you have to keep a toddler cooped up in the house. If they're familiar with the water and you have the proper gear, take them to an indoor or outdoor swimming pool. During a summer heat wave or a cold winter, an indoor play area at your local shopping mall can make a nice retreat. Never take pool safety for granted with toddlers. Make sure they have an approved life jacket that fits properly, and supervise them closely at all times. Take them to a children's museum. If you have a children's museum nearby, you'll find it to be a great place for keeping a toddler actively engaged for hours. Children's museums have lots of hands-on activities geared toward younger kids, and you don't have to worry too much about them breaking anything! While not as fully kid-centric, science, art, and history museums often have kid-friendly areas or programs as well. Your local library might also have an area where kids can read and play. Play classic games in cars, planes, or restaurants. It's hard for a toddler to remain cooped up in any one spot for more than a few minutes. Keeping them engaged with simple games like “I spy” can help distract them from the boredom of being stuck in the same spot. You can also try putting a selection of items on the restaurant table or airplane seat tray, taking something away while the toddler covers their eyes, and asking them to figure out what's missing. Sing-alongs, whether backed up by your stereo or not, are a great choice for car rides. Keeping Them Occupied While You Work a Bit Let them help you clean. If you need to dust, give them their own little dusting wand and let them clean off low shelves and non-breakable items. If you're doing laundry, work on color recognition together while sorting clothes. If you want to vacuum, get them a toy vacuum so they can follow you around with it. Generally speaking, they won't actually be helping you clean, and will often make things a little bit less clean in the process. Learn to embrace it, and enjoy watching them try! Offer your toddler toy versions of your broom, dustpan, or other cleaning supplies, and let them follow along with you as you clean. Help them “bake cookies” with play dough. Older toddlers may be able to help you with your baking by stirring batters or using plastic cookie cutters. For younger toddlers, you can set up a workstation on the kitchen table or floor and let them do their own “baking” while you do yours. Buy or make play dough for them to use and provide plastic cookie cutters and utensils, and a few old baking sheets. You can compare the looks of your resulting cookie creations! Even if you do make homemade play dough out of ingredients in your pantry, make sure your toddler doesn't eat it. If your toddler is old enough, let them use plastic cookie cutters to cut out real cookie dough and help you put the cookies on the baking sheet. Rake leaves or do other yard work together. Instead of trying to squeeze in some yard work while they're napping, bring your toddler outside to help. While they'll probably make it take longer to actually rake the leaves, you'll both enjoy it when they start jumping in the leaf pile! Some toddlers might also like to help pick up sticks and twigs, pull weeds, or clear small amounts of snow. Create a safe play space for them. If you need to get some work done, it's important to remember that you can't really take your eyes off a toddler for more than a few seconds at a time. You need to make sure you're situated in a spot where you can see them clearly, and that the play area is properly toddler-proofed. If you're letting them play in your home office, for instance, make sure you protect or remove any electrical or wiring hazards, sharp objects, hard surfaces, and choking hazards. It may be better, in fact, to set up a mini workspace for yourself in the child's typical play area. Record yourself reading their favorite books. Reading directly to a toddler is much more interactive and personal, of course. But, when you need to get a few things done, handing them one of their books while you play audio of you reading it can provide a useful distraction. You could also create a video of yourself reading the book and holding up the pictures, then play it back on a TV or other screen. Give them a cardboard box to play with. Every parent of a toddler has seen it happen—their kid ends up more interested in the box the toy came in than the toy itself. So, at least sometimes, just skip the toy part and provide them with an empty cardboard box or 2 to create and play with. With a little help from you, toddlers can find nearly limitless uses for a simple box. It can be a spaceship, a puppet stage, a mailbox, a hiding spot, and so much more! Play with your toddler and give them some ideas about how to use the box. This will inspire their creativity, and they may soon start coming up with ideas on their own! Set up play-dates with other toddlers. When you're tired and frazzled, adding more toddlers to the mix may seem like the last thing you want to do. However, the kids will help to keep each other occupied, meaning you can become more of a supervisor than an active participant for at least a little while. And, if you invite other parent(s) with their toddler(s) for a play-date, you can take turns with them being the primary lookout for the kids. See if you can set up weekly play-dates at a local park, or rotate them among several homes with toddlers. Have the next activity ready to go when they get bored. Toddlers have short attention spans, so you have to plan ahead if you want to keep them occupied for more than a couple minutes at a time. When they suddenly lose interest in the pots and pans they were banging on, for example, have some building blocks or art supplies ready to go. There is one thing that can invariably keep a toddler occupied for a long stretch of time—you! Make the most of the full attention your toddler wants to give you—they'll be off to school and making friends before you know it! Rely on TV or screen time only as a temporary last resort. Plopping a toddler in front of a TV or other screen to keep them occupied should only be a short-term alternative when you don't have better options. The American Academy of Pediatrics recommends no screen time for kids under 18 months, very limited screen time with an adult watching along at 18-24 months, and no more than 1 hour per day of solo screen time from 2-5 years. Choose educational programming with limited or no advertising, and watch along with them whenever possible. To make things a bit more engaging, help them set up their dolls or stuffed animals in chairs to create a \"movie theater.\" You might even make up tickets to sell for the show! Or, drag out some home movies for them to watch. Toddlers are often fascinated by seeing themselves on the big screen, and they might be especially intrigued by seeing themselves as a tiny baby!",
    "sentences": [
        " Sharing Fun Activities in Your Home Play dress-up together.",
        "If a toddler sees you putting on a tie or a necklace, they usually want to do the same thing.",
        "Pile up some clothes near a big mirror and have a dress-up fashion show!",
        "Or, get fancied up for a tea party or a “business meeting.”\nToddlers also like to mimic adults doing things like shaving or styling their hair.",
        "Look for a toddler-friendly shaving or hair styling kit so they can follow along with you.",
        "Write cards or letters to friends and family.",
        "Toddlers can add a unique artistic touch to any card or letter.",
        "Give them their own sheet of paper or card to work on while you write yours, then send them both to a friend or loved one.",
        "Or, write the card or letter, then let them “spruce it up” a bit.",
        "Let them choose the stories you'll read.",
        "This is one of the simplest ways to let a toddler feel like they're in control.",
        "Be warned, though—this may mean you'll read the same book over and over again!",
        "To make things a bit easier, you can present them with 2 options and let them decide—“Do you want to read this book or this one?” They'll still feel like they're the one making the call.",
        "Play “follow the leader” as the follower.",
        "Most toddlers will relish the chance to be the one giving you orders.",
        "Let them lead you (and anyone else playing along) around the house, throughout the yard, or both!",
        "If they're able to get the hang of the game “Simon says” as the follower, you can also give them the chance to be the one giving the commands.",
        "You can also get your toddler used to following and giving directions by starting out with follow-along songs like “If You're Happy and You Know It.” Create music with them as the composer.",
        "Pull out some musical toys to play with, or just get out some pots and pans to bang away on.",
        "Ask them to make up the song and start playing, and then you can join in and make a beautiful racket together!",
        "You may want to set up a recital or concert for an audience of stuffed animals.",
        "Let them pick from a rotating selection of toys.",
        "Toddlers like to choose which toys to play with, but letting them choose from everything can be overwhelming for them—and for you when it's time to clean up!",
        "Instead of keeping every toy accessible, rotate some of the toys in and out of circulation every few days.",
        "This can make old toys feel like new again.",
        "It can also make storing toys easier, as only a certain number of toys need to be kept in spots easily accessible to your toddler.",
        "Have a dance party to their favorite music.",
        "Put on a CD of their favorite toddler tunes, or pull up a toddler music channel on your favorite streaming app.",
        "But don't just sit back and watch them create new dance moves—join in!",
        "Record them dancing on your smartphone and then play it back to them.",
        "Kids usually love watching themselves get down!",
        "Entertaining Them Outdoors and Away from Home Take a walk and let them choose the route.",
        "This helps them burn off some energy and be the person in charge.",
        "Depending on their age, they can either direct you from their stroller or lead you by the hand.",
        "Consider limiting them to 2 options in order to make things a little easier—“Should we turn this way or this way?” Go for a nature walk and collect items.",
        "Bring along a bag or bucket and let them decide (within reason) what to pick up.",
        "You could look for pine cones, leaves, rocks, dandelions, or whatever else interests them.",
        "You might help them create a nature collage or leaf book when you get back home.",
        "If they're collecting things you don't really want to drag home, you can usually discard items as you go without them noticing.",
        "Set up a sandbox in your yard.",
        "If you're handy, you can build one yourself, or buy a pre-made one.",
        "In any case, toddlers will love to dig in, fill buckets, build castles, and have a sandy good time!",
        "Grab a bag of sand toys, or just use some plastic measuring cups, drinking cups, spoons, etc.",
        "Make sure the sandbox has a cover for when it's not being used.",
        "It can be a health hazard if animals start using it as a litter box.",
        "Go with them to a toddler-friendly playground.",
        "Toddlers can have a blast on slides, swings, and other playground classics, but look for playgrounds that are designed with toddlers in mind.",
        "Look for swings that have deep seats with leg openings to secure a toddler in place, and slides that aren't too high or fast.",
        "The playground should also have a soft surface for them to run (and inevitably fall) on.",
        "Toddlers need close supervision at all times while on a playground, even if it is designed for kids their age.",
        "Don't just sit on the bench and check in occasionally—walk around with them and help them enjoy their playtime safely.",
        "Put on rain boots and jump in puddles.",
        "A rainy day does not need to be an impediment to a toddler having fun outside.",
        "Grab their raincoat, boots, and umbrella and let them find the biggest puddles around.",
        "Even better, put your rain gear on and splash along with them.",
        "Use common sense, of course.",
        "Taking a toddler out in a light rain shower is fine; in a thunderstorm, not so much.",
        "Find a pool, gym, or indoor play area nearby.",
        "If the weather simply isn't cooperating, don't feel like you have to keep a toddler cooped up in the house.",
        "If they're familiar with the water and you have the proper gear, take them to an indoor or outdoor swimming pool.",
        "During a summer heat wave or a cold winter, an indoor play area at your local shopping mall can make a nice retreat.",
        "Never take pool safety for granted with toddlers.",
        "Make sure they have an approved life jacket that fits properly, and supervise them closely at all times.",
        "Take them to a children's museum.",
        "If you have a children's museum nearby, you'll find it to be a great place for keeping a toddler actively engaged for hours.",
        "Children's museums have lots of hands-on activities geared toward younger kids, and you don't have to worry too much about them breaking anything!",
        "While not as fully kid-centric, science, art, and history museums often have kid-friendly areas or programs as well.",
        "Your local library might also have an area where kids can read and play.",
        "Play classic games in cars, planes, or restaurants.",
        "It's hard for a toddler to remain cooped up in any one spot for more than a few minutes.",
        "Keeping them engaged with simple games like “I spy” can help distract them from the boredom of being stuck in the same spot.",
        "You can also try putting a selection of items on the restaurant table or airplane seat tray, taking something away while the toddler covers their eyes, and asking them to figure out what's missing.",
        "Sing-alongs, whether backed up by your stereo or not, are a great choice for car rides.",
        "Keeping Them Occupied While You Work a Bit Let them help you clean.",
        "If you need to dust, give them their own little dusting wand and let them clean off low shelves and non-breakable items.",
        "If you're doing laundry, work on color recognition together while sorting clothes.",
        "If you want to vacuum, get them a toy vacuum so they can follow you around with it.",
        "Generally speaking, they won't actually be helping you clean, and will often make things a little bit less clean in the process.",
        "Learn to embrace it, and enjoy watching them try!",
        "Offer your toddler toy versions of your broom, dustpan, or other cleaning supplies, and let them follow along with you as you clean.",
        "Help them “bake cookies” with play dough.",
        "Older toddlers may be able to help you with your baking by stirring batters or using plastic cookie cutters.",
        "For younger toddlers, you can set up a workstation on the kitchen table or floor and let them do their own “baking” while you do yours.",
        "Buy or make play dough for them to use and provide plastic cookie cutters and utensils, and a few old baking sheets.",
        "You can compare the looks of your resulting cookie creations!",
        "Even if you do make homemade play dough out of ingredients in your pantry, make sure your toddler doesn't eat it.",
        "If your toddler is old enough, let them use plastic cookie cutters to cut out real cookie dough and help you put the cookies on the baking sheet.",
        "Rake leaves or do other yard work together.",
        "Instead of trying to squeeze in some yard work while they're napping, bring your toddler outside to help.",
        "While they'll probably make it take longer to actually rake the leaves, you'll both enjoy it when they start jumping in the leaf pile!",
        "Some toddlers might also like to help pick up sticks and twigs, pull weeds, or clear small amounts of snow.",
        "Create a safe play space for them.",
        "If you need to get some work done, it's important to remember that you can't really take your eyes off a toddler for more than a few seconds at a time.",
        "You need to make sure you're situated in a spot where you can see them clearly, and that the play area is properly toddler-proofed.",
        "If you're letting them play in your home office, for instance, make sure you protect or remove any electrical or wiring hazards, sharp objects, hard surfaces, and choking hazards.",
        "It may be better, in fact, to set up a mini workspace for yourself in the child's typical play area.",
        "Record yourself reading their favorite books.",
        "Reading directly to a toddler is much more interactive and personal, of course.",
        "But, when you need to get a few things done, handing them one of their books while you play audio of you reading it can provide a useful distraction.",
        "You could also create a video of yourself reading the book and holding up the pictures, then play it back on a TV or other screen.",
        "Give them a cardboard box to play with.",
        "Every parent of a toddler has seen it happen—their kid ends up more interested in the box the toy came in than the toy itself.",
        "So, at least sometimes, just skip the toy part and provide them with an empty cardboard box or 2 to create and play with.",
        "With a little help from you, toddlers can find nearly limitless uses for a simple box.",
        "It can be a spaceship, a puppet stage, a mailbox, a hiding spot, and so much more!",
        "Play with your toddler and give them some ideas about how to use the box.",
        "This will inspire their creativity, and they may soon start coming up with ideas on their own!",
        "Set up play-dates with other toddlers.",
        "When you're tired and frazzled, adding more toddlers to the mix may seem like the last thing you want to do.",
        "However, the kids will help to keep each other occupied, meaning you can become more of a supervisor than an active participant for at least a little while.",
        "And, if you invite other parent(s) with their toddler(s) for a play-date, you can take turns with them being the primary lookout for the kids.",
        "See if you can set up weekly play-dates at a local park, or rotate them among several homes with toddlers.",
        "Have the next activity ready to go when they get bored.",
        "Toddlers have short attention spans, so you have to plan ahead if you want to keep them occupied for more than a couple minutes at a time.",
        "When they suddenly lose interest in the pots and pans they were banging on, for example, have some building blocks or art supplies ready to go.",
        "There is one thing that can invariably keep a toddler occupied for a long stretch of time—you!",
        "Make the most of the full attention your toddler wants to give you—they'll be off to school and making friends before you know it!",
        "Rely on TV or screen time only as a temporary last resort.",
        "Plopping a toddler in front of a TV or other screen to keep them occupied should only be a short-term alternative when you don't have better options.",
        "The American Academy of Pediatrics recommends no screen time for kids under 18 months, very limited screen time with an adult watching along at 18-24 months, and no more than 1 hour per day of solo screen time from 2-5 years.",
        "Choose educational programming with limited or no advertising, and watch along with them whenever possible.",
        "To make things a bit more engaging, help them set up their dolls or stuffed animals in chairs to create a \"movie theater.\"",
        "You might even make up tickets to sell for the show!",
        "Or, drag out some home movies for them to watch.",
        "Toddlers are often fascinated by seeing themselves on the big screen, and they might be especially intrigued by seeing themselves as a tiny baby!"
    ]
}