{
    "title": "How to Make Grits and Scrambled Eggs Southern Style",
    "url": "https://www.wikihow.com/Make-Grits-and-Scrambled-Eggs-Southern-Style",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Eggs and Dairy",
        "Scrambled Eggs"
    ],
    "methods": [
        {
            "name": "Making grits",
            "steps": [
                {
                    "headline": "Get your pot.",
                    "description": "Don't look for a top, you won't need it. It should be large enough to hold the water for your grits. The grits doesn't take up much space, but allow room for it."
                },
                {
                    "headline": "Add the water to the pot and put it on the stove.",
                    "description": "The amount of water determines how runny your grits will be."
                },
                {
                    "headline": "Turn the heat all the way up to get the water boiling as fast as you can.",
                    "description": ""
                },
                {
                    "headline": "Add a little salt to the water.",
                    "description": "Use your judgment. The salt cause the water to boil at a higher temperature, as well as satisfying your personal taste."
                },
                {
                    "headline": "Add sugar or sweetener to suit your taste.",
                    "description": ""
                },
                {
                    "headline": "Add butter to your heart's content.",
                    "description": "Adding it to the water at this time will permit it to inundate the grits and keep it from getting lumpy."
                },
                {
                    "headline": "As soon as the water comes to a full boil, add the grits and stir like crazy.",
                    "description": "Use a spoon with a long handle, because the grits try to pop out of the pot."
                },
                {
                    "headline": "Reduce the heat to a low setting.",
                    "description": "For a gas stove, wait about 30 seconds and put it on medium to low. You want the grits to boil for about a minute then simmer. The grits should remain on the heat until they are tender. This depends on the type of grits (Quick, 5-Minute, or the real thing)."
                },
                {
                    "headline": "Continue to stir occasionally.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Scrambling eggs",
            "steps": [
                {
                    "headline": "While the grits simmers, get your frying pan and a small bowl.",
                    "description": ""
                },
                {
                    "headline": "Put the frying pan on the stove and turn the heat all the way up.",
                    "description": ""
                },
                {
                    "headline": "Put a little butter or oil in the frying pan to keep the eggs from sticking.",
                    "description": ""
                },
                {
                    "headline": "Crack the eggs and put them in the bowl.",
                    "description": "Scramble them up. Mix well until they are uniform throughout."
                },
                {
                    "headline": "When the butter in the frying pan has melted, add the eggs.",
                    "description": ""
                },
                {
                    "headline": "Scramble the eggs.",
                    "description": "Don't let them brown."
                },
                {
                    "headline": "Take the frying pan off the heat just before they are finished.",
                    "description": "They will finish cooking with the remaining heat of the pan, but will be less likely to dry out."
                }
            ]
        },
        {
            "name": "Serving the meal",
            "steps": [
                {
                    "headline": "When the grits are ready (thick, but not dry), serve in a bowl or on a plate with the scrambled eggs on top.",
                    "description": ""
                },
                {
                    "headline": "Eat the eggs and grits together.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Medium sized pot",
        "Long-handle spoon",
        "Frying pan",
        "Small bowl"
    ],
    "text": " Making grits Get your pot. Don't look for a top, you won't need it. It should be large enough to hold the water for your grits. The grits doesn't take up much space, but allow room for it. Add the water to the pot and put it on the stove. The amount of water determines how runny your grits will be. Turn the heat all the way up to get the water boiling as fast as you can.  Add a little salt to the water. Use your judgment. The salt cause the water to boil at a higher temperature, as well as satisfying your personal taste. Add sugar or sweetener to suit your taste.  Add butter to your heart's content. Adding it to the water at this time will permit it to inundate the grits and keep it from getting lumpy. As soon as the water comes to a full boil, add the grits and stir like crazy. Use a spoon with a long handle, because the grits try to pop out of the pot. Reduce the heat to a low setting. For a gas stove, wait about 30 seconds and put it on medium to low. You want the grits to boil for about a minute then simmer. The grits should remain on the heat until they are tender. This depends on the type of grits (Quick, 5-Minute, or the real thing). Continue to stir occasionally.  Scrambling eggs While the grits simmers, get your frying pan and a small bowl.  Put the frying pan on the stove and turn the heat all the way up.  Put a little butter or oil in the frying pan to keep the eggs from sticking.  Crack the eggs and put them in the bowl. Scramble them up. Mix well until they are uniform throughout. When the butter in the frying pan has melted, add the eggs.  Scramble the eggs. Don't let them brown. Take the frying pan off the heat just before they are finished. They will finish cooking with the remaining heat of the pan, but will be less likely to dry out. Serving the meal When the grits are ready (thick, but not dry), serve in a bowl or on a plate with the scrambled eggs on top.  Eat the eggs and grits together. ",
    "sentences": [
        " Making grits Get your pot.",
        "Don't look for a top, you won't need it.",
        "It should be large enough to hold the water for your grits.",
        "The grits doesn't take up much space, but allow room for it.",
        "Add the water to the pot and put it on the stove.",
        "The amount of water determines how runny your grits will be.",
        "Turn the heat all the way up to get the water boiling as fast as you can.",
        "Add a little salt to the water.",
        "Use your judgment.",
        "The salt cause the water to boil at a higher temperature, as well as satisfying your personal taste.",
        "Add sugar or sweetener to suit your taste.",
        "Add butter to your heart's content.",
        "Adding it to the water at this time will permit it to inundate the grits and keep it from getting lumpy.",
        "As soon as the water comes to a full boil, add the grits and stir like crazy.",
        "Use a spoon with a long handle, because the grits try to pop out of the pot.",
        "Reduce the heat to a low setting.",
        "For a gas stove, wait about 30 seconds and put it on medium to low.",
        "You want the grits to boil for about a minute then simmer.",
        "The grits should remain on the heat until they are tender.",
        "This depends on the type of grits (Quick, 5-Minute, or the real thing).",
        "Continue to stir occasionally.",
        "Scrambling eggs While the grits simmers, get your frying pan and a small bowl.",
        "Put the frying pan on the stove and turn the heat all the way up.",
        "Put a little butter or oil in the frying pan to keep the eggs from sticking.",
        "Crack the eggs and put them in the bowl.",
        "Scramble them up.",
        "Mix well until they are uniform throughout.",
        "When the butter in the frying pan has melted, add the eggs.",
        "Scramble the eggs.",
        "Don't let them brown.",
        "Take the frying pan off the heat just before they are finished.",
        "They will finish cooking with the remaining heat of the pan, but will be less likely to dry out.",
        "Serving the meal When the grits are ready (thick, but not dry), serve in a bowl or on a plate with the scrambled eggs on top.",
        "Eat the eggs and grits together."
    ]
}