{
    "title": "How to Create Double Vision Halloween Makeup",
    "url": "https://www.wikihow.com/Create-Double-Vision-Halloween-Makeup",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Costumes",
        "Costume Makeup"
    ],
    "parts": [
        {
            "name": "Creating A Second Set of Eyes",
            "steps": [
                {
                    "headline": "Apply your regular makeup.",
                    "description": "You can use your every day eye makeup routine, or do something dark and bold– it’s completely up to you. Just remember that you will be doing the same makeup on the fake, second set of eyes and lips you’ll be creating, so simplicity is key. For example, sweeping one color shadow across your lid, lining your lash line with eyeliner, applying mascara, and applying a pigmented lipstick is great. You can use any color and product you like, but it won’t be too complicated to recreate on your “fake” eyes!"
                },
                {
                    "headline": "Create your fake eyebrows with eyebrow pomade.",
                    "description": "It’s best to use a pomade or gel for this step, because you will want to create dark, pigmented eyebrows that match your own brows. This second set of brows should go right under your eyes, on either side of your nose. The key is to mimic your natural brows. Begin your fake ones parallel to where your real ones start, and taper them off where your real brows taper. Recreate the length, thickness, shape, color, and so on of your real brows. It’s easiest to apply your fake brows with a tapered eyeliner brush."
                },
                {
                    "headline": "Draw your fake eyes below these brows.",
                    "description": "Observe your own eyes carefully, and recreate the shape of your eyes with eyeliner. They should be basically parallel with your nostrils. Once you’ve created the outline of your new eyes, brush eyeshadow over the top. Begin by applying the eyeshadow right on the outer border of your eye outline, blending it upwards – just like on your natural lids. Once you’ve applied the eyeshadow, use your darker eyeliner to draw a fake “crease” in it. This will make your shadow look more like three-dimensional eyelids."
                },
                {
                    "headline": "Create your eyeballs with eyeliners.",
                    "description": "Use a white, pigmented eyeliner to fill in the entire outline you created. This will create the whites of your eyes. Then, you will need to create your colored iris. Try to find an eyeliner or pigmented eyeshadow that matches the color of your eyes (brown, blue, green, gray, hazel, etc.). Use a small concealer or eyeshadow brush to create your iris, and then use a black eyeliner to create your pupil within it. Again, you are simply trying to make this second set of eyes look like your real eyes, so use those for reference! Once you’ve created the iris and pupil, dot a bit of white liquid eyeliner in the fake pupil. This will give the effect of light shining off these eyes, and make them look more realistic and lifelike. Once your fake eyes are completely created, line the outline darkly with the same eyeliner you used on your real eyes."
                },
                {
                    "headline": "Glue false lashes on your fake eyes.",
                    "description": "This step takes your fake eyes from cool to downright trippy. Pick up a pair of full, fake lashes from a local pharmacy or beauty supply store. Apply lash glue along the band of the lashes, letting it dry until it’s tacky. Then, place your fake lashes onto the top border of your fake eyes. Make sure to hold the lashes down for a couple of seconds to make sure they dry securely on your skin. Be careful not to touch your face at all while you’re wearing this look. If you touch your cheeks out of habit, you can smear your carefully constructed fake eyes. Add a row of bottom lashes by just drawing lines extending from the bottom lash line in eyeliner."
                }
            ]
        },
        {
            "name": "Drawing a Second Nose",
            "steps": [
                {
                    "headline": "Apply concealer to your nose.",
                    "description": "You will want to apply it to the tip of your natural nose, but also where your second, fake nose will be. The nose you will create should go about midway up the bridge of your nose, between your real and fake eyes. Apply the concealer, and then blend it out. This will create a smooth, blank canvas to work on."
                },
                {
                    "headline": "Sketch the shape of your new nose with eyeliner.",
                    "description": "Use a pencil eyeliner in a tan or brown color, depending on the color of your skin. You don’t need to be Picasso and create a freakishly realistic nose. Instead, just recreate the shape of your natural nose as you look at it straight on. Your outline will probably only consist of a few curves, where your natural nose curves from nostril to tip. Observe how your nostrils poke out on the sides, and create that same shape with your eyeliner, extending upwards slightly."
                },
                {
                    "headline": "Soften your outline with a blending brush.",
                    "description": "You don’t want your fake nose to be a hard outline. By blending the lines out gently with a blending brush, the lines will look more like shadows around a three-dimensional nose."
                },
                {
                    "headline": "Add shading around your fake nose.",
                    "description": "There should be darker shadows in the “nostrils” and up where the sides of the nose would be. Use a tan or brown eyeshadow and small brush to create these areas of shadow. The sides of the nose should extend upwards, towards your natural brows."
                }
            ]
        },
        {
            "name": "Making a Second Pair of Lips",
            "steps": [
                {
                    "headline": "Draw the outline of lips on your chin.",
                    "description": "Again, the shape you create should look like the shape of your natural lips. Create this general outline with the same product you used on your natural lips, like a cream or liquid lipstick. You can use a doe foot applicator to create the lips, or you may want to use a lip brush. When you’re finished with this step, you’ll have the general shape of your lips but they won’t look realistic yet."
                },
                {
                    "headline": "Outline your lips.",
                    "description": "Use a dark lip liner to outline the entire border of the lips, taking care to really copy the shape of your natural lips. Make sure you use a lip liner dark enough to show up against the lipstick you used to create the lips. Once you’ve outlined the border, draw a line through your lips. This will separate the shape into a top and bottom lip."
                },
                {
                    "headline": "Add dimension and detail to your lips.",
                    "description": "Using the same dark lip liner, draw vertical lines down your lips. This will mimic the ridges of natural lips. You can shade in the outer corners a bit and add a bit of shading between the top and bottom lips, making them appear more three-dimensional and lifelike. To create a bit more dimension within your lips, you can dot a bit of white eyeliner at the two peaks of the top lip and the center of the bottom lip. This will look like light reflecting off the highest points of the lip."
                }
            ]
        }
    ],
    "tyn": [
        "Eyeshadow",
        "Eyeshadow brush",
        "Black eyeliner",
        "Mascara",
        "Lipstick",
        "Lip brush (optional)",
        "False eyelashes",
        "Eyeliner or eyeshadow in the color of your irises",
        "Concealer",
        "White eyeliner (pencil and liquid)",
        "Tan or brown eyeliner",
        "Tan or brown eyeshadow",
        "Dark lip liner (complementary to your lipstick color)"
    ],
    "text": " Creating A Second Set of Eyes Apply your regular makeup. You can use your every day eye makeup routine, or do something dark and bold– it’s completely up to you. Just remember that you will be doing the same makeup on the fake, second set of eyes and lips you’ll be creating, so simplicity is key. For example, sweeping one color shadow across your lid, lining your lash line with eyeliner, applying mascara, and applying a pigmented lipstick is great. You can use any color and product you like, but it won’t be too complicated to recreate on your “fake” eyes! Create your fake eyebrows with eyebrow pomade. It’s best to use a pomade or gel for this step, because you will want to create dark, pigmented eyebrows that match your own brows. This second set of brows should go right under your eyes, on either side of your nose. The key is to mimic your natural brows. Begin your fake ones parallel to where your real ones start, and taper them off where your real brows taper. Recreate the length, thickness, shape, color, and so on of your real brows. It’s easiest to apply your fake brows with a tapered eyeliner brush. Draw your fake eyes below these brows. Observe your own eyes carefully, and recreate the shape of your eyes with eyeliner. They should be basically parallel with your nostrils. Once you’ve created the outline of your new eyes, brush eyeshadow over the top. Begin by applying the eyeshadow right on the outer border of your eye outline, blending it upwards – just like on your natural lids. Once you’ve applied the eyeshadow, use your darker eyeliner to draw a fake “crease” in it. This will make your shadow look more like three-dimensional eyelids. Create your eyeballs with eyeliners. Use a white, pigmented eyeliner to fill in the entire outline you created. This will create the whites of your eyes. Then, you will need to create your colored iris. Try to find an eyeliner or pigmented eyeshadow that matches the color of your eyes (brown, blue, green, gray, hazel, etc.). Use a small concealer or eyeshadow brush to create your iris, and then use a black eyeliner to create your pupil within it. Again, you are simply trying to make this second set of eyes look like your real eyes, so use those for reference! Once you’ve created the iris and pupil, dot a bit of white liquid eyeliner in the fake pupil. This will give the effect of light shining off these eyes, and make them look more realistic and lifelike. Once your fake eyes are completely created, line the outline darkly with the same eyeliner you used on your real eyes. Glue false lashes on your fake eyes. This step takes your fake eyes from cool to downright trippy. Pick up a pair of full, fake lashes from a local pharmacy or beauty supply store. Apply lash glue along the band of the lashes, letting it dry until it’s tacky. Then, place your fake lashes onto the top border of your fake eyes. Make sure to hold the lashes down for a couple of seconds to make sure they dry securely on your skin. Be careful not to touch your face at all while you’re wearing this look. If you touch your cheeks out of habit, you can smear your carefully constructed fake eyes. Add a row of bottom lashes by just drawing lines extending from the bottom lash line in eyeliner. Drawing a Second Nose Apply concealer to your nose. You will want to apply it to the tip of your natural nose, but also where your second, fake nose will be. The nose you will create should go about midway up the bridge of your nose, between your real and fake eyes. Apply the concealer, and then blend it out. This will create a smooth, blank canvas to work on. Sketch the shape of your new nose with eyeliner. Use a pencil eyeliner in a tan or brown color, depending on the color of your skin. You don’t need to be Picasso and create a freakishly realistic nose. Instead, just recreate the shape of your natural nose as you look at it straight on. Your outline will probably only consist of a few curves, where your natural nose curves from nostril to tip. Observe how your nostrils poke out on the sides, and create that same shape with your eyeliner, extending upwards slightly. Soften your outline with a blending brush. You don’t want your fake nose to be a hard outline. By blending the lines out gently with a blending brush, the lines will look more like shadows around a three-dimensional nose. Add shading around your fake nose. There should be darker shadows in the “nostrils” and up where the sides of the nose would be. Use a tan or brown eyeshadow and small brush to create these areas of shadow. The sides of the nose should extend upwards, towards your natural brows. Making a Second Pair of Lips Draw the outline of lips on your chin. Again, the shape you create should look like the shape of your natural lips. Create this general outline with the same product you used on your natural lips, like a cream or liquid lipstick. You can use a doe foot applicator to create the lips, or you may want to use a lip brush. When you’re finished with this step, you’ll have the general shape of your lips but they won’t look realistic yet. Outline your lips. Use a dark lip liner to outline the entire border of the lips, taking care to really copy the shape of your natural lips. Make sure you use a lip liner dark enough to show up against the lipstick you used to create the lips. Once you’ve outlined the border, draw a line through your lips. This will separate the shape into a top and bottom lip. Add dimension and detail to your lips. Using the same dark lip liner, draw vertical lines down your lips. This will mimic the ridges of natural lips. You can shade in the outer corners a bit and add a bit of shading between the top and bottom lips, making them appear more three-dimensional and lifelike. To create a bit more dimension within your lips, you can dot a bit of white eyeliner at the two peaks of the top lip and the center of the bottom lip. This will look like light reflecting off the highest points of the lip.",
    "sentences": [
        " Creating A Second Set of Eyes Apply your regular makeup.",
        "You can use your every day eye makeup routine, or do something dark and bold– it’s completely up to you.",
        "Just remember that you will be doing the same makeup on the fake, second set of eyes and lips you’ll be creating, so simplicity is key.",
        "For example, sweeping one color shadow across your lid, lining your lash line with eyeliner, applying mascara, and applying a pigmented lipstick is great.",
        "You can use any color and product you like, but it won’t be too complicated to recreate on your “fake” eyes!",
        "Create your fake eyebrows with eyebrow pomade.",
        "It’s best to use a pomade or gel for this step, because you will want to create dark, pigmented eyebrows that match your own brows.",
        "This second set of brows should go right under your eyes, on either side of your nose.",
        "The key is to mimic your natural brows.",
        "Begin your fake ones parallel to where your real ones start, and taper them off where your real brows taper.",
        "Recreate the length, thickness, shape, color, and so on of your real brows.",
        "It’s easiest to apply your fake brows with a tapered eyeliner brush.",
        "Draw your fake eyes below these brows.",
        "Observe your own eyes carefully, and recreate the shape of your eyes with eyeliner.",
        "They should be basically parallel with your nostrils.",
        "Once you’ve created the outline of your new eyes, brush eyeshadow over the top.",
        "Begin by applying the eyeshadow right on the outer border of your eye outline, blending it upwards – just like on your natural lids.",
        "Once you’ve applied the eyeshadow, use your darker eyeliner to draw a fake “crease” in it.",
        "This will make your shadow look more like three-dimensional eyelids.",
        "Create your eyeballs with eyeliners.",
        "Use a white, pigmented eyeliner to fill in the entire outline you created.",
        "This will create the whites of your eyes.",
        "Then, you will need to create your colored iris.",
        "Try to find an eyeliner or pigmented eyeshadow that matches the color of your eyes (brown, blue, green, gray, hazel, etc.).",
        "Use a small concealer or eyeshadow brush to create your iris, and then use a black eyeliner to create your pupil within it.",
        "Again, you are simply trying to make this second set of eyes look like your real eyes, so use those for reference!",
        "Once you’ve created the iris and pupil, dot a bit of white liquid eyeliner in the fake pupil.",
        "This will give the effect of light shining off these eyes, and make them look more realistic and lifelike.",
        "Once your fake eyes are completely created, line the outline darkly with the same eyeliner you used on your real eyes.",
        "Glue false lashes on your fake eyes.",
        "This step takes your fake eyes from cool to downright trippy.",
        "Pick up a pair of full, fake lashes from a local pharmacy or beauty supply store.",
        "Apply lash glue along the band of the lashes, letting it dry until it’s tacky.",
        "Then, place your fake lashes onto the top border of your fake eyes.",
        "Make sure to hold the lashes down for a couple of seconds to make sure they dry securely on your skin.",
        "Be careful not to touch your face at all while you’re wearing this look.",
        "If you touch your cheeks out of habit, you can smear your carefully constructed fake eyes.",
        "Add a row of bottom lashes by just drawing lines extending from the bottom lash line in eyeliner.",
        "Drawing a Second Nose Apply concealer to your nose.",
        "You will want to apply it to the tip of your natural nose, but also where your second, fake nose will be.",
        "The nose you will create should go about midway up the bridge of your nose, between your real and fake eyes.",
        "Apply the concealer, and then blend it out.",
        "This will create a smooth, blank canvas to work on.",
        "Sketch the shape of your new nose with eyeliner.",
        "Use a pencil eyeliner in a tan or brown color, depending on the color of your skin.",
        "You don’t need to be Picasso and create a freakishly realistic nose.",
        "Instead, just recreate the shape of your natural nose as you look at it straight on.",
        "Your outline will probably only consist of a few curves, where your natural nose curves from nostril to tip.",
        "Observe how your nostrils poke out on the sides, and create that same shape with your eyeliner, extending upwards slightly.",
        "Soften your outline with a blending brush.",
        "You don’t want your fake nose to be a hard outline.",
        "By blending the lines out gently with a blending brush, the lines will look more like shadows around a three-dimensional nose.",
        "Add shading around your fake nose.",
        "There should be darker shadows in the “nostrils” and up where the sides of the nose would be.",
        "Use a tan or brown eyeshadow and small brush to create these areas of shadow.",
        "The sides of the nose should extend upwards, towards your natural brows.",
        "Making a Second Pair of Lips Draw the outline of lips on your chin.",
        "Again, the shape you create should look like the shape of your natural lips.",
        "Create this general outline with the same product you used on your natural lips, like a cream or liquid lipstick.",
        "You can use a doe foot applicator to create the lips, or you may want to use a lip brush.",
        "When you’re finished with this step, you’ll have the general shape of your lips but they won’t look realistic yet.",
        "Outline your lips.",
        "Use a dark lip liner to outline the entire border of the lips, taking care to really copy the shape of your natural lips.",
        "Make sure you use a lip liner dark enough to show up against the lipstick you used to create the lips.",
        "Once you’ve outlined the border, draw a line through your lips.",
        "This will separate the shape into a top and bottom lip.",
        "Add dimension and detail to your lips.",
        "Using the same dark lip liner, draw vertical lines down your lips.",
        "This will mimic the ridges of natural lips.",
        "You can shade in the outer corners a bit and add a bit of shading between the top and bottom lips, making them appear more three-dimensional and lifelike.",
        "To create a bit more dimension within your lips, you can dot a bit of white eyeliner at the two peaks of the top lip and the center of the bottom lip.",
        "This will look like light reflecting off the highest points of the lip."
    ]
}