{
    "title": "How to Make Chocolate Hazelnut Coffee",
    "url": "https://www.wikihow.com/Make-Chocolate-Hazelnut-Coffee",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Coffee",
        "Flavored Coffee",
        "Chocolate Flavored Coffee"
    ],
    "methods": [
        {
            "name": "Adding Chocolate Hazelnut Spread to Coffee",
            "steps": [
                {
                    "headline": "Fill a mug with coffee.",
                    "description": "Pour approximately ¾ cup (177 ml) of your favorite coffee into a mug. Make sure that the coffee is fresh and still hot when you fill the mug. You can use whatever coffee you like, but make sure that it’s not a flavored variety, such as pumpkin spice or caramel."
                },
                {
                    "headline": "Mix in the chocolate hazelnut spread.",
                    "description": "While the coffee is still hot, add 2 tablespoons (37 g) of chocolate hazelnut spread, such as Nutella, to the coffee. Stir the coffee thoroughly to help the spread melt so the two blend completely. You can add more or less of the chocolate hazelnut spread, depending on how intense you want the flavor to be."
                },
                {
                    "headline": "Garnish with whipped cream and ground cinnamon.",
                    "description": "When the coffee and spread are well blended, top the mug with a dollop of whipped cream. Sprinkle a little ground cinnamon over the whipped cream, and serve. You can change or omit the garnish to suit your tastes. For example, you may want to add chopped hazelnuts or top the coffee with chocolate whipped cream."
                }
            ]
        },
        {
            "name": "Making Homemade Chocolate Hazelnut Creamer",
            "steps": [
                {
                    "headline": "Combine the condensed milk and half and half.",
                    "description": "Add 1 14-ounce (396 ml) can of sweetened condensed milk and 1 ¾ cup (414 ml) of half and half to a medium size bowl. Stir well to ensure that they’re well combined. In some areas, sweetened condensed milk may be sold as condensed milk. It is evaporated milk that has been sweetened with sugar."
                },
                {
                    "headline": "Add the syrups and vanilla paste.",
                    "description": "Once the condensed milk and half and half are combined, stir 3 tablespoons (45 ml) of chocolate syrup, 2 tablespoons (30 ml) of hazelnut syrup, and 1 teaspoon (5 ml) of vanilla bean paste into the mixture. Mix well until all of the ingredients are fully incorporated. You can use homemade or store-bought chocolate syrup,depending on your preference. Hazelnut syrup is typically found in the coffee aisle at the grocery store. If you don’t have vanilla bean paste, you can substitute an equal amount of pure vanilla extract. You can use this recipe as a base for any flavored cream that you like. Just mix in the corresponding syrup(s) in place of the chocolate and hazelnut."
                },
                {
                    "headline": "Mix the desired amount into your coffee.",
                    "description": "Transfer the creamer mixture to a airtight container that’s easy to pour from, and add the desired amount to a cup of hot coffee. Keep in mind that the more creamer that you add, the stronger the chocolate hazelnut flavor will be in your coffee. Make sure to refrigerate the creamer. It should keep for several days to a week."
                }
            ]
        },
        {
            "name": "Mixing Coffee and Hot Chocolate for Double Chocolate Hazelnut Coffee",
            "steps": [
                {
                    "headline": "Combine the coffee, hot chocolate, and hazelnut creamer in a mug.",
                    "description": "In a large mug, mix ½ cup (118 ml) of hot coffee, ½ cup (118 ml) of hot chocolate, and 2 tablespoons (30 ml) of hazelnut creamer. Stir well to ensure that the liquids are well combined. You can use whatever coffee and hot chocolate that you prefer, but make sure that they’re not flavored variations, such as salted caramel, or it will alter the taste of your finished coffee."
                },
                {
                    "headline": "Mix the whipped cream, icing sugar, and cocoa powder in a bowl.",
                    "description": "Add ¼ cup (20 g) of whipped cream to a medium sized bowl. Carefully fold in 1 tablespoon (8 g) of icing sugar and 1 teaspoon (2.5 g) of cocoa powder into the whipped cream with a spatula until the ingredients are well combined. You can use homemade or store-bought whipped cream, depending on your preference. In some areas, icing sugar is sold as powdered sugar. Just check the ingredients to make sure that cornstarch hasn’t been added to the sugar."
                },
                {
                    "headline": "Top the coffee mixture with the whipped cream and garnish as desired.",
                    "description": "Add a dollop of the whipped cream to the top of the coffee mixture. If desired, you can drizzle some chocolate syrup and toasted, chopped hazelnuts over the coffee for garnish."
                }
            ]
        }
    ],
    "tyn": [
        "Chocolate Hazelnut Spread to Coffee",
        "A mug",
        "A spoon",
        "Homemade Chocolate Hazelnut Creamer",
        "A medium size bowl",
        "An airtight container",
        "Double Chocolate Hazelnut Coffee",
        "A spatula"
    ],
    "text": " Adding Chocolate Hazelnut Spread to Coffee Fill a mug with coffee. Pour approximately ¾ cup (177 ml) of your favorite coffee into a mug. Make sure that the coffee is fresh and still hot when you fill the mug. You can use whatever coffee you like, but make sure that it’s not a flavored variety, such as pumpkin spice or caramel. Mix in the chocolate hazelnut spread. While the coffee is still hot, add 2 tablespoons (37 g) of chocolate hazelnut spread, such as Nutella, to the coffee. Stir the coffee thoroughly to help the spread melt so the two blend completely. You can add more or less of the chocolate hazelnut spread, depending on how intense you want the flavor to be. Garnish with whipped cream and ground cinnamon. When the coffee and spread are well blended, top the mug with a dollop of whipped cream. Sprinkle a little ground cinnamon over the whipped cream, and serve. You can change or omit the garnish to suit your tastes. For example, you may want to add chopped hazelnuts or top the coffee with chocolate whipped cream. Making Homemade Chocolate Hazelnut Creamer Combine the condensed milk and half and half. Add 1 14-ounce (396 ml) can of sweetened condensed milk and 1 ¾ cup (414 ml) of half and half to a medium size bowl. Stir well to ensure that they’re well combined. In some areas, sweetened condensed milk may be sold as condensed milk. It is evaporated milk that has been sweetened with sugar. Add the syrups and vanilla paste. Once the condensed milk and half and half are combined, stir 3 tablespoons (45 ml) of chocolate syrup, 2 tablespoons (30 ml) of hazelnut syrup, and 1 teaspoon (5 ml) of vanilla bean paste into the mixture. Mix well until all of the ingredients are fully incorporated. You can use homemade or store-bought chocolate syrup,depending on your preference. Hazelnut syrup is typically found in the coffee aisle at the grocery store. If you don’t have vanilla bean paste, you can substitute an equal amount of pure vanilla extract. You can use this recipe as a base for any flavored cream that you like. Just mix in the corresponding syrup(s) in place of the chocolate and hazelnut. Mix the desired amount into your coffee. Transfer the creamer mixture to a airtight container that’s easy to pour from, and add the desired amount to a cup of hot coffee. Keep in mind that the more creamer that you add, the stronger the chocolate hazelnut flavor will be in your coffee. Make sure to refrigerate the creamer. It should keep for several days to a week. Mixing Coffee and Hot Chocolate for Double Chocolate Hazelnut Coffee Combine the coffee, hot chocolate, and hazelnut creamer in a mug. In a large mug, mix ½ cup (118 ml) of hot coffee, ½ cup (118 ml) of hot chocolate, and 2 tablespoons (30 ml) of hazelnut creamer. Stir well to ensure that the liquids are well combined. You can use whatever coffee and hot chocolate that you prefer, but make sure that they’re not flavored variations, such as salted caramel, or it will alter the taste of your finished coffee. Mix the whipped cream, icing sugar, and cocoa powder in a bowl. Add ¼ cup (20 g) of whipped cream to a medium sized bowl. Carefully fold in 1 tablespoon (8 g) of icing sugar and 1 teaspoon (2.5 g) of cocoa powder into the whipped cream with a spatula until the ingredients are well combined. You can use homemade or store-bought whipped cream, depending on your preference. In some areas, icing sugar is sold as powdered sugar. Just check the ingredients to make sure that cornstarch hasn’t been added to the sugar. Top the coffee mixture with the whipped cream and garnish as desired. Add a dollop of the whipped cream to the top of the coffee mixture. If desired, you can drizzle some chocolate syrup and toasted, chopped hazelnuts over the coffee for garnish.",
    "sentences": [
        " Adding Chocolate Hazelnut Spread to Coffee Fill a mug with coffee.",
        "Pour approximately ¾ cup (177 ml) of your favorite coffee into a mug.",
        "Make sure that the coffee is fresh and still hot when you fill the mug.",
        "You can use whatever coffee you like, but make sure that it’s not a flavored variety, such as pumpkin spice or caramel.",
        "Mix in the chocolate hazelnut spread.",
        "While the coffee is still hot, add 2 tablespoons (37 g) of chocolate hazelnut spread, such as Nutella, to the coffee.",
        "Stir the coffee thoroughly to help the spread melt so the two blend completely.",
        "You can add more or less of the chocolate hazelnut spread, depending on how intense you want the flavor to be.",
        "Garnish with whipped cream and ground cinnamon.",
        "When the coffee and spread are well blended, top the mug with a dollop of whipped cream.",
        "Sprinkle a little ground cinnamon over the whipped cream, and serve.",
        "You can change or omit the garnish to suit your tastes.",
        "For example, you may want to add chopped hazelnuts or top the coffee with chocolate whipped cream.",
        "Making Homemade Chocolate Hazelnut Creamer Combine the condensed milk and half and half.",
        "Add 1 14-ounce (396 ml) can of sweetened condensed milk and 1 ¾ cup (414 ml) of half and half to a medium size bowl.",
        "Stir well to ensure that they’re well combined.",
        "In some areas, sweetened condensed milk may be sold as condensed milk.",
        "It is evaporated milk that has been sweetened with sugar.",
        "Add the syrups and vanilla paste.",
        "Once the condensed milk and half and half are combined, stir 3 tablespoons (45 ml) of chocolate syrup, 2 tablespoons (30 ml) of hazelnut syrup, and 1 teaspoon (5 ml) of vanilla bean paste into the mixture.",
        "Mix well until all of the ingredients are fully incorporated.",
        "You can use homemade or store-bought chocolate syrup,depending on your preference.",
        "Hazelnut syrup is typically found in the coffee aisle at the grocery store.",
        "If you don’t have vanilla bean paste, you can substitute an equal amount of pure vanilla extract.",
        "You can use this recipe as a base for any flavored cream that you like.",
        "Just mix in the corresponding syrup(s) in place of the chocolate and hazelnut.",
        "Mix the desired amount into your coffee.",
        "Transfer the creamer mixture to a airtight container that’s easy to pour from, and add the desired amount to a cup of hot coffee.",
        "Keep in mind that the more creamer that you add, the stronger the chocolate hazelnut flavor will be in your coffee.",
        "Make sure to refrigerate the creamer.",
        "It should keep for several days to a week.",
        "Mixing Coffee and Hot Chocolate for Double Chocolate Hazelnut Coffee Combine the coffee, hot chocolate, and hazelnut creamer in a mug.",
        "In a large mug, mix ½ cup (118 ml) of hot coffee, ½ cup (118 ml) of hot chocolate, and 2 tablespoons (30 ml) of hazelnut creamer.",
        "Stir well to ensure that the liquids are well combined.",
        "You can use whatever coffee and hot chocolate that you prefer, but make sure that they’re not flavored variations, such as salted caramel, or it will alter the taste of your finished coffee.",
        "Mix the whipped cream, icing sugar, and cocoa powder in a bowl.",
        "Add ¼ cup (20 g) of whipped cream to a medium sized bowl.",
        "Carefully fold in 1 tablespoon (8 g) of icing sugar and 1 teaspoon (2.5 g) of cocoa powder into the whipped cream with a spatula until the ingredients are well combined.",
        "You can use homemade or store-bought whipped cream, depending on your preference.",
        "In some areas, icing sugar is sold as powdered sugar.",
        "Just check the ingredients to make sure that cornstarch hasn’t been added to the sugar.",
        "Top the coffee mixture with the whipped cream and garnish as desired.",
        "Add a dollop of the whipped cream to the top of the coffee mixture.",
        "If desired, you can drizzle some chocolate syrup and toasted, chopped hazelnuts over the coffee for garnish."
    ]
}