{
    "title": "How to Make an Origami Pikachu",
    "url": "https://www.wikihow.com/Make-an-Origami-Pikachu",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Paper Craft",
        "Origami"
    ],
    "methods": [
        {
            "name": "Folding an Easy Origami Pikachu",
            "steps": [
                {
                    "headline": "Place a square piece of origami paper flat and rotate it like a diamond.",
                    "description": "Use yellow origami paper to create an authentic-looking Pikachu. Place the paper on a flat surface in front of you with the colored side down. You can make a square out of normal white printer paper if you don’t have origami paper. Color it yellow before you start folding it to make it Pikachu’s color."
                },
                {
                    "headline": "Fold the origami paper in half left to right, then unfold it.",
                    "description": "Fold the left corner over the right corner and crease the middle. Unfold it into a diamond again so you can see the crease in the middle. The crease will help guide your next folds to make your Pikachu."
                },
                {
                    "headline": "Fold the bottom half of the paper up to the top.",
                    "description": "Take the bottom corner and fold it up over the top corner. You will now have a yellow triangle with the top point facing away from you. Make sure you can still see the crease in the middle to guide your next fold."
                },
                {
                    "headline": "Fold the top of the triangle down to the bottom edge.",
                    "description": "Take both layers of the top point of the triangle and fold it down so the tip touches the bottom edge. Make sure the tip is lined up with the crease in the middle of the triangle. The origami should now look like a triangle with the top third of it cut off."
                },
                {
                    "headline": "Fold the sides up diagonally towards the center.",
                    "description": "Fold the left side up so that it creates half of a diamond. Do the same for the right side so you have a diamond with a space down the center. Use the part of the triangle that you folded down as a guide for folding the sides up diagonally."
                },
                {
                    "headline": "Fold the left and right corners in to the center.",
                    "description": "Fold the corners in at each side like a paper airplane. This will create Pikachu’s ears that you will fold out next. You should have a diamond shape in front of you that is long and narrow at the top, and short and wide at the bottom."
                },
                {
                    "headline": "Fold the ears out to the left and right at whatever angle you want.",
                    "description": "Fold the left and right ears out at different angles to give your Pikachu some personality. Fold them at the same angle if you want your Pikachu to look symmetrical. Look at how Pikachu’s ears are in different Pokemon scenes or artwork for inspiration."
                },
                {
                    "headline": "Fold in the pointy cheeks and chin of your Pikachu’s face.",
                    "description": "Fold the bottom point up to flatten the chin. Fold the left and right points in to flatten the cheeks. Try to keep the folds symmetrical so that you create an evenly rounded face for Pikachu."
                },
                {
                    "headline": "Flip the origami over and draw on Pikachu’s face.",
                    "description": "Use a black marker to draw the eyes, ears, nose, and the outline of the mouth. Use a red marker to draw the cheeks and color in the mouth. You can draw many styles of Pikachu's face on your origami Pikachu. Make Pikachu happy, mad, or even sad! Try making a bunch of these easy origami Pikachus for every mood."
                }
            ]
        },
        {
            "name": "Making an Origami Pikachu Cube",
            "steps": [
                {
                    "headline": "Start with a piece of origami paper flat with the colored side facing you.",
                    "description": "Place a piece of yellow origami paper on a flat surface in front of you. Align it like a normal square. Use a square of normal paper colored yellow if you don’t have origami paper."
                },
                {
                    "headline": "Fold the paper in half along both diagonals and horizontally.",
                    "description": "Fold the top half down over the bottom half and unfold it. Do the same for both diagonal directions. You should now have a square in front of you with a horizontal crease and 2 diagonal creases."
                },
                {
                    "headline": "Fold the paper inwards along the diagonal creases on the bottom half.",
                    "description": "Flatten the paper along the creases so you have a triangle with a vertical piece of paper sticking up into the air. Flatten the vertical piece next so that you have 2 triangles. It should now look like 2 triangles, 1 on top of the other, with the top point facing away from you and the flat edge closest to you."
                },
                {
                    "headline": "Fold the 2 sides of each triangle up so they meet in the middle.",
                    "description": "Fold the left and right corners of the top triangle upwards towards the point of the triangle. Flip the paper over and repeat this for the bottom triangle. You should now have a diamond shape in front of you that has a vertical space running down the middle."
                },
                {
                    "headline": "Fold the side flaps in to the middle on each side.",
                    "description": "Fold the left and right points in so that they meet in the middle where the vertical space is. Flip the paper over and repeat this. You will now have a diamond shape with flat sides. Fold the top flaps down. Fold the left and right top flaps down in half and slide the tips into the little pockets. Flip over the paper and repeat this for the other side."
                },
                {
                    "headline": "Tuck the folded top flaps into the little pockets on each side.",
                    "description": "Start with the side facing you and tuck the top flaps you folded down into the little pockets that are there. Do the same for the other side. This will keep all the top flaps in place once you inflate Pikachu."
                },
                {
                    "headline": "Fold the remaining set of top flaps down and to the side to make the ears.",
                    "description": "Fold the left and right top flaps down and out to the left and right. You will now have what looks like a flattened Pikachu. The top half should look like a triangle, with the ears as the left and right sides of the triangle. The bottom half should look like a square with a pointy bottom."
                },
                {
                    "headline": "Blow in the tiny hole at the bottom of the origami to inflate it.",
                    "description": "Pick up the folded origami and look for the tiny hole at the bottom. Blow into it several times until it inflates. You should now have a cube with 2 ears."
                },
                {
                    "headline": "Draw Pikachu’s face on with markers.",
                    "description": "Use a black marker to color the tips of the ears and draw on the eyes, nose, and mouth. Use a red marker to make the cheeks and a tongue if you want. Perk up the ears to give your Pikachu some character."
                }
            ]
        }
    ],
    "tyn": [
        "Yellow origami paper",
        "Red and black markers (optional)"
    ],
    "text": " Folding an Easy Origami Pikachu Place a square piece of origami paper flat and rotate it like a diamond. Use yellow origami paper to create an authentic-looking Pikachu. Place the paper on a flat surface in front of you with the colored side down. You can make a square out of normal white printer paper if you don’t have origami paper. Color it yellow before you start folding it to make it Pikachu’s color. Fold the origami paper in half left to right, then unfold it. Fold the left corner over the right corner and crease the middle. Unfold it into a diamond again so you can see the crease in the middle. The crease will help guide your next folds to make your Pikachu. Fold the bottom half of the paper up to the top. Take the bottom corner and fold it up over the top corner. You will now have a yellow triangle with the top point facing away from you. Make sure you can still see the crease in the middle to guide your next fold. Fold the top of the triangle down to the bottom edge. Take both layers of the top point of the triangle and fold it down so the tip touches the bottom edge. Make sure the tip is lined up with the crease in the middle of the triangle. The origami should now look like a triangle with the top third of it cut off. Fold the sides up diagonally towards the center. Fold the left side up so that it creates half of a diamond. Do the same for the right side so you have a diamond with a space down the center. Use the part of the triangle that you folded down as a guide for folding the sides up diagonally. Fold the left and right corners in to the center. Fold the corners in at each side like a paper airplane. This will create Pikachu’s ears that you will fold out next. You should have a diamond shape in front of you that is long and narrow at the top, and short and wide at the bottom. Fold the ears out to the left and right at whatever angle you want. Fold the left and right ears out at different angles to give your Pikachu some personality. Fold them at the same angle if you want your Pikachu to look symmetrical. Look at how Pikachu’s ears are in different Pokemon scenes or artwork for inspiration. Fold in the pointy cheeks and chin of your Pikachu’s face. Fold the bottom point up to flatten the chin. Fold the left and right points in to flatten the cheeks. Try to keep the folds symmetrical so that you create an evenly rounded face for Pikachu. Flip the origami over and draw on Pikachu’s face. Use a black marker to draw the eyes, ears, nose, and the outline of the mouth. Use a red marker to draw the cheeks and color in the mouth. You can draw many styles of Pikachu's face on your origami Pikachu. Make Pikachu happy, mad, or even sad! Try making a bunch of these easy origami Pikachus for every mood. Making an Origami Pikachu Cube Start with a piece of origami paper flat with the colored side facing you. Place a piece of yellow origami paper on a flat surface in front of you. Align it like a normal square. Use a square of normal paper colored yellow if you don’t have origami paper. Fold the paper in half along both diagonals and horizontally. Fold the top half down over the bottom half and unfold it. Do the same for both diagonal directions. You should now have a square in front of you with a horizontal crease and 2 diagonal creases. Fold the paper inwards along the diagonal creases on the bottom half. Flatten the paper along the creases so you have a triangle with a vertical piece of paper sticking up into the air. Flatten the vertical piece next so that you have 2 triangles. It should now look like 2 triangles, 1 on top of the other, with the top point facing away from you and the flat edge closest to you. Fold the 2 sides of each triangle up so they meet in the middle. Fold the left and right corners of the top triangle upwards towards the point of the triangle. Flip the paper over and repeat this for the bottom triangle. You should now have a diamond shape in front of you that has a vertical space running down the middle. Fold the side flaps in to the middle on each side. Fold the left and right points in so that they meet in the middle where the vertical space is. Flip the paper over and repeat this. You will now have a diamond shape with flat sides. Fold the top flaps down. Fold the left and right top flaps down in half and slide the tips into the little pockets. Flip over the paper and repeat this for the other side. Tuck the folded top flaps into the little pockets on each side. Start with the side facing you and tuck the top flaps you folded down into the little pockets that are there. Do the same for the other side. This will keep all the top flaps in place once you inflate Pikachu. Fold the remaining set of top flaps down and to the side to make the ears. Fold the left and right top flaps down and out to the left and right. You will now have what looks like a flattened Pikachu. The top half should look like a triangle, with the ears as the left and right sides of the triangle. The bottom half should look like a square with a pointy bottom. Blow in the tiny hole at the bottom of the origami to inflate it. Pick up the folded origami and look for the tiny hole at the bottom. Blow into it several times until it inflates. You should now have a cube with 2 ears. Draw Pikachu’s face on with markers. Use a black marker to color the tips of the ears and draw on the eyes, nose, and mouth. Use a red marker to make the cheeks and a tongue if you want. Perk up the ears to give your Pikachu some character.",
    "sentences": [
        " Folding an Easy Origami Pikachu Place a square piece of origami paper flat and rotate it like a diamond.",
        "Use yellow origami paper to create an authentic-looking Pikachu.",
        "Place the paper on a flat surface in front of you with the colored side down.",
        "You can make a square out of normal white printer paper if you don’t have origami paper.",
        "Color it yellow before you start folding it to make it Pikachu’s color.",
        "Fold the origami paper in half left to right, then unfold it.",
        "Fold the left corner over the right corner and crease the middle.",
        "Unfold it into a diamond again so you can see the crease in the middle.",
        "The crease will help guide your next folds to make your Pikachu.",
        "Fold the bottom half of the paper up to the top.",
        "Take the bottom corner and fold it up over the top corner.",
        "You will now have a yellow triangle with the top point facing away from you.",
        "Make sure you can still see the crease in the middle to guide your next fold.",
        "Fold the top of the triangle down to the bottom edge.",
        "Take both layers of the top point of the triangle and fold it down so the tip touches the bottom edge.",
        "Make sure the tip is lined up with the crease in the middle of the triangle.",
        "The origami should now look like a triangle with the top third of it cut off.",
        "Fold the sides up diagonally towards the center.",
        "Fold the left side up so that it creates half of a diamond.",
        "Do the same for the right side so you have a diamond with a space down the center.",
        "Use the part of the triangle that you folded down as a guide for folding the sides up diagonally.",
        "Fold the left and right corners in to the center.",
        "Fold the corners in at each side like a paper airplane.",
        "This will create Pikachu’s ears that you will fold out next.",
        "You should have a diamond shape in front of you that is long and narrow at the top, and short and wide at the bottom.",
        "Fold the ears out to the left and right at whatever angle you want.",
        "Fold the left and right ears out at different angles to give your Pikachu some personality.",
        "Fold them at the same angle if you want your Pikachu to look symmetrical.",
        "Look at how Pikachu’s ears are in different Pokemon scenes or artwork for inspiration.",
        "Fold in the pointy cheeks and chin of your Pikachu’s face.",
        "Fold the bottom point up to flatten the chin.",
        "Fold the left and right points in to flatten the cheeks.",
        "Try to keep the folds symmetrical so that you create an evenly rounded face for Pikachu.",
        "Flip the origami over and draw on Pikachu’s face.",
        "Use a black marker to draw the eyes, ears, nose, and the outline of the mouth.",
        "Use a red marker to draw the cheeks and color in the mouth.",
        "You can draw many styles of Pikachu's face on your origami Pikachu.",
        "Make Pikachu happy, mad, or even sad!",
        "Try making a bunch of these easy origami Pikachus for every mood.",
        "Making an Origami Pikachu Cube Start with a piece of origami paper flat with the colored side facing you.",
        "Place a piece of yellow origami paper on a flat surface in front of you.",
        "Align it like a normal square.",
        "Use a square of normal paper colored yellow if you don’t have origami paper.",
        "Fold the paper in half along both diagonals and horizontally.",
        "Fold the top half down over the bottom half and unfold it.",
        "Do the same for both diagonal directions.",
        "You should now have a square in front of you with a horizontal crease and 2 diagonal creases.",
        "Fold the paper inwards along the diagonal creases on the bottom half.",
        "Flatten the paper along the creases so you have a triangle with a vertical piece of paper sticking up into the air.",
        "Flatten the vertical piece next so that you have 2 triangles.",
        "It should now look like 2 triangles, 1 on top of the other, with the top point facing away from you and the flat edge closest to you.",
        "Fold the 2 sides of each triangle up so they meet in the middle.",
        "Fold the left and right corners of the top triangle upwards towards the point of the triangle.",
        "Flip the paper over and repeat this for the bottom triangle.",
        "You should now have a diamond shape in front of you that has a vertical space running down the middle.",
        "Fold the side flaps in to the middle on each side.",
        "Fold the left and right points in so that they meet in the middle where the vertical space is.",
        "Flip the paper over and repeat this.",
        "You will now have a diamond shape with flat sides.",
        "Fold the top flaps down.",
        "Fold the left and right top flaps down in half and slide the tips into the little pockets.",
        "Flip over the paper and repeat this for the other side.",
        "Tuck the folded top flaps into the little pockets on each side.",
        "Start with the side facing you and tuck the top flaps you folded down into the little pockets that are there.",
        "Do the same for the other side.",
        "This will keep all the top flaps in place once you inflate Pikachu.",
        "Fold the remaining set of top flaps down and to the side to make the ears.",
        "Fold the left and right top flaps down and out to the left and right.",
        "You will now have what looks like a flattened Pikachu.",
        "The top half should look like a triangle, with the ears as the left and right sides of the triangle.",
        "The bottom half should look like a square with a pointy bottom.",
        "Blow in the tiny hole at the bottom of the origami to inflate it.",
        "Pick up the folded origami and look for the tiny hole at the bottom.",
        "Blow into it several times until it inflates.",
        "You should now have a cube with 2 ears.",
        "Draw Pikachu’s face on with markers.",
        "Use a black marker to color the tips of the ears and draw on the eyes, nose, and mouth.",
        "Use a red marker to make the cheeks and a tongue if you want.",
        "Perk up the ears to give your Pikachu some character."
    ]
}