{
    "title": "How to Make Glittered Leaves",
    "url": "https://www.wikihow.com/Make-Glittered-Leaves",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Nature Crafts",
        "Leaf and Flower Crafts"
    ],
    "parts": [
        {
            "name": "Prepping for the Craft",
            "steps": [
                {
                    "headline": "Find your silk leaves.",
                    "description": "You can typically find plenty of fake plants at your local craft store, but it’s all about finding the perfect leaves. Look for strands or branches of greenery that you can cut individual leaves from. Big maple leaves work perfectly for this, but you can use any silk leaves that you want. If you want to save money on leaves, use the real ones. If you can find some leaves in the shape and size you want on the ground outside, there is no reason why you can't just glitter these!"
                },
                {
                    "headline": "Purchase your glitters of choice.",
                    "description": "Make sure you purchase enough to cover the surface of the leaves entirely. Warm fall colors like red, yellow, orange, and gold are perfect for fall décor. You can opt for other colors, depending on the occasion or holiday you’re decorating for. The great thing about silk flowers is that they don’t die, so you can create holiday décor that you can use year after year!"
                },
                {
                    "headline": "Create your workspace.",
                    "description": "If you’ve worked with glitter before, you know it can get a bit messy. Cover the surface you’re working on with newspaper. You may want to cover the ground with newspaper as well. Then, place a smaller piece of paper on top. This is where you will shake excess glitter from the leaves, and you can pick up this smaller paper to reuse the glitter for other leaves."
                }
            ]
        },
        {
            "name": "Adding the Glitter",
            "steps": [
                {
                    "headline": "Use your foam brush to paint the leaf with glue.",
                    "description": "Mod Podge, a water-based glue and finish, is perfect for this craft. If you have regular, everyday glue that you want to use, you may want to try thinning it out with a bit of water to make it more easily spreadable. Use your foam brush to coat one side of the leaf completely."
                },
                {
                    "headline": "Sprinkle your glitter onto the leaf.",
                    "description": "You can use your fingers to sprinkle a bit of glitter at a time, or gently pour the glitter from the container directly onto the leaf. Add glitter until the entire surface of the leaf is covered. Then, pick up your leaf and gently shake it so that the excess glitter falls off onto your paper. You will probably need to repeat this process a few times to ensure the entire leaf is covered in glitter. You can then lift up your paper on either side and pour the glitter back into the container to use for other leaves."
                },
                {
                    "headline": "Add another layer of glue.",
                    "description": "The leaf may look perfect now, but it will likely leave a mess behind if you stop here. Let the first coat of glittery dry, and gently brush on another coat of your glue. This will dry transparent, and seal the glitter to the leaf. You won’t have to worry about your new décor leaving traces of glitter wherever you put it."
                },
                {
                    "headline": "Repeat these steps for the backs of the leaves.",
                    "description": "This may or may not be necessary, depending on how you plan on displaying your leaves. If only one side of them will show, you don’t need to coat both sides with glitter. Otherwise, let the fronts of all the leaves dry, and then repeat the process on the reverse sides of the leaves."
                }
            ]
        },
        {
            "name": "Decorating with Your Glittered Leaves",
            "steps": [
                {
                    "headline": "Scatter them around.",
                    "description": "This is a simple way to add a bit of pizazz to a holiday table or display. You can arrange them around candles or a vase of flowers for a simple yet eye-catching centerpiece. For the autumn months, glittery maple leaves look great scattered around your pumpkins. Arrange them on your bookshelf, throw them into a bowl on your coffee table, and so on. Get creative!"
                },
                {
                    "headline": "Create a fall wreath.",
                    "description": "Glitter leaves add instant glitz to a typical DIY fall wreath. You can add one or two glittered leaves within regular fall leaves for little pops, or you can use only glittered leaves for a really attention-grabbing display. Purchase a wire wreath base and some foliage or grasses to create a beautiful wreath to hang in your home."
                },
                {
                    "headline": "Hang them with ribbons.",
                    "description": "If your silk leaves have stems, use them to your advantage. Tie a bit of ribbon or twine to your stems, and hang them in your home. You can hang them in a doorway like some fun, flashy garland, or hang them from your mantle to complete your holiday display. You can go nuts and hang them from doorknobs, kitchen cabinets, potted plants, and lampshades… you’ll certainly add some excitement to your space! If your leaves don’t have stems, you can punch holes and thread your ribbon or string through these."
                }
            ]
        }
    ],
    "tyn": [
        "Silk leaves",
        "Foam brush",
        "Mod Podge or regular glue",
        "Glitter",
        "Newspaper"
    ],
    "text": " Prepping for the Craft Find your silk leaves. You can typically find plenty of fake plants at your local craft store, but it’s all about finding the perfect leaves. Look for strands or branches of greenery that you can cut individual leaves from. Big maple leaves work perfectly for this, but you can use any silk leaves that you want. If you want to save money on leaves, use the real ones. If you can find some leaves in the shape and size you want on the ground outside, there is no reason why you can't just glitter these! Purchase your glitters of choice. Make sure you purchase enough to cover the surface of the leaves entirely. Warm fall colors like red, yellow, orange, and gold are perfect for fall décor. You can opt for other colors, depending on the occasion or holiday you’re decorating for. The great thing about silk flowers is that they don’t die, so you can create holiday décor that you can use year after year! Create your workspace. If you’ve worked with glitter before, you know it can get a bit messy. Cover the surface you’re working on with newspaper. You may want to cover the ground with newspaper as well. Then, place a smaller piece of paper on top. This is where you will shake excess glitter from the leaves, and you can pick up this smaller paper to reuse the glitter for other leaves. Adding the Glitter Use your foam brush to paint the leaf with glue. Mod Podge, a water-based glue and finish, is perfect for this craft. If you have regular, everyday glue that you want to use, you may want to try thinning it out with a bit of water to make it more easily spreadable. Use your foam brush to coat one side of the leaf completely. Sprinkle your glitter onto the leaf. You can use your fingers to sprinkle a bit of glitter at a time, or gently pour the glitter from the container directly onto the leaf. Add glitter until the entire surface of the leaf is covered. Then, pick up your leaf and gently shake it so that the excess glitter falls off onto your paper. You will probably need to repeat this process a few times to ensure the entire leaf is covered in glitter. You can then lift up your paper on either side and pour the glitter back into the container to use for other leaves. Add another layer of glue. The leaf may look perfect now, but it will likely leave a mess behind if you stop here. Let the first coat of glittery dry, and gently brush on another coat of your glue. This will dry transparent, and seal the glitter to the leaf. You won’t have to worry about your new décor leaving traces of glitter wherever you put it. Repeat these steps for the backs of the leaves. This may or may not be necessary, depending on how you plan on displaying your leaves. If only one side of them will show, you don’t need to coat both sides with glitter. Otherwise, let the fronts of all the leaves dry, and then repeat the process on the reverse sides of the leaves. Decorating with Your Glittered Leaves Scatter them around. This is a simple way to add a bit of pizazz to a holiday table or display. You can arrange them around candles or a vase of flowers for a simple yet eye-catching centerpiece. For the autumn months, glittery maple leaves look great scattered around your pumpkins. Arrange them on your bookshelf, throw them into a bowl on your coffee table, and so on. Get creative! Create a fall wreath. Glitter leaves add instant glitz to a typical DIY fall wreath. You can add one or two glittered leaves within regular fall leaves for little pops, or you can use only glittered leaves for a really attention-grabbing display. Purchase a wire wreath base and some foliage or grasses to create a beautiful wreath to hang in your home. Hang them with ribbons. If your silk leaves have stems, use them to your advantage. Tie a bit of ribbon or twine to your stems, and hang them in your home. You can hang them in a doorway like some fun, flashy garland, or hang them from your mantle to complete your holiday display. You can go nuts and hang them from doorknobs, kitchen cabinets, potted plants, and lampshades… you’ll certainly add some excitement to your space! If your leaves don’t have stems, you can punch holes and thread your ribbon or string through these.",
    "sentences": [
        " Prepping for the Craft Find your silk leaves.",
        "You can typically find plenty of fake plants at your local craft store, but it’s all about finding the perfect leaves.",
        "Look for strands or branches of greenery that you can cut individual leaves from.",
        "Big maple leaves work perfectly for this, but you can use any silk leaves that you want.",
        "If you want to save money on leaves, use the real ones.",
        "If you can find some leaves in the shape and size you want on the ground outside, there is no reason why you can't just glitter these!",
        "Purchase your glitters of choice.",
        "Make sure you purchase enough to cover the surface of the leaves entirely.",
        "Warm fall colors like red, yellow, orange, and gold are perfect for fall décor.",
        "You can opt for other colors, depending on the occasion or holiday you’re decorating for.",
        "The great thing about silk flowers is that they don’t die, so you can create holiday décor that you can use year after year!",
        "Create your workspace.",
        "If you’ve worked with glitter before, you know it can get a bit messy.",
        "Cover the surface you’re working on with newspaper.",
        "You may want to cover the ground with newspaper as well.",
        "Then, place a smaller piece of paper on top.",
        "This is where you will shake excess glitter from the leaves, and you can pick up this smaller paper to reuse the glitter for other leaves.",
        "Adding the Glitter Use your foam brush to paint the leaf with glue.",
        "Mod Podge, a water-based glue and finish, is perfect for this craft.",
        "If you have regular, everyday glue that you want to use, you may want to try thinning it out with a bit of water to make it more easily spreadable.",
        "Use your foam brush to coat one side of the leaf completely.",
        "Sprinkle your glitter onto the leaf.",
        "You can use your fingers to sprinkle a bit of glitter at a time, or gently pour the glitter from the container directly onto the leaf.",
        "Add glitter until the entire surface of the leaf is covered.",
        "Then, pick up your leaf and gently shake it so that the excess glitter falls off onto your paper.",
        "You will probably need to repeat this process a few times to ensure the entire leaf is covered in glitter.",
        "You can then lift up your paper on either side and pour the glitter back into the container to use for other leaves.",
        "Add another layer of glue.",
        "The leaf may look perfect now, but it will likely leave a mess behind if you stop here.",
        "Let the first coat of glittery dry, and gently brush on another coat of your glue.",
        "This will dry transparent, and seal the glitter to the leaf.",
        "You won’t have to worry about your new décor leaving traces of glitter wherever you put it.",
        "Repeat these steps for the backs of the leaves.",
        "This may or may not be necessary, depending on how you plan on displaying your leaves.",
        "If only one side of them will show, you don’t need to coat both sides with glitter.",
        "Otherwise, let the fronts of all the leaves dry, and then repeat the process on the reverse sides of the leaves.",
        "Decorating with Your Glittered Leaves Scatter them around.",
        "This is a simple way to add a bit of pizazz to a holiday table or display.",
        "You can arrange them around candles or a vase of flowers for a simple yet eye-catching centerpiece.",
        "For the autumn months, glittery maple leaves look great scattered around your pumpkins.",
        "Arrange them on your bookshelf, throw them into a bowl on your coffee table, and so on.",
        "Get creative!",
        "Create a fall wreath.",
        "Glitter leaves add instant glitz to a typical DIY fall wreath.",
        "You can add one or two glittered leaves within regular fall leaves for little pops, or you can use only glittered leaves for a really attention-grabbing display.",
        "Purchase a wire wreath base and some foliage or grasses to create a beautiful wreath to hang in your home.",
        "Hang them with ribbons.",
        "If your silk leaves have stems, use them to your advantage.",
        "Tie a bit of ribbon or twine to your stems, and hang them in your home.",
        "You can hang them in a doorway like some fun, flashy garland, or hang them from your mantle to complete your holiday display.",
        "You can go nuts and hang them from doorknobs, kitchen cabinets, potted plants, and lampshades… you’ll certainly add some excitement to your space!",
        "If your leaves don’t have stems, you can punch holes and thread your ribbon or string through these."
    ]
}