{
    "title": "How to Make Tabletop Christmas Trees",
    "url": "https://www.wikihow.com/Make-Tabletop-Christmas-Trees",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Christmas"
    ],
    "methods": [
        {
            "name": "Using Real Plant Trimmings",
            "steps": [
                {
                    "headline": "Collect the trimmings.",
                    "description": "Purchase evergreen trimmings or clip them from trees and shrubs in your own yard. If you’re gathering your own materials, fill a shopping bag with three- to six-inch cuttings. If you’re purchasing materials, look for cuttings at local garden centers or nurseries, and ask which ones will hold up well indoors. Examples of plants you can collect trimmings from are spruce and holly. If you have outdoor plants that already need trimming, like boxwood or arborvitae, you can upcycle their trimmings!"
                },
                {
                    "headline": "Choose the bases.",
                    "description": "You can use short, sturdy decorative vases if they are able to hold water. Otherwise, place vessels of water inside of larger decorative bowls, pots or pedestals. For example, place tumbler glasses inside of pots or nestle small vases into the centers of ornament-filled bowls. Be creative! Use items you already have or buy containers to suit your tastes."
                },
                {
                    "headline": "Use soaking floral foam.",
                    "description": "Get foam blocks that are about as long as you want each tree to be tall. You may want to cut them down to size, into one rectangular block per tree. Saturate the foam completely. Trim each one with a knife, from a rectangle shape into a cone shape. Keep the tops of the blocks flat. The foam won’t show, so don’t worry about making the shape perfect."
                },
                {
                    "headline": "Push the trimmings into the foam.",
                    "description": "Start at the bottom and put the longest pieces in first. Continue all the way up, choosing smaller pieces as you get higher on the trees. Put one or a few plant pieces at the very tops. Keep scissors or wire cutters on hand and trim “branches” down wherever needed as you’re arranging. Fill in any gaps until the floral foam is fully concealed."
                },
                {
                    "headline": "Add decorations if desired.",
                    "description": "You can brighten up your trees with artificial berry branches, strings of brightly-colored or metallic beads, and light-weight ornaments. Another idea is to add small bows and/or miniature candy canes."
                },
                {
                    "headline": "Keep the trees watered.",
                    "description": "Check the floral foam every couple of days. Stick your finger in between the trimmings to feel the foam. If it isn’t moist, add a little water to the foam. Plan to water your trees every other day."
                }
            ]
        },
        {
            "name": "Stacking Sugar Cookies into Tree Forms",
            "steps": [
                {
                    "headline": "Get graduated size cookie cutters or plan to improvise.",
                    "description": "You can find graduated cookie cutters at most craft stores where the cake decorating supplies are, or purchase them online. Stars are a great choice because their corners mimic the ridges of pine trees. However, you can use other shapes such as circles instead. If you don’t have the time or desire to get graduated cutters, cut out freeform circles or stars in graduated sizes. For example, make cookies with diameters roughly two inches, one and a half inches, and one inch. The more imperfect the cuts are, the more abstract your tree will look. You can even make them wavy!"
                },
                {
                    "headline": "Use your favorite recipe.",
                    "description": "Sugar cookie recipes are an ideal choice because they will be sturdy and take decoration well. However, you can use any cookie recipe you like: for example, you could use butter cookies, gingerbread cookies, or snickerdoodles. Alternately, if you don’t want to use homemade cookies, you can purchase cookies for this purpose at a grocery store or bakery. If you choose a butter cookie recipe, make sure the cookies will be thick enough to be sturdy in your cookie stacks. A good dough thickness is a quarter of an inch."
                },
                {
                    "headline": "Ice the cookies.",
                    "description": "Royal icing is a good choice since it will dry hard and maintain its shape. Smooth icing onto the surface of one of your largest-sized cookies. Build your stacks by working from the bottom up, placing smaller cookies on top of larger cookies. If you are using star shapes, arrange them so that the points of the star are shifted for every other layer. If you have frosting remaining, drizzle it onto the trees."
                },
                {
                    "headline": "Add decorations.",
                    "description": "Place a small cookie vertically on the top of your tree, securing it with icing. You can add sprinkles, colored sugar, or whatever edible decorations you like! For example, if you’re using star shapes, you can put a dome-shaped sprinkle where the points of the stars are. Try cinnamon-flavored crystals or sprinkles in red, green and metallic shades."
                },
                {
                    "headline": "Put the trees on display.",
                    "description": "Arrange them all on a single platter, or give them each their own decorative dish. Add “snow” on their dish(es) with paper doilies or by sprinkling powdered sugar around their bases."
                }
            ]
        },
        {
            "name": "Making Crafty Artificial Trees",
            "steps": [
                {
                    "headline": "Choose pedestals, if desired.",
                    "description": "You can use candle bases, wooden spools, or no pedestal at all, depending on your preference. The wooden spools will take a little longer and require the addition of wooden discs, such as those found in craft stores. However, the wooden spools make a neat effect stacked beneath the trees like trunks. Hot glue wooden spools together by gluing the top of one to the bottom of another. Repeat until you have the trunk height you desire. Glue the bottom spool to a wooden disk as a stand. Repeat this for each tree. Be careful when handling a hot glue gun, and follow the safety precautions that came with your glue gun. You can read more about glue gun safety at http://safety.ucanr.edu/files/3260.pdf."
                },
                {
                    "headline": "Arrange the bases.",
                    "description": "Get paper mache or Styrofoam cones. If you’re using wooden spools as pedestals, fit a wooden disc into or onto the bottom of the cone (depending if the cone is open- or closed-bottomed). Secure it in place with hot glue. Glue the end of the spool stacks to the discs on the bottoms of the cones."
                },
                {
                    "headline": "Add the main material.",
                    "description": "There are multiple materials you can pick from to make up the primary texture of your trees. You can apply ribbon, felt, or jingle bells to your cones. Cut any fabric material, as needed, and apply it to the cones using a hot glue gun. If you opt for ribbon or felt, glue a strip about two inches wide around the bottom of the base, and start your layers above that strip. Glue the layers on row by row, with the points of the fabric triangles facing down. Alternate where the downward points of the triangles overlap for each row. If using felt, try muted neutrals like gray, white, and beige balanced out with some baby blue or soft green. Cut felt into triangles one and a half inches long. Consider ribbon colors in silver, gold, red and green, or go with any color theme you like! Cut ribbon into pieces about two inches each. Create a clean point in each piece of ribbon by folding its corners on one end and gluing them down in the backs. Hot glue jingle bells with every other row shifted, as if they were making up a brick wall. Give them extra flair by spray painting the whole thing white, or with a glitter sealant!"
                },
                {
                    "headline": "Place decorations on the treetops.",
                    "description": "The options are endless as to what you can put on top of your mini Christmas trees! You can hot glue Christmas bows, ornaments, pine cones, or whatever decorations you like onto the tops."
                }
            ]
        }
    ],
    "tyn": [
        "Using Real Plant Trimmings",
        "Pruning shears",
        "Empty shopping bag",
        "Tree trimmings",
        "Gardening gloves",
        "Bricks of soakable floral foam",
        "Small containers",
        "Decorative vases or bowls",
        "Water",
        "Knife",
        "Scissors or wire cutters",
        "Artificial berry branches",
        "Lightweight ornaments or decorations",
        "Stacking Sugar Cookies into Tree Forms",
        "Cookies",
        "Icing",
        "Sprinkles",
        "Doilies or powdered sugar",
        "Platter or plates",
        "Graduated cookie cutters (alternately, a butter knife and clean ruler)",
        "Making Crafty Artificial Trees",
        "Hot glue gun",
        "Candle bases or wooden spools",
        "Wood discs",
        "Paper mache or Styrofoam cones",
        "Ribbon, felt, or jingle bells",
        "Scissors"
    ],
    "text": " Using Real Plant Trimmings Collect the trimmings. Purchase evergreen trimmings or clip them from trees and shrubs in your own yard. If you’re gathering your own materials, fill a shopping bag with three- to six-inch cuttings. If you’re purchasing materials, look for cuttings at local garden centers or nurseries, and ask which ones will hold up well indoors. Examples of plants you can collect trimmings from are spruce and holly. If you have outdoor plants that already need trimming, like boxwood or arborvitae, you can upcycle their trimmings! Choose the bases. You can use short, sturdy decorative vases if they are able to hold water. Otherwise, place vessels of water inside of larger decorative bowls, pots or pedestals. For example, place tumbler glasses inside of pots or nestle small vases into the centers of ornament-filled bowls. Be creative! Use items you already have or buy containers to suit your tastes. Use soaking floral foam. Get foam blocks that are about as long as you want each tree to be tall. You may want to cut them down to size, into one rectangular block per tree. Saturate the foam completely. Trim each one with a knife, from a rectangle shape into a cone shape. Keep the tops of the blocks flat. The foam won’t show, so don’t worry about making the shape perfect. Push the trimmings into the foam. Start at the bottom and put the longest pieces in first. Continue all the way up, choosing smaller pieces as you get higher on the trees. Put one or a few plant pieces at the very tops. Keep scissors or wire cutters on hand and trim “branches” down wherever needed as you’re arranging. Fill in any gaps until the floral foam is fully concealed. Add decorations if desired. You can brighten up your trees with artificial berry branches, strings of brightly-colored or metallic beads, and light-weight ornaments. Another idea is to add small bows and/or miniature candy canes. Keep the trees watered. Check the floral foam every couple of days. Stick your finger in between the trimmings to feel the foam. If it isn’t moist, add a little water to the foam. Plan to water your trees every other day. Stacking Sugar Cookies into Tree Forms Get graduated size cookie cutters or plan to improvise. You can find graduated cookie cutters at most craft stores where the cake decorating supplies are, or purchase them online. Stars are a great choice because their corners mimic the ridges of pine trees. However, you can use other shapes such as circles instead. If you don’t have the time or desire to get graduated cutters, cut out freeform circles or stars in graduated sizes. For example, make cookies with diameters roughly two inches, one and a half inches, and one inch. The more imperfect the cuts are, the more abstract your tree will look. You can even make them wavy! Use your favorite recipe. Sugar cookie recipes are an ideal choice because they will be sturdy and take decoration well. However, you can use any cookie recipe you like: for example, you could use butter cookies, gingerbread cookies, or snickerdoodles. Alternately, if you don’t want to use homemade cookies, you can purchase cookies for this purpose at a grocery store or bakery. If you choose a butter cookie recipe, make sure the cookies will be thick enough to be sturdy in your cookie stacks. A good dough thickness is a quarter of an inch. Ice the cookies. Royal icing is a good choice since it will dry hard and maintain its shape. Smooth icing onto the surface of one of your largest-sized cookies. Build your stacks by working from the bottom up, placing smaller cookies on top of larger cookies. If you are using star shapes, arrange them so that the points of the star are shifted for every other layer. If you have frosting remaining, drizzle it onto the trees. Add decorations. Place a small cookie vertically on the top of your tree, securing it with icing. You can add sprinkles, colored sugar, or whatever edible decorations you like! For example, if you’re using star shapes, you can put a dome-shaped sprinkle where the points of the stars are. Try cinnamon-flavored crystals or sprinkles in red, green and metallic shades. Put the trees on display. Arrange them all on a single platter, or give them each their own decorative dish. Add “snow” on their dish(es) with paper doilies or by sprinkling powdered sugar around their bases. Making Crafty Artificial Trees Choose pedestals, if desired. You can use candle bases, wooden spools, or no pedestal at all, depending on your preference. The wooden spools will take a little longer and require the addition of wooden discs, such as those found in craft stores. However, the wooden spools make a neat effect stacked beneath the trees like trunks. Hot glue wooden spools together by gluing the top of one to the bottom of another. Repeat until you have the trunk height you desire. Glue the bottom spool to a wooden disk as a stand. Repeat this for each tree. Be careful when handling a hot glue gun, and follow the safety precautions that came with your glue gun. You can read more about glue gun safety at http://safety.ucanr.edu/files/3260.pdf. Arrange the bases. Get paper mache or Styrofoam cones. If you’re using wooden spools as pedestals, fit a wooden disc into or onto the bottom of the cone (depending if the cone is open- or closed-bottomed). Secure it in place with hot glue. Glue the end of the spool stacks to the discs on the bottoms of the cones. Add the main material. There are multiple materials you can pick from to make up the primary texture of your trees. You can apply ribbon, felt, or jingle bells to your cones. Cut any fabric material, as needed, and apply it to the cones using a hot glue gun. If you opt for ribbon or felt, glue a strip about two inches wide around the bottom of the base, and start your layers above that strip. Glue the layers on row by row, with the points of the fabric triangles facing down. Alternate where the downward points of the triangles overlap for each row. If using felt, try muted neutrals like gray, white, and beige balanced out with some baby blue or soft green. Cut felt into triangles one and a half inches long. Consider ribbon colors in silver, gold, red and green, or go with any color theme you like! Cut ribbon into pieces about two inches each. Create a clean point in each piece of ribbon by folding its corners on one end and gluing them down in the backs. Hot glue jingle bells with every other row shifted, as if they were making up a brick wall. Give them extra flair by spray painting the whole thing white, or with a glitter sealant! Place decorations on the treetops. The options are endless as to what you can put on top of your mini Christmas trees! You can hot glue Christmas bows, ornaments, pine cones, or whatever decorations you like onto the tops.",
    "sentences": [
        " Using Real Plant Trimmings Collect the trimmings.",
        "Purchase evergreen trimmings or clip them from trees and shrubs in your own yard.",
        "If you’re gathering your own materials, fill a shopping bag with three- to six-inch cuttings.",
        "If you’re purchasing materials, look for cuttings at local garden centers or nurseries, and ask which ones will hold up well indoors.",
        "Examples of plants you can collect trimmings from are spruce and holly.",
        "If you have outdoor plants that already need trimming, like boxwood or arborvitae, you can upcycle their trimmings!",
        "Choose the bases.",
        "You can use short, sturdy decorative vases if they are able to hold water.",
        "Otherwise, place vessels of water inside of larger decorative bowls, pots or pedestals.",
        "For example, place tumbler glasses inside of pots or nestle small vases into the centers of ornament-filled bowls.",
        "Be creative!",
        "Use items you already have or buy containers to suit your tastes.",
        "Use soaking floral foam.",
        "Get foam blocks that are about as long as you want each tree to be tall.",
        "You may want to cut them down to size, into one rectangular block per tree.",
        "Saturate the foam completely.",
        "Trim each one with a knife, from a rectangle shape into a cone shape.",
        "Keep the tops of the blocks flat.",
        "The foam won’t show, so don’t worry about making the shape perfect.",
        "Push the trimmings into the foam.",
        "Start at the bottom and put the longest pieces in first.",
        "Continue all the way up, choosing smaller pieces as you get higher on the trees.",
        "Put one or a few plant pieces at the very tops.",
        "Keep scissors or wire cutters on hand and trim “branches” down wherever needed as you’re arranging.",
        "Fill in any gaps until the floral foam is fully concealed.",
        "Add decorations if desired.",
        "You can brighten up your trees with artificial berry branches, strings of brightly-colored or metallic beads, and light-weight ornaments.",
        "Another idea is to add small bows and/or miniature candy canes.",
        "Keep the trees watered.",
        "Check the floral foam every couple of days.",
        "Stick your finger in between the trimmings to feel the foam.",
        "If it isn’t moist, add a little water to the foam.",
        "Plan to water your trees every other day.",
        "Stacking Sugar Cookies into Tree Forms Get graduated size cookie cutters or plan to improvise.",
        "You can find graduated cookie cutters at most craft stores where the cake decorating supplies are, or purchase them online.",
        "Stars are a great choice because their corners mimic the ridges of pine trees.",
        "However, you can use other shapes such as circles instead.",
        "If you don’t have the time or desire to get graduated cutters, cut out freeform circles or stars in graduated sizes.",
        "For example, make cookies with diameters roughly two inches, one and a half inches, and one inch.",
        "The more imperfect the cuts are, the more abstract your tree will look.",
        "You can even make them wavy!",
        "Use your favorite recipe.",
        "Sugar cookie recipes are an ideal choice because they will be sturdy and take decoration well.",
        "However, you can use any cookie recipe you like: for example, you could use butter cookies, gingerbread cookies, or snickerdoodles.",
        "Alternately, if you don’t want to use homemade cookies, you can purchase cookies for this purpose at a grocery store or bakery.",
        "If you choose a butter cookie recipe, make sure the cookies will be thick enough to be sturdy in your cookie stacks.",
        "A good dough thickness is a quarter of an inch.",
        "Ice the cookies.",
        "Royal icing is a good choice since it will dry hard and maintain its shape.",
        "Smooth icing onto the surface of one of your largest-sized cookies.",
        "Build your stacks by working from the bottom up, placing smaller cookies on top of larger cookies.",
        "If you are using star shapes, arrange them so that the points of the star are shifted for every other layer.",
        "If you have frosting remaining, drizzle it onto the trees.",
        "Add decorations.",
        "Place a small cookie vertically on the top of your tree, securing it with icing.",
        "You can add sprinkles, colored sugar, or whatever edible decorations you like!",
        "For example, if you’re using star shapes, you can put a dome-shaped sprinkle where the points of the stars are.",
        "Try cinnamon-flavored crystals or sprinkles in red, green and metallic shades.",
        "Put the trees on display.",
        "Arrange them all on a single platter, or give them each their own decorative dish.",
        "Add “snow” on their dish(es) with paper doilies or by sprinkling powdered sugar around their bases.",
        "Making Crafty Artificial Trees Choose pedestals, if desired.",
        "You can use candle bases, wooden spools, or no pedestal at all, depending on your preference.",
        "The wooden spools will take a little longer and require the addition of wooden discs, such as those found in craft stores.",
        "However, the wooden spools make a neat effect stacked beneath the trees like trunks.",
        "Hot glue wooden spools together by gluing the top of one to the bottom of another.",
        "Repeat until you have the trunk height you desire.",
        "Glue the bottom spool to a wooden disk as a stand.",
        "Repeat this for each tree.",
        "Be careful when handling a hot glue gun, and follow the safety precautions that came with your glue gun.",
        "You can read more about glue gun safety at http://safety.ucanr.edu/files/3260.pdf.",
        "Arrange the bases.",
        "Get paper mache or Styrofoam cones.",
        "If you’re using wooden spools as pedestals, fit a wooden disc into or onto the bottom of the cone (depending if the cone is open- or closed-bottomed).",
        "Secure it in place with hot glue.",
        "Glue the end of the spool stacks to the discs on the bottoms of the cones.",
        "Add the main material.",
        "There are multiple materials you can pick from to make up the primary texture of your trees.",
        "You can apply ribbon, felt, or jingle bells to your cones.",
        "Cut any fabric material, as needed, and apply it to the cones using a hot glue gun.",
        "If you opt for ribbon or felt, glue a strip about two inches wide around the bottom of the base, and start your layers above that strip.",
        "Glue the layers on row by row, with the points of the fabric triangles facing down.",
        "Alternate where the downward points of the triangles overlap for each row.",
        "If using felt, try muted neutrals like gray, white, and beige balanced out with some baby blue or soft green.",
        "Cut felt into triangles one and a half inches long.",
        "Consider ribbon colors in silver, gold, red and green, or go with any color theme you like!",
        "Cut ribbon into pieces about two inches each.",
        "Create a clean point in each piece of ribbon by folding its corners on one end and gluing them down in the backs.",
        "Hot glue jingle bells with every other row shifted, as if they were making up a brick wall.",
        "Give them extra flair by spray painting the whole thing white, or with a glitter sealant!",
        "Place decorations on the treetops.",
        "The options are endless as to what you can put on top of your mini Christmas trees!",
        "You can hot glue Christmas bows, ornaments, pine cones, or whatever decorations you like onto the tops."
    ]
}