{
    "title": "How to Make Glitter Ornaments",
    "url": "https://www.wikihow.com/Make-Glitter-Ornaments",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Decoration Projects",
        "Glitter Projects"
    ],
    "methods": [
        {
            "name": "Making Basic Glitter Ornaments",
            "steps": [
                {
                    "headline": "Pull the cap off of a clear glass or plastic ornament.",
                    "description": "The ornament can be any shape or size you want, but it needs to be clear. Set the cap aside into a safe place where you won't lose it."
                },
                {
                    "headline": "Pour some floor polish or polycrylic into your ornament.",
                    "description": "Stick a funnel into the neck of the ornament. Pour a little bit of your floor polish into the ornament. If you want to make a half-glitter, half-clear ornament, use only a tiny amount of floor polish or polycrylic; a little bit goes a long way. Floor polish is the cheapest and easiest option, but the glitter may fall off over time. The ornament also won't be as sparkly as polycrylic. Polycrylic is trickier to use, but it offers a permanent hold and helps bring out the colors of the glitter. Can't find floor polish or polycrylic? Try a decoupage glue, such as Mod Podge. You will have to dilute it with some water to get creamy consistency like half-and-half."
                },
                {
                    "headline": "Swirl the ornament around to distribute the floor polish or polycrylic.",
                    "description": "You can coat the entire ornament, or you can partway to create a half-glitter, half-clear ornament. If you are creating a full-glitter ornament, make sure that there are no bare patches."
                },
                {
                    "headline": "Pour the excess liquid back into the container.",
                    "description": "Use the funnel again, if you need to. If you are doing a half-glitter, half-clear ornament, keep swirling it to distribute the floor polish or polyacrylic. You don't want it to pool at the bottom of your ornament, but if you pour it out, you might get streaks."
                },
                {
                    "headline": "Let the excess liquid drain out if you used polycrylic.",
                    "description": "Set the ornament upside down on a sheet of wax paper or aluminum foil. Leave it for 1 to 2 minutes so that the excess liquid can drain out. If you don't do this, the excess polycrylic will drip back into the ornament and pool at the bottom. If you used floor polish, you can skip this and move on to the next step. Be careful if you created a half-glitter, half-clear ornament. The liquid may create streaks on the clear part."
                },
                {
                    "headline": "Pour some glitter into the ornament.",
                    "description": "Wash your old funnel or get out a clean one. Stick it into the neck of the ornament. Pour some glitter into the ornament. Plan on using about a spoonful of glitter. You can use any type of glitter you want, but the extra-fine kind used in scrapbooking will work the best. Don't have another funnel? Roll some paper into a cone, and stick it into the neck of your ornament instead."
                },
                {
                    "headline": "Plug the ornament and shake it.",
                    "description": "Hold the ornament in your palm and cover the opening with your finger. Shake the ornament vigorously to distribute the glitter. If there are too many patches, you may need to add more glitter."
                },
                {
                    "headline": "Pour out the excess glitter.",
                    "description": "Turn the ornament upside down over the glitter container. Tap it gently to help knock out the excess glitter."
                },
                {
                    "headline": "Let the ornament dry before you put the cap back on.",
                    "description": "It will need at least 6 hours to dry, but it would be better if you left it overnight. Place the ornament upside down into a paper or plastic cup. Once the ornament is dry, you can pop the cap back onto it."
                },
                {
                    "headline": "Consider adding vinyl lettering.",
                    "description": "Use a Silhouette (or similar) machine to cut your initials or a Christmas greeting out of solid colored scrapbooking vinyl. Use transfer paper to transfer the letters to your ornament. You can use matte, glossy, or metallic scrapbooking vinyl. If you don't have a Silhouette-type machine, you can use the letters or words out using a craft blade. Be sure to cut through both the paper and vinyl."
                }
            ]
        },
        {
            "name": "Making Glitter Design Ornaments",
            "steps": [
                {
                    "headline": "Get some glass or plastic ornaments.",
                    "description": "Clear ornaments will work best for this project, but you can also use clear iridescent ones, shiny metallic ones, or frosted-pearl ones."
                },
                {
                    "headline": "Wipe the ornaments clean.",
                    "description": "This is especially important if you are using old ornaments. Once you clean them, try to handle them only by the metal cap. Any dirt or fingerprints may prevent the glitter from sticking."
                },
                {
                    "headline": "Block off the areas you don't want glittered with painter's tape.",
                    "description": "You can create stripes, zigzags, or other geometric shapes. If the tape is too thick to work with, cut it in half using a sharp pair of scissors. If you wish to make polka dots, you can skip this step. If you want to make more intricate shapes, use self-adhesive stencils."
                },
                {
                    "headline": "Coat the areas you want glittered with a decoupage glue.",
                    "description": "Handle the ornament by the cap so that you don't accidentally mess up your design. If your ornament is very large, it might be a good idea to work on a small area first so that the glue doesn't dry out. If you wish to make polka dots, use a round foam brush or pouncer to dab the glue onto the ornament. If you wish to use more than one color of glitter, apply the glue to the areas where you want your first color."
                },
                {
                    "headline": "Shake on some glitter.",
                    "description": "Hold the ornament over a paper plate or sheet of paper. Shake some glitter onto the ornament, rotating it will you do. You can use any type of glitter you want for this, but extra-find glitter, like the kind used in scrapbooking, would work best. If you plan on using multiple colors of glitter, shake on your first color and hold off on the others for now. Scoop the glitter back into its container when you are done so that you don't waste any. If you are using a sheet of paper, fold the paper in half, and funnel it back inside."
                },
                {
                    "headline": "Gently tap off the excess.",
                    "description": "Shake the ornament over your plate or paper to knock off any excess glitter. This will help give you crisper lines and reduce shedding."
                },
                {
                    "headline": "Add more glue and glitter, if needed.",
                    "description": "If you need to cover more of your ornament, or if you need to add more colors, now is the time to apply more glue and more glitter. Keep repeating these steps, one color at a time, until the ornament is covered to your liking."
                },
                {
                    "headline": "Remove the painter's tape or stencils, if you used any.",
                    "description": "Be sure to lift these straight up and away from the ornament, or you will risk messing up your design. If some of the lines got messed up, you can nudge the glitter back into place with a toothpick, or gently brush it away with a soft-bristled paintbrush."
                },
                {
                    "headline": "Hang the ornament until it dries.",
                    "description": "You can hang the ornament from your tree, a dowel, or a piece of string. Make sure that there's nothing close by that can bump into it and mess up the glitter. The ornament will require a few hours to dry."
                },
                {
                    "headline": "Seal the glittered designs, if desired.",
                    "description": "This is not completely necessary, but it will help protect your design. Use a paintbrush to paint clear, glossy sealer onto your designs. Extend the sealer just past the outlines of your designs—enough to seal them in but not so much to make it obvious. This is great for all ornaments, including matte ones! Make sure that the sealer you are using has a glossy finish, or the glitter will turn out dull. If you used a clear ornament, you can spray your entire ornament with a clear, glossy, acrylic sealer. Do not use this on matte ornaments."
                },
                {
                    "headline": "Let the sealer dry before using your ornament.",
                    "description": "If you'd like to, you can tie a skinny ribbon in a bow around the cap, or you can add extras into the ornament itself, such as curled strips of sheet music or fake snow."
                }
            ]
        }
    ],
    "tyn": [
        "Basic Glitter Ornaments",
        "Clear glass or plastic ornaments",
        "Extra-fine glitter",
        "Funnels",
        "Decoupage, floor polish, or polycrylic",
        "Paper or plastic cups",
        "Glitter Design Ornaments",
        "Glass or plastic ornaments",
        "Decoupage or Mod Podge",
        "Foam brush or pouncer",
        "Painter's tape or stencils (optional)",
        "Clear acrylic sealer (optional)"
    ],
    "text": " Making Basic Glitter Ornaments Pull the cap off of a clear glass or plastic ornament. The ornament can be any shape or size you want, but it needs to be clear. Set the cap aside into a safe place where you won't lose it. Pour some floor polish or polycrylic into your ornament. Stick a funnel into the neck of the ornament. Pour a little bit of your floor polish into the ornament. If you want to make a half-glitter, half-clear ornament, use only a tiny amount of floor polish or polycrylic; a little bit goes a long way. Floor polish is the cheapest and easiest option, but the glitter may fall off over time. The ornament also won't be as sparkly as polycrylic. Polycrylic is trickier to use, but it offers a permanent hold and helps bring out the colors of the glitter. Can't find floor polish or polycrylic? Try a decoupage glue, such as Mod Podge. You will have to dilute it with some water to get creamy consistency like half-and-half. Swirl the ornament around to distribute the floor polish or polycrylic. You can coat the entire ornament, or you can partway to create a half-glitter, half-clear ornament. If you are creating a full-glitter ornament, make sure that there are no bare patches. Pour the excess liquid back into the container. Use the funnel again, if you need to. If you are doing a half-glitter, half-clear ornament, keep swirling it to distribute the floor polish or polyacrylic. You don't want it to pool at the bottom of your ornament, but if you pour it out, you might get streaks. Let the excess liquid drain out if you used polycrylic. Set the ornament upside down on a sheet of wax paper or aluminum foil. Leave it for 1 to 2 minutes so that the excess liquid can drain out. If you don't do this, the excess polycrylic will drip back into the ornament and pool at the bottom. If you used floor polish, you can skip this and move on to the next step. Be careful if you created a half-glitter, half-clear ornament. The liquid may create streaks on the clear part. Pour some glitter into the ornament. Wash your old funnel or get out a clean one. Stick it into the neck of the ornament. Pour some glitter into the ornament. Plan on using about a spoonful of glitter. You can use any type of glitter you want, but the extra-fine kind used in scrapbooking will work the best. Don't have another funnel? Roll some paper into a cone, and stick it into the neck of your ornament instead. Plug the ornament and shake it. Hold the ornament in your palm and cover the opening with your finger. Shake the ornament vigorously to distribute the glitter. If there are too many patches, you may need to add more glitter. Pour out the excess glitter. Turn the ornament upside down over the glitter container. Tap it gently to help knock out the excess glitter. Let the ornament dry before you put the cap back on. It will need at least 6 hours to dry, but it would be better if you left it overnight. Place the ornament upside down into a paper or plastic cup. Once the ornament is dry, you can pop the cap back onto it. Consider adding vinyl lettering. Use a Silhouette (or similar) machine to cut your initials or a Christmas greeting out of solid colored scrapbooking vinyl. Use transfer paper to transfer the letters to your ornament. You can use matte, glossy, or metallic scrapbooking vinyl. If you don't have a Silhouette-type machine, you can use the letters or words out using a craft blade. Be sure to cut through both the paper and vinyl. Making Glitter Design Ornaments Get some glass or plastic ornaments. Clear ornaments will work best for this project, but you can also use clear iridescent ones, shiny metallic ones, or frosted-pearl ones. Wipe the ornaments clean. This is especially important if you are using old ornaments. Once you clean them, try to handle them only by the metal cap. Any dirt or fingerprints may prevent the glitter from sticking. Block off the areas you don't want glittered with painter's tape. You can create stripes, zigzags, or other geometric shapes. If the tape is too thick to work with, cut it in half using a sharp pair of scissors. If you wish to make polka dots, you can skip this step. If you want to make more intricate shapes, use self-adhesive stencils. Coat the areas you want glittered with a decoupage glue. Handle the ornament by the cap so that you don't accidentally mess up your design. If your ornament is very large, it might be a good idea to work on a small area first so that the glue doesn't dry out. If you wish to make polka dots, use a round foam brush or pouncer to dab the glue onto the ornament. If you wish to use more than one color of glitter, apply the glue to the areas where you want your first color. Shake on some glitter. Hold the ornament over a paper plate or sheet of paper. Shake some glitter onto the ornament, rotating it will you do. You can use any type of glitter you want for this, but extra-find glitter, like the kind used in scrapbooking, would work best. If you plan on using multiple colors of glitter, shake on your first color and hold off on the others for now. Scoop the glitter back into its container when you are done so that you don't waste any. If you are using a sheet of paper, fold the paper in half, and funnel it back inside. Gently tap off the excess. Shake the ornament over your plate or paper to knock off any excess glitter. This will help give you crisper lines and reduce shedding. Add more glue and glitter, if needed. If you need to cover more of your ornament, or if you need to add more colors, now is the time to apply more glue and more glitter. Keep repeating these steps, one color at a time, until the ornament is covered to your liking. Remove the painter's tape or stencils, if you used any. Be sure to lift these straight up and away from the ornament, or you will risk messing up your design. If some of the lines got messed up, you can nudge the glitter back into place with a toothpick, or gently brush it away with a soft-bristled paintbrush. Hang the ornament until it dries. You can hang the ornament from your tree, a dowel, or a piece of string. Make sure that there's nothing close by that can bump into it and mess up the glitter. The ornament will require a few hours to dry. Seal the glittered designs, if desired. This is not completely necessary, but it will help protect your design. Use a paintbrush to paint clear, glossy sealer onto your designs. Extend the sealer just past the outlines of your designs—enough to seal them in but not so much to make it obvious. This is great for all ornaments, including matte ones! Make sure that the sealer you are using has a glossy finish, or the glitter will turn out dull. If you used a clear ornament, you can spray your entire ornament with a clear, glossy, acrylic sealer. Do not use this on matte ornaments. Let the sealer dry before using your ornament. If you'd like to, you can tie a skinny ribbon in a bow around the cap, or you can add extras into the ornament itself, such as curled strips of sheet music or fake snow.",
    "sentences": [
        " Making Basic Glitter Ornaments Pull the cap off of a clear glass or plastic ornament.",
        "The ornament can be any shape or size you want, but it needs to be clear.",
        "Set the cap aside into a safe place where you won't lose it.",
        "Pour some floor polish or polycrylic into your ornament.",
        "Stick a funnel into the neck of the ornament.",
        "Pour a little bit of your floor polish into the ornament.",
        "If you want to make a half-glitter, half-clear ornament, use only a tiny amount of floor polish or polycrylic; a little bit goes a long way.",
        "Floor polish is the cheapest and easiest option, but the glitter may fall off over time.",
        "The ornament also won't be as sparkly as polycrylic.",
        "Polycrylic is trickier to use, but it offers a permanent hold and helps bring out the colors of the glitter.",
        "Can't find floor polish or polycrylic?",
        "Try a decoupage glue, such as Mod Podge.",
        "You will have to dilute it with some water to get creamy consistency like half-and-half.",
        "Swirl the ornament around to distribute the floor polish or polycrylic.",
        "You can coat the entire ornament, or you can partway to create a half-glitter, half-clear ornament.",
        "If you are creating a full-glitter ornament, make sure that there are no bare patches.",
        "Pour the excess liquid back into the container.",
        "Use the funnel again, if you need to.",
        "If you are doing a half-glitter, half-clear ornament, keep swirling it to distribute the floor polish or polyacrylic.",
        "You don't want it to pool at the bottom of your ornament, but if you pour it out, you might get streaks.",
        "Let the excess liquid drain out if you used polycrylic.",
        "Set the ornament upside down on a sheet of wax paper or aluminum foil.",
        "Leave it for 1 to 2 minutes so that the excess liquid can drain out.",
        "If you don't do this, the excess polycrylic will drip back into the ornament and pool at the bottom.",
        "If you used floor polish, you can skip this and move on to the next step.",
        "Be careful if you created a half-glitter, half-clear ornament.",
        "The liquid may create streaks on the clear part.",
        "Pour some glitter into the ornament.",
        "Wash your old funnel or get out a clean one.",
        "Stick it into the neck of the ornament.",
        "Pour some glitter into the ornament.",
        "Plan on using about a spoonful of glitter.",
        "You can use any type of glitter you want, but the extra-fine kind used in scrapbooking will work the best.",
        "Don't have another funnel?",
        "Roll some paper into a cone, and stick it into the neck of your ornament instead.",
        "Plug the ornament and shake it.",
        "Hold the ornament in your palm and cover the opening with your finger.",
        "Shake the ornament vigorously to distribute the glitter.",
        "If there are too many patches, you may need to add more glitter.",
        "Pour out the excess glitter.",
        "Turn the ornament upside down over the glitter container.",
        "Tap it gently to help knock out the excess glitter.",
        "Let the ornament dry before you put the cap back on.",
        "It will need at least 6 hours to dry, but it would be better if you left it overnight.",
        "Place the ornament upside down into a paper or plastic cup.",
        "Once the ornament is dry, you can pop the cap back onto it.",
        "Consider adding vinyl lettering.",
        "Use a Silhouette (or similar) machine to cut your initials or a Christmas greeting out of solid colored scrapbooking vinyl.",
        "Use transfer paper to transfer the letters to your ornament.",
        "You can use matte, glossy, or metallic scrapbooking vinyl.",
        "If you don't have a Silhouette-type machine, you can use the letters or words out using a craft blade.",
        "Be sure to cut through both the paper and vinyl.",
        "Making Glitter Design Ornaments Get some glass or plastic ornaments.",
        "Clear ornaments will work best for this project, but you can also use clear iridescent ones, shiny metallic ones, or frosted-pearl ones.",
        "Wipe the ornaments clean.",
        "This is especially important if you are using old ornaments.",
        "Once you clean them, try to handle them only by the metal cap.",
        "Any dirt or fingerprints may prevent the glitter from sticking.",
        "Block off the areas you don't want glittered with painter's tape.",
        "You can create stripes, zigzags, or other geometric shapes.",
        "If the tape is too thick to work with, cut it in half using a sharp pair of scissors.",
        "If you wish to make polka dots, you can skip this step.",
        "If you want to make more intricate shapes, use self-adhesive stencils.",
        "Coat the areas you want glittered with a decoupage glue.",
        "Handle the ornament by the cap so that you don't accidentally mess up your design.",
        "If your ornament is very large, it might be a good idea to work on a small area first so that the glue doesn't dry out.",
        "If you wish to make polka dots, use a round foam brush or pouncer to dab the glue onto the ornament.",
        "If you wish to use more than one color of glitter, apply the glue to the areas where you want your first color.",
        "Shake on some glitter.",
        "Hold the ornament over a paper plate or sheet of paper.",
        "Shake some glitter onto the ornament, rotating it will you do.",
        "You can use any type of glitter you want for this, but extra-find glitter, like the kind used in scrapbooking, would work best.",
        "If you plan on using multiple colors of glitter, shake on your first color and hold off on the others for now.",
        "Scoop the glitter back into its container when you are done so that you don't waste any.",
        "If you are using a sheet of paper, fold the paper in half, and funnel it back inside.",
        "Gently tap off the excess.",
        "Shake the ornament over your plate or paper to knock off any excess glitter.",
        "This will help give you crisper lines and reduce shedding.",
        "Add more glue and glitter, if needed.",
        "If you need to cover more of your ornament, or if you need to add more colors, now is the time to apply more glue and more glitter.",
        "Keep repeating these steps, one color at a time, until the ornament is covered to your liking.",
        "Remove the painter's tape or stencils, if you used any.",
        "Be sure to lift these straight up and away from the ornament, or you will risk messing up your design.",
        "If some of the lines got messed up, you can nudge the glitter back into place with a toothpick, or gently brush it away with a soft-bristled paintbrush.",
        "Hang the ornament until it dries.",
        "You can hang the ornament from your tree, a dowel, or a piece of string.",
        "Make sure that there's nothing close by that can bump into it and mess up the glitter.",
        "The ornament will require a few hours to dry.",
        "Seal the glittered designs, if desired.",
        "This is not completely necessary, but it will help protect your design.",
        "Use a paintbrush to paint clear, glossy sealer onto your designs.",
        "Extend the sealer just past the outlines of your designs—enough to seal them in but not so much to make it obvious.",
        "This is great for all ornaments, including matte ones!",
        "Make sure that the sealer you are using has a glossy finish, or the glitter will turn out dull.",
        "If you used a clear ornament, you can spray your entire ornament with a clear, glossy, acrylic sealer.",
        "Do not use this on matte ornaments.",
        "Let the sealer dry before using your ornament.",
        "If you'd like to, you can tie a skinny ribbon in a bow around the cap, or you can add extras into the ornament itself, such as curled strips of sheet music or fake snow."
    ]
}