{
    "title": "How to Make a Skinny Latte",
    "url": "https://www.wikihow.com/Make-a-Skinny-Latte",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Coffee",
        "Espresso Based Coffee",
        "Latte"
    ],
    "methods": [
        {
            "name": "Skinny Latte with a Moka Pot and Frothing Wand",
            "steps": [
                {
                    "headline": "Fill the moka pot with water.",
                    "description": "The bottom portion of the moka pot is the water tank. Unscrew it from the top portion, and add 2 cups (474 ml) of fresh, cold water to it. Most moka pots have a fill lines that indicate how much water to add based on how much espresso you want to make. Consult the instruction manual for your pot to see if there are guidelines if you want to adjust the amount."
                },
                {
                    "headline": "Add the coffee grounds to filter.",
                    "description": "Place the filter portion of the pot over the water tank. Fill the filter with 2 ½ tablespoons (16 g) of espresso grind ground coffee. Don't press the coffee down, but you can smooth it with a spoon to ensure that none of the grounds spill out of the filter. You can use pre-ground coffee or grind your own beans, depending on your preference. Depending on the coffee that you use, you may want to adjust the amount of grounds that you use. Experiment to determine the best amount for the flavor that you like."
                },
                {
                    "headline": "Close the pot and place on the stove to brew.",
                    "description": "Once you've added the ground coffee, place the top on the pot. Set it on your stove, and turn the burner to high. The coffee will need to brew for 5 to 10 minutes -- you'll know that it's finished when the pot makes a loud gurgling sound. If you have a gas stove, you may not need to use high heat. Experiment with the settings to determine what works best. If you have an induction stove, you'll need a specialty moka pot."
                },
                {
                    "headline": "Pour some milk into a frothing pitcher and heat it.",
                    "description": "While your coffee is brewing, add ½ cup (118 ml) of skim milk to a frothing pitcher. Heat the pitcher on the stove on medium for 3 to 5 minutes to steam it. Use an instant read thermometer to monitor the temperature of the milk so you know when to froth it. It should be between 130 and 150 degrees Fahrenheit (54 to 66 degrees Celsius). Skim milk is the best option if you want a skinny latte. However, 1% or 2% milk can also work. Just be aware that the latte will just have more fat and calories. You can use non-dairy milk for the latte as well."
                },
                {
                    "headline": "Use a frothing wand to create foam in the milk.",
                    "description": "When the milk is warm enough, submerge the whisk portion of a frothing wand completely in the pitcher. Turn it on low and gently move it around the milk, keeping it fully submerged. After 5 to 10 seconds, increase the speed to high and move the wand up so it's just beneath the surface of the milk to create more foam. Foam made this way tends to dissipate as you drink your latte, so if you want it to last, make a little more than you'll think you need."
                },
                {
                    "headline": "Transfer the espresso to a cup and add the milk slowly.",
                    "description": "Once the espresso is finished brewing, pour it into a large coffee up. Slowly add the milk to the top of it. Use a spoon to keep the foam from flowing into the cup with the milk. You can add as much steamed milk to the espresso as you like. You may need to experiment to see how much provides the best flavor for your latte."
                },
                {
                    "headline": "Spoon some foam on top of the latte.",
                    "description": "When the espresso and steamed milk are mixed, use the spoon to gently place some of the foamed milk on top. Handle the foam gently because it can easily fall apart. You can add as much milk to the espresso as you’d like. However, if your drink has a greater percentage of foamed milk to steamed milk, it is technically a cappuccino, not a latte."
                }
            ]
        },
        {
            "name": "Preparing a Basic Skinny Latte With Limited Equipment",
            "steps": [
                {
                    "headline": "Pour the milk into a jar and shake it.",
                    "description": "Add ½ cup (118 ml) of non-fat milk to a jar that has a lid. Close the lid, and shake the jar vigorously until the milk becomes frothy and doubles in volume, which should take approximately 30 to 60 seconds. Make sure that the lid is on the jar tightly before you shake it so you don’t wind up spilling milk all over your kitchen."
                },
                {
                    "headline": "Microwave the milk.",
                    "description": "Once the milk is frothy, remove the lid from the jar and place it in the microwave. Heat it on high for 30 seconds. In addition to warming the milk, the heat from the microwave helps stabilize the foam."
                },
                {
                    "headline": "Combine the espresso and milk in a mug.",
                    "description": "Fill a wide, shallow coffee mug with approximately 1 cup (237 ml) of hot espresso. Pour as much of the milk into the espresso as you’d like, using a large spoon to hold back the foam. Lattes are traditionally made with espresso, but if you don’t have an espresso machine or moka pot, you can make an extremely strong cup of regular coffee to use."
                },
                {
                    "headline": "Add as much milk foam as desired.",
                    "description": "Once the espresso and milk are combined, use the spoon to add some of the milk foam to the top of the latte. You can also garnish it with ground cinnamon or nutmeg for added flavor."
                }
            ]
        },
        {
            "name": "Whipping Up a Skinny Flavored Latte",
            "steps": [
                {
                    "headline": "Microwave the milk.",
                    "description": "Pour ½ cup (118 ml) of skim milk into a microwave-safe mug or bowl. Place the milk in the microwave, and heat on high for 30 seconds to steam it. You can substitute your favorite non-dairy milk for the skim if you prefer."
                },
                {
                    "headline": "Combine the hot espresso, milk, and syrup.",
                    "description": "Once the milk is steamed, add it to a large bowl along with 1 cup (237 ml) of hot espresso and ½ tablespoon (7 ½ ml) of syrup in your choice of flavor. Mix gently until the ingredients are just combined. You can use any kind of syrup that you like to flavor your latte. Caramel and maple are two tasty options, but you can purchase coffee flavoring syrups in a wide range of flavors, such as hazelnut, brown sugar, cinnamon, and coconut. To keep the calories down in your latte, it’s best to use a sugar-free syrup."
                },
                {
                    "headline": "Blend the espresso mixture to create foam.",
                    "description": "When all of the ingredients are combined, use an immersion blender or a handheld electric mixer to blend the mixture on low. Continue blending until there is quite a bit of foam."
                },
                {
                    "headline": "Pour the mixture into a mug and add some foam.",
                    "description": "Once you’ve finished blending the espresso mixture, transfer it to a large mug. Use a spoon to hold back the foam as you’re pouring. After you’ve filled the mug, add as much or as little of the foam to the top as you’d like. If you prefer, you can allow the foam to pour into the mug as you fill it. However, you won’t be able to control how much is in your latte."
                },
                {
                    "headline": "Garnish the latte with more syrup if desired.",
                    "description": "After you’ve topped the latte with the foam, you can add more of the flavored syrup. Add up to ½ tablespoon (7 ½ ml) over the foam to increase the flavor. You can squeeze the syrup in stripes, zig zags, or even a swirl over the top of the latte to give it a more decorative look."
                }
            ]
        },
        {
            "name": "Mixing Up a Skinny Mocha Latte",
            "steps": [
                {
                    "headline": "Combine the hot espresso and hot chocolate powder.",
                    "description": "Add approximately 1 cup (237 ml) of hot espresso to a large mug with 2 tablespoons (16 g) of sugar-free hot chocolate mix. Mix the two together until they’re well blended. You can substitute chocolate syrup for the hot chocolate mix, but a powdered mix usually works best."
                },
                {
                    "headline": "Heat the milk on the stove.",
                    "description": "Pour ½ cup (118 ml) of skim milk into a small saucepan, and set it on the stove. Turn the heat to low, and allow the milk to heat for approximately 1 minute to steam it lightly. Whisk the milk constantly as you warm it to help make it frothy and create foam. Be careful not to heat the milk too long. It can burn easily."
                },
                {
                    "headline": "Pour the milk into the espresso.",
                    "description": "After you’ve warmed the milk, add it to the espresso and chocolate mixture. You can add as much or as little as you’d like."
                },
                {
                    "headline": "Garnish the latte if desired.",
                    "description": "You can add whipped cream to the top of your latte or sprinkle it with shaved chocolate. Cocoa powder, ground cinnamon, or ground nutmeg are also ideal toppings. Keep in mind that any toppings that you add to the latte will make it less “skinny.” If you want to keep the calories and fat down in your beverage, it’s best to keep the toppings simple."
                }
            ]
        }
    ],
    "tyn": [
        "Basic Skinny Latte",
        "Jar with a lid",
        "Microwave",
        "Large coffee mug",
        "Spoon",
        "Flavored Skinny Latte",
        "Large microwave-safe bowl",
        "Immersion blender or handheld electric mixer",
        "Large mug",
        "Skinny Mocha Latte",
        "Small saucepan",
        "Whisk"
    ],
    "text": " Skinny Latte with a Moka Pot and Frothing Wand Fill the moka pot with water. The bottom portion of the moka pot is the water tank. Unscrew it from the top portion, and add 2 cups (474 ml) of fresh, cold water to it. Most moka pots have a fill lines that indicate how much water to add based on how much espresso you want to make. Consult the instruction manual for your pot to see if there are guidelines if you want to adjust the amount. Add the coffee grounds to filter. Place the filter portion of the pot over the water tank. Fill the filter with 2 ½ tablespoons (16 g) of espresso grind ground coffee. Don't press the coffee down, but you can smooth it with a spoon to ensure that none of the grounds spill out of the filter. You can use pre-ground coffee or grind your own beans, depending on your preference. Depending on the coffee that you use, you may want to adjust the amount of grounds that you use. Experiment to determine the best amount for the flavor that you like. Close the pot and place on the stove to brew. Once you've added the ground coffee, place the top on the pot. Set it on your stove, and turn the burner to high. The coffee will need to brew for 5 to 10 minutes -- you'll know that it's finished when the pot makes a loud gurgling sound. If you have a gas stove, you may not need to use high heat. Experiment with the settings to determine what works best. If you have an induction stove, you'll need a specialty moka pot. Pour some milk into a frothing pitcher and heat it. While your coffee is brewing, add ½ cup (118 ml) of skim milk to a frothing pitcher. Heat the pitcher on the stove on medium for 3 to 5 minutes to steam it. Use an instant read thermometer to monitor the temperature of the milk so you know when to froth it. It should be between 130 and 150 degrees Fahrenheit (54 to 66 degrees Celsius). Skim milk is the best option if you want a skinny latte. However, 1% or 2% milk can also work. Just be aware that the latte will just have more fat and calories. You can use non-dairy milk for the latte as well. Use a frothing wand to create foam in the milk. When the milk is warm enough, submerge the whisk portion of a frothing wand completely in the pitcher. Turn it on low and gently move it around the milk, keeping it fully submerged. After 5 to 10 seconds, increase the speed to high and move the wand up so it's just beneath the surface of the milk to create more foam. Foam made this way tends to dissipate as you drink your latte, so if you want it to last, make a little more than you'll think you need. Transfer the espresso to a cup and add the milk slowly. Once the espresso is finished brewing, pour it into a large coffee up. Slowly add the milk to the top of it. Use a spoon to keep the foam from flowing into the cup with the milk. You can add as much steamed milk to the espresso as you like. You may need to experiment to see how much provides the best flavor for your latte. Spoon some foam on top of the latte. When the espresso and steamed milk are mixed, use the spoon to gently place some of the foamed milk on top. Handle the foam gently because it can easily fall apart. You can add as much milk to the espresso as you’d like. However, if your drink has a greater percentage of foamed milk to steamed milk, it is technically a cappuccino, not a latte. Preparing a Basic Skinny Latte With Limited Equipment Pour the milk into a jar and shake it. Add ½ cup (118 ml) of non-fat milk to a jar that has a lid. Close the lid, and shake the jar vigorously until the milk becomes frothy and doubles in volume, which should take approximately 30 to 60 seconds. Make sure that the lid is on the jar tightly before you shake it so you don’t wind up spilling milk all over your kitchen. Microwave the milk. Once the milk is frothy, remove the lid from the jar and place it in the microwave. Heat it on high for 30 seconds. In addition to warming the milk, the heat from the microwave helps stabilize the foam. Combine the espresso and milk in a mug. Fill a wide, shallow coffee mug with approximately 1 cup (237 ml) of hot espresso. Pour as much of the milk into the espresso as you’d like, using a large spoon to hold back the foam. Lattes are traditionally made with espresso, but if you don’t have an espresso machine or moka pot, you can make an extremely strong cup of regular coffee to use. Add as much milk foam as desired. Once the espresso and milk are combined, use the spoon to add some of the milk foam to the top of the latte. You can also garnish it with ground cinnamon or nutmeg for added flavor. Whipping Up a Skinny Flavored Latte Microwave the milk. Pour ½ cup (118 ml) of skim milk into a microwave-safe mug or bowl. Place the milk in the microwave, and heat on high for 30 seconds to steam it. You can substitute your favorite non-dairy milk for the skim if you prefer. Combine the hot espresso, milk, and syrup. Once the milk is steamed, add it to a large bowl along with 1 cup (237 ml) of hot espresso and ½ tablespoon (7 ½ ml) of syrup in your choice of flavor. Mix gently until the ingredients are just combined. You can use any kind of syrup that you like to flavor your latte. Caramel and maple are two tasty options, but you can purchase coffee flavoring syrups in a wide range of flavors, such as hazelnut, brown sugar, cinnamon, and coconut. To keep the calories down in your latte, it’s best to use a sugar-free syrup. Blend the espresso mixture to create foam. When all of the ingredients are combined, use an immersion blender or a handheld electric mixer to blend the mixture on low. Continue blending until there is quite a bit of foam. Pour the mixture into a mug and add some foam. Once you’ve finished blending the espresso mixture, transfer it to a large mug. Use a spoon to hold back the foam as you’re pouring. After you’ve filled the mug, add as much or as little of the foam to the top as you’d like. If you prefer, you can allow the foam to pour into the mug as you fill it. However, you won’t be able to control how much is in your latte. Garnish the latte with more syrup if desired. After you’ve topped the latte with the foam, you can add more of the flavored syrup. Add up to ½ tablespoon (7 ½ ml) over the foam to increase the flavor. You can squeeze the syrup in stripes, zig zags, or even a swirl over the top of the latte to give it a more decorative look. Mixing Up a Skinny Mocha Latte Combine the hot espresso and hot chocolate powder. Add approximately 1 cup (237 ml) of hot espresso to a large mug with 2 tablespoons (16 g) of sugar-free hot chocolate mix. Mix the two together until they’re well blended. You can substitute chocolate syrup for the hot chocolate mix, but a powdered mix usually works best. Heat the milk on the stove. Pour ½ cup (118 ml) of skim milk into a small saucepan, and set it on the stove. Turn the heat to low, and allow the milk to heat for approximately 1 minute to steam it lightly. Whisk the milk constantly as you warm it to help make it frothy and create foam. Be careful not to heat the milk too long. It can burn easily. Pour the milk into the espresso. After you’ve warmed the milk, add it to the espresso and chocolate mixture. You can add as much or as little as you’d like. Garnish the latte if desired. You can add whipped cream to the top of your latte or sprinkle it with shaved chocolate. Cocoa powder, ground cinnamon, or ground nutmeg are also ideal toppings. Keep in mind that any toppings that you add to the latte will make it less “skinny.” If you want to keep the calories and fat down in your beverage, it’s best to keep the toppings simple.",
    "sentences": [
        " Skinny Latte with a Moka Pot and Frothing Wand Fill the moka pot with water.",
        "The bottom portion of the moka pot is the water tank.",
        "Unscrew it from the top portion, and add 2 cups (474 ml) of fresh, cold water to it.",
        "Most moka pots have a fill lines that indicate how much water to add based on how much espresso you want to make.",
        "Consult the instruction manual for your pot to see if there are guidelines if you want to adjust the amount.",
        "Add the coffee grounds to filter.",
        "Place the filter portion of the pot over the water tank.",
        "Fill the filter with 2 ½ tablespoons (16 g) of espresso grind ground coffee.",
        "Don't press the coffee down, but you can smooth it with a spoon to ensure that none of the grounds spill out of the filter.",
        "You can use pre-ground coffee or grind your own beans, depending on your preference.",
        "Depending on the coffee that you use, you may want to adjust the amount of grounds that you use.",
        "Experiment to determine the best amount for the flavor that you like.",
        "Close the pot and place on the stove to brew.",
        "Once you've added the ground coffee, place the top on the pot.",
        "Set it on your stove, and turn the burner to high.",
        "The coffee will need to brew for 5 to 10 minutes -- you'll know that it's finished when the pot makes a loud gurgling sound.",
        "If you have a gas stove, you may not need to use high heat.",
        "Experiment with the settings to determine what works best.",
        "If you have an induction stove, you'll need a specialty moka pot.",
        "Pour some milk into a frothing pitcher and heat it.",
        "While your coffee is brewing, add ½ cup (118 ml) of skim milk to a frothing pitcher.",
        "Heat the pitcher on the stove on medium for 3 to 5 minutes to steam it.",
        "Use an instant read thermometer to monitor the temperature of the milk so you know when to froth it.",
        "It should be between 130 and 150 degrees Fahrenheit (54 to 66 degrees Celsius).",
        "Skim milk is the best option if you want a skinny latte.",
        "However, 1% or 2% milk can also work.",
        "Just be aware that the latte will just have more fat and calories.",
        "You can use non-dairy milk for the latte as well.",
        "Use a frothing wand to create foam in the milk.",
        "When the milk is warm enough, submerge the whisk portion of a frothing wand completely in the pitcher.",
        "Turn it on low and gently move it around the milk, keeping it fully submerged.",
        "After 5 to 10 seconds, increase the speed to high and move the wand up so it's just beneath the surface of the milk to create more foam.",
        "Foam made this way tends to dissipate as you drink your latte, so if you want it to last, make a little more than you'll think you need.",
        "Transfer the espresso to a cup and add the milk slowly.",
        "Once the espresso is finished brewing, pour it into a large coffee up.",
        "Slowly add the milk to the top of it.",
        "Use a spoon to keep the foam from flowing into the cup with the milk.",
        "You can add as much steamed milk to the espresso as you like.",
        "You may need to experiment to see how much provides the best flavor for your latte.",
        "Spoon some foam on top of the latte.",
        "When the espresso and steamed milk are mixed, use the spoon to gently place some of the foamed milk on top.",
        "Handle the foam gently because it can easily fall apart.",
        "You can add as much milk to the espresso as you’d like.",
        "However, if your drink has a greater percentage of foamed milk to steamed milk, it is technically a cappuccino, not a latte.",
        "Preparing a Basic Skinny Latte With Limited Equipment Pour the milk into a jar and shake it.",
        "Add ½ cup (118 ml) of non-fat milk to a jar that has a lid.",
        "Close the lid, and shake the jar vigorously until the milk becomes frothy and doubles in volume, which should take approximately 30 to 60 seconds.",
        "Make sure that the lid is on the jar tightly before you shake it so you don’t wind up spilling milk all over your kitchen.",
        "Microwave the milk.",
        "Once the milk is frothy, remove the lid from the jar and place it in the microwave.",
        "Heat it on high for 30 seconds.",
        "In addition to warming the milk, the heat from the microwave helps stabilize the foam.",
        "Combine the espresso and milk in a mug.",
        "Fill a wide, shallow coffee mug with approximately 1 cup (237 ml) of hot espresso.",
        "Pour as much of the milk into the espresso as you’d like, using a large spoon to hold back the foam.",
        "Lattes are traditionally made with espresso, but if you don’t have an espresso machine or moka pot, you can make an extremely strong cup of regular coffee to use.",
        "Add as much milk foam as desired.",
        "Once the espresso and milk are combined, use the spoon to add some of the milk foam to the top of the latte.",
        "You can also garnish it with ground cinnamon or nutmeg for added flavor.",
        "Whipping Up a Skinny Flavored Latte Microwave the milk.",
        "Pour ½ cup (118 ml) of skim milk into a microwave-safe mug or bowl.",
        "Place the milk in the microwave, and heat on high for 30 seconds to steam it.",
        "You can substitute your favorite non-dairy milk for the skim if you prefer.",
        "Combine the hot espresso, milk, and syrup.",
        "Once the milk is steamed, add it to a large bowl along with 1 cup (237 ml) of hot espresso and ½ tablespoon (7 ½ ml) of syrup in your choice of flavor.",
        "Mix gently until the ingredients are just combined.",
        "You can use any kind of syrup that you like to flavor your latte.",
        "Caramel and maple are two tasty options, but you can purchase coffee flavoring syrups in a wide range of flavors, such as hazelnut, brown sugar, cinnamon, and coconut.",
        "To keep the calories down in your latte, it’s best to use a sugar-free syrup.",
        "Blend the espresso mixture to create foam.",
        "When all of the ingredients are combined, use an immersion blender or a handheld electric mixer to blend the mixture on low.",
        "Continue blending until there is quite a bit of foam.",
        "Pour the mixture into a mug and add some foam.",
        "Once you’ve finished blending the espresso mixture, transfer it to a large mug.",
        "Use a spoon to hold back the foam as you’re pouring.",
        "After you’ve filled the mug, add as much or as little of the foam to the top as you’d like.",
        "If you prefer, you can allow the foam to pour into the mug as you fill it.",
        "However, you won’t be able to control how much is in your latte.",
        "Garnish the latte with more syrup if desired.",
        "After you’ve topped the latte with the foam, you can add more of the flavored syrup.",
        "Add up to ½ tablespoon (7 ½ ml) over the foam to increase the flavor.",
        "You can squeeze the syrup in stripes, zig zags, or even a swirl over the top of the latte to give it a more decorative look.",
        "Mixing Up a Skinny Mocha Latte Combine the hot espresso and hot chocolate powder.",
        "Add approximately 1 cup (237 ml) of hot espresso to a large mug with 2 tablespoons (16 g) of sugar-free hot chocolate mix.",
        "Mix the two together until they’re well blended.",
        "You can substitute chocolate syrup for the hot chocolate mix, but a powdered mix usually works best.",
        "Heat the milk on the stove.",
        "Pour ½ cup (118 ml) of skim milk into a small saucepan, and set it on the stove.",
        "Turn the heat to low, and allow the milk to heat for approximately 1 minute to steam it lightly.",
        "Whisk the milk constantly as you warm it to help make it frothy and create foam.",
        "Be careful not to heat the milk too long.",
        "It can burn easily.",
        "Pour the milk into the espresso.",
        "After you’ve warmed the milk, add it to the espresso and chocolate mixture.",
        "You can add as much or as little as you’d like.",
        "Garnish the latte if desired.",
        "You can add whipped cream to the top of your latte or sprinkle it with shaved chocolate.",
        "Cocoa powder, ground cinnamon, or ground nutmeg are also ideal toppings.",
        "Keep in mind that any toppings that you add to the latte will make it less “skinny.” If you want to keep the calories and fat down in your beverage, it’s best to keep the toppings simple."
    ]
}