{
    "title": "How to Use Leftover Eggnog",
    "url": "https://www.wikihow.com/Use-Leftover-Eggnog",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Christmas"
    ],
    "methods": [
        {
            "name": "Using Eggnog with Coffee",
            "steps": [
                {
                    "headline": "Brew a cup of coffee.",
                    "description": "Use your favorite type of coffee to make a 20 ounce (591 ml) cup. You can use a traditional coffee machine, a single-serve coffee machine, a French press, or even an instant type that you simply mix with hot water. It’s best to use unflavored coffee to allow the eggnog flavor stand out, though. If you want to use a flavored coffee, be sure that it’s a flavor that will complement the eggnog. French vanilla, gingerbread, or cinnamon are good options."
                },
                {
                    "headline": "Mix in the eggnog.",
                    "description": "Once you’ve brewed your cup of coffee, pour approximately 3 ounces (89 ml) of eggnog in. Stir the mixture well to ensure that the eggnog is fully combined. You can add as much or as little of the eggnog as you’d like. You’re using it as you would milk or creamer so you use the amount of those mix-ins that you prefer as a guide."
                },
                {
                    "headline": "Sprinkle with ground cinnamon.",
                    "description": "After you’ve mixed the eggnog into the coffee, add a pinch of ground cinnamon to the top of the cup as a garnish. The cinnamon will complement the flavor in the eggnog for an even more delicious cup of coffee. If you usually take sugar in your coffee, you can mix in some in too. However, keep in mind that the eggnog is sweetened so you may not need to add as much sugar as you normally would."
                }
            ]
        },
        {
            "name": "Whipping Up Eggnog Icing",
            "steps": [
                {
                    "headline": "Combine the sugar, eggnog, and extract.",
                    "description": "Add 1 cup (125 g) of powdered sugar, 2 tablespoons (30 ml) of eggnog, and ½ teaspoon (2 ½ ml) vanilla extract to a large bowl. Stir the ingredients together with a whisk until a thick paste forms. You can substitute almond extract for the vanilla if you prefer."
                },
                {
                    "headline": "Add more eggnog to thin the icing.",
                    "description": "You want the frosting to have a spreadable consistency, so if it’s too thick, mix in more eggnog. Add up to 4 more tablespoons (60 ml) to get the consistency that you prefer. It’s best to add the eggnog a tablespoon (15 ml) at a time and stir after each addition. That way, you won’t accidentally make the frosting too thin. If you add an extra 4 tablespoons (60 ml) of the eggnog or more, the frosting will be thin enough to have a glaze-like consistency."
                },
                {
                    "headline": "Frost your favorite baked good with the icing.",
                    "description": "When you’re happy with the consistency of the frosting, use a knife or offset spatula to spread it on the baked goods of your choice. It’s an ideal topping for scones, cookies, cupcakes, muffins, and cakes. Store any unused frosting in an airtight container in the refrigerator. It will keep for up to a week. Let the frosting warm up to room temperature before using it, though."
                }
            ]
        },
        {
            "name": "Preparing Eggnog French Toast",
            "steps": [
                {
                    "headline": "Preheat and grease an electric griddle.",
                    "description": "To prepare the electric griddle for frying the French toast, set its temperature to 350 degrees Fahrenheit (177 degrees Celsius) and allow it to heat fully. Once it’s hot, grease the surface of the griddle with butter to keep the bread from sticking. If you don’t have an electric griddle, you can fry the French toast in a skillet. Heat it on medium and grease it with butter as you would with the griddle."
                },
                {
                    "headline": "Mix the eggnog, eggs, nutmeg, and vanilla extract.",
                    "description": "Add 1 ½ cups (355 ml) of eggnog, 5 large eggs, ½ teaspoon (1 g) of ground nutmeg, and ½ teaspoon (2.5 ml) of vanilla extract to a large bowl. Whisk the ingredients together until they’re fully combined. You can substitute rum extract for the vanilla if you prefer."
                },
                {
                    "headline": "Pour the mixture into a shallow dish.",
                    "description": "After you’ve mixed the batter, transfer it to a shallow dish or bowl so you can easily coat the bread. A 11-inch by 7-inch (28-cm by 18-cm) baking dish works well."
                },
                {
                    "headline": "Dip the bread slices in the eggnog mixture.",
                    "description": "Take 12 slices of bread, and dip them two at a time into the batter. Make sure to flip the slices over so both sides are fully coated with the batter. Shake the bread off over the bowl to remove any excess batter."
                },
                {
                    "headline": "Transfer the bread to the griddle and cook until the bottom is golden brown.",
                    "description": "Once the bread is coated with the batter, place it on the griddle. Allow it to cook for approximately 3 to 5 minutes or until the bottom is a golden brown color. Make sure to keep an eye on the French toast as it’s cooking. It can burn easily."
                },
                {
                    "headline": "Flip the bread and cook until the other side is golden.",
                    "description": "When the bottom of the bread is golden brown, use a spatula to flip it over. Let the other side of the bread cook for approximately 2 to 3 more minutes or until it is golden brown too."
                },
                {
                    "headline": "Serve the French toast with maple syrup.",
                    "description": "Lift the cooked toast off of the griddle, and transfer to a plate. Top it with warm maple syrup and serve immediately. For a more decadent breakfast, you can add sweetened whipped cream to the top of the eggnog French toast."
                }
            ]
        },
        {
            "name": "Baking an Eggnog Pound Cake",
            "steps": [
                {
                    "headline": "Preheat the oven and grease the the pans.",
                    "description": "To ensure that the oven is hot enough to bake the pound cake, set the temperature to 350 degrees Fahrenheit (177 degrees Celsius) and allow it to fully heat. Next, lightly grease two 9-inch (23-cm) loaf pans with butter and dust with flour to prevent the cakes from sticking. You can use nonstick cooking spray to grease the pans if you prefer. To flour the pan, sprinkle a couple of pinches of flour into the bottom of the pan. Shake and tap the pan to distribute the flour evenly across the entire interior surface of the pan. If all of the sides aren’t covered, add a little more flour and repeat the process. Dump out any excess flour before pouring the batter in. You can use one bundt pan in place of the two loaf pans if you prefer."
                },
                {
                    "headline": "Combine the flour, baking powder, salt, and nutmeg.",
                    "description": "Add 3 cups (375 g) of all purpose flour, 2 teaspoons (10 g) of baking powder, ¼ teaspoon (1 g) of salt, and ½ teaspoon (1 g) of nutmeg to a large bowl. Stir with a wooden spoon to thoroughly combine the ingredients, and set the bowl aside for the moment."
                },
                {
                    "headline": "Cream the butter and sugar together.",
                    "description": "Add 1 cup (225 g) of softened butter and 2 cups (450 g) of sugar to a large bowl. Use an electric hand mixer to blend the two together on low. Raise the speed to medium, and cream the mixture until it is light and creamy. You can use a stand mixer to make the batter if you prefer."
                },
                {
                    "headline": "Mix in the eggs and vanilla.",
                    "description": "Once the butter and sugar are combined, add 4 eggs one at a time to the batter with the mixer on low. Next, stir in 1 teaspoon (5 ml) of vanilla and mix until the ingredients are fully combined. You can substitute almond or rum extract for the vanilla if you prefer."
                },
                {
                    "headline": "Stir in the flour mixture and eggnog.",
                    "description": "When the eggs and vanilla are fully incorporated, alternate adding flour mixture and eggnog. Start with a small amount of the flour mixture and follow with a small amount of the eggnog until you’ve added all of both and the batter is smooth. Keep the hand mixer on low or medium low so you don’t make a mess as you’re mixing. Make sure to mix the batter after each addition before adding more of the ingredients."
                },
                {
                    "headline": "Pour the batter into the pans.",
                    "description": "Once the batter is fully mixed, carefully transfer it to the prepared pans. Use a spatula to smooth the batter into each pan in an even layer."
                },
                {
                    "headline": "Bake the cakes until a toothpick comes out clean.",
                    "description": "Place the filled pans in the preheated oven. Allow them to bake for 50 to 55 minutes or until a toothpick inserted into the center of the cake comes out clean. If you don’t have any toothpicks, you can use a fork to test the cakes for doneness."
                },
                {
                    "headline": "Cool the cakes on a wire rack.",
                    "description": "When the cakes are finished baking, remove them from the oven. Allow them to rest in the pans for 20 minutes, and then carefully turn them out onto a wire rack to cool completely, which should take another 20 to 30 minutes. If you like, you can add a glaze or icing to the cooled cake. The eggnog frosting recipe from above would work well with the pound cake."
                }
            ]
        }
    ],
    "tyn": [
        "Eggnog Coffee",
        "Coffee mug",
        "Spoon",
        "Eggnog Frosting",
        "Bowl",
        "Whisk",
        "Eggnog French Toast",
        "Electric griddle",
        "Large bowl",
        "Shallow dish",
        "Spatula",
        "Eggnog Pound Cake",
        "2 9-inch (23-cm) loaf pans",
        "2 large bowls",
        "Wooden spoon",
        "Electric hand mixer",
        "Toothpick",
        "Wire cooling rack"
    ],
    "text": " Using Eggnog with Coffee Brew a cup of coffee. Use your favorite type of coffee to make a 20 ounce (591 ml) cup. You can use a traditional coffee machine, a single-serve coffee machine, a French press, or even an instant type that you simply mix with hot water. It’s best to use unflavored coffee to allow the eggnog flavor stand out, though. If you want to use a flavored coffee, be sure that it’s a flavor that will complement the eggnog. French vanilla, gingerbread, or cinnamon are good options. Mix in the eggnog. Once you’ve brewed your cup of coffee, pour approximately 3 ounces (89 ml) of eggnog in. Stir the mixture well to ensure that the eggnog is fully combined. You can add as much or as little of the eggnog as you’d like. You’re using it as you would milk or creamer so you use the amount of those mix-ins that you prefer as a guide. Sprinkle with ground cinnamon. After you’ve mixed the eggnog into the coffee, add a pinch of ground cinnamon to the top of the cup as a garnish. The cinnamon will complement the flavor in the eggnog for an even more delicious cup of coffee. If you usually take sugar in your coffee, you can mix in some in too. However, keep in mind that the eggnog is sweetened so you may not need to add as much sugar as you normally would. Whipping Up Eggnog Icing Combine the sugar, eggnog, and extract. Add 1 cup (125 g) of powdered sugar, 2 tablespoons (30 ml) of eggnog, and ½ teaspoon (2 ½ ml) vanilla extract to a large bowl. Stir the ingredients together with a whisk until a thick paste forms. You can substitute almond extract for the vanilla if you prefer. Add more eggnog to thin the icing. You want the frosting to have a spreadable consistency, so if it’s too thick, mix in more eggnog. Add up to 4 more tablespoons (60 ml) to get the consistency that you prefer. It’s best to add the eggnog a tablespoon (15 ml) at a time and stir after each addition. That way, you won’t accidentally make the frosting too thin. If you add an extra 4 tablespoons (60 ml) of the eggnog or more, the frosting will be thin enough to have a glaze-like consistency. Frost your favorite baked good with the icing. When you’re happy with the consistency of the frosting, use a knife or offset spatula to spread it on the baked goods of your choice. It’s an ideal topping for scones, cookies, cupcakes, muffins, and cakes. Store any unused frosting in an airtight container in the refrigerator. It will keep for up to a week. Let the frosting warm up to room temperature before using it, though. Preparing Eggnog French Toast Preheat and grease an electric griddle. To prepare the electric griddle for frying the French toast, set its temperature to 350 degrees Fahrenheit (177 degrees Celsius) and allow it to heat fully. Once it’s hot, grease the surface of the griddle with butter to keep the bread from sticking. If you don’t have an electric griddle, you can fry the French toast in a skillet. Heat it on medium and grease it with butter as you would with the griddle. Mix the eggnog, eggs, nutmeg, and vanilla extract. Add 1 ½ cups (355 ml) of eggnog, 5 large eggs, ½ teaspoon (1 g) of ground nutmeg, and ½ teaspoon (2.5 ml) of vanilla extract to a large bowl. Whisk the ingredients together until they’re fully combined. You can substitute rum extract for the vanilla if you prefer. Pour the mixture into a shallow dish. After you’ve mixed the batter, transfer it to a shallow dish or bowl so you can easily coat the bread. A 11-inch by 7-inch (28-cm by 18-cm) baking dish works well. Dip the bread slices in the eggnog mixture. Take 12 slices of bread, and dip them two at a time into the batter. Make sure to flip the slices over so both sides are fully coated with the batter. Shake the bread off over the bowl to remove any excess batter. Transfer the bread to the griddle and cook until the bottom is golden brown. Once the bread is coated with the batter, place it on the griddle. Allow it to cook for approximately 3 to 5 minutes or until the bottom is a golden brown color. Make sure to keep an eye on the French toast as it’s cooking. It can burn easily. Flip the bread and cook until the other side is golden. When the bottom of the bread is golden brown, use a spatula to flip it over. Let the other side of the bread cook for approximately 2 to 3 more minutes or until it is golden brown too. Serve the French toast with maple syrup. Lift the cooked toast off of the griddle, and transfer to a plate. Top it with warm maple syrup and serve immediately. For a more decadent breakfast, you can add sweetened whipped cream to the top of the eggnog French toast. Baking an Eggnog Pound Cake Preheat the oven and grease the the pans. To ensure that the oven is hot enough to bake the pound cake, set the temperature to 350 degrees Fahrenheit (177 degrees Celsius) and allow it to fully heat. Next, lightly grease two 9-inch (23-cm) loaf pans with butter and dust with flour to prevent the cakes from sticking. You can use nonstick cooking spray to grease the pans if you prefer. To flour the pan, sprinkle a couple of pinches of flour into the bottom of the pan. Shake and tap the pan to distribute the flour evenly across the entire interior surface of the pan. If all of the sides aren’t covered, add a little more flour and repeat the process. Dump out any excess flour before pouring the batter in. You can use one bundt pan in place of the two loaf pans if you prefer. Combine the flour, baking powder, salt, and nutmeg. Add 3 cups (375 g) of all purpose flour, 2 teaspoons (10 g) of baking powder, ¼ teaspoon (1 g) of salt, and ½ teaspoon (1 g) of nutmeg to a large bowl. Stir with a wooden spoon to thoroughly combine the ingredients, and set the bowl aside for the moment. Cream the butter and sugar together. Add 1 cup (225 g) of softened butter and 2 cups (450 g) of sugar to a large bowl. Use an electric hand mixer to blend the two together on low. Raise the speed to medium, and cream the mixture until it is light and creamy. You can use a stand mixer to make the batter if you prefer. Mix in the eggs and vanilla. Once the butter and sugar are combined, add 4 eggs one at a time to the batter with the mixer on low. Next, stir in 1 teaspoon (5 ml) of vanilla and mix until the ingredients are fully combined. You can substitute almond or rum extract for the vanilla if you prefer. Stir in the flour mixture and eggnog. When the eggs and vanilla are fully incorporated, alternate adding flour mixture and eggnog. Start with a small amount of the flour mixture and follow with a small amount of the eggnog until you’ve added all of both and the batter is smooth. Keep the hand mixer on low or medium low so you don’t make a mess as you’re mixing. Make sure to mix the batter after each addition before adding more of the ingredients. Pour the batter into the pans. Once the batter is fully mixed, carefully transfer it to the prepared pans. Use a spatula to smooth the batter into each pan in an even layer. Bake the cakes until a toothpick comes out clean. Place the filled pans in the preheated oven. Allow them to bake for 50 to 55 minutes or until a toothpick inserted into the center of the cake comes out clean. If you don’t have any toothpicks, you can use a fork to test the cakes for doneness. Cool the cakes on a wire rack. When the cakes are finished baking, remove them from the oven. Allow them to rest in the pans for 20 minutes, and then carefully turn them out onto a wire rack to cool completely, which should take another 20 to 30 minutes. If you like, you can add a glaze or icing to the cooled cake. The eggnog frosting recipe from above would work well with the pound cake.",
    "sentences": [
        " Using Eggnog with Coffee Brew a cup of coffee.",
        "Use your favorite type of coffee to make a 20 ounce (591 ml) cup.",
        "You can use a traditional coffee machine, a single-serve coffee machine, a French press, or even an instant type that you simply mix with hot water.",
        "It’s best to use unflavored coffee to allow the eggnog flavor stand out, though.",
        "If you want to use a flavored coffee, be sure that it’s a flavor that will complement the eggnog.",
        "French vanilla, gingerbread, or cinnamon are good options.",
        "Mix in the eggnog.",
        "Once you’ve brewed your cup of coffee, pour approximately 3 ounces (89 ml) of eggnog in.",
        "Stir the mixture well to ensure that the eggnog is fully combined.",
        "You can add as much or as little of the eggnog as you’d like.",
        "You’re using it as you would milk or creamer so you use the amount of those mix-ins that you prefer as a guide.",
        "Sprinkle with ground cinnamon.",
        "After you’ve mixed the eggnog into the coffee, add a pinch of ground cinnamon to the top of the cup as a garnish.",
        "The cinnamon will complement the flavor in the eggnog for an even more delicious cup of coffee.",
        "If you usually take sugar in your coffee, you can mix in some in too.",
        "However, keep in mind that the eggnog is sweetened so you may not need to add as much sugar as you normally would.",
        "Whipping Up Eggnog Icing Combine the sugar, eggnog, and extract.",
        "Add 1 cup (125 g) of powdered sugar, 2 tablespoons (30 ml) of eggnog, and ½ teaspoon (2 ½ ml) vanilla extract to a large bowl.",
        "Stir the ingredients together with a whisk until a thick paste forms.",
        "You can substitute almond extract for the vanilla if you prefer.",
        "Add more eggnog to thin the icing.",
        "You want the frosting to have a spreadable consistency, so if it’s too thick, mix in more eggnog.",
        "Add up to 4 more tablespoons (60 ml) to get the consistency that you prefer.",
        "It’s best to add the eggnog a tablespoon (15 ml) at a time and stir after each addition.",
        "That way, you won’t accidentally make the frosting too thin.",
        "If you add an extra 4 tablespoons (60 ml) of the eggnog or more, the frosting will be thin enough to have a glaze-like consistency.",
        "Frost your favorite baked good with the icing.",
        "When you’re happy with the consistency of the frosting, use a knife or offset spatula to spread it on the baked goods of your choice.",
        "It’s an ideal topping for scones, cookies, cupcakes, muffins, and cakes.",
        "Store any unused frosting in an airtight container in the refrigerator.",
        "It will keep for up to a week.",
        "Let the frosting warm up to room temperature before using it, though.",
        "Preparing Eggnog French Toast Preheat and grease an electric griddle.",
        "To prepare the electric griddle for frying the French toast, set its temperature to 350 degrees Fahrenheit (177 degrees Celsius) and allow it to heat fully.",
        "Once it’s hot, grease the surface of the griddle with butter to keep the bread from sticking.",
        "If you don’t have an electric griddle, you can fry the French toast in a skillet.",
        "Heat it on medium and grease it with butter as you would with the griddle.",
        "Mix the eggnog, eggs, nutmeg, and vanilla extract.",
        "Add 1 ½ cups (355 ml) of eggnog, 5 large eggs, ½ teaspoon (1 g) of ground nutmeg, and ½ teaspoon (2.5 ml) of vanilla extract to a large bowl.",
        "Whisk the ingredients together until they’re fully combined.",
        "You can substitute rum extract for the vanilla if you prefer.",
        "Pour the mixture into a shallow dish.",
        "After you’ve mixed the batter, transfer it to a shallow dish or bowl so you can easily coat the bread.",
        "A 11-inch by 7-inch (28-cm by 18-cm) baking dish works well.",
        "Dip the bread slices in the eggnog mixture.",
        "Take 12 slices of bread, and dip them two at a time into the batter.",
        "Make sure to flip the slices over so both sides are fully coated with the batter.",
        "Shake the bread off over the bowl to remove any excess batter.",
        "Transfer the bread to the griddle and cook until the bottom is golden brown.",
        "Once the bread is coated with the batter, place it on the griddle.",
        "Allow it to cook for approximately 3 to 5 minutes or until the bottom is a golden brown color.",
        "Make sure to keep an eye on the French toast as it’s cooking.",
        "It can burn easily.",
        "Flip the bread and cook until the other side is golden.",
        "When the bottom of the bread is golden brown, use a spatula to flip it over.",
        "Let the other side of the bread cook for approximately 2 to 3 more minutes or until it is golden brown too.",
        "Serve the French toast with maple syrup.",
        "Lift the cooked toast off of the griddle, and transfer to a plate.",
        "Top it with warm maple syrup and serve immediately.",
        "For a more decadent breakfast, you can add sweetened whipped cream to the top of the eggnog French toast.",
        "Baking an Eggnog Pound Cake Preheat the oven and grease the the pans.",
        "To ensure that the oven is hot enough to bake the pound cake, set the temperature to 350 degrees Fahrenheit (177 degrees Celsius) and allow it to fully heat.",
        "Next, lightly grease two 9-inch (23-cm) loaf pans with butter and dust with flour to prevent the cakes from sticking.",
        "You can use nonstick cooking spray to grease the pans if you prefer.",
        "To flour the pan, sprinkle a couple of pinches of flour into the bottom of the pan.",
        "Shake and tap the pan to distribute the flour evenly across the entire interior surface of the pan.",
        "If all of the sides aren’t covered, add a little more flour and repeat the process.",
        "Dump out any excess flour before pouring the batter in.",
        "You can use one bundt pan in place of the two loaf pans if you prefer.",
        "Combine the flour, baking powder, salt, and nutmeg.",
        "Add 3 cups (375 g) of all purpose flour, 2 teaspoons (10 g) of baking powder, ¼ teaspoon (1 g) of salt, and ½ teaspoon (1 g) of nutmeg to a large bowl.",
        "Stir with a wooden spoon to thoroughly combine the ingredients, and set the bowl aside for the moment.",
        "Cream the butter and sugar together.",
        "Add 1 cup (225 g) of softened butter and 2 cups (450 g) of sugar to a large bowl.",
        "Use an electric hand mixer to blend the two together on low.",
        "Raise the speed to medium, and cream the mixture until it is light and creamy.",
        "You can use a stand mixer to make the batter if you prefer.",
        "Mix in the eggs and vanilla.",
        "Once the butter and sugar are combined, add 4 eggs one at a time to the batter with the mixer on low.",
        "Next, stir in 1 teaspoon (5 ml) of vanilla and mix until the ingredients are fully combined.",
        "You can substitute almond or rum extract for the vanilla if you prefer.",
        "Stir in the flour mixture and eggnog.",
        "When the eggs and vanilla are fully incorporated, alternate adding flour mixture and eggnog.",
        "Start with a small amount of the flour mixture and follow with a small amount of the eggnog until you’ve added all of both and the batter is smooth.",
        "Keep the hand mixer on low or medium low so you don’t make a mess as you’re mixing.",
        "Make sure to mix the batter after each addition before adding more of the ingredients.",
        "Pour the batter into the pans.",
        "Once the batter is fully mixed, carefully transfer it to the prepared pans.",
        "Use a spatula to smooth the batter into each pan in an even layer.",
        "Bake the cakes until a toothpick comes out clean.",
        "Place the filled pans in the preheated oven.",
        "Allow them to bake for 50 to 55 minutes or until a toothpick inserted into the center of the cake comes out clean.",
        "If you don’t have any toothpicks, you can use a fork to test the cakes for doneness.",
        "Cool the cakes on a wire rack.",
        "When the cakes are finished baking, remove them from the oven.",
        "Allow them to rest in the pans for 20 minutes, and then carefully turn them out onto a wire rack to cool completely, which should take another 20 to 30 minutes.",
        "If you like, you can add a glaze or icing to the cooled cake.",
        "The eggnog frosting recipe from above would work well with the pound cake."
    ]
}