{
    "title": "How to Make a Flannel Throw Blanket",
    "url": "https://www.wikihow.com/Make-a-Flannel-Throw-Blanket",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Sewing",
        "Sewing Crafts",
        "Sewing Blankets"
    ],
    "methods": [
        {
            "name": "Making a Fringed Flannel Throw Blanket",
            "steps": [
                {
                    "headline": "Choose your fabric.",
                    "description": "You will need 1¾ yards (1.6 meters) of flannel fabric, about 44 to 45 inches (1.2 meters) wide. Plaid patterns work best with this, but a solid color will also look nice. Make sure that you are using flannel and not fleece. Fleece does not fray the same way flannel does. For a larger blanket, opt for a 2-yard (1.8-meter) piece of fabric instead."
                },
                {
                    "headline": "Clean the selvage edges up.",
                    "description": "This blanket will only have a fringe on the narrow edges. The long edges will be left alone for a finished look. Take a look at the long edges of your fabric, and trim off any stray threads. You won't be hemming them because the salvage already takes care of that. If you want to have a fringe on all four sides, cut the selvage edges off."
                },
                {
                    "headline": "Sew across the narrow edges of your blanket.",
                    "description": "Choose a thread color that matches your fabric, and sew across the narrow sides, 1-inch (2.54-centimeters) from the edge. Use a short stitch length. This will keep the fabric from fraying past the fringe. If you want to have a fringe on all four sides, sew around the blanket using a 1-inch (2.54-centimeter) seam allowance. Turn the fabric at the corners so that you sew in one continuous line. If you want a longer fringe, leave a larger seam allowance."
                },
                {
                    "headline": "Cut 1-inch (2.54-centimeter) slits into the selvage edges.",
                    "description": "Cut the slits from the narrow edges of the fabric so that they are aligned with the selvage edge. This will make the proceeding steps easier. Be careful not to cut through your stitching! If you want your blanket to have a fringe on all four sides, cut a 1-inch (2.54-centimeter) square into each of the corners. Be careful not to cut through your stitching. This will make it easier to pull the threads out. If you want to make a longer fringe, cut longer slits/bigger squares."
                },
                {
                    "headline": "Pull the threads out of the fabric until you reach your stitching.",
                    "description": "Be careful not the pull the actual stitching threads out, however. You are only pulling the threads that make up the fabric out. The easiest way to do this would be to grab a thread or two with a seam ripper and then pulling it out. Keep doing this until you reach the stitching you made. Be sure to pull the threads out from the notch you cut into the selvage edge. Do not fray the rest of the selvage. Run your fingers through the fringe when you are done. This will loosen up the fringe and get rid of any residual fuzz."
                }
            ]
        },
        {
            "name": "Making a Lined Flannel Throw Blanket",
            "steps": [
                {
                    "headline": "Choose your flannel fabric.",
                    "description": "You will need two pieces of flannel fabric, 2¼ yards (2.1 meters) each. It needs to be about 44 to 45 inches (1.2 meters) wide. You can use two different solid colors, two different patterns, or a solid color and a pattern."
                },
                {
                    "headline": "Pin the two pieces of fabric together, wrong sides facing out.",
                    "description": "Spread your first piece of fabric down on the floor, right side up. Place your second piece of fabric on top, right side down. Make sure that the long edges match up with the long edges, and the short edges match up with the short edges. Pin the two pieces together along the edges."
                },
                {
                    "headline": "Sew around the fabric, but leave a gap for turning.",
                    "description": "Sew around the blanket using a ¼-inch (0.64-centimeter) seam allowance. Remove the pins as you sew. Leave a gap in one edge that is big enough for you to turn the fabric inside out. It needs to be about ¼ to ½ the length of one edge."
                },
                {
                    "headline": "Clip the corners.",
                    "description": "Try to get as close to the stitching as you can without actually cutting through it. This will help reduce bulk, and make your blanket lay smoother."
                },
                {
                    "headline": "Turn your blanket right side out through the gap.",
                    "description": "Use something blunt, but pointy, like a pencil or knitting needle, to push out the corners. This will make them nice and crisp."
                },
                {
                    "headline": "Press the seams with an iron.",
                    "description": "Be sure to use a flannel or cotton setting. When you reach the gap, carefully tuck the raw edges into the blanket so that they match up with the rest of the hems. If you need to, use pins to keep the gap closed."
                },
                {
                    "headline": "Topstitch around the blanket, including the gap.",
                    "description": "Use a ⅛-inch (0.32-centimeter) seam allowance. You can use matching or contrasting thread colors for the topstitching. A matching thread color will blend in more easily, but a contrasting thread color will make a nice design. If you need to, use sewing pins to hold the gap shut. Remember to remove the pins while you sew."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Fringed Flannel Throw Blanket",
        "1¾ yards (1.6 meters) flannel fabric, 44/45 inches (1.2 meters) wide",
        "Thread",
        "Sewing machine",
        "Fabric scissors",
        "Lined Flannel Throw Blanket",
        "2¼ yards (2.1 meters) flannel fabric, 44/45 inches (1.2 meters) wide",
        "2¼ yards (2.1 meters) coordinating flannel fabric, 44/45 inches (1.2 meters) wide",
        "Pins"
    ],
    "text": " Making a Fringed Flannel Throw Blanket Choose your fabric. You will need 1¾ yards (1.6 meters) of flannel fabric, about 44 to 45 inches (1.2 meters) wide. Plaid patterns work best with this, but a solid color will also look nice. Make sure that you are using flannel and not fleece. Fleece does not fray the same way flannel does. For a larger blanket, opt for a 2-yard (1.8-meter) piece of fabric instead. Clean the selvage edges up. This blanket will only have a fringe on the narrow edges. The long edges will be left alone for a finished look. Take a look at the long edges of your fabric, and trim off any stray threads. You won't be hemming them because the salvage already takes care of that. If you want to have a fringe on all four sides, cut the selvage edges off. Sew across the narrow edges of your blanket. Choose a thread color that matches your fabric, and sew across the narrow sides, 1-inch (2.54-centimeters) from the edge. Use a short stitch length. This will keep the fabric from fraying past the fringe. If you want to have a fringe on all four sides, sew around the blanket using a 1-inch (2.54-centimeter) seam allowance. Turn the fabric at the corners so that you sew in one continuous line. If you want a longer fringe, leave a larger seam allowance. Cut 1-inch (2.54-centimeter) slits into the selvage edges. Cut the slits from the narrow edges of the fabric so that they are aligned with the selvage edge. This will make the proceeding steps easier. Be careful not to cut through your stitching! If you want your blanket to have a fringe on all four sides, cut a 1-inch (2.54-centimeter) square into each of the corners. Be careful not to cut through your stitching. This will make it easier to pull the threads out. If you want to make a longer fringe, cut longer slits/bigger squares. Pull the threads out of the fabric until you reach your stitching. Be careful not the pull the actual stitching threads out, however. You are only pulling the threads that make up the fabric out. The easiest way to do this would be to grab a thread or two with a seam ripper and then pulling it out. Keep doing this until you reach the stitching you made. Be sure to pull the threads out from the notch you cut into the selvage edge. Do not fray the rest of the selvage. Run your fingers through the fringe when you are done. This will loosen up the fringe and get rid of any residual fuzz. Making a Lined Flannel Throw Blanket Choose your flannel fabric. You will need two pieces of flannel fabric, 2¼ yards (2.1 meters) each. It needs to be about 44 to 45 inches (1.2 meters) wide. You can use two different solid colors, two different patterns, or a solid color and a pattern. Pin the two pieces of fabric together, wrong sides facing out. Spread your first piece of fabric down on the floor, right side up. Place your second piece of fabric on top, right side down. Make sure that the long edges match up with the long edges, and the short edges match up with the short edges. Pin the two pieces together along the edges. Sew around the fabric, but leave a gap for turning. Sew around the blanket using a ¼-inch (0.64-centimeter) seam allowance. Remove the pins as you sew. Leave a gap in one edge that is big enough for you to turn the fabric inside out. It needs to be about ¼ to ½ the length of one edge. Clip the corners. Try to get as close to the stitching as you can without actually cutting through it. This will help reduce bulk, and make your blanket lay smoother. Turn your blanket right side out through the gap. Use something blunt, but pointy, like a pencil or knitting needle, to push out the corners. This will make them nice and crisp. Press the seams with an iron. Be sure to use a flannel or cotton setting. When you reach the gap, carefully tuck the raw edges into the blanket so that they match up with the rest of the hems. If you need to, use pins to keep the gap closed. Topstitch around the blanket, including the gap. Use a ⅛-inch (0.32-centimeter) seam allowance. You can use matching or contrasting thread colors for the topstitching. A matching thread color will blend in more easily, but a contrasting thread color will make a nice design. If you need to, use sewing pins to hold the gap shut. Remember to remove the pins while you sew. Finished. ",
    "sentences": [
        " Making a Fringed Flannel Throw Blanket Choose your fabric.",
        "You will need 1¾ yards (1.6 meters) of flannel fabric, about 44 to 45 inches (1.2 meters) wide.",
        "Plaid patterns work best with this, but a solid color will also look nice.",
        "Make sure that you are using flannel and not fleece.",
        "Fleece does not fray the same way flannel does.",
        "For a larger blanket, opt for a 2-yard (1.8-meter) piece of fabric instead.",
        "Clean the selvage edges up.",
        "This blanket will only have a fringe on the narrow edges.",
        "The long edges will be left alone for a finished look.",
        "Take a look at the long edges of your fabric, and trim off any stray threads.",
        "You won't be hemming them because the salvage already takes care of that.",
        "If you want to have a fringe on all four sides, cut the selvage edges off.",
        "Sew across the narrow edges of your blanket.",
        "Choose a thread color that matches your fabric, and sew across the narrow sides, 1-inch (2.54-centimeters) from the edge.",
        "Use a short stitch length.",
        "This will keep the fabric from fraying past the fringe.",
        "If you want to have a fringe on all four sides, sew around the blanket using a 1-inch (2.54-centimeter) seam allowance.",
        "Turn the fabric at the corners so that you sew in one continuous line.",
        "If you want a longer fringe, leave a larger seam allowance.",
        "Cut 1-inch (2.54-centimeter) slits into the selvage edges.",
        "Cut the slits from the narrow edges of the fabric so that they are aligned with the selvage edge.",
        "This will make the proceeding steps easier.",
        "Be careful not to cut through your stitching!",
        "If you want your blanket to have a fringe on all four sides, cut a 1-inch (2.54-centimeter) square into each of the corners.",
        "Be careful not to cut through your stitching.",
        "This will make it easier to pull the threads out.",
        "If you want to make a longer fringe, cut longer slits/bigger squares.",
        "Pull the threads out of the fabric until you reach your stitching.",
        "Be careful not the pull the actual stitching threads out, however.",
        "You are only pulling the threads that make up the fabric out.",
        "The easiest way to do this would be to grab a thread or two with a seam ripper and then pulling it out.",
        "Keep doing this until you reach the stitching you made.",
        "Be sure to pull the threads out from the notch you cut into the selvage edge.",
        "Do not fray the rest of the selvage.",
        "Run your fingers through the fringe when you are done.",
        "This will loosen up the fringe and get rid of any residual fuzz.",
        "Making a Lined Flannel Throw Blanket Choose your flannel fabric.",
        "You will need two pieces of flannel fabric, 2¼ yards (2.1 meters) each.",
        "It needs to be about 44 to 45 inches (1.2 meters) wide.",
        "You can use two different solid colors, two different patterns, or a solid color and a pattern.",
        "Pin the two pieces of fabric together, wrong sides facing out.",
        "Spread your first piece of fabric down on the floor, right side up.",
        "Place your second piece of fabric on top, right side down.",
        "Make sure that the long edges match up with the long edges, and the short edges match up with the short edges.",
        "Pin the two pieces together along the edges.",
        "Sew around the fabric, but leave a gap for turning.",
        "Sew around the blanket using a ¼-inch (0.64-centimeter) seam allowance.",
        "Remove the pins as you sew.",
        "Leave a gap in one edge that is big enough for you to turn the fabric inside out.",
        "It needs to be about ¼ to ½ the length of one edge.",
        "Clip the corners.",
        "Try to get as close to the stitching as you can without actually cutting through it.",
        "This will help reduce bulk, and make your blanket lay smoother.",
        "Turn your blanket right side out through the gap.",
        "Use something blunt, but pointy, like a pencil or knitting needle, to push out the corners.",
        "This will make them nice and crisp.",
        "Press the seams with an iron.",
        "Be sure to use a flannel or cotton setting.",
        "When you reach the gap, carefully tuck the raw edges into the blanket so that they match up with the rest of the hems.",
        "If you need to, use pins to keep the gap closed.",
        "Topstitch around the blanket, including the gap.",
        "Use a ⅛-inch (0.32-centimeter) seam allowance.",
        "You can use matching or contrasting thread colors for the topstitching.",
        "A matching thread color will blend in more easily, but a contrasting thread color will make a nice design.",
        "If you need to, use sewing pins to hold the gap shut.",
        "Remember to remove the pins while you sew.",
        "Finished."
    ]
}