{
    "title": "How to Make Middle Eastern Lamb Stew",
    "url": "https://www.wikihow.com/Make-Middle-Eastern-Lamb-Stew",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "World Cuisines",
        "Middle Eastern Cuisine"
    ],
    "methods": [
        {
            "name": "Making Moroccan Lamb Stew",
            "steps": [
                {
                    "headline": "Trim the lamb and grate the onion.",
                    "description": "Get out 2 pounds (907 g) of lamb shoulder and carefully cut away any excess flaps of fat. Use a sharp knife to cut the lamb into 1-inch (2.5 cm) pieces and set the lamb aside. You'll also need to get out one small onion and peel it. Grate the onion using a cheese grater. Set the grated onion aside. You should end up with about 1/3 cup (50 g) of grated onion."
                },
                {
                    "headline": "Saute the lamb, onion, and seasonings.",
                    "description": "Melt 2 tablespoons of unsalted butter in a large pot or Dutch oven over medium-low heat. Add the lamb pieces and grated onion along with most of the seasonings. Stir the stew mixture and cook it for 5 to 7 minutes. You should smell the seasonings, but the lamb shouldn't brown. You'll need to add these seasonings:\n4 cloves of garlic, minced\n1 teaspoon of black pepper\n1 teaspoon of salt\n1 teaspoon of ground cinnamon\n1 teaspoon of ground coriander\n1 teaspoon of ground cumin\n½ teaspoon of red pepper flakes\n¼ cup (80 g) of apricot preserves\n⅓ cup (80 ml) of red wine vinegar"
                },
                {
                    "headline": "Simmer the stew with the chickpeas and stock.",
                    "description": "Open one 15-ounce (411 g) can of chickpeas and drain it. Rinse the chickpeas and then add them to the pot along with 2 cups (473 ml) of chicken stock. Bring the Moroccan stew to a simmer and turn the heat down to low. Cover the pot and let it bubble lightly for 1 hour and 15 minutes. You may need to adjust the heat as the lamb stew simmers. It should always be bubbling gently."
                },
                {
                    "headline": "Stir in the raisins, parsley, and lemon juice.",
                    "description": "Once the lamb is tender, stir in 1/4 cup (40 g) of raisins. Cook the stew for ten more minutes with the lid off. The raisins should soften and swell. Turn off the heat and stir in 1/4 cup (5 g) of chopped fresh parsley along with 2 tablespoons of lemon juice. Consider serving the Moroccan lamb stew along with couscous or flat bread."
                }
            ]
        },
        {
            "name": "Making Iranian Lamb Stew",
            "steps": [
                {
                    "headline": "Combine the spice mixture.",
                    "description": "While there aren't many ingredients in the Iranian lamb stew, it does rely on a lot of spice for flavor and heat. Get out a small bowl and measure out the seasonings you'll need for the stew. Set the spices aside while you heat the stew. You'll need to mix together:\n1 tablespoon of turmeric\n2 teaspoons of black pepper\n1 teaspoon of salt\n1 teaspoon of crushed red pepper flakes"
                },
                {
                    "headline": "Saute the onions.",
                    "description": "Pour 3 tablespoons of extra virgin olive oil into a large pot or Dutch oven. Heat the oil over medium heat and once it shimmers, stir in 2 medium onions that have been minced. Saute the onions for about 10 minutes or until they turn translucent and soften. You may need to adjust the heat as you saute the onions. If they start to turn too brown, turn the heat down."
                },
                {
                    "headline": "Add the lamb and brown it.",
                    "description": "Take 3 pounds (1.36 kg) of lamb and cut it into large chunks. Add the lamb to the sauteed onions in the pot and cook it over medium-high heat for several minutes. Turn the meat after a few minutes so it browns on all sides. Drain off or scoop away any fat that's at the bottom of the pan. You can use bone-in lamb, boneless meat, or any large pieces of lamb that you have. You can also combine these types of lamb."
                },
                {
                    "headline": "Simmer the spiced stew.",
                    "description": "Add the spice mixture to the browned lamb and stir it well so the spices coat the lamb. Pour in 4 cups (950 ml) of water and bring the water to a boil. Turn the heat down to medium-low so that the liquid bubbles gently. Simmer the stew for 2 hours. You may notice fat bubbling to the surface as the stew cooks. You can use a large shallow spoon to scoop away the fat that comes to the top. Try to do this every 30 minutes."
                },
                {
                    "headline": "Stir in tomato paste and finish cooking the stew.",
                    "description": "Measure out 3 tablespoons of tomato paste and stir it into the stew. Keep simmering the stew with the lid off for another 20 minutes. Stir the stew frequently so that it doesn't stick to the pan. The Iranian lamb stew should thicken and the meat will soften once it's finished cooking. Taste the stew and add more salt or seasonings according to your taste. Garnish the Iranian lamb stew with 1/4 cup (5 g) of chopped fresh parsley or cilantro. You can serve the stew with flat bread or basmati rice."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Measuring cups and spoons",
        "Knives and cutting board",
        "Can opener",
        "Large pot or Dutch oven with a lid",
        "Large shallow spoon"
    ],
    "text": " Making Moroccan Lamb Stew Trim the lamb and grate the onion. Get out 2 pounds (907 g) of lamb shoulder and carefully cut away any excess flaps of fat. Use a sharp knife to cut the lamb into 1-inch (2.5 cm) pieces and set the lamb aside. You'll also need to get out one small onion and peel it. Grate the onion using a cheese grater. Set the grated onion aside. You should end up with about 1/3 cup (50 g) of grated onion. Saute the lamb, onion, and seasonings. Melt 2 tablespoons of unsalted butter in a large pot or Dutch oven over medium-low heat. Add the lamb pieces and grated onion along with most of the seasonings. Stir the stew mixture and cook it for 5 to 7 minutes. You should smell the seasonings, but the lamb shouldn't brown. You'll need to add these seasonings:\n4 cloves of garlic, minced\n1 teaspoon of black pepper\n1 teaspoon of salt\n1 teaspoon of ground cinnamon\n1 teaspoon of ground coriander\n1 teaspoon of ground cumin\n½ teaspoon of red pepper flakes\n¼ cup (80 g) of apricot preserves\n⅓ cup (80 ml) of red wine vinegar Simmer the stew with the chickpeas and stock. Open one 15-ounce (411 g) can of chickpeas and drain it. Rinse the chickpeas and then add them to the pot along with 2 cups (473 ml) of chicken stock. Bring the Moroccan stew to a simmer and turn the heat down to low. Cover the pot and let it bubble lightly for 1 hour and 15 minutes. You may need to adjust the heat as the lamb stew simmers. It should always be bubbling gently. Stir in the raisins, parsley, and lemon juice. Once the lamb is tender, stir in 1/4 cup (40 g) of raisins. Cook the stew for ten more minutes with the lid off. The raisins should soften and swell. Turn off the heat and stir in 1/4 cup (5 g) of chopped fresh parsley along with 2 tablespoons of lemon juice. Consider serving the Moroccan lamb stew along with couscous or flat bread. Making Iranian Lamb Stew Combine the spice mixture. While there aren't many ingredients in the Iranian lamb stew, it does rely on a lot of spice for flavor and heat. Get out a small bowl and measure out the seasonings you'll need for the stew. Set the spices aside while you heat the stew. You'll need to mix together:\n1 tablespoon of turmeric\n2 teaspoons of black pepper\n1 teaspoon of salt\n1 teaspoon of crushed red pepper flakes Saute the onions. Pour 3 tablespoons of extra virgin olive oil into a large pot or Dutch oven. Heat the oil over medium heat and once it shimmers, stir in 2 medium onions that have been minced. Saute the onions for about 10 minutes or until they turn translucent and soften. You may need to adjust the heat as you saute the onions. If they start to turn too brown, turn the heat down. Add the lamb and brown it. Take 3 pounds (1.36 kg) of lamb and cut it into large chunks. Add the lamb to the sauteed onions in the pot and cook it over medium-high heat for several minutes. Turn the meat after a few minutes so it browns on all sides. Drain off or scoop away any fat that's at the bottom of the pan. You can use bone-in lamb, boneless meat, or any large pieces of lamb that you have. You can also combine these types of lamb. Simmer the spiced stew. Add the spice mixture to the browned lamb and stir it well so the spices coat the lamb. Pour in 4 cups (950 ml) of water and bring the water to a boil. Turn the heat down to medium-low so that the liquid bubbles gently. Simmer the stew for 2 hours. You may notice fat bubbling to the surface as the stew cooks. You can use a large shallow spoon to scoop away the fat that comes to the top. Try to do this every 30 minutes. Stir in tomato paste and finish cooking the stew. Measure out 3 tablespoons of tomato paste and stir it into the stew. Keep simmering the stew with the lid off for another 20 minutes. Stir the stew frequently so that it doesn't stick to the pan. The Iranian lamb stew should thicken and the meat will soften once it's finished cooking. Taste the stew and add more salt or seasonings according to your taste. Garnish the Iranian lamb stew with 1/4 cup (5 g) of chopped fresh parsley or cilantro. You can serve the stew with flat bread or basmati rice. Finished. ",
    "sentences": [
        " Making Moroccan Lamb Stew Trim the lamb and grate the onion.",
        "Get out 2 pounds (907 g) of lamb shoulder and carefully cut away any excess flaps of fat.",
        "Use a sharp knife to cut the lamb into 1-inch (2.5 cm) pieces and set the lamb aside.",
        "You'll also need to get out one small onion and peel it.",
        "Grate the onion using a cheese grater.",
        "Set the grated onion aside.",
        "You should end up with about 1/3 cup (50 g) of grated onion.",
        "Saute the lamb, onion, and seasonings.",
        "Melt 2 tablespoons of unsalted butter in a large pot or Dutch oven over medium-low heat.",
        "Add the lamb pieces and grated onion along with most of the seasonings.",
        "Stir the stew mixture and cook it for 5 to 7 minutes.",
        "You should smell the seasonings, but the lamb shouldn't brown.",
        "You'll need to add these seasonings:\n4 cloves of garlic, minced\n1 teaspoon of black pepper\n1 teaspoon of salt\n1 teaspoon of ground cinnamon\n1 teaspoon of ground coriander\n1 teaspoon of ground cumin\n½ teaspoon of red pepper flakes\n¼ cup (80 g) of apricot preserves\n⅓ cup (80 ml) of red wine vinegar Simmer the stew with the chickpeas and stock.",
        "Open one 15-ounce (411 g) can of chickpeas and drain it.",
        "Rinse the chickpeas and then add them to the pot along with 2 cups (473 ml) of chicken stock.",
        "Bring the Moroccan stew to a simmer and turn the heat down to low.",
        "Cover the pot and let it bubble lightly for 1 hour and 15 minutes.",
        "You may need to adjust the heat as the lamb stew simmers.",
        "It should always be bubbling gently.",
        "Stir in the raisins, parsley, and lemon juice.",
        "Once the lamb is tender, stir in 1/4 cup (40 g) of raisins.",
        "Cook the stew for ten more minutes with the lid off.",
        "The raisins should soften and swell.",
        "Turn off the heat and stir in 1/4 cup (5 g) of chopped fresh parsley along with 2 tablespoons of lemon juice.",
        "Consider serving the Moroccan lamb stew along with couscous or flat bread.",
        "Making Iranian Lamb Stew Combine the spice mixture.",
        "While there aren't many ingredients in the Iranian lamb stew, it does rely on a lot of spice for flavor and heat.",
        "Get out a small bowl and measure out the seasonings you'll need for the stew.",
        "Set the spices aside while you heat the stew.",
        "You'll need to mix together:\n1 tablespoon of turmeric\n2 teaspoons of black pepper\n1 teaspoon of salt\n1 teaspoon of crushed red pepper flakes Saute the onions.",
        "Pour 3 tablespoons of extra virgin olive oil into a large pot or Dutch oven.",
        "Heat the oil over medium heat and once it shimmers, stir in 2 medium onions that have been minced.",
        "Saute the onions for about 10 minutes or until they turn translucent and soften.",
        "You may need to adjust the heat as you saute the onions.",
        "If they start to turn too brown, turn the heat down.",
        "Add the lamb and brown it.",
        "Take 3 pounds (1.36 kg) of lamb and cut it into large chunks.",
        "Add the lamb to the sauteed onions in the pot and cook it over medium-high heat for several minutes.",
        "Turn the meat after a few minutes so it browns on all sides.",
        "Drain off or scoop away any fat that's at the bottom of the pan.",
        "You can use bone-in lamb, boneless meat, or any large pieces of lamb that you have.",
        "You can also combine these types of lamb.",
        "Simmer the spiced stew.",
        "Add the spice mixture to the browned lamb and stir it well so the spices coat the lamb.",
        "Pour in 4 cups (950 ml) of water and bring the water to a boil.",
        "Turn the heat down to medium-low so that the liquid bubbles gently.",
        "Simmer the stew for 2 hours.",
        "You may notice fat bubbling to the surface as the stew cooks.",
        "You can use a large shallow spoon to scoop away the fat that comes to the top.",
        "Try to do this every 30 minutes.",
        "Stir in tomato paste and finish cooking the stew.",
        "Measure out 3 tablespoons of tomato paste and stir it into the stew.",
        "Keep simmering the stew with the lid off for another 20 minutes.",
        "Stir the stew frequently so that it doesn't stick to the pan.",
        "The Iranian lamb stew should thicken and the meat will soften once it's finished cooking.",
        "Taste the stew and add more salt or seasonings according to your taste.",
        "Garnish the Iranian lamb stew with 1/4 cup (5 g) of chopped fresh parsley or cilantro.",
        "You can serve the stew with flat bread or basmati rice.",
        "Finished."
    ]
}