{
    "title": "How to Top Tomato Soup",
    "url": "https://www.wikihow.com/Top-Tomato-Soup",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables"
    ],
    "methods": [
        {
            "name": "Baking Polenta Croutons",
            "steps": [
                {
                    "headline": "Cut your polenta.",
                    "description": "First, preheat your oven to 350 degrees Fahrenheit (177 degrees Celsius). While that heats up, remove the polenta from its wrapping and place it on a cutting board. Slice it into cubes roughly ½ to ¾ inch in size (1.27 to 1.9 cm)."
                },
                {
                    "headline": "Prep for baking.",
                    "description": "Transfer your cubes into a small mixing bowl. Drizzle them with 1 tablespoon of olive oil. Then toss them to distribute the oil more evenly. To make sure they don’t stick to your baking sheet, spray the sheet with olive oil."
                },
                {
                    "headline": "Bake your croutons.",
                    "description": "Place your cubes on your baking sheet. Make sure they are spread out, with each one sitting directly on the sheet, as opposed to piled on top of each other. Place the baking sheet in the oven and set a timer for 10 minutes. When it goes off, remove the sheet and toss or flip the cubes so each one rests on a new side. Repeat every 10 minutes for a total cooking time of 35 to 40 minutes, or until they grow crisp and browned."
                }
            ]
        },
        {
            "name": "Making Melted-Cheese Croutons",
            "steps": [
                {
                    "headline": "Prep two grilled cheese sandwiches.",
                    "description": "Lay out four slices of sandwich bread. Spread butter or margarine to lightly cover both sides of each slice. Then cover two of them with sliced or shredded sharp cheddar cheese each, using 1 ounce (28.33 g) for each one. Cover each one with one of the other slices."
                },
                {
                    "headline": "Grill your sandwiches.",
                    "description": "Place a large dry skillet on one of your stovetop’s burners. Turn the heat to medium-low. Once it heats up, place your sandwiches inside. Grill each side for approximately three minutes, until the cheese melts and the breads toasts to a golden brown."
                },
                {
                    "headline": "Cut your croutons and top your soup.",
                    "description": "Transfer the sandwiches to a cutting board. Let them sit for a minute or two, until they are cool enough to touch. Trim away the crusts, then slice each sandwich into eight croutons of roughly even size. Divide your sixteen croutons into four servings and top each bowl of soup with four of them."
                }
            ]
        },
        {
            "name": "Broiling Cheese",
            "steps": [
                {
                    "headline": "Prep for broiling.",
                    "description": "You’re going to broil the cheese for each serving directly in its bowl with the soup already inside, so make your favorite tomato soup recipe beforehand. While that’s cooking, preheat your oven to 350 degrees Fahrenheit (177 degrees Celsius). Then line a baking sheet with aluminum foil and place your four serving bowls on top."
                },
                {
                    "headline": "Fill your bowls.",
                    "description": "Once your soup is cooked, divide it between four oven-safe bowls in equal portions. Next, lightly spread butter over one side of four separate slices of bread. Place each slice directly on top of the soup with the buttered side facing up. Divide 1 cup (113 g) of grated cheddar cheese into quarters and then top each slice with one quarter. Because the bread is placed directly on the soup, buy a full loaf and slice it yourself, nice and thick, so it doesn’t weaken in the liquid. Pre-sliced sandwich bread may be too thin and will probably end up dissolving in the soup."
                },
                {
                    "headline": "Melt your cheese and then serve.",
                    "description": "Place the baking sheet in your preheated oven. Set a timer for 15 minutes. Once it goes off, check the cheese. If it has browned and started to bubble, it’s good to go. If not, give it another five minutes and check again. Once it’s done, give it a minute or two to cool off before serving. To deepen the color for a more golden brown, transfer the baking sheet from the oven to under the broiler for another five minutes. Warn guests that the bowls were in the oven and will be extremely hot to the touch."
                }
            ]
        }
    ],
    "tyn": [
        "Polenta Croutons:",
        "Oven",
        "Cutting board",
        "Knife",
        "Measuring spoon",
        "Mixing bowl",
        "Baking sheet",
        "Melted-Cheese Croutons",
        "Knife for spreading",
        "Large skillet",
        "Stovetop",
        "Knife for cutting",
        "Broiling Cheddar:",
        "Aluminum foil",
        "Oven-safe serving bowls"
    ],
    "text": " Baking Polenta Croutons Cut your polenta. First, preheat your oven to 350 degrees Fahrenheit (177 degrees Celsius). While that heats up, remove the polenta from its wrapping and place it on a cutting board. Slice it into cubes roughly ½ to ¾ inch in size (1.27 to 1.9 cm). Prep for baking. Transfer your cubes into a small mixing bowl. Drizzle them with 1 tablespoon of olive oil. Then toss them to distribute the oil more evenly. To make sure they don’t stick to your baking sheet, spray the sheet with olive oil. Bake your croutons. Place your cubes on your baking sheet. Make sure they are spread out, with each one sitting directly on the sheet, as opposed to piled on top of each other. Place the baking sheet in the oven and set a timer for 10 minutes. When it goes off, remove the sheet and toss or flip the cubes so each one rests on a new side. Repeat every 10 minutes for a total cooking time of 35 to 40 minutes, or until they grow crisp and browned. Making Melted-Cheese Croutons Prep two grilled cheese sandwiches. Lay out four slices of sandwich bread. Spread butter or margarine to lightly cover both sides of each slice. Then cover two of them with sliced or shredded sharp cheddar cheese each, using 1 ounce (28.33 g) for each one. Cover each one with one of the other slices. Grill your sandwiches. Place a large dry skillet on one of your stovetop’s burners. Turn the heat to medium-low. Once it heats up, place your sandwiches inside. Grill each side for approximately three minutes, until the cheese melts and the breads toasts to a golden brown. Cut your croutons and top your soup. Transfer the sandwiches to a cutting board. Let them sit for a minute or two, until they are cool enough to touch. Trim away the crusts, then slice each sandwich into eight croutons of roughly even size. Divide your sixteen croutons into four servings and top each bowl of soup with four of them. Broiling Cheese Prep for broiling. You’re going to broil the cheese for each serving directly in its bowl with the soup already inside, so make your favorite tomato soup recipe beforehand. While that’s cooking, preheat your oven to 350 degrees Fahrenheit (177 degrees Celsius). Then line a baking sheet with aluminum foil and place your four serving bowls on top. Fill your bowls. Once your soup is cooked, divide it between four oven-safe bowls in equal portions. Next, lightly spread butter over one side of four separate slices of bread. Place each slice directly on top of the soup with the buttered side facing up. Divide 1 cup (113 g) of grated cheddar cheese into quarters and then top each slice with one quarter. Because the bread is placed directly on the soup, buy a full loaf and slice it yourself, nice and thick, so it doesn’t weaken in the liquid. Pre-sliced sandwich bread may be too thin and will probably end up dissolving in the soup. Melt your cheese and then serve. Place the baking sheet in your preheated oven. Set a timer for 15 minutes. Once it goes off, check the cheese. If it has browned and started to bubble, it’s good to go. If not, give it another five minutes and check again. Once it’s done, give it a minute or two to cool off before serving. To deepen the color for a more golden brown, transfer the baking sheet from the oven to under the broiler for another five minutes. Warn guests that the bowls were in the oven and will be extremely hot to the touch.",
    "sentences": [
        " Baking Polenta Croutons Cut your polenta.",
        "First, preheat your oven to 350 degrees Fahrenheit (177 degrees Celsius).",
        "While that heats up, remove the polenta from its wrapping and place it on a cutting board.",
        "Slice it into cubes roughly ½ to ¾ inch in size (1.27 to 1.9 cm).",
        "Prep for baking.",
        "Transfer your cubes into a small mixing bowl.",
        "Drizzle them with 1 tablespoon of olive oil.",
        "Then toss them to distribute the oil more evenly.",
        "To make sure they don’t stick to your baking sheet, spray the sheet with olive oil.",
        "Bake your croutons.",
        "Place your cubes on your baking sheet.",
        "Make sure they are spread out, with each one sitting directly on the sheet, as opposed to piled on top of each other.",
        "Place the baking sheet in the oven and set a timer for 10 minutes.",
        "When it goes off, remove the sheet and toss or flip the cubes so each one rests on a new side.",
        "Repeat every 10 minutes for a total cooking time of 35 to 40 minutes, or until they grow crisp and browned.",
        "Making Melted-Cheese Croutons Prep two grilled cheese sandwiches.",
        "Lay out four slices of sandwich bread.",
        "Spread butter or margarine to lightly cover both sides of each slice.",
        "Then cover two of them with sliced or shredded sharp cheddar cheese each, using 1 ounce (28.33 g) for each one.",
        "Cover each one with one of the other slices.",
        "Grill your sandwiches.",
        "Place a large dry skillet on one of your stovetop’s burners.",
        "Turn the heat to medium-low.",
        "Once it heats up, place your sandwiches inside.",
        "Grill each side for approximately three minutes, until the cheese melts and the breads toasts to a golden brown.",
        "Cut your croutons and top your soup.",
        "Transfer the sandwiches to a cutting board.",
        "Let them sit for a minute or two, until they are cool enough to touch.",
        "Trim away the crusts, then slice each sandwich into eight croutons of roughly even size.",
        "Divide your sixteen croutons into four servings and top each bowl of soup with four of them.",
        "Broiling Cheese Prep for broiling.",
        "You’re going to broil the cheese for each serving directly in its bowl with the soup already inside, so make your favorite tomato soup recipe beforehand.",
        "While that’s cooking, preheat your oven to 350 degrees Fahrenheit (177 degrees Celsius).",
        "Then line a baking sheet with aluminum foil and place your four serving bowls on top.",
        "Fill your bowls.",
        "Once your soup is cooked, divide it between four oven-safe bowls in equal portions.",
        "Next, lightly spread butter over one side of four separate slices of bread.",
        "Place each slice directly on top of the soup with the buttered side facing up.",
        "Divide 1 cup (113 g) of grated cheddar cheese into quarters and then top each slice with one quarter.",
        "Because the bread is placed directly on the soup, buy a full loaf and slice it yourself, nice and thick, so it doesn’t weaken in the liquid.",
        "Pre-sliced sandwich bread may be too thin and will probably end up dissolving in the soup.",
        "Melt your cheese and then serve.",
        "Place the baking sheet in your preheated oven.",
        "Set a timer for 15 minutes.",
        "Once it goes off, check the cheese.",
        "If it has browned and started to bubble, it’s good to go.",
        "If not, give it another five minutes and check again.",
        "Once it’s done, give it a minute or two to cool off before serving.",
        "To deepen the color for a more golden brown, transfer the baking sheet from the oven to under the broiler for another five minutes.",
        "Warn guests that the bowls were in the oven and will be extremely hot to the touch."
    ]
}