{
    "title": "How to Use a Can of Beans",
    "url": "https://www.wikihow.com/Use-a-Can-of-Beans",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Rice and Beans"
    ],
    "methods": [
        {
            "name": "Opening and Preparing the Beans",
            "steps": [
                {
                    "headline": "Check the expiry date.",
                    "description": "Open your cupboard and find the can of beans. You should see an expiry date printed on the top or bottom of the can. It might be printed in small letters so you should make sure you have adequate lighting in the room. If you use glasses, you may want to put on your glasses before checking the expiry date."
                },
                {
                    "headline": "Open the can of beans.",
                    "description": "Place a can opener on the side of the can and turn the can opener in a clockwise direction until you have opened the can. Pull up the top of the can with your fingers, a knife or a fork. If the can of beans has a ring pin, you can just pull the pin upwards to open it. If you do not have a regular can opener, you can use the can opener on a swiss army or other utility knife can opener. If you do not have a can opener, it is best to go to the store and pick one up. Although one can use other implements, such as a sharp knife, it can be dangerous to open a can of beans without a can opener."
                },
                {
                    "headline": "Drain the beans.",
                    "description": "It is very important to drain the can of beans because beans are stored in water and salt based brine. Although there is nothing wrong with eating the brine, it contains a lot of sodium that you may not want to use in your recipe. Pour the beans into a colander in the sink and rinse them with cold water to remove the brine and excess sodium."
                }
            ]
        },
        {
            "name": "Cooking Main Dishes with Beans",
            "steps": [
                {
                    "headline": "Make huevos rancheros.",
                    "description": "In a saucepan over medium-high heat, add the oil, garlic and cumin. Stir the ingredients until you can smell the fragrant cumin or for about a minute. Then, add the beans and the water. Cook the beans for six or seven minutes. At the end, add the lime juice and mash the beans with a potato masher."
                },
                {
                    "headline": "Prepare the huevos rancheros.",
                    "description": "In a non-stick pan, add two teaspoons of oil, crack the eggs into the pan and cook for two or three minutes until the eggs are cooked to your liking. Put a tortilla on a plate, add a layer of beans, followed by the eggs and the feta."
                },
                {
                    "headline": "Cook black bean, squash and turkey burritos.",
                    "description": "Start by chopping the butternut squash into half inch pieces. In a non-stick frying pan on medium to high heat, cook the squash in the canola oil for three or four minutes on each side. Put the squash aside in a bowl. Cook the onion and chili powder in the pan for two minutes. Then, add the turkey and cook it for three minutes or until it looks done (i.e., no longer pink). Finally, put the black beans, salt and cooked squash into the pan. Heat up the mixture for one or two minutes. Prepare the burritos. Heat up the tortillas in the microwave for ten seconds. Put the turkey mixture into the tortillas and then sprinkle some Jack cheese and cilantro on top. Roll up and serve the burritos."
                },
                {
                    "headline": "Mix a three bean salad with celery.",
                    "description": "Drain all of the cans of beans. Mix together the beans with the onion and celery. Then, add the dressing of olive oil, vinegar, sugar, salt, celery seed and black pepper. Stir the salad so that it is fully covered with dressing. Chill for two to four hours. If you have any other leftover cans of beans besides the kidney, garbanzo or green beans, you could throw them in or use them to replace one of the other cans. If you only have one can of beans, you could go to a local grocery store to pick up the other beans you need for the recipe."
                },
                {
                    "headline": "Cook red beans and rice.",
                    "description": "In large saucepan over medium to high heat, saute the garlic, onion, celery and bell pepper. Throw in the onion powder, kidney beans, hot sauce, salt and pepper. Once the mixture looks tender, reduce it to low and start the rice. In a pot, bring the chicken stock to a boil. Put in the rice and butter. Once it boils again, turn the heat down and simmer it for twenty minutes with the lid on. Mix the bean mixture with the rice. Serve it with some fresh cilantro on top."
                }
            ]
        },
        {
            "name": "Making Bean Side Dishes",
            "steps": [
                {
                    "headline": "Whip up a black bean dip.",
                    "description": "Puree the black beans, half the red onion, vinegar, orange juice, oil, garlic, cumin and cilantro in a food processor. Put the mixture in a bowl. Flavor it with salt and pepper. Put the remaining red onion on top and serve with tortilla chips or chopped vegetables."
                },
                {
                    "headline": "Serve black-eyed pea salsa.",
                    "description": "Drain the cans of black-eyed peas, a member of the bean and pea family that is actually a bean. In a medium size bowl, mix together the black-eyed peas with the tomatoes, lime juice and scallions. Season the bean dish with salt and pepper and serve it with tortilla chips."
                },
                {
                    "headline": "Make white bean bruschetta.",
                    "description": "Slice the loaf of white bread into half inch slices and then lightly toast it. Rub one side of each piece of toast with garlic. Grate half a teaspoon of peel from the lemon and squeeze out the juice. Put the beans, lemon juice and peel, parsley, oil, salt and pepper in a bowl. Mash up the bean mixture. Place bean mixture on the garlic toast. Add a sprinkle of parsley and serve."
                }
            ]
        }
    ],
    "tyn": [
        "Saucepan",
        "Potato masher",
        "Medium sized bowl",
        "Grater",
        "Toaster"
    ],
    "text": " Opening and Preparing the Beans Check the expiry date. Open your cupboard and find the can of beans. You should see an expiry date printed on the top or bottom of the can. It might be printed in small letters so you should make sure you have adequate lighting in the room. If you use glasses, you may want to put on your glasses before checking the expiry date. Open the can of beans. Place a can opener on the side of the can and turn the can opener in a clockwise direction until you have opened the can. Pull up the top of the can with your fingers, a knife or a fork. If the can of beans has a ring pin, you can just pull the pin upwards to open it. If you do not have a regular can opener, you can use the can opener on a swiss army or other utility knife can opener. If you do not have a can opener, it is best to go to the store and pick one up. Although one can use other implements, such as a sharp knife, it can be dangerous to open a can of beans without a can opener. Drain the beans. It is very important to drain the can of beans because beans are stored in water and salt based brine. Although there is nothing wrong with eating the brine, it contains a lot of sodium that you may not want to use in your recipe. Pour the beans into a colander in the sink and rinse them with cold water to remove the brine and excess sodium. Cooking Main Dishes with Beans Make huevos rancheros. In a saucepan over medium-high heat, add the oil, garlic and cumin. Stir the ingredients until you can smell the fragrant cumin or for about a minute. Then, add the beans and the water. Cook the beans for six or seven minutes. At the end, add the lime juice and mash the beans with a potato masher. Prepare the huevos rancheros. In a non-stick pan, add two teaspoons of oil, crack the eggs into the pan and cook for two or three minutes until the eggs are cooked to your liking. Put a tortilla on a plate, add a layer of beans, followed by the eggs and the feta. Cook black bean, squash and turkey burritos. Start by chopping the butternut squash into half inch pieces. In a non-stick frying pan on medium to high heat, cook the squash in the canola oil for three or four minutes on each side. Put the squash aside in a bowl. Cook the onion and chili powder in the pan for two minutes. Then, add the turkey and cook it for three minutes or until it looks done (i.e., no longer pink). Finally, put the black beans, salt and cooked squash into the pan. Heat up the mixture for one or two minutes. Prepare the burritos. Heat up the tortillas in the microwave for ten seconds. Put the turkey mixture into the tortillas and then sprinkle some Jack cheese and cilantro on top. Roll up and serve the burritos. Mix a three bean salad with celery. Drain all of the cans of beans. Mix together the beans with the onion and celery. Then, add the dressing of olive oil, vinegar, sugar, salt, celery seed and black pepper. Stir the salad so that it is fully covered with dressing. Chill for two to four hours. If you have any other leftover cans of beans besides the kidney, garbanzo or green beans, you could throw them in or use them to replace one of the other cans. If you only have one can of beans, you could go to a local grocery store to pick up the other beans you need for the recipe. Cook red beans and rice. In large saucepan over medium to high heat, saute the garlic, onion, celery and bell pepper. Throw in the onion powder, kidney beans, hot sauce, salt and pepper. Once the mixture looks tender, reduce it to low and start the rice. In a pot, bring the chicken stock to a boil. Put in the rice and butter. Once it boils again, turn the heat down and simmer it for twenty minutes with the lid on. Mix the bean mixture with the rice. Serve it with some fresh cilantro on top. Making Bean Side Dishes Whip up a black bean dip. Puree the black beans, half the red onion, vinegar, orange juice, oil, garlic, cumin and cilantro in a food processor. Put the mixture in a bowl. Flavor it with salt and pepper. Put the remaining red onion on top and serve with tortilla chips or chopped vegetables. Serve black-eyed pea salsa. Drain the cans of black-eyed peas, a member of the bean and pea family that is actually a bean. In a medium size bowl, mix together the black-eyed peas with the tomatoes, lime juice and scallions. Season the bean dish with salt and pepper and serve it with tortilla chips. Make white bean bruschetta. Slice the loaf of white bread into half inch slices and then lightly toast it. Rub one side of each piece of toast with garlic. Grate half a teaspoon of peel from the lemon and squeeze out the juice. Put the beans, lemon juice and peel, parsley, oil, salt and pepper in a bowl. Mash up the bean mixture. Place bean mixture on the garlic toast. Add a sprinkle of parsley and serve.",
    "sentences": [
        " Opening and Preparing the Beans Check the expiry date.",
        "Open your cupboard and find the can of beans.",
        "You should see an expiry date printed on the top or bottom of the can.",
        "It might be printed in small letters so you should make sure you have adequate lighting in the room.",
        "If you use glasses, you may want to put on your glasses before checking the expiry date.",
        "Open the can of beans.",
        "Place a can opener on the side of the can and turn the can opener in a clockwise direction until you have opened the can.",
        "Pull up the top of the can with your fingers, a knife or a fork.",
        "If the can of beans has a ring pin, you can just pull the pin upwards to open it.",
        "If you do not have a regular can opener, you can use the can opener on a swiss army or other utility knife can opener.",
        "If you do not have a can opener, it is best to go to the store and pick one up.",
        "Although one can use other implements, such as a sharp knife, it can be dangerous to open a can of beans without a can opener.",
        "Drain the beans.",
        "It is very important to drain the can of beans because beans are stored in water and salt based brine.",
        "Although there is nothing wrong with eating the brine, it contains a lot of sodium that you may not want to use in your recipe.",
        "Pour the beans into a colander in the sink and rinse them with cold water to remove the brine and excess sodium.",
        "Cooking Main Dishes with Beans Make huevos rancheros.",
        "In a saucepan over medium-high heat, add the oil, garlic and cumin.",
        "Stir the ingredients until you can smell the fragrant cumin or for about a minute.",
        "Then, add the beans and the water.",
        "Cook the beans for six or seven minutes.",
        "At the end, add the lime juice and mash the beans with a potato masher.",
        "Prepare the huevos rancheros.",
        "In a non-stick pan, add two teaspoons of oil, crack the eggs into the pan and cook for two or three minutes until the eggs are cooked to your liking.",
        "Put a tortilla on a plate, add a layer of beans, followed by the eggs and the feta.",
        "Cook black bean, squash and turkey burritos.",
        "Start by chopping the butternut squash into half inch pieces.",
        "In a non-stick frying pan on medium to high heat, cook the squash in the canola oil for three or four minutes on each side.",
        "Put the squash aside in a bowl.",
        "Cook the onion and chili powder in the pan for two minutes.",
        "Then, add the turkey and cook it for three minutes or until it looks done (i.e., no longer pink).",
        "Finally, put the black beans, salt and cooked squash into the pan.",
        "Heat up the mixture for one or two minutes.",
        "Prepare the burritos.",
        "Heat up the tortillas in the microwave for ten seconds.",
        "Put the turkey mixture into the tortillas and then sprinkle some Jack cheese and cilantro on top.",
        "Roll up and serve the burritos.",
        "Mix a three bean salad with celery.",
        "Drain all of the cans of beans.",
        "Mix together the beans with the onion and celery.",
        "Then, add the dressing of olive oil, vinegar, sugar, salt, celery seed and black pepper.",
        "Stir the salad so that it is fully covered with dressing.",
        "Chill for two to four hours.",
        "If you have any other leftover cans of beans besides the kidney, garbanzo or green beans, you could throw them in or use them to replace one of the other cans.",
        "If you only have one can of beans, you could go to a local grocery store to pick up the other beans you need for the recipe.",
        "Cook red beans and rice.",
        "In large saucepan over medium to high heat, saute the garlic, onion, celery and bell pepper.",
        "Throw in the onion powder, kidney beans, hot sauce, salt and pepper.",
        "Once the mixture looks tender, reduce it to low and start the rice.",
        "In a pot, bring the chicken stock to a boil.",
        "Put in the rice and butter.",
        "Once it boils again, turn the heat down and simmer it for twenty minutes with the lid on.",
        "Mix the bean mixture with the rice.",
        "Serve it with some fresh cilantro on top.",
        "Making Bean Side Dishes Whip up a black bean dip.",
        "Puree the black beans, half the red onion, vinegar, orange juice, oil, garlic, cumin and cilantro in a food processor.",
        "Put the mixture in a bowl.",
        "Flavor it with salt and pepper.",
        "Put the remaining red onion on top and serve with tortilla chips or chopped vegetables.",
        "Serve black-eyed pea salsa.",
        "Drain the cans of black-eyed peas, a member of the bean and pea family that is actually a bean.",
        "In a medium size bowl, mix together the black-eyed peas with the tomatoes, lime juice and scallions.",
        "Season the bean dish with salt and pepper and serve it with tortilla chips.",
        "Make white bean bruschetta.",
        "Slice the loaf of white bread into half inch slices and then lightly toast it.",
        "Rub one side of each piece of toast with garlic.",
        "Grate half a teaspoon of peel from the lemon and squeeze out the juice.",
        "Put the beans, lemon juice and peel, parsley, oil, salt and pepper in a bowl.",
        "Mash up the bean mixture.",
        "Place bean mixture on the garlic toast.",
        "Add a sprinkle of parsley and serve."
    ]
}