{
    "title": "How to Make Peach Syrup",
    "url": "https://www.wikihow.com/Make-Peach-Syrup",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Jams Preserves and Condiments",
        "Syrups"
    ],
    "parts": [
        {
            "name": "Selecting Peaches for the Syrup",
            "steps": [
                {
                    "headline": "Select four fresh, organic peaches from your local supermarket.",
                    "description": "Your peach syrup will taste best if it’s prepared with fresh and organic peaches. Visit your local supermarket and see what they have in stock. When selecting peaches, look closely at the skin and make sure that the peach is not torn or bruised. The peaches you select should not be firm (a sign of under-ripe fruit) but should gently give if you squeeze slightly. If applicable, look in your supermarket’s organic section, or visit a nearby organic foods or health-food store. Peaches sold at these locations will likely be healthier and will have been grown under organic conditions."
                },
                {
                    "headline": "Visit a local farmer’s market to shop for peaches.",
                    "description": "If you live in a city or neighborhood that has a frequent farmer’s market, plan to purchase your peaches there. Peaches from a local vendor are likely to have been picked within only a few days, and will have been grown without pesticides. Farmer’s markets are typically only open during the spring and summer months, roughly from April through September. Look online or ask at a local grocery store to find out if there’s a farmer’s market near you."
                },
                {
                    "headline": "Purchase two 16-ounce packages of frozen peaches.",
                    "description": "If you’re preparing the recipe in a hurry and don’t have time to prepare whole peaches, or if you are unable to find ripe, fresh, or organic peaches, just grab frozen peaches out of the frozen-foods section at your local grocery store. As with shopping for fresh peaches, look for organic bags of frozen peaches. These will have been prepared without pesticides."
                }
            ]
        },
        {
            "name": "Making Peach Syrup on the Stovetop",
            "steps": [
                {
                    "headline": "Wash, pit, and quarter the peaches.",
                    "description": "To begin preparing the peaches for the sauce, you’ll need to wash off any dirt from the fuzzy skin of the peach. (Be sure to leave the skin on however, as it contains both nutrients and flavor.) Then slice the peaches in half, and use your fingers to pry out the peach pit. Finally, cut the peaches in half again, so that you are left with peach quarters. Although this recipe only calls for four peaches, it can easily be doubled or tripled. As long as you’re washing and cutting peaches, consider preparing eight or twelve instead of only four."
                },
                {
                    "headline": "Simmer the peaches.",
                    "description": "Take your peach quarters, and place them in a large saucepan. Add 1 cup of water, ¼ cup of fresh lemon juice, and 3 cups of granulated sugar. Do not stir the mixture, but cover and bring to a simmer over medium heat. Once the mixture is simmering, reduce to a low temperature and allow it to simmer for 30 to 45 minutes. Do not stir the peaches while they’re simmering. Even gentle stirring can smash the peach quarters and break them apart. In order to have relatively well preserved peach pieces, let the mixture simmer unstirred."
                },
                {
                    "headline": "Strain and jar the peach syrup.",
                    "description": "Once your peach syrup has simmered, turn off the burner and remove the saucepan. You’ll need to strain the syrup to separate the syrup itself from the peach quarters. To do this, pour the contents of the saucepan into a fine colander and set this over a large bowl or container. Let the liquid syrup filter out through the colander for about an hour. As the syrup strains, use a wooden spoon to press down on the solid peach material. Press gently: if you exert too much pressure on the peach quarters, they may become damaged and turn the syrup cloudy."
                }
            ]
        },
        {
            "name": "Thickening and Storing the Syrup",
            "steps": [
                {
                    "headline": "Thicken your syrup if its consistency is too thin.",
                    "description": "If the syrup is thinner or runnier than you would like it to be—or if you want to set aside a portion of the syrup and thicken it so that you have syrup of two separate consistencies—you can thicken the syrup using cornstarch. Take a cup of your peach syrup and, using a whisk, blend 1 tablespoon of corn starch into the syrup. Then transfer a mixture to a saucepan and bring to a boil, using the whisk to stir constantly. You can use the color of the syrup to gauge if it has thickened fully. When you’re mixing in the cornstarch at first, the mixture will be cloudy, but after the syrup has boiled for a few minutes, it’ll become clear again."
                },
                {
                    "headline": "Keep the peach pulp for use in smoothies or cooking.",
                    "description": "The peach pulp itself will still have a strong flavor after simmering and straining, although its consistency will be mushy. You don’t need to throw the pulp away; rather, let it cool and then freeze the pulp in plastic bags or Tupperware containers. The pulp can be combined with other fruits in a smoothie, or added on top of yogurt. If you’d like to even out the consistency of the peach pulp before freezing it, spoon the pulp into a blender and puree it to a uniform consistency."
                },
                {
                    "headline": "Store the syrup in your refrigerator.",
                    "description": "Once you have strained the syrup, let it cool down to room temperature; this will take roughly an hour. When the syrup has cooled down, you can pour it into jars, cans, or plastic Tupperware containers and store it in your refrigerator. The fresh peach syrup will keep for about two weeks, so you should plan to consume it all within that period of time."
                }
            ]
        }
    ],
    "tyn": [
        "Kitchen knife",
        "Cutting board",
        "Sauce pan",
        "Colander"
    ],
    "text": " Selecting Peaches for the Syrup Select four fresh, organic peaches from your local supermarket. Your peach syrup will taste best if it’s prepared with fresh and organic peaches. Visit your local supermarket and see what they have in stock. When selecting peaches, look closely at the skin and make sure that the peach is not torn or bruised. The peaches you select should not be firm (a sign of under-ripe fruit) but should gently give if you squeeze slightly. If applicable, look in your supermarket’s organic section, or visit a nearby organic foods or health-food store. Peaches sold at these locations will likely be healthier and will have been grown under organic conditions. Visit a local farmer’s market to shop for peaches. If you live in a city or neighborhood that has a frequent farmer’s market, plan to purchase your peaches there. Peaches from a local vendor are likely to have been picked within only a few days, and will have been grown without pesticides. Farmer’s markets are typically only open during the spring and summer months, roughly from April through September. Look online or ask at a local grocery store to find out if there’s a farmer’s market near you. Purchase two 16-ounce packages of frozen peaches. If you’re preparing the recipe in a hurry and don’t have time to prepare whole peaches, or if you are unable to find ripe, fresh, or organic peaches, just grab frozen peaches out of the frozen-foods section at your local grocery store. As with shopping for fresh peaches, look for organic bags of frozen peaches. These will have been prepared without pesticides. Making Peach Syrup on the Stovetop Wash, pit, and quarter the peaches. To begin preparing the peaches for the sauce, you’ll need to wash off any dirt from the fuzzy skin of the peach. (Be sure to leave the skin on however, as it contains both nutrients and flavor.) Then slice the peaches in half, and use your fingers to pry out the peach pit. Finally, cut the peaches in half again, so that you are left with peach quarters. Although this recipe only calls for four peaches, it can easily be doubled or tripled. As long as you’re washing and cutting peaches, consider preparing eight or twelve instead of only four. Simmer the peaches. Take your peach quarters, and place them in a large saucepan. Add 1 cup of water, ¼ cup of fresh lemon juice, and 3 cups of granulated sugar. Do not stir the mixture, but cover and bring to a simmer over medium heat. Once the mixture is simmering, reduce to a low temperature and allow it to simmer for 30 to 45 minutes. Do not stir the peaches while they’re simmering. Even gentle stirring can smash the peach quarters and break them apart. In order to have relatively well preserved peach pieces, let the mixture simmer unstirred. Strain and jar the peach syrup. Once your peach syrup has simmered, turn off the burner and remove the saucepan. You’ll need to strain the syrup to separate the syrup itself from the peach quarters. To do this, pour the contents of the saucepan into a fine colander and set this over a large bowl or container. Let the liquid syrup filter out through the colander for about an hour. As the syrup strains, use a wooden spoon to press down on the solid peach material. Press gently: if you exert too much pressure on the peach quarters, they may become damaged and turn the syrup cloudy. Thickening and Storing the Syrup Thicken your syrup if its consistency is too thin. If the syrup is thinner or runnier than you would like it to be—or if you want to set aside a portion of the syrup and thicken it so that you have syrup of two separate consistencies—you can thicken the syrup using cornstarch. Take a cup of your peach syrup and, using a whisk, blend 1 tablespoon of corn starch into the syrup. Then transfer a mixture to a saucepan and bring to a boil, using the whisk to stir constantly. You can use the color of the syrup to gauge if it has thickened fully. When you’re mixing in the cornstarch at first, the mixture will be cloudy, but after the syrup has boiled for a few minutes, it’ll become clear again. Keep the peach pulp for use in smoothies or cooking. The peach pulp itself will still have a strong flavor after simmering and straining, although its consistency will be mushy. You don’t need to throw the pulp away; rather, let it cool and then freeze the pulp in plastic bags or Tupperware containers. The pulp can be combined with other fruits in a smoothie, or added on top of yogurt. If you’d like to even out the consistency of the peach pulp before freezing it, spoon the pulp into a blender and puree it to a uniform consistency. Store the syrup in your refrigerator. Once you have strained the syrup, let it cool down to room temperature; this will take roughly an hour. When the syrup has cooled down, you can pour it into jars, cans, or plastic Tupperware containers and store it in your refrigerator. The fresh peach syrup will keep for about two weeks, so you should plan to consume it all within that period of time.",
    "sentences": [
        " Selecting Peaches for the Syrup Select four fresh, organic peaches from your local supermarket.",
        "Your peach syrup will taste best if it’s prepared with fresh and organic peaches.",
        "Visit your local supermarket and see what they have in stock.",
        "When selecting peaches, look closely at the skin and make sure that the peach is not torn or bruised.",
        "The peaches you select should not be firm (a sign of under-ripe fruit) but should gently give if you squeeze slightly.",
        "If applicable, look in your supermarket’s organic section, or visit a nearby organic foods or health-food store.",
        "Peaches sold at these locations will likely be healthier and will have been grown under organic conditions.",
        "Visit a local farmer’s market to shop for peaches.",
        "If you live in a city or neighborhood that has a frequent farmer’s market, plan to purchase your peaches there.",
        "Peaches from a local vendor are likely to have been picked within only a few days, and will have been grown without pesticides.",
        "Farmer’s markets are typically only open during the spring and summer months, roughly from April through September.",
        "Look online or ask at a local grocery store to find out if there’s a farmer’s market near you.",
        "Purchase two 16-ounce packages of frozen peaches.",
        "If you’re preparing the recipe in a hurry and don’t have time to prepare whole peaches, or if you are unable to find ripe, fresh, or organic peaches, just grab frozen peaches out of the frozen-foods section at your local grocery store.",
        "As with shopping for fresh peaches, look for organic bags of frozen peaches.",
        "These will have been prepared without pesticides.",
        "Making Peach Syrup on the Stovetop Wash, pit, and quarter the peaches.",
        "To begin preparing the peaches for the sauce, you’ll need to wash off any dirt from the fuzzy skin of the peach.",
        "(Be sure to leave the skin on however, as it contains both nutrients and flavor.)",
        "Then slice the peaches in half, and use your fingers to pry out the peach pit.",
        "Finally, cut the peaches in half again, so that you are left with peach quarters.",
        "Although this recipe only calls for four peaches, it can easily be doubled or tripled.",
        "As long as you’re washing and cutting peaches, consider preparing eight or twelve instead of only four.",
        "Simmer the peaches.",
        "Take your peach quarters, and place them in a large saucepan.",
        "Add 1 cup of water, ¼ cup of fresh lemon juice, and 3 cups of granulated sugar.",
        "Do not stir the mixture, but cover and bring to a simmer over medium heat.",
        "Once the mixture is simmering, reduce to a low temperature and allow it to simmer for 30 to 45 minutes.",
        "Do not stir the peaches while they’re simmering.",
        "Even gentle stirring can smash the peach quarters and break them apart.",
        "In order to have relatively well preserved peach pieces, let the mixture simmer unstirred.",
        "Strain and jar the peach syrup.",
        "Once your peach syrup has simmered, turn off the burner and remove the saucepan.",
        "You’ll need to strain the syrup to separate the syrup itself from the peach quarters.",
        "To do this, pour the contents of the saucepan into a fine colander and set this over a large bowl or container.",
        "Let the liquid syrup filter out through the colander for about an hour.",
        "As the syrup strains, use a wooden spoon to press down on the solid peach material.",
        "Press gently: if you exert too much pressure on the peach quarters, they may become damaged and turn the syrup cloudy.",
        "Thickening and Storing the Syrup Thicken your syrup if its consistency is too thin.",
        "If the syrup is thinner or runnier than you would like it to be—or if you want to set aside a portion of the syrup and thicken it so that you have syrup of two separate consistencies—you can thicken the syrup using cornstarch.",
        "Take a cup of your peach syrup and, using a whisk, blend 1 tablespoon of corn starch into the syrup.",
        "Then transfer a mixture to a saucepan and bring to a boil, using the whisk to stir constantly.",
        "You can use the color of the syrup to gauge if it has thickened fully.",
        "When you’re mixing in the cornstarch at first, the mixture will be cloudy, but after the syrup has boiled for a few minutes, it’ll become clear again.",
        "Keep the peach pulp for use in smoothies or cooking.",
        "The peach pulp itself will still have a strong flavor after simmering and straining, although its consistency will be mushy.",
        "You don’t need to throw the pulp away; rather, let it cool and then freeze the pulp in plastic bags or Tupperware containers.",
        "The pulp can be combined with other fruits in a smoothie, or added on top of yogurt.",
        "If you’d like to even out the consistency of the peach pulp before freezing it, spoon the pulp into a blender and puree it to a uniform consistency.",
        "Store the syrup in your refrigerator.",
        "Once you have strained the syrup, let it cool down to room temperature; this will take roughly an hour.",
        "When the syrup has cooled down, you can pour it into jars, cans, or plastic Tupperware containers and store it in your refrigerator.",
        "The fresh peach syrup will keep for about two weeks, so you should plan to consume it all within that period of time."
    ]
}