{
    "title": "How to Make Strawberry Mousse",
    "url": "https://www.wikihow.com/Make-Strawberry-Mousse",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Desserts and Sweets",
        "Dessert Mousses"
    ],
    "methods": [
        {
            "name": "Making Classic Strawberry Mousse",
            "steps": [
                {
                    "headline": "Dissolve the gelatin in water.",
                    "description": "Get out a small bowl and pour 1/4 (60 ml) of water into it. Sprinkle 1 tablespoon of powdered gelatin evenly over the water. Don't stir the gelatin into the water. Instead, just let it sit for 5 minutes. The gelatin will begin to soak up the water as it stands."
                },
                {
                    "headline": "Combine the strawberries with sugar.",
                    "description": "Wash 2 pints (680 g) of strawberries and put half of them aside. Use a sharp knife to trim off the stems from 1 pint (340 g) of the strawberries. Chop the strawberries into pieces. Sprinkle 3 tablespoons of the sugar over the strawberries and let them sit for several minutes while you prepare the rest of the strawberries. Letting the strawberries sit with the sugar is known as macerating the fruit. This will help the strawberries release their liquid and make the strawberry flavor stronger."
                },
                {
                    "headline": "Puree some of the strawberries and slice the rest.",
                    "description": "Transfer the sugared strawberries to a food processor or blender and blitz the strawberries until they're slightly chunky. Set these aside and get out the remaining pint of whole strawberries. Trim off the stems and slice the strawberries. Sprinkle the last 3 tablespoons of sugar over the sliced berries. If you don't have a blender or food processor, you can use a fork or potato masher to mash the strawberries."
                },
                {
                    "headline": "Drain the sliced strawberries.",
                    "description": "Set a fine-mesh strainer in the sink or over a bowl and place the sliced and sugared berries in the strainer. Let them sit for a few minutes, so the liquid from the strawberries drips into the sink or bowl. Discard or save the liquid for another recipe. You want to remove the excess liquid, so the mousse sets up properly."
                },
                {
                    "headline": "Whip the cream with powdered sugar and vanilla.",
                    "description": "Pour 1 1/2 cups (350 ml) of heavy cream into a large mixing bowl and add 3 tablespoons of powdered sugar along with 1 teaspoon of vanilla. Use a stand or hand mixer to whisk the cream on high speed. Whip the mixture for a few minutes, so the cream becomes stiff. Try to chill the bowl and whisk attachments before you beat the cream. This will help the cream whip up faster."
                },
                {
                    "headline": "Melt the gelatin and mix it into the pureed strawberries.",
                    "description": "Place the dish of gelatin in the microwave. Microwave it for 30 seconds, so the gelatin completely dissolves into liquid. Avoid boiling the gelatin. Pour the gelatin into a large bowl along with the pureed strawberries. Stir them well. You can also melt the gelatin over a double boiler, if you don't want to use the microwave."
                },
                {
                    "headline": "Fold in the whipped cream and chill the mousse.",
                    "description": "Gently scoop and fold the whipped cream into the strawberry gelatin mixture. Keep twisting your wrist holding a spatula, so that the cream is completely incorporated. Lay the sliced strawberries in the bottom of you serving bowl and scoop the strawberry mousse over the berries. Refrigerate the mousse for a few hours, so it sets up. Garnish the mousse with additional sliced berries."
                }
            ]
        },
        {
            "name": "Making Gelatin-Free Strawberry Mousse",
            "steps": [
                {
                    "headline": "Puree the strawberries with the sugar.",
                    "description": "Wash 2 cups (340 g) of fresh strawberries and use a knife to carefully cut and discard the stems. Cut the strawberries into quarters and place them in a blender or food processor. Add 3 tablespoons of sugar and put the lid on the blender. Puree the strawberries until they're completely smooth. Blending the strawberries will also help the sugar dissolve."
                },
                {
                    "headline": "Dissolve the agar flakes in hot water.",
                    "description": "Get out a small bowl and measure 2 tablespoons of agar flakes into it. Carefully pour 1/8 cup (30 ml) of hot water over the flakes. Stir the mixture to dissolve the flakes and set the bowl aside, so the agar cools. Avoid letting the mixture turn solid. Agar flakes are a vegetable gelatin made from sea vegetables. This makes them a safe vegan choice for making mousse."
                },
                {
                    "headline": "Whisk the whipping cream, powdered sugar, and agar mixture.",
                    "description": "Pour 1 1/4 cups (300 ml) of whipping cream into a large mixing bowl along with 2 tablespoons of powdered sugar. Add the cooled agar mixture to the bowl. Use a stand or hand mixer with whisk attachments to whisk the ingredients on high speed. Whisk the mixture for a few minutes, so the cream becomes stiff. If you can, chill the mixing bowl and whisk attachments for 5 to 15 minutes before you whisk the mixture. A cold bowl will help the cream whip up faster."
                },
                {
                    "headline": "Combine the gelatin-free strawberry mousse.",
                    "description": "Transfer the strawberry puree to a serving bowl or mixing bowl and add the whipped cream mixture. Use a rubber spatula to gently fold the cream into the strawberry puree. You can chill the mousse or scoop it into individual serving dishes before you chill it. Refrigerate the mousse for 4 to 6 hours, so it sets up. Garnish the mousse with 2 to 3 fresh strawberries and fresh mint."
                }
            ]
        },
        {
            "name": "Making Strawberry Marshmallow Mousse",
            "steps": [
                {
                    "headline": "Combine the strawberries, sugar, and water.",
                    "description": "Get out a small saucepan and wash 1 1/4 cups (250 g) of fresh strawberries. Use a small knife to carefully trim off the strawberry stems and discard them. Cut the strawberries in half, if they're large. Set 2 strawberries aside and place the remaining strawberries in the pan along with:\n1/8 cup (25 g) of sugar\n1/3 cup + 2 tablespoons (100 ml) of water"
                },
                {
                    "headline": "Simmer and mash the strawberries.",
                    "description": "Turn the heat on to medium and stir the sugared strawberries. Cook the strawberries, so they start to bubble gently. Simmer the strawberries for 3 minutes or until they're soft. Turn off the heat and use a fork to mash the strawberries. You could also use a potato masher to mash the strawberries. Be gentle when mashing, so you don't splash hot juice on you."
                },
                {
                    "headline": "Stir in the mini-marshmallows.",
                    "description": "Measure out 1 1/2 cups (140 g) of mini-marshmallows and add them to the hot strawberry mixture. Stir the mini-marshmallows in, so they dissolve completely. Let the mixture cool in the pan. The mini-marshmallows will help the strawberry mousse set up, since the mini-marshmallows contain gelatin."
                },
                {
                    "headline": "Whip the heavy cream.",
                    "description": "Place 3/4 cup + 2 tablespoons (200 ml) of heavy whipping cream into a large mixing bowl. Use a stand or hand mixer to whisk the cream on high speed for several minutes. The cream should stiffen, so the whisks leave firm peaks when you lift them away. To help the cream whip, chill the mixing bowl and whisk attachments for 5 to 15 minutes before whipping the cream."
                },
                {
                    "headline": "Combine and chill the strawberry marshmallow mousse.",
                    "description": "Once the strawberry mixture is cool, scoop in the whipped cream and use a rubber spatula to gently fold it in. Transfer the strawberry marshmallow mousse into a serving bowl or individual dishes. Refrigerate the mousse for 2 hours, so it sets up. You can cut the reserved strawberries in half and garnish the mousse with the halves."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Measuring cups and spoons",
        "9 x 13-inch (23 x 33-cm) pan",
        "Small saucepan",
        "Small knife and cutting board",
        "Fork or potato masher",
        "Small bowl",
        "Spoon",
        "Large mixing bowl",
        "Blender or food processor",
        "Stand or hand mixer with whisk attachments",
        "Serving bowl or individual serving dishes"
    ],
    "text": " Making Classic Strawberry Mousse Dissolve the gelatin in water. Get out a small bowl and pour 1/4 (60 ml) of water into it. Sprinkle 1 tablespoon of powdered gelatin evenly over the water. Don't stir the gelatin into the water. Instead, just let it sit for 5 minutes. The gelatin will begin to soak up the water as it stands. Combine the strawberries with sugar. Wash 2 pints (680 g) of strawberries and put half of them aside. Use a sharp knife to trim off the stems from 1 pint (340 g) of the strawberries. Chop the strawberries into pieces. Sprinkle 3 tablespoons of the sugar over the strawberries and let them sit for several minutes while you prepare the rest of the strawberries. Letting the strawberries sit with the sugar is known as macerating the fruit. This will help the strawberries release their liquid and make the strawberry flavor stronger. Puree some of the strawberries and slice the rest. Transfer the sugared strawberries to a food processor or blender and blitz the strawberries until they're slightly chunky. Set these aside and get out the remaining pint of whole strawberries. Trim off the stems and slice the strawberries. Sprinkle the last 3 tablespoons of sugar over the sliced berries. If you don't have a blender or food processor, you can use a fork or potato masher to mash the strawberries. Drain the sliced strawberries. Set a fine-mesh strainer in the sink or over a bowl and place the sliced and sugared berries in the strainer. Let them sit for a few minutes, so the liquid from the strawberries drips into the sink or bowl. Discard or save the liquid for another recipe. You want to remove the excess liquid, so the mousse sets up properly. Whip the cream with powdered sugar and vanilla. Pour 1 1/2 cups (350 ml) of heavy cream into a large mixing bowl and add 3 tablespoons of powdered sugar along with 1 teaspoon of vanilla. Use a stand or hand mixer to whisk the cream on high speed. Whip the mixture for a few minutes, so the cream becomes stiff. Try to chill the bowl and whisk attachments before you beat the cream. This will help the cream whip up faster. Melt the gelatin and mix it into the pureed strawberries. Place the dish of gelatin in the microwave. Microwave it for 30 seconds, so the gelatin completely dissolves into liquid. Avoid boiling the gelatin. Pour the gelatin into a large bowl along with the pureed strawberries. Stir them well. You can also melt the gelatin over a double boiler, if you don't want to use the microwave. Fold in the whipped cream and chill the mousse. Gently scoop and fold the whipped cream into the strawberry gelatin mixture. Keep twisting your wrist holding a spatula, so that the cream is completely incorporated. Lay the sliced strawberries in the bottom of you serving bowl and scoop the strawberry mousse over the berries. Refrigerate the mousse for a few hours, so it sets up. Garnish the mousse with additional sliced berries. Making Gelatin-Free Strawberry Mousse Puree the strawberries with the sugar. Wash 2 cups (340 g) of fresh strawberries and use a knife to carefully cut and discard the stems. Cut the strawberries into quarters and place them in a blender or food processor. Add 3 tablespoons of sugar and put the lid on the blender. Puree the strawberries until they're completely smooth. Blending the strawberries will also help the sugar dissolve. Dissolve the agar flakes in hot water. Get out a small bowl and measure 2 tablespoons of agar flakes into it. Carefully pour 1/8 cup (30 ml) of hot water over the flakes. Stir the mixture to dissolve the flakes and set the bowl aside, so the agar cools. Avoid letting the mixture turn solid. Agar flakes are a vegetable gelatin made from sea vegetables. This makes them a safe vegan choice for making mousse. Whisk the whipping cream, powdered sugar, and agar mixture. Pour 1 1/4 cups (300 ml) of whipping cream into a large mixing bowl along with 2 tablespoons of powdered sugar. Add the cooled agar mixture to the bowl. Use a stand or hand mixer with whisk attachments to whisk the ingredients on high speed. Whisk the mixture for a few minutes, so the cream becomes stiff. If you can, chill the mixing bowl and whisk attachments for 5 to 15 minutes before you whisk the mixture. A cold bowl will help the cream whip up faster. Combine the gelatin-free strawberry mousse. Transfer the strawberry puree to a serving bowl or mixing bowl and add the whipped cream mixture. Use a rubber spatula to gently fold the cream into the strawberry puree. You can chill the mousse or scoop it into individual serving dishes before you chill it. Refrigerate the mousse for 4 to 6 hours, so it sets up. Garnish the mousse with 2 to 3 fresh strawberries and fresh mint. Making Strawberry Marshmallow Mousse Combine the strawberries, sugar, and water. Get out a small saucepan and wash 1 1/4 cups (250 g) of fresh strawberries. Use a small knife to carefully trim off the strawberry stems and discard them. Cut the strawberries in half, if they're large. Set 2 strawberries aside and place the remaining strawberries in the pan along with:\n1/8 cup (25 g) of sugar\n1/3 cup + 2 tablespoons (100 ml) of water Simmer and mash the strawberries. Turn the heat on to medium and stir the sugared strawberries. Cook the strawberries, so they start to bubble gently. Simmer the strawberries for 3 minutes or until they're soft. Turn off the heat and use a fork to mash the strawberries. You could also use a potato masher to mash the strawberries. Be gentle when mashing, so you don't splash hot juice on you. Stir in the mini-marshmallows. Measure out 1 1/2 cups (140 g) of mini-marshmallows and add them to the hot strawberry mixture. Stir the mini-marshmallows in, so they dissolve completely. Let the mixture cool in the pan. The mini-marshmallows will help the strawberry mousse set up, since the mini-marshmallows contain gelatin. Whip the heavy cream. Place 3/4 cup + 2 tablespoons (200 ml) of heavy whipping cream into a large mixing bowl. Use a stand or hand mixer to whisk the cream on high speed for several minutes. The cream should stiffen, so the whisks leave firm peaks when you lift them away. To help the cream whip, chill the mixing bowl and whisk attachments for 5 to 15 minutes before whipping the cream. Combine and chill the strawberry marshmallow mousse. Once the strawberry mixture is cool, scoop in the whipped cream and use a rubber spatula to gently fold it in. Transfer the strawberry marshmallow mousse into a serving bowl or individual dishes. Refrigerate the mousse for 2 hours, so it sets up. You can cut the reserved strawberries in half and garnish the mousse with the halves. Finished. ",
    "sentences": [
        " Making Classic Strawberry Mousse Dissolve the gelatin in water.",
        "Get out a small bowl and pour 1/4 (60 ml) of water into it.",
        "Sprinkle 1 tablespoon of powdered gelatin evenly over the water.",
        "Don't stir the gelatin into the water.",
        "Instead, just let it sit for 5 minutes.",
        "The gelatin will begin to soak up the water as it stands.",
        "Combine the strawberries with sugar.",
        "Wash 2 pints (680 g) of strawberries and put half of them aside.",
        "Use a sharp knife to trim off the stems from 1 pint (340 g) of the strawberries.",
        "Chop the strawberries into pieces.",
        "Sprinkle 3 tablespoons of the sugar over the strawberries and let them sit for several minutes while you prepare the rest of the strawberries.",
        "Letting the strawberries sit with the sugar is known as macerating the fruit.",
        "This will help the strawberries release their liquid and make the strawberry flavor stronger.",
        "Puree some of the strawberries and slice the rest.",
        "Transfer the sugared strawberries to a food processor or blender and blitz the strawberries until they're slightly chunky.",
        "Set these aside and get out the remaining pint of whole strawberries.",
        "Trim off the stems and slice the strawberries.",
        "Sprinkle the last 3 tablespoons of sugar over the sliced berries.",
        "If you don't have a blender or food processor, you can use a fork or potato masher to mash the strawberries.",
        "Drain the sliced strawberries.",
        "Set a fine-mesh strainer in the sink or over a bowl and place the sliced and sugared berries in the strainer.",
        "Let them sit for a few minutes, so the liquid from the strawberries drips into the sink or bowl.",
        "Discard or save the liquid for another recipe.",
        "You want to remove the excess liquid, so the mousse sets up properly.",
        "Whip the cream with powdered sugar and vanilla.",
        "Pour 1 1/2 cups (350 ml) of heavy cream into a large mixing bowl and add 3 tablespoons of powdered sugar along with 1 teaspoon of vanilla.",
        "Use a stand or hand mixer to whisk the cream on high speed.",
        "Whip the mixture for a few minutes, so the cream becomes stiff.",
        "Try to chill the bowl and whisk attachments before you beat the cream.",
        "This will help the cream whip up faster.",
        "Melt the gelatin and mix it into the pureed strawberries.",
        "Place the dish of gelatin in the microwave.",
        "Microwave it for 30 seconds, so the gelatin completely dissolves into liquid.",
        "Avoid boiling the gelatin.",
        "Pour the gelatin into a large bowl along with the pureed strawberries.",
        "Stir them well.",
        "You can also melt the gelatin over a double boiler, if you don't want to use the microwave.",
        "Fold in the whipped cream and chill the mousse.",
        "Gently scoop and fold the whipped cream into the strawberry gelatin mixture.",
        "Keep twisting your wrist holding a spatula, so that the cream is completely incorporated.",
        "Lay the sliced strawberries in the bottom of you serving bowl and scoop the strawberry mousse over the berries.",
        "Refrigerate the mousse for a few hours, so it sets up.",
        "Garnish the mousse with additional sliced berries.",
        "Making Gelatin-Free Strawberry Mousse Puree the strawberries with the sugar.",
        "Wash 2 cups (340 g) of fresh strawberries and use a knife to carefully cut and discard the stems.",
        "Cut the strawberries into quarters and place them in a blender or food processor.",
        "Add 3 tablespoons of sugar and put the lid on the blender.",
        "Puree the strawberries until they're completely smooth.",
        "Blending the strawberries will also help the sugar dissolve.",
        "Dissolve the agar flakes in hot water.",
        "Get out a small bowl and measure 2 tablespoons of agar flakes into it.",
        "Carefully pour 1/8 cup (30 ml) of hot water over the flakes.",
        "Stir the mixture to dissolve the flakes and set the bowl aside, so the agar cools.",
        "Avoid letting the mixture turn solid.",
        "Agar flakes are a vegetable gelatin made from sea vegetables.",
        "This makes them a safe vegan choice for making mousse.",
        "Whisk the whipping cream, powdered sugar, and agar mixture.",
        "Pour 1 1/4 cups (300 ml) of whipping cream into a large mixing bowl along with 2 tablespoons of powdered sugar.",
        "Add the cooled agar mixture to the bowl.",
        "Use a stand or hand mixer with whisk attachments to whisk the ingredients on high speed.",
        "Whisk the mixture for a few minutes, so the cream becomes stiff.",
        "If you can, chill the mixing bowl and whisk attachments for 5 to 15 minutes before you whisk the mixture.",
        "A cold bowl will help the cream whip up faster.",
        "Combine the gelatin-free strawberry mousse.",
        "Transfer the strawberry puree to a serving bowl or mixing bowl and add the whipped cream mixture.",
        "Use a rubber spatula to gently fold the cream into the strawberry puree.",
        "You can chill the mousse or scoop it into individual serving dishes before you chill it.",
        "Refrigerate the mousse for 4 to 6 hours, so it sets up.",
        "Garnish the mousse with 2 to 3 fresh strawberries and fresh mint.",
        "Making Strawberry Marshmallow Mousse Combine the strawberries, sugar, and water.",
        "Get out a small saucepan and wash 1 1/4 cups (250 g) of fresh strawberries.",
        "Use a small knife to carefully trim off the strawberry stems and discard them.",
        "Cut the strawberries in half, if they're large.",
        "Set 2 strawberries aside and place the remaining strawberries in the pan along with:\n1/8 cup (25 g) of sugar\n1/3 cup + 2 tablespoons (100 ml) of water Simmer and mash the strawberries.",
        "Turn the heat on to medium and stir the sugared strawberries.",
        "Cook the strawberries, so they start to bubble gently.",
        "Simmer the strawberries for 3 minutes or until they're soft.",
        "Turn off the heat and use a fork to mash the strawberries.",
        "You could also use a potato masher to mash the strawberries.",
        "Be gentle when mashing, so you don't splash hot juice on you.",
        "Stir in the mini-marshmallows.",
        "Measure out 1 1/2 cups (140 g) of mini-marshmallows and add them to the hot strawberry mixture.",
        "Stir the mini-marshmallows in, so they dissolve completely.",
        "Let the mixture cool in the pan.",
        "The mini-marshmallows will help the strawberry mousse set up, since the mini-marshmallows contain gelatin.",
        "Whip the heavy cream.",
        "Place 3/4 cup + 2 tablespoons (200 ml) of heavy whipping cream into a large mixing bowl.",
        "Use a stand or hand mixer to whisk the cream on high speed for several minutes.",
        "The cream should stiffen, so the whisks leave firm peaks when you lift them away.",
        "To help the cream whip, chill the mixing bowl and whisk attachments for 5 to 15 minutes before whipping the cream.",
        "Combine and chill the strawberry marshmallow mousse.",
        "Once the strawberry mixture is cool, scoop in the whipped cream and use a rubber spatula to gently fold it in.",
        "Transfer the strawberry marshmallow mousse into a serving bowl or individual dishes.",
        "Refrigerate the mousse for 2 hours, so it sets up.",
        "You can cut the reserved strawberries in half and garnish the mousse with the halves.",
        "Finished."
    ]
}