{
    "title": "How to Make Rose Centerpieces",
    "url": "https://www.wikihow.com/Make-Rose-Centerpieces",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening"
    ],
    "methods": [
        {
            "name": "Making a Silk Rose Topiary",
            "steps": [
                {
                    "headline": "Hot glue a Styrofoam ball to the top of a glass or crystal candlestick.",
                    "description": "Cover the top of the candlestick with hot glue, then quickly press the Styrofoam ball into the glue. You can use any size Styrofoam ball you want, but something around 5 inches (12.7 centimeters) would be ideal. Keep the ball proportionate to the candle stick. The smaller the ball, the shorter the candle stick should be."
                },
                {
                    "headline": "Get a bouquet of mini silk roses and snip the flowers off.",
                    "description": "Leave a 2-inch (5.08-centimeter) long stem on each rose. If possible, use a pair of wire cutters to do this. Many silk flowers have wire inside the stem, which can ruin a good pair of scissors. If you cannot find wire cutters, use a pair of sturdy scissors you don't mind possibly ruining."
                },
                {
                    "headline": "Poke a rose into the top of a Styrofoam ball.",
                    "description": "If the rose is very loose, pull it out, add a drop of glue into the hole, then push the rose back in. You want the base of the rose touching the Styrofoam ball. You can use tacky glue or hot glue."
                },
                {
                    "headline": "Add more roses in a ring around the first one.",
                    "description": "Make sure that all of the roses are touching one another, including the one in the center. Once again, if any of the roses feel loose, secure them with a drop of hot glue."
                },
                {
                    "headline": "Continue adding roses in rings until you reach the bottom of the Styrofoam ball.",
                    "description": "When you are done, the entire ball should be covered in roses. Make sure that there are no gaps or bits of Styrofoam showing."
                },
                {
                    "headline": "Wrap a ribbon around the middle of the candlestick.",
                    "description": "Tie the ends of the ribbon into a large bow. For that final touch, snip the ends of the ribbon at an angle. A satin ribbon would work the best, but you can also use a sheer ribbon as well. It can match the color of your rose ball, or it can be an accent color instead, such as silver or gold."
                }
            ]
        },
        {
            "name": "Making a Real Rose Topiary",
            "steps": [
                {
                    "headline": "Soak a block of green floral foam in water overnight.",
                    "description": "This will help keep the roses stay fresher longer when you stick them into the foam. There are several different types of floral foam. Make sure that you get the kind meant for fresh flowers. You can find it in the floral section of an arts and crafts shop. Do not use regular white Styrofoam for this. You need the foam to be able to soak up water so that the roses stay fresh. Be careful when handling this type of foam. It is very soft when dry and easily dented."
                },
                {
                    "headline": "Put the foam block into a vessel.",
                    "description": "You can use a fancy bowl, planter, vase, or even a pedestal meant for pillar candles. It should sit below the rim of your bowl, planter, or vase. If the foam is too big, cut it down to the right size and shape. If you are setting the foam down onto a pedestal, cut it down to a rough dome or orb shape."
                },
                {
                    "headline": "Get an assortment of roses and put them into a bucket of water.",
                    "description": "You can use roses in all one color, or you can experiment using different colors. You can also get different shades of the same color for an ombre effect. Plan on using about 48 roses. If you plan on using multiple shades or colors, put them into separate buckets. This will make sorting through them easier. Consider using fragrant roses. This is a small detail that often gets overlooked but will add a nice touch."
                },
                {
                    "headline": "Cut about 3 inches (7.62 centimeters) off of each stem.",
                    "description": "Use a clean pair of garden shears and cut the stems at an angle. It would be a good idea to cut off the leaves and thorns as well. If your foam block is very small, you may want to cut the stems down to about 3 inches (7.63 centimeters)."
                },
                {
                    "headline": "Poke the roses into the foam.",
                    "description": "Insert them close enough so that the blooms touch. Keep adding roses until the foam is no longer visible. You don't have to poke the roses all the way down into the foam. If you are sticking the roses into a bowl, planter, or vase, consider sticking them in as different depths to create a dome-like effect. If you are going for an ombre effect, start with your lightest color, then move on to the darkest. You can arrange it in stripes or rings."
                },
                {
                    "headline": "Add some finishing touches.",
                    "description": "At this point, your centerpiece is done. You can move it to the table, and leave it as is, or you can add some more touches to it. Here are some ideas:\nArrange short, votive candles around the centerpiece. Scatter glass gems or metallic confetti around the centerpiece. Tie a satin or sheer ribbon around the base of the vessel."
                }
            ]
        },
        {
            "name": "Making an Underwater Vase",
            "steps": [
                {
                    "headline": "Get a tall, glass, cylindrical vase.",
                    "description": "You can also use a square vase instead. You will be placing the entire rose inside the vase and then filling the vase all the way with water. Try to get a vase that is at least 12 inches (30.48-centimeters) tall. This will make your centerpiece look more elegant. Consider wrapping a crystal trim around the base of the vase. You can find it in the sticker or scrapbooking section of an arts and crafts store."
                },
                {
                    "headline": "Trim a rose down until it is about 3 inches (7.62 centimeters) shorter than the vase.",
                    "description": "You will need the extra space inside the vase for the floating candle. If the rose is too tall, it will stick out of the water/vase and ruin the effect. You can trim off the leaves or leave them on. Cut real roses with clean garden shears. Cut silk roses with wire cutters. If you chose to leave the leaves on a real rose, rinse them off under cool water. This will get rid of any dust that might muddy up the water."
                },
                {
                    "headline": "Insert the rose into a frog pin.",
                    "description": "A frog pin is a coin-sized metal disk with pins sticking out of it, like a hairbrush. You can find them in the floral section of an arts and crafts store. Try to wedge the rose's stem between the pins rather than straight into them. Consider adding a few more shorter roses into the pin. A frog pin is not absolutely necessary, but it will help keep the rose secure. If you cannot find a frog pin, you will have to add more vase filler later on."
                },
                {
                    "headline": "Place the rose into the bottom of the vase.",
                    "description": "For an added effect, consider turning on a submersible LED light, and adding it into the bottom of the vase as well. Make sure that the LED light is meant for being used in underwater floral arrangements. You can find them in the floral department of an arts and crafts shop."
                },
                {
                    "headline": "Fill the bottom of the vase filler.",
                    "description": "Scoop the filler out of the bag with your hands, then carefully spread it across the bottom of the vase. This will prevent the filler from damaging the rose's petals. Keep filling the vase until the frog pin is covered. You can use tiny acrylic pellets or crystals, of glass gems or marbles. If you weren't able to find a frog pin, fill the bottom of the vase with 2 to 3 inches (5.08 to 7.62 centimeters) of vase filler, or until the rose stands up on its own."
                },
                {
                    "headline": "Fill the vase with cool water.",
                    "description": "Stop when you are about 1 inch (2.54 centimeters) away from the rim of the vase. The entire rose, including the bloom, should be submerged under water."
                },
                {
                    "headline": "Place a floating candle on top.",
                    "description": "Make sure that the bottom of the candle does not bump up against the rose. If it does, add more water or trim the rose down. You can use a regular round candle or a rose-shaped one."
                },
                {
                    "headline": "Place the vase on your table.",
                    "description": "Consider scattering acrylic gems or metallic confetti around the vase. You can also make a few more vases that are taller or shorter than the one you just made."
                }
            ]
        }
    ],
    "tyn": [
        "Making a Silk Rose Topiary",
        "Glass or crystal candlestick",
        "Styrofoam ball",
        "Bouquet of mini silk roses",
        "Tacky glue",
        "Hot glue gun and hot glue sticks",
        "Sheer or satin ribbon",
        "Wire cutters",
        "Making a Real Rose Topiary",
        "Floral foam",
        "Clean garden shears",
        "Vase or other vessel",
        "Real roses",
        "Making an Underwater Vase",
        "Tall, glass, cylindrical vase",
        "Clear glass or acrylic vase filler",
        "Real or silk rose",
        "Frog pin",
        "Garden shears or wire cutters",
        "Water",
        "Crystal trim (optional)",
        "Submersible LED light (optional)"
    ],
    "text": " Making a Silk Rose Topiary Hot glue a Styrofoam ball to the top of a glass or crystal candlestick. Cover the top of the candlestick with hot glue, then quickly press the Styrofoam ball into the glue. You can use any size Styrofoam ball you want, but something around 5 inches (12.7 centimeters) would be ideal. Keep the ball proportionate to the candle stick. The smaller the ball, the shorter the candle stick should be. Get a bouquet of mini silk roses and snip the flowers off. Leave a 2-inch (5.08-centimeter) long stem on each rose. If possible, use a pair of wire cutters to do this. Many silk flowers have wire inside the stem, which can ruin a good pair of scissors. If you cannot find wire cutters, use a pair of sturdy scissors you don't mind possibly ruining. Poke a rose into the top of a Styrofoam ball. If the rose is very loose, pull it out, add a drop of glue into the hole, then push the rose back in. You want the base of the rose touching the Styrofoam ball. You can use tacky glue or hot glue. Add more roses in a ring around the first one. Make sure that all of the roses are touching one another, including the one in the center. Once again, if any of the roses feel loose, secure them with a drop of hot glue. Continue adding roses in rings until you reach the bottom of the Styrofoam ball. When you are done, the entire ball should be covered in roses. Make sure that there are no gaps or bits of Styrofoam showing. Wrap a ribbon around the middle of the candlestick. Tie the ends of the ribbon into a large bow. For that final touch, snip the ends of the ribbon at an angle. A satin ribbon would work the best, but you can also use a sheer ribbon as well. It can match the color of your rose ball, or it can be an accent color instead, such as silver or gold. Making a Real Rose Topiary Soak a block of green floral foam in water overnight. This will help keep the roses stay fresher longer when you stick them into the foam. There are several different types of floral foam. Make sure that you get the kind meant for fresh flowers. You can find it in the floral section of an arts and crafts shop. Do not use regular white Styrofoam for this. You need the foam to be able to soak up water so that the roses stay fresh. Be careful when handling this type of foam. It is very soft when dry and easily dented. Put the foam block into a vessel. You can use a fancy bowl, planter, vase, or even a pedestal meant for pillar candles. It should sit below the rim of your bowl, planter, or vase. If the foam is too big, cut it down to the right size and shape. If you are setting the foam down onto a pedestal, cut it down to a rough dome or orb shape. Get an assortment of roses and put them into a bucket of water. You can use roses in all one color, or you can experiment using different colors. You can also get different shades of the same color for an ombre effect. Plan on using about 48 roses. If you plan on using multiple shades or colors, put them into separate buckets. This will make sorting through them easier. Consider using fragrant roses. This is a small detail that often gets overlooked but will add a nice touch. Cut about 3 inches (7.62 centimeters) off of each stem. Use a clean pair of garden shears and cut the stems at an angle. It would be a good idea to cut off the leaves and thorns as well. If your foam block is very small, you may want to cut the stems down to about 3 inches (7.63 centimeters). Poke the roses into the foam. Insert them close enough so that the blooms touch. Keep adding roses until the foam is no longer visible. You don't have to poke the roses all the way down into the foam. If you are sticking the roses into a bowl, planter, or vase, consider sticking them in as different depths to create a dome-like effect. If you are going for an ombre effect, start with your lightest color, then move on to the darkest. You can arrange it in stripes or rings. Add some finishing touches. At this point, your centerpiece is done. You can move it to the table, and leave it as is, or you can add some more touches to it. Here are some ideas:\nArrange short, votive candles around the centerpiece. Scatter glass gems or metallic confetti around the centerpiece. Tie a satin or sheer ribbon around the base of the vessel. Making an Underwater Vase Get a tall, glass, cylindrical vase. You can also use a square vase instead. You will be placing the entire rose inside the vase and then filling the vase all the way with water. Try to get a vase that is at least 12 inches (30.48-centimeters) tall. This will make your centerpiece look more elegant. Consider wrapping a crystal trim around the base of the vase. You can find it in the sticker or scrapbooking section of an arts and crafts store. Trim a rose down until it is about 3 inches (7.62 centimeters) shorter than the vase. You will need the extra space inside the vase for the floating candle. If the rose is too tall, it will stick out of the water/vase and ruin the effect. You can trim off the leaves or leave them on. Cut real roses with clean garden shears. Cut silk roses with wire cutters. If you chose to leave the leaves on a real rose, rinse them off under cool water. This will get rid of any dust that might muddy up the water. Insert the rose into a frog pin. A frog pin is a coin-sized metal disk with pins sticking out of it, like a hairbrush. You can find them in the floral section of an arts and crafts store. Try to wedge the rose's stem between the pins rather than straight into them. Consider adding a few more shorter roses into the pin. A frog pin is not absolutely necessary, but it will help keep the rose secure. If you cannot find a frog pin, you will have to add more vase filler later on. Place the rose into the bottom of the vase. For an added effect, consider turning on a submersible LED light, and adding it into the bottom of the vase as well. Make sure that the LED light is meant for being used in underwater floral arrangements. You can find them in the floral department of an arts and crafts shop. Fill the bottom of the vase filler. Scoop the filler out of the bag with your hands, then carefully spread it across the bottom of the vase. This will prevent the filler from damaging the rose's petals. Keep filling the vase until the frog pin is covered. You can use tiny acrylic pellets or crystals, of glass gems or marbles. If you weren't able to find a frog pin, fill the bottom of the vase with 2 to 3 inches (5.08 to 7.62 centimeters) of vase filler, or until the rose stands up on its own. Fill the vase with cool water. Stop when you are about 1 inch (2.54 centimeters) away from the rim of the vase. The entire rose, including the bloom, should be submerged under water. Place a floating candle on top. Make sure that the bottom of the candle does not bump up against the rose. If it does, add more water or trim the rose down. You can use a regular round candle or a rose-shaped one. Place the vase on your table. Consider scattering acrylic gems or metallic confetti around the vase. You can also make a few more vases that are taller or shorter than the one you just made.",
    "sentences": [
        " Making a Silk Rose Topiary Hot glue a Styrofoam ball to the top of a glass or crystal candlestick.",
        "Cover the top of the candlestick with hot glue, then quickly press the Styrofoam ball into the glue.",
        "You can use any size Styrofoam ball you want, but something around 5 inches (12.7 centimeters) would be ideal.",
        "Keep the ball proportionate to the candle stick.",
        "The smaller the ball, the shorter the candle stick should be.",
        "Get a bouquet of mini silk roses and snip the flowers off.",
        "Leave a 2-inch (5.08-centimeter) long stem on each rose.",
        "If possible, use a pair of wire cutters to do this.",
        "Many silk flowers have wire inside the stem, which can ruin a good pair of scissors.",
        "If you cannot find wire cutters, use a pair of sturdy scissors you don't mind possibly ruining.",
        "Poke a rose into the top of a Styrofoam ball.",
        "If the rose is very loose, pull it out, add a drop of glue into the hole, then push the rose back in.",
        "You want the base of the rose touching the Styrofoam ball.",
        "You can use tacky glue or hot glue.",
        "Add more roses in a ring around the first one.",
        "Make sure that all of the roses are touching one another, including the one in the center.",
        "Once again, if any of the roses feel loose, secure them with a drop of hot glue.",
        "Continue adding roses in rings until you reach the bottom of the Styrofoam ball.",
        "When you are done, the entire ball should be covered in roses.",
        "Make sure that there are no gaps or bits of Styrofoam showing.",
        "Wrap a ribbon around the middle of the candlestick.",
        "Tie the ends of the ribbon into a large bow.",
        "For that final touch, snip the ends of the ribbon at an angle.",
        "A satin ribbon would work the best, but you can also use a sheer ribbon as well.",
        "It can match the color of your rose ball, or it can be an accent color instead, such as silver or gold.",
        "Making a Real Rose Topiary Soak a block of green floral foam in water overnight.",
        "This will help keep the roses stay fresher longer when you stick them into the foam.",
        "There are several different types of floral foam.",
        "Make sure that you get the kind meant for fresh flowers.",
        "You can find it in the floral section of an arts and crafts shop.",
        "Do not use regular white Styrofoam for this.",
        "You need the foam to be able to soak up water so that the roses stay fresh.",
        "Be careful when handling this type of foam.",
        "It is very soft when dry and easily dented.",
        "Put the foam block into a vessel.",
        "You can use a fancy bowl, planter, vase, or even a pedestal meant for pillar candles.",
        "It should sit below the rim of your bowl, planter, or vase.",
        "If the foam is too big, cut it down to the right size and shape.",
        "If you are setting the foam down onto a pedestal, cut it down to a rough dome or orb shape.",
        "Get an assortment of roses and put them into a bucket of water.",
        "You can use roses in all one color, or you can experiment using different colors.",
        "You can also get different shades of the same color for an ombre effect.",
        "Plan on using about 48 roses.",
        "If you plan on using multiple shades or colors, put them into separate buckets.",
        "This will make sorting through them easier.",
        "Consider using fragrant roses.",
        "This is a small detail that often gets overlooked but will add a nice touch.",
        "Cut about 3 inches (7.62 centimeters) off of each stem.",
        "Use a clean pair of garden shears and cut the stems at an angle.",
        "It would be a good idea to cut off the leaves and thorns as well.",
        "If your foam block is very small, you may want to cut the stems down to about 3 inches (7.63 centimeters).",
        "Poke the roses into the foam.",
        "Insert them close enough so that the blooms touch.",
        "Keep adding roses until the foam is no longer visible.",
        "You don't have to poke the roses all the way down into the foam.",
        "If you are sticking the roses into a bowl, planter, or vase, consider sticking them in as different depths to create a dome-like effect.",
        "If you are going for an ombre effect, start with your lightest color, then move on to the darkest.",
        "You can arrange it in stripes or rings.",
        "Add some finishing touches.",
        "At this point, your centerpiece is done.",
        "You can move it to the table, and leave it as is, or you can add some more touches to it.",
        "Here are some ideas:\nArrange short, votive candles around the centerpiece.",
        "Scatter glass gems or metallic confetti around the centerpiece.",
        "Tie a satin or sheer ribbon around the base of the vessel.",
        "Making an Underwater Vase Get a tall, glass, cylindrical vase.",
        "You can also use a square vase instead.",
        "You will be placing the entire rose inside the vase and then filling the vase all the way with water.",
        "Try to get a vase that is at least 12 inches (30.48-centimeters) tall.",
        "This will make your centerpiece look more elegant.",
        "Consider wrapping a crystal trim around the base of the vase.",
        "You can find it in the sticker or scrapbooking section of an arts and crafts store.",
        "Trim a rose down until it is about 3 inches (7.62 centimeters) shorter than the vase.",
        "You will need the extra space inside the vase for the floating candle.",
        "If the rose is too tall, it will stick out of the water/vase and ruin the effect.",
        "You can trim off the leaves or leave them on.",
        "Cut real roses with clean garden shears.",
        "Cut silk roses with wire cutters.",
        "If you chose to leave the leaves on a real rose, rinse them off under cool water.",
        "This will get rid of any dust that might muddy up the water.",
        "Insert the rose into a frog pin.",
        "A frog pin is a coin-sized metal disk with pins sticking out of it, like a hairbrush.",
        "You can find them in the floral section of an arts and crafts store.",
        "Try to wedge the rose's stem between the pins rather than straight into them.",
        "Consider adding a few more shorter roses into the pin.",
        "A frog pin is not absolutely necessary, but it will help keep the rose secure.",
        "If you cannot find a frog pin, you will have to add more vase filler later on.",
        "Place the rose into the bottom of the vase.",
        "For an added effect, consider turning on a submersible LED light, and adding it into the bottom of the vase as well.",
        "Make sure that the LED light is meant for being used in underwater floral arrangements.",
        "You can find them in the floral department of an arts and crafts shop.",
        "Fill the bottom of the vase filler.",
        "Scoop the filler out of the bag with your hands, then carefully spread it across the bottom of the vase.",
        "This will prevent the filler from damaging the rose's petals.",
        "Keep filling the vase until the frog pin is covered.",
        "You can use tiny acrylic pellets or crystals, of glass gems or marbles.",
        "If you weren't able to find a frog pin, fill the bottom of the vase with 2 to 3 inches (5.08 to 7.62 centimeters) of vase filler, or until the rose stands up on its own.",
        "Fill the vase with cool water.",
        "Stop when you are about 1 inch (2.54 centimeters) away from the rim of the vase.",
        "The entire rose, including the bloom, should be submerged under water.",
        "Place a floating candle on top.",
        "Make sure that the bottom of the candle does not bump up against the rose.",
        "If it does, add more water or trim the rose down.",
        "You can use a regular round candle or a rose-shaped one.",
        "Place the vase on your table.",
        "Consider scattering acrylic gems or metallic confetti around the vase.",
        "You can also make a few more vases that are taller or shorter than the one you just made."
    ]
}