{
    "title": "How to Make a Pen Pocket for Your Journal",
    "url": "https://www.wikihow.com/Make-a-Pen-Pocket-for-Your-Journal",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Sewing",
        "Sewing Crafts",
        "Sewing Document Holders"
    ],
    "parts": [
        {
            "name": "Cutting the Pieces",
            "steps": [
                {
                    "headline": "Decide how tall and wide you want the pen pocket to be.",
                    "description": "It needs to be tall and wide enough to hold at least two pens. Most pen pockets are a little shorter than the journal. If your pens are different sizes, use the longest pen for you measurement."
                },
                {
                    "headline": "Add ½ inch (1.27 centimeters) to the length and width.",
                    "description": "This will leave room for the ¼-inch (0.64-centimeter) seam allowances on all four sides."
                },
                {
                    "headline": "Cut two pieces of fabric according to your measurements.",
                    "description": "This will make the body of your pocket. You can use any type of fabric you want, but canvas, linen, or cotton will work the best."
                },
                {
                    "headline": "Cut a third piece of for the front pocket.",
                    "description": "It needs to be the same width as the first two pieces of fabric, but about ⅔ of the height. This fabric can be the same color and pattern as the first two, or a coordinating one. Make sure that you use the same type of fabric, however."
                },
                {
                    "headline": "Cut your elastic 1 inch (2.54 centimeters) longer than your body pieces.",
                    "description": "You want the excess elastic for extra support. The strap will wrap around the front and back covers of the journal. If you want a tighter fit, or if you want the strap to wrap around just the front cover, cut the elastic 1 inch (2.54 centimeters) shorter than your body pieces. The elastic can be any width you want, but it should be flat. Something around 5/8 inch (15.8 millimeters) would be ideal. If you can, try to find a colored elastic that matches your fabric."
                }
            ]
        },
        {
            "name": "Creating the Front Pocket",
            "steps": [
                {
                    "headline": "Fold and iron the top hem of the front pocket.",
                    "description": "Take the third, shortest piece of fabric. Turn it so that the wrong side is facing you. Fold one of the narrow ends down by ¼ inch (0.64 centimeters). Press it flat with an iron. For a neater finish, and to reduce fraying, repeat this step."
                },
                {
                    "headline": "Top stitch the hem down.",
                    "description": "Sew as close to the top edge as you can. Snip the thread close to the side edges. You can use a matching thread color, or a contrasting one for a hint of design."
                },
                {
                    "headline": "Pin the pocket to the front of one of the larger body pieces.",
                    "description": "Set one of the larger body pieces down, right-side-up. Place the pocket on top, also right-side-up. Make sure that the bottom and side edges are aligned. There will be a gap between the pocket's hemmed edge and the body's aw, top edge."
                },
                {
                    "headline": "Create the individual pockets, if desired.",
                    "description": "Sew from the top, hemmed edge of the front pocket, all the way down to the bottom edge. How many slots you make is up to you, but make sure that the pens can fit. Remember to leave a ¼-inch gap on the left and right sides. You can use a matching thread color or a contrasting one. Skip this step if you want a simpler pen pouch with one pocket."
                }
            ]
        },
        {
            "name": "Putting Everything Together",
            "steps": [
                {
                    "headline": "Place the elastic on top of the other body piece.",
                    "description": "Set the remaining body piece of down, right-side-up. Place the elastic on top. Make sure that it is centered and going lengthwise. You'll have about ½ inch (1.27 centimeters) of excess elastic sticking up over the top and bottom of the fabric. If you cut your elastic shorter, skip this step. You will be inserting the elastic a different way."
                },
                {
                    "headline": "Pin the pocket piece on top, wrong-side-up.",
                    "description": "Take the assembled front pocket. Place it down on top of the elastic, wrong-side-up. The front pouch should now be sandwiched between the two body pieces. Pin everything into place."
                },
                {
                    "headline": "Sew around the fabric, leaving a gap for turning.",
                    "description": "Sew around both of the top, bottom, and one of the side edges. Sew around half of the other side edge. This will be your gap for turning. Use a matching thread color and ¼-inch (0.64-centimeter) seam allowances. Snip the thread close to the edges when you are down sewing. If you cut your elastic shorter, sew up the side edges instead. Leave the top and bottom edges open."
                },
                {
                    "headline": "Turn the fabric inside out through the gap.",
                    "description": "Use a slender pair of scissors or a knitting needle to push out the corners. For a neater finish, clip the corners before turning the fabric."
                },
                {
                    "headline": "Press the entire pocket flat with an iron.",
                    "description": "When you reach the gap, fold the raw edges inside so that they match up with the rest of the pocket. Press them flat with an iron. Pull the elastic out of the way as you iron. Avoid ironing over the elastic. If you cut you elastic shorter, tuck the ends of the elastic into the top and bottom openings by about ½ inch (1.27 centimeters). Pin them in place."
                },
                {
                    "headline": "Top stitch around the entire piece.",
                    "description": "Pin the gap shut, then top stitch around all four edges of the pen pocket, as close to the edges as you can. Pull the elastic out of the way as you sew so that the top stitching goes under it rather than over it. Snip the thread when you are done sewing. Use a matching or contrasting thread color. Backstitch a few times at the start and end of your sewing."
                }
            ]
        }
    ],
    "tyn": [
        "Ruler or measuring tape",
        "Fabric (cotton, linen, or canvas)",
        "Fabric scissors",
        "Sewing machine",
        "Sewing pins",
        "Thread"
    ],
    "text": " Cutting the Pieces Decide how tall and wide you want the pen pocket to be. It needs to be tall and wide enough to hold at least two pens. Most pen pockets are a little shorter than the journal. If your pens are different sizes, use the longest pen for you measurement. Add ½ inch (1.27 centimeters) to the length and width. This will leave room for the ¼-inch (0.64-centimeter) seam allowances on all four sides. Cut two pieces of fabric according to your measurements. This will make the body of your pocket. You can use any type of fabric you want, but canvas, linen, or cotton will work the best. Cut a third piece of for the front pocket. It needs to be the same width as the first two pieces of fabric, but about ⅔ of the height. This fabric can be the same color and pattern as the first two, or a coordinating one. Make sure that you use the same type of fabric, however. Cut your elastic 1 inch (2.54 centimeters) longer than your body pieces. You want the excess elastic for extra support. The strap will wrap around the front and back covers of the journal. If you want a tighter fit, or if you want the strap to wrap around just the front cover, cut the elastic 1 inch (2.54 centimeters) shorter than your body pieces. The elastic can be any width you want, but it should be flat. Something around 5/8 inch (15.8 millimeters) would be ideal. If you can, try to find a colored elastic that matches your fabric. Creating the Front Pocket Fold and iron the top hem of the front pocket. Take the third, shortest piece of fabric. Turn it so that the wrong side is facing you. Fold one of the narrow ends down by ¼ inch (0.64 centimeters). Press it flat with an iron. For a neater finish, and to reduce fraying, repeat this step. Top stitch the hem down. Sew as close to the top edge as you can. Snip the thread close to the side edges. You can use a matching thread color, or a contrasting one for a hint of design. Pin the pocket to the front of one of the larger body pieces. Set one of the larger body pieces down, right-side-up. Place the pocket on top, also right-side-up. Make sure that the bottom and side edges are aligned. There will be a gap between the pocket's hemmed edge and the body's aw, top edge. Create the individual pockets, if desired. Sew from the top, hemmed edge of the front pocket, all the way down to the bottom edge. How many slots you make is up to you, but make sure that the pens can fit. Remember to leave a ¼-inch gap on the left and right sides. You can use a matching thread color or a contrasting one. Skip this step if you want a simpler pen pouch with one pocket. Putting Everything Together Place the elastic on top of the other body piece. Set the remaining body piece of down, right-side-up. Place the elastic on top. Make sure that it is centered and going lengthwise. You'll have about ½ inch (1.27 centimeters) of excess elastic sticking up over the top and bottom of the fabric. If you cut your elastic shorter, skip this step. You will be inserting the elastic a different way. Pin the pocket piece on top, wrong-side-up. Take the assembled front pocket. Place it down on top of the elastic, wrong-side-up. The front pouch should now be sandwiched between the two body pieces. Pin everything into place. Sew around the fabric, leaving a gap for turning. Sew around both of the top, bottom, and one of the side edges. Sew around half of the other side edge. This will be your gap for turning. Use a matching thread color and ¼-inch (0.64-centimeter) seam allowances. Snip the thread close to the edges when you are down sewing. If you cut your elastic shorter, sew up the side edges instead. Leave the top and bottom edges open. Turn the fabric inside out through the gap. Use a slender pair of scissors or a knitting needle to push out the corners. For a neater finish, clip the corners before turning the fabric. Press the entire pocket flat with an iron. When you reach the gap, fold the raw edges inside so that they match up with the rest of the pocket. Press them flat with an iron. Pull the elastic out of the way as you iron. Avoid ironing over the elastic. If you cut you elastic shorter, tuck the ends of the elastic into the top and bottom openings by about ½ inch (1.27 centimeters). Pin them in place. Top stitch around the entire piece. Pin the gap shut, then top stitch around all four edges of the pen pocket, as close to the edges as you can. Pull the elastic out of the way as you sew so that the top stitching goes under it rather than over it. Snip the thread when you are done sewing. Use a matching or contrasting thread color. Backstitch a few times at the start and end of your sewing.",
    "sentences": [
        " Cutting the Pieces Decide how tall and wide you want the pen pocket to be.",
        "It needs to be tall and wide enough to hold at least two pens.",
        "Most pen pockets are a little shorter than the journal.",
        "If your pens are different sizes, use the longest pen for you measurement.",
        "Add ½ inch (1.27 centimeters) to the length and width.",
        "This will leave room for the ¼-inch (0.64-centimeter) seam allowances on all four sides.",
        "Cut two pieces of fabric according to your measurements.",
        "This will make the body of your pocket.",
        "You can use any type of fabric you want, but canvas, linen, or cotton will work the best.",
        "Cut a third piece of for the front pocket.",
        "It needs to be the same width as the first two pieces of fabric, but about ⅔ of the height.",
        "This fabric can be the same color and pattern as the first two, or a coordinating one.",
        "Make sure that you use the same type of fabric, however.",
        "Cut your elastic 1 inch (2.54 centimeters) longer than your body pieces.",
        "You want the excess elastic for extra support.",
        "The strap will wrap around the front and back covers of the journal.",
        "If you want a tighter fit, or if you want the strap to wrap around just the front cover, cut the elastic 1 inch (2.54 centimeters) shorter than your body pieces.",
        "The elastic can be any width you want, but it should be flat.",
        "Something around 5/8 inch (15.8 millimeters) would be ideal.",
        "If you can, try to find a colored elastic that matches your fabric.",
        "Creating the Front Pocket Fold and iron the top hem of the front pocket.",
        "Take the third, shortest piece of fabric.",
        "Turn it so that the wrong side is facing you.",
        "Fold one of the narrow ends down by ¼ inch (0.64 centimeters).",
        "Press it flat with an iron.",
        "For a neater finish, and to reduce fraying, repeat this step.",
        "Top stitch the hem down.",
        "Sew as close to the top edge as you can.",
        "Snip the thread close to the side edges.",
        "You can use a matching thread color, or a contrasting one for a hint of design.",
        "Pin the pocket to the front of one of the larger body pieces.",
        "Set one of the larger body pieces down, right-side-up.",
        "Place the pocket on top, also right-side-up.",
        "Make sure that the bottom and side edges are aligned.",
        "There will be a gap between the pocket's hemmed edge and the body's aw, top edge.",
        "Create the individual pockets, if desired.",
        "Sew from the top, hemmed edge of the front pocket, all the way down to the bottom edge.",
        "How many slots you make is up to you, but make sure that the pens can fit.",
        "Remember to leave a ¼-inch gap on the left and right sides.",
        "You can use a matching thread color or a contrasting one.",
        "Skip this step if you want a simpler pen pouch with one pocket.",
        "Putting Everything Together Place the elastic on top of the other body piece.",
        "Set the remaining body piece of down, right-side-up.",
        "Place the elastic on top.",
        "Make sure that it is centered and going lengthwise.",
        "You'll have about ½ inch (1.27 centimeters) of excess elastic sticking up over the top and bottom of the fabric.",
        "If you cut your elastic shorter, skip this step.",
        "You will be inserting the elastic a different way.",
        "Pin the pocket piece on top, wrong-side-up.",
        "Take the assembled front pocket.",
        "Place it down on top of the elastic, wrong-side-up.",
        "The front pouch should now be sandwiched between the two body pieces.",
        "Pin everything into place.",
        "Sew around the fabric, leaving a gap for turning.",
        "Sew around both of the top, bottom, and one of the side edges.",
        "Sew around half of the other side edge.",
        "This will be your gap for turning.",
        "Use a matching thread color and ¼-inch (0.64-centimeter) seam allowances.",
        "Snip the thread close to the edges when you are down sewing.",
        "If you cut your elastic shorter, sew up the side edges instead.",
        "Leave the top and bottom edges open.",
        "Turn the fabric inside out through the gap.",
        "Use a slender pair of scissors or a knitting needle to push out the corners.",
        "For a neater finish, clip the corners before turning the fabric.",
        "Press the entire pocket flat with an iron.",
        "When you reach the gap, fold the raw edges inside so that they match up with the rest of the pocket.",
        "Press them flat with an iron.",
        "Pull the elastic out of the way as you iron.",
        "Avoid ironing over the elastic.",
        "If you cut you elastic shorter, tuck the ends of the elastic into the top and bottom openings by about ½ inch (1.27 centimeters).",
        "Pin them in place.",
        "Top stitch around the entire piece.",
        "Pin the gap shut, then top stitch around all four edges of the pen pocket, as close to the edges as you can.",
        "Pull the elastic out of the way as you sew so that the top stitching goes under it rather than over it.",
        "Snip the thread when you are done sewing.",
        "Use a matching or contrasting thread color.",
        "Backstitch a few times at the start and end of your sewing."
    ]
}