{
    "title": "How to Cook a Frozen Turkey",
    "url": "https://www.wikihow.com/Cook-a-Frozen-Turkey",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Poultry Recipes"
    ],
    "parts": [
        {
            "name": "Thawing the Turkey in the Oven",
            "steps": [
                {
                    "headline": "Take your turkey out of the freezer and unwrap it.",
                    "description": "Use scissors to cut the netting and plastic off the turkey. Leave the bag of giblets inside the turkey for now."
                },
                {
                    "headline": "Put the turkey on a roasting rack inside of a roasting pan.",
                    "description": "The turkey should be breast-side up on the rack in the pan. It's important that you use a roasting rack so the heat in the oven can circulate around the entire turkey."
                },
                {
                    "headline": "Preheat the oven to 325 °F (163 °C).",
                    "description": "If there are multiple racks in the oven, remove all of them except for the one that's in the bottom third of the oven. That way there will be enough room for the turkey."
                },
                {
                    "headline": "Place the frozen turkey in the oven and let it thaw for 2 and a half hours.",
                    "description": "Avoid opening the oven during this time so heat doesn’t escape. After 2 and a half hours, the turkey should be mostly thawed and have a golden brown color. Don’t worry about seasoning your turkey yet — seasoning won’t stick to a frozen turkey. You can season the turkey later after it thaws for a couple of hours in the oven."
                },
                {
                    "headline": "Use a meat thermometer to check the turkey’s temperature after it’s thawed.",
                    "description": "Stick the thermometer in the breast or thighs and give it a few seconds to read the temperature. At this point, the turkey should be around 100–125 °F (38–52 °C). If the temperature is lower than 100–125 °F (38–52 °C), let the turkey continue to roast and check on it periodically until it’s up to temperature."
                }
            ]
        },
        {
            "name": "Basting and Seasoning the Turkey",
            "steps": [
                {
                    "headline": "Take the bag of giblets out of the neck of the turkey.",
                    "description": "The giblets are the organs of the turkey that are bagged and stuffed in the turkey’s neck by the butcher. Now that the turkey is partially thawed, you should be able to pull the giblets out so you can discard them (or make gravy with them)."
                },
                {
                    "headline": "Brush ⁄2 cup (120 mL) of melted butter onto the turkey with a basting brush.",
                    "description": "Coating the turkey with butter will make it more flavorful. If you don't have butter, you can use olive oil instead."
                },
                {
                    "headline": "Season the turkey with salt and pepper.",
                    "description": "Start with 2 tablespoons (30 mL) of salt and pepper and gradually add more if it's not enough to cover the whole turkey. Sprinkle the seasonings onto the top of the turkey and then gently rub them in with your fingers. You can also use other kinds of seasonings, like rosemary, thyme, and sage."
                }
            ]
        },
        {
            "name": "Roasting the Turkey",
            "steps": [
                {
                    "headline": "Roast the turkey for 1.5-5 more hours depending on its weight.",
                    "description": "The more your turkey weighs, the longer you’ll need to roast it for. You can find out how much your turkey weighs by checking the plastic wrapping that it came in. 8–12 pounds (3.6–5.4 kg): roast for 1.5-2 more hours. 12–14 pounds (5.4–6.4 kg): roast for 2-3 more hours. 14–20 pounds (6.4–9.1 kg): roast for 3-4 more hours. 20–24 pounds (9.1–10.9 kg): roast for 4-5 more hours."
                },
                {
                    "headline": "Check on the turkey every hour.",
                    "description": "When you check on the turkey, check its temperature with the thermometer to make sure it’s going up. You can also brush on more melted butter or oil to give it more flavor. If the turkey looks like it’s burning or getting too crisp, cover the top with aluminum foil."
                },
                {
                    "headline": "Take the turkey out of the oven once it reaches 165 °F (74 °C).",
                    "description": "Your turkey will be fully cooked and safe to eat at this temperature. Check the temperature with the thermometer at multiple depths in different places to make sure the whole turkey is cooked through. Check the center of the turkey with the thermometer since it will take the longest to cook."
                },
                {
                    "headline": "Let the turkey cool for 30 minutes before serving.",
                    "description": "After 30 minutes, your turkey should be cool enough to carve and serve. Carve the turkey and serve it with stuffing, mashed potatoes, or your other favorite sides."
                }
            ]
        }
    ],
    "tyn": [
        "Oven",
        "Roasting rack",
        "Roasting pan",
        "Meat thermometer",
        "Basting brush",
        "Seasoning"
    ],
    "text": " Thawing the Turkey in the Oven Take your turkey out of the freezer and unwrap it. Use scissors to cut the netting and plastic off the turkey. Leave the bag of giblets inside the turkey for now. Put the turkey on a roasting rack inside of a roasting pan. The turkey should be breast-side up on the rack in the pan. It's important that you use a roasting rack so the heat in the oven can circulate around the entire turkey. Preheat the oven to 325 °F (163 °C). If there are multiple racks in the oven, remove all of them except for the one that's in the bottom third of the oven. That way there will be enough room for the turkey. Place the frozen turkey in the oven and let it thaw for 2 and a half hours. Avoid opening the oven during this time so heat doesn’t escape. After 2 and a half hours, the turkey should be mostly thawed and have a golden brown color. Don’t worry about seasoning your turkey yet — seasoning won’t stick to a frozen turkey. You can season the turkey later after it thaws for a couple of hours in the oven. Use a meat thermometer to check the turkey’s temperature after it’s thawed. Stick the thermometer in the breast or thighs and give it a few seconds to read the temperature. At this point, the turkey should be around 100–125 °F (38–52 °C). If the temperature is lower than 100–125 °F (38–52 °C), let the turkey continue to roast and check on it periodically until it’s up to temperature. Basting and Seasoning the Turkey Take the bag of giblets out of the neck of the turkey. The giblets are the organs of the turkey that are bagged and stuffed in the turkey’s neck by the butcher. Now that the turkey is partially thawed, you should be able to pull the giblets out so you can discard them (or make gravy with them). Brush ⁄2 cup (120 mL) of melted butter onto the turkey with a basting brush. Coating the turkey with butter will make it more flavorful. If you don't have butter, you can use olive oil instead. Season the turkey with salt and pepper. Start with 2 tablespoons (30 mL) of salt and pepper and gradually add more if it's not enough to cover the whole turkey. Sprinkle the seasonings onto the top of the turkey and then gently rub them in with your fingers. You can also use other kinds of seasonings, like rosemary, thyme, and sage. Roasting the Turkey Roast the turkey for 1.5-5 more hours depending on its weight. The more your turkey weighs, the longer you’ll need to roast it for. You can find out how much your turkey weighs by checking the plastic wrapping that it came in. 8–12 pounds (3.6–5.4 kg): roast for 1.5-2 more hours. 12–14 pounds (5.4–6.4 kg): roast for 2-3 more hours. 14–20 pounds (6.4–9.1 kg): roast for 3-4 more hours. 20–24 pounds (9.1–10.9 kg): roast for 4-5 more hours. Check on the turkey every hour. When you check on the turkey, check its temperature with the thermometer to make sure it’s going up. You can also brush on more melted butter or oil to give it more flavor. If the turkey looks like it’s burning or getting too crisp, cover the top with aluminum foil. Take the turkey out of the oven once it reaches 165 °F (74 °C). Your turkey will be fully cooked and safe to eat at this temperature. Check the temperature with the thermometer at multiple depths in different places to make sure the whole turkey is cooked through. Check the center of the turkey with the thermometer since it will take the longest to cook. Let the turkey cool for 30 minutes before serving. After 30 minutes, your turkey should be cool enough to carve and serve. Carve the turkey and serve it with stuffing, mashed potatoes, or your other favorite sides.",
    "sentences": [
        " Thawing the Turkey in the Oven Take your turkey out of the freezer and unwrap it.",
        "Use scissors to cut the netting and plastic off the turkey.",
        "Leave the bag of giblets inside the turkey for now.",
        "Put the turkey on a roasting rack inside of a roasting pan.",
        "The turkey should be breast-side up on the rack in the pan.",
        "It's important that you use a roasting rack so the heat in the oven can circulate around the entire turkey.",
        "Preheat the oven to 325 °F (163 °C).",
        "If there are multiple racks in the oven, remove all of them except for the one that's in the bottom third of the oven.",
        "That way there will be enough room for the turkey.",
        "Place the frozen turkey in the oven and let it thaw for 2 and a half hours.",
        "Avoid opening the oven during this time so heat doesn’t escape.",
        "After 2 and a half hours, the turkey should be mostly thawed and have a golden brown color.",
        "Don’t worry about seasoning your turkey yet — seasoning won’t stick to a frozen turkey.",
        "You can season the turkey later after it thaws for a couple of hours in the oven.",
        "Use a meat thermometer to check the turkey’s temperature after it’s thawed.",
        "Stick the thermometer in the breast or thighs and give it a few seconds to read the temperature.",
        "At this point, the turkey should be around 100–125 °F (38–52 °C).",
        "If the temperature is lower than 100–125 °F (38–52 °C), let the turkey continue to roast and check on it periodically until it’s up to temperature.",
        "Basting and Seasoning the Turkey Take the bag of giblets out of the neck of the turkey.",
        "The giblets are the organs of the turkey that are bagged and stuffed in the turkey’s neck by the butcher.",
        "Now that the turkey is partially thawed, you should be able to pull the giblets out so you can discard them (or make gravy with them).",
        "Brush ⁄2 cup (120 mL) of melted butter onto the turkey with a basting brush.",
        "Coating the turkey with butter will make it more flavorful.",
        "If you don't have butter, you can use olive oil instead.",
        "Season the turkey with salt and pepper.",
        "Start with 2 tablespoons (30 mL) of salt and pepper and gradually add more if it's not enough to cover the whole turkey.",
        "Sprinkle the seasonings onto the top of the turkey and then gently rub them in with your fingers.",
        "You can also use other kinds of seasonings, like rosemary, thyme, and sage.",
        "Roasting the Turkey Roast the turkey for 1.5-5 more hours depending on its weight.",
        "The more your turkey weighs, the longer you’ll need to roast it for.",
        "You can find out how much your turkey weighs by checking the plastic wrapping that it came in.",
        "8–12 pounds (3.6–5.4 kg): roast for 1.5-2 more hours.",
        "12–14 pounds (5.4–6.4 kg): roast for 2-3 more hours.",
        "14–20 pounds (6.4–9.1 kg): roast for 3-4 more hours.",
        "20–24 pounds (9.1–10.9 kg): roast for 4-5 more hours.",
        "Check on the turkey every hour.",
        "When you check on the turkey, check its temperature with the thermometer to make sure it’s going up.",
        "You can also brush on more melted butter or oil to give it more flavor.",
        "If the turkey looks like it’s burning or getting too crisp, cover the top with aluminum foil.",
        "Take the turkey out of the oven once it reaches 165 °F (74 °C).",
        "Your turkey will be fully cooked and safe to eat at this temperature.",
        "Check the temperature with the thermometer at multiple depths in different places to make sure the whole turkey is cooked through.",
        "Check the center of the turkey with the thermometer since it will take the longest to cook.",
        "Let the turkey cool for 30 minutes before serving.",
        "After 30 minutes, your turkey should be cool enough to carve and serve.",
        "Carve the turkey and serve it with stuffing, mashed potatoes, or your other favorite sides."
    ]
}