{
    "title": "How to Make a Hanging Flower Chandelier",
    "url": "https://www.wikihow.com/Make-a-Hanging-Flower-Chandelier",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Nature Crafts",
        "Leaf and Flower Crafts"
    ],
    "methods": [
        {
            "name": "Making a Wreath Chandelier",
            "steps": [
                {
                    "headline": "Tie four strands of twine to a wire floral wreath.",
                    "description": "Cut four equal strands of twine, about 33 inches (83.82 centimeters) long. Tie them together into a secure, double-knot, then tie the remaining ends to top, curved part of wreath. It's best to tie the string to the horizontal bars. This way, they won't slide around as much. You can also use fishing line instead."
                },
                {
                    "headline": "Take apart your plants.",
                    "description": "Pull the leaves off of a silk fern so that you have individual branches. Next, get some silk flowers in a variety of sizes, and pull the blooms off of the stems. Consider pulling the green leaves off of the stems as well; you can use these to fill in any gaps. If you can't pull the leaves or blooms off, you can cut them using wire cutters or a sharp pair of scissors. Ranunculus and zinnias are great choices! You can also use eucalyptus instead of ferns. Pull apart the branches, but keep the leaves attached."
                },
                {
                    "headline": "Start securing the fern fronds to the wire wreath.",
                    "description": "Place your first fern frond on top of the wire wreath. Bend it so that it follows the curve of the wreath. Secure it to the wreath with 4-inch (10.16-centimeter) pieces of green floral wire."
                },
                {
                    "headline": "Continue securing the ferns to the wire wreath.",
                    "description": "Place the next front just behind it, so that the tip overlaps the base of the first one. Secure the second frond with more wire. Keep securing fronds to your wire frame until the entire frame is covered. Don't worry if there are gaps. Be sure to cover the bottom of the wreath as well. You don't have to go full-out--just enough to hide the wires."
                },
                {
                    "headline": "Fill in the gaps with the largest flowers.",
                    "description": "Take some of your largest blooms, and secure them to the wreath using hot glue. Try to glue them directly to the wire wreath so that they are nestled between the fern fronds."
                },
                {
                    "headline": "Add in some small and medium sized flowers.",
                    "description": "Alternate using different types, colors, and sizes. Try to group your flowers together in odd numbers. This will create a more balanced and aesthetically-pleasing look."
                },
                {
                    "headline": "Clean it up.",
                    "description": "Carefully go over your wreath. Fill in any remaining gaps with silk leaves, greenery, and tiny \"filler\" plants, such as baby's breath. Pull or snip off any threads or whiskers left behind by the hot glue."
                }
            ]
        },
        {
            "name": "Making a Dangling Chandelier",
            "steps": [
                {
                    "headline": "Cut two 3-yard (2.74-meter) pieces of narrow ribbon.",
                    "description": "White ribbon works best for this, but you can use any color you want. Try to use satin ribbon, if you can. Sheer ribbon will give you a nice, delicate look, however."
                },
                {
                    "headline": "Fold the ribbons in half, and loop them through a metal D ring.",
                    "description": "Gather the two ribbons together. Fold them in half and make sure that the ends match up. Slip the folded part through a D ring. Pull all four loose ends of the ribbon up through the loop. Gently tug down on the loose ends to tighten the knot."
                },
                {
                    "headline": "Measure down 18 inches (45.72 centimeters) on each ribbon.",
                    "description": "Make a mark using a pen, marker, or a sewing pin. You only need to mark one side of each ribbon. These marks will tell you where to glue the embroidery hoop."
                },
                {
                    "headline": "Take apart a wooden embroidery hoop and divide the inner ring into quarters.",
                    "description": "Discard the outer ring and save the inner ring. Divide the inner ring into quarters. Mark off each quarter with a pen. These marks will tell you where to put the ribbon. Make the marks on the inside of the ring."
                },
                {
                    "headline": "Secure the ribbons to the inside of the hoop with hot glue.",
                    "description": "Take a hot glue gun, and draw a line of hot glue along one of the marks on the embroidery hoop. Quickly press one of the ribbons into the glue. Make sure that the mark on the ribbon lines up with the top edge of the hoop. Repeat this step for the other ribbons. Wok one ribbon at a time, or the glue will set too fast."
                },
                {
                    "headline": "Wrap the ribbons around the hoop for extra security.",
                    "description": "Pull one of the ribbon ends over the bottom edge of the hoop. Bring it to the right side of the right side of the ribbon. Pull it down, them wrap it under the bottom edge of the hoop. This time, pull it to the left side of the ribbon. Secure the ribbon with hot glue before each wrap. Repeat this step for the other three ribbons."
                },
                {
                    "headline": "Trim down your flowers.",
                    "description": "Choose some pretty real or silk flowers, and cut them down until they are a few inches long. Use clean gardening shears for real flowers, and wire cutters for silk ones. Choose flowers with thicker stems, such as roses, ranunculus, and zinnias. If your flowers have leaves on them, it might be a good idea to trim them off."
                },
                {
                    "headline": "Tie the flowers to the ribbons.",
                    "description": "Wrap the end of each ribbon around each flower stem, and tie it into a tight knot. Try to tie the ribbon just above a \"knob\" or \"knot\" on the flower stem, so that when the flowers hang upside down, they won't slide off."
                },
                {
                    "headline": "Add more ribbons and flowers, if desired.",
                    "description": "Cut several more pieces of ribbon. They can be the same length as the ones dangling from the embroidery hoop, or different lengths. Attach them to the hoop with hot glue, then wrap them around the hoop twice for extra security. Trim down some more flowers, and tie them to the ribbons. The ribbons can all be the same, or they can be different. It might be a good idea to hang the chandelier up while you are working. This way, if one side is too heavy, you will be able to fix it."
                },
                {
                    "headline": "Adjust the weight.",
                    "description": "Hang the chandelier up. It's okay if the flowers and ribbons are different lengths, but the embroidery hoop should be level. If it is hanging crooked, one side is too heavy. Switch out the flower for a lighter/heavier or, or trim down the stem to make it lighter."
                },
                {
                    "headline": "Glue a piece of lace trim around the embroidery hoop.",
                    "description": "Measure around the embroidery hoop and add 1 inch (2.54 centimeters). Cut a piece of lace trim according to that measurement. Glue it around the outer edge of the hoop. Overlap the ends by ½ inch (1.27 centimeters), and secure them with more hot glue. Hot glue sets fast, so work only 1 to 2 inches (2.54 to 5.08 centimeters) at a time. White or ivory lace would work well for this."
                }
            ]
        }
    ],
    "tyn": [
        "Making a Wreath Chandelier",
        "Green, floral wire wreath base",
        "Green floral wire",
        "Silk ferns",
        "Silk flowers in a variety of sizes",
        "Wire cutters or heavy duty scissors",
        "Hot glue gun and hot glue sticks",
        "Twine or strong string",
        "Making a Dangling Chandelier",
        "3 to 4 dozen silk flowers",
        "Wooden embroidery hoop",
        "6 yards (5.49 meters) thin, satin ribbon",
        "Flat, lace trim",
        "Metal D ring",
        "Scissors"
    ],
    "text": " Making a Wreath Chandelier Tie four strands of twine to a wire floral wreath. Cut four equal strands of twine, about 33 inches (83.82 centimeters) long. Tie them together into a secure, double-knot, then tie the remaining ends to top, curved part of wreath. It's best to tie the string to the horizontal bars. This way, they won't slide around as much. You can also use fishing line instead. Take apart your plants. Pull the leaves off of a silk fern so that you have individual branches. Next, get some silk flowers in a variety of sizes, and pull the blooms off of the stems. Consider pulling the green leaves off of the stems as well; you can use these to fill in any gaps. If you can't pull the leaves or blooms off, you can cut them using wire cutters or a sharp pair of scissors. Ranunculus and zinnias are great choices! You can also use eucalyptus instead of ferns. Pull apart the branches, but keep the leaves attached. Start securing the fern fronds to the wire wreath. Place your first fern frond on top of the wire wreath. Bend it so that it follows the curve of the wreath. Secure it to the wreath with 4-inch (10.16-centimeter) pieces of green floral wire. Continue securing the ferns to the wire wreath. Place the next front just behind it, so that the tip overlaps the base of the first one. Secure the second frond with more wire. Keep securing fronds to your wire frame until the entire frame is covered. Don't worry if there are gaps. Be sure to cover the bottom of the wreath as well. You don't have to go full-out--just enough to hide the wires. Fill in the gaps with the largest flowers. Take some of your largest blooms, and secure them to the wreath using hot glue. Try to glue them directly to the wire wreath so that they are nestled between the fern fronds. Add in some small and medium sized flowers. Alternate using different types, colors, and sizes. Try to group your flowers together in odd numbers. This will create a more balanced and aesthetically-pleasing look. Clean it up. Carefully go over your wreath. Fill in any remaining gaps with silk leaves, greenery, and tiny \"filler\" plants, such as baby's breath. Pull or snip off any threads or whiskers left behind by the hot glue. Making a Dangling Chandelier Cut two 3-yard (2.74-meter) pieces of narrow ribbon. White ribbon works best for this, but you can use any color you want. Try to use satin ribbon, if you can. Sheer ribbon will give you a nice, delicate look, however. Fold the ribbons in half, and loop them through a metal D ring. Gather the two ribbons together. Fold them in half and make sure that the ends match up. Slip the folded part through a D ring. Pull all four loose ends of the ribbon up through the loop. Gently tug down on the loose ends to tighten the knot. Measure down 18 inches (45.72 centimeters) on each ribbon. Make a mark using a pen, marker, or a sewing pin. You only need to mark one side of each ribbon. These marks will tell you where to glue the embroidery hoop. Take apart a wooden embroidery hoop and divide the inner ring into quarters. Discard the outer ring and save the inner ring. Divide the inner ring into quarters. Mark off each quarter with a pen. These marks will tell you where to put the ribbon. Make the marks on the inside of the ring. Secure the ribbons to the inside of the hoop with hot glue. Take a hot glue gun, and draw a line of hot glue along one of the marks on the embroidery hoop. Quickly press one of the ribbons into the glue. Make sure that the mark on the ribbon lines up with the top edge of the hoop. Repeat this step for the other ribbons. Wok one ribbon at a time, or the glue will set too fast. Wrap the ribbons around the hoop for extra security. Pull one of the ribbon ends over the bottom edge of the hoop. Bring it to the right side of the right side of the ribbon. Pull it down, them wrap it under the bottom edge of the hoop. This time, pull it to the left side of the ribbon. Secure the ribbon with hot glue before each wrap. Repeat this step for the other three ribbons. Trim down your flowers. Choose some pretty real or silk flowers, and cut them down until they are a few inches long. Use clean gardening shears for real flowers, and wire cutters for silk ones. Choose flowers with thicker stems, such as roses, ranunculus, and zinnias. If your flowers have leaves on them, it might be a good idea to trim them off. Tie the flowers to the ribbons. Wrap the end of each ribbon around each flower stem, and tie it into a tight knot. Try to tie the ribbon just above a \"knob\" or \"knot\" on the flower stem, so that when the flowers hang upside down, they won't slide off. Add more ribbons and flowers, if desired. Cut several more pieces of ribbon. They can be the same length as the ones dangling from the embroidery hoop, or different lengths. Attach them to the hoop with hot glue, then wrap them around the hoop twice for extra security. Trim down some more flowers, and tie them to the ribbons. The ribbons can all be the same, or they can be different. It might be a good idea to hang the chandelier up while you are working. This way, if one side is too heavy, you will be able to fix it. Adjust the weight. Hang the chandelier up. It's okay if the flowers and ribbons are different lengths, but the embroidery hoop should be level. If it is hanging crooked, one side is too heavy. Switch out the flower for a lighter/heavier or, or trim down the stem to make it lighter. Glue a piece of lace trim around the embroidery hoop. Measure around the embroidery hoop and add 1 inch (2.54 centimeters). Cut a piece of lace trim according to that measurement. Glue it around the outer edge of the hoop. Overlap the ends by ½ inch (1.27 centimeters), and secure them with more hot glue. Hot glue sets fast, so work only 1 to 2 inches (2.54 to 5.08 centimeters) at a time. White or ivory lace would work well for this.",
    "sentences": [
        " Making a Wreath Chandelier Tie four strands of twine to a wire floral wreath.",
        "Cut four equal strands of twine, about 33 inches (83.82 centimeters) long.",
        "Tie them together into a secure, double-knot, then tie the remaining ends to top, curved part of wreath.",
        "It's best to tie the string to the horizontal bars.",
        "This way, they won't slide around as much.",
        "You can also use fishing line instead.",
        "Take apart your plants.",
        "Pull the leaves off of a silk fern so that you have individual branches.",
        "Next, get some silk flowers in a variety of sizes, and pull the blooms off of the stems.",
        "Consider pulling the green leaves off of the stems as well; you can use these to fill in any gaps.",
        "If you can't pull the leaves or blooms off, you can cut them using wire cutters or a sharp pair of scissors.",
        "Ranunculus and zinnias are great choices!",
        "You can also use eucalyptus instead of ferns.",
        "Pull apart the branches, but keep the leaves attached.",
        "Start securing the fern fronds to the wire wreath.",
        "Place your first fern frond on top of the wire wreath.",
        "Bend it so that it follows the curve of the wreath.",
        "Secure it to the wreath with 4-inch (10.16-centimeter) pieces of green floral wire.",
        "Continue securing the ferns to the wire wreath.",
        "Place the next front just behind it, so that the tip overlaps the base of the first one.",
        "Secure the second frond with more wire.",
        "Keep securing fronds to your wire frame until the entire frame is covered.",
        "Don't worry if there are gaps.",
        "Be sure to cover the bottom of the wreath as well.",
        "You don't have to go full-out--just enough to hide the wires.",
        "Fill in the gaps with the largest flowers.",
        "Take some of your largest blooms, and secure them to the wreath using hot glue.",
        "Try to glue them directly to the wire wreath so that they are nestled between the fern fronds.",
        "Add in some small and medium sized flowers.",
        "Alternate using different types, colors, and sizes.",
        "Try to group your flowers together in odd numbers.",
        "This will create a more balanced and aesthetically-pleasing look.",
        "Clean it up.",
        "Carefully go over your wreath.",
        "Fill in any remaining gaps with silk leaves, greenery, and tiny \"filler\" plants, such as baby's breath.",
        "Pull or snip off any threads or whiskers left behind by the hot glue.",
        "Making a Dangling Chandelier Cut two 3-yard (2.74-meter) pieces of narrow ribbon.",
        "White ribbon works best for this, but you can use any color you want.",
        "Try to use satin ribbon, if you can.",
        "Sheer ribbon will give you a nice, delicate look, however.",
        "Fold the ribbons in half, and loop them through a metal D ring.",
        "Gather the two ribbons together.",
        "Fold them in half and make sure that the ends match up.",
        "Slip the folded part through a D ring.",
        "Pull all four loose ends of the ribbon up through the loop.",
        "Gently tug down on the loose ends to tighten the knot.",
        "Measure down 18 inches (45.72 centimeters) on each ribbon.",
        "Make a mark using a pen, marker, or a sewing pin.",
        "You only need to mark one side of each ribbon.",
        "These marks will tell you where to glue the embroidery hoop.",
        "Take apart a wooden embroidery hoop and divide the inner ring into quarters.",
        "Discard the outer ring and save the inner ring.",
        "Divide the inner ring into quarters.",
        "Mark off each quarter with a pen.",
        "These marks will tell you where to put the ribbon.",
        "Make the marks on the inside of the ring.",
        "Secure the ribbons to the inside of the hoop with hot glue.",
        "Take a hot glue gun, and draw a line of hot glue along one of the marks on the embroidery hoop.",
        "Quickly press one of the ribbons into the glue.",
        "Make sure that the mark on the ribbon lines up with the top edge of the hoop.",
        "Repeat this step for the other ribbons.",
        "Wok one ribbon at a time, or the glue will set too fast.",
        "Wrap the ribbons around the hoop for extra security.",
        "Pull one of the ribbon ends over the bottom edge of the hoop.",
        "Bring it to the right side of the right side of the ribbon.",
        "Pull it down, them wrap it under the bottom edge of the hoop.",
        "This time, pull it to the left side of the ribbon.",
        "Secure the ribbon with hot glue before each wrap.",
        "Repeat this step for the other three ribbons.",
        "Trim down your flowers.",
        "Choose some pretty real or silk flowers, and cut them down until they are a few inches long.",
        "Use clean gardening shears for real flowers, and wire cutters for silk ones.",
        "Choose flowers with thicker stems, such as roses, ranunculus, and zinnias.",
        "If your flowers have leaves on them, it might be a good idea to trim them off.",
        "Tie the flowers to the ribbons.",
        "Wrap the end of each ribbon around each flower stem, and tie it into a tight knot.",
        "Try to tie the ribbon just above a \"knob\" or \"knot\" on the flower stem, so that when the flowers hang upside down, they won't slide off.",
        "Add more ribbons and flowers, if desired.",
        "Cut several more pieces of ribbon.",
        "They can be the same length as the ones dangling from the embroidery hoop, or different lengths.",
        "Attach them to the hoop with hot glue, then wrap them around the hoop twice for extra security.",
        "Trim down some more flowers, and tie them to the ribbons.",
        "The ribbons can all be the same, or they can be different.",
        "It might be a good idea to hang the chandelier up while you are working.",
        "This way, if one side is too heavy, you will be able to fix it.",
        "Adjust the weight.",
        "Hang the chandelier up.",
        "It's okay if the flowers and ribbons are different lengths, but the embroidery hoop should be level.",
        "If it is hanging crooked, one side is too heavy.",
        "Switch out the flower for a lighter/heavier or, or trim down the stem to make it lighter.",
        "Glue a piece of lace trim around the embroidery hoop.",
        "Measure around the embroidery hoop and add 1 inch (2.54 centimeters).",
        "Cut a piece of lace trim according to that measurement.",
        "Glue it around the outer edge of the hoop.",
        "Overlap the ends by ½ inch (1.27 centimeters), and secure them with more hot glue.",
        "Hot glue sets fast, so work only 1 to 2 inches (2.54 to 5.08 centimeters) at a time.",
        "White or ivory lace would work well for this."
    ]
}