{
    "title": "How to Remove Permanent Marker from Cotton",
    "url": "https://www.wikihow.com/Remove-Permanent-Marker-from-Cotton",
    "category_hierarchy": [
        "Education and Communications",
        "Stationery",
        "Ink"
    ],
    "parts": [
        {
            "name": "Using an Alcohol-Based Solvent",
            "steps": [
                {
                    "headline": "Remove wet ink with a clean cloth.",
                    "description": "If the ink is still wet, use a clean, dry cloth to gently dab the stain. This will remove the ink that hasn't soaked into the cotton material and dried. Avoid scrubbing or wiping, as this may spread the stain."
                },
                {
                    "headline": "Select a solvent with a high percentage of alcohol.",
                    "description": "You'll need a solvent to help break down the ink and remove it. Liquids with a high percentage of alcohol are the most effective solvent for this purpose. Fortunately, there are a handful of readily available options. Methylated spirits or rubbing alcohol are the best option. These are available at hardware stores and pharmacies. Alcohol-based hair spray, nail polish remover, and liquid hand sanitizer that contains alcohol will also work. In a pinch, liquor may work too."
                },
                {
                    "headline": "Test your solvent before using it.",
                    "description": "Apply a small amount of the solvent you want to use to a hidden area of the cotton item, such as the inside seam of a piece of clothing. Most cotton items will not be affected by alcohol-based liquids, but it's worth making sure your solvent won't discolor the item. If your solvent discolors your cotton item, try a different solvent before proceeding."
                }
            ]
        },
        {
            "name": "Applying the Solvent",
            "steps": [
                {
                    "headline": "Position the stain against a paper towel.",
                    "description": "Place the section of the cotton material that is stained face down against a piece of dry paper towel. This will allow you to work the stain out of the cotton from the other side of the material."
                },
                {
                    "headline": "Pour the solvent into the stain from the other side.",
                    "description": "Pour a small amount of your solvent onto the cotton so that it seeps through the material into the stain. Allow the solvent to breakdown the stain by letting it to sit for a minute."
                },
                {
                    "headline": "Blot the stain from the opposite side.",
                    "description": "Dampen a cotton ball or piece of cloth with solvent and gently blot the stain from the backside. This will push the marker ink out of the cotton and into the paper towel."
                },
                {
                    "headline": "Change the paper towel frequently.",
                    "description": "Continue adding alcohol to the stain in small amounts and blotting. As you do so, remove saturated paper towels from below and replace them with dry paper towels that will soak up your solvent and ink from the stain. Frequent paper towel changes are important, to prevent the cotton from re-absorbing ink that is transferred into the towel. Continue blotting and replacing the paper towel until no more ink transfers and the stain is removed from the cotton material."
                },
                {
                    "headline": "Let the material air dry.",
                    "description": "After removing the ink stain, allow the item to air dry and ensure the stain is removed. Avoid machine-drying the material until you're sure the stain is removed, as high-heat drying can make the stain permanent. Once you're sure the stain has been removed, wash the item normally."
                }
            ]
        },
        {
            "name": "Trying Other Methods",
            "steps": [
                {
                    "headline": "Use a stain remover.",
                    "description": "Stain removers require less effort on your part, and may work well. Examples include Dawn Power Dissolver, Mr. Clean Multi-Surface Cleaner, and Tide Spray 'n Wash. Follow the directions on the items container, making sure they can safely be used on cotton. Be aware that it may take several applications of a stain remover in order to fully remove a stain. Always test a commercial stain remover on an inconspicuous part of the cotton item."
                },
                {
                    "headline": "Swap out the alcohol with citrus juice.",
                    "description": "Citrus juice is an alternative solvent option. Place the stained material face down on clean paper towel. Cut an orange or lemon in half, and dab the fruit's flesh onto the back of the stained area. Switch the paper towel frequently and continue dabbing until the stain is removed. Allow the item to air dry and wash normally."
                },
                {
                    "headline": "Try to rinse the stain out.",
                    "description": "You may be able to remove an ink stain without blotting. You will still need to apply a solvent, such as alcohol-based hairspray. Apply the solvent directly to the stain from both sides of the cotton material. Allow the solvent to sit for a few minutes and rinse in cool or warm water. You may need to repeat this process several times. Try allowing the solvent to soak into the stain for a longer period of time, such as 15 minutes, between rinses."
                },
                {
                    "headline": "Soak the fabric in milk.",
                    "description": "Fill a bowl or basin with milk, and submerge the stained fabric in it. Allow the cotton to soak overnight, then wash it as you normally would."
                },
                {
                    "headline": "Make a paste from baking soda.",
                    "description": "Mix baking soda and water until a paste forms. Add more baking soda if the mixture is too runny, or add water if it is too thick. Put the paste on the stain and let it soak in for 15 minutes. Then, use a brush to scrub the paste into the fabric until the stain is gone. Wash the material as you normally would after removing the stain. Don't brush too hard if the fabric is thin or delicate."
                }
            ]
        }
    ],
    "tyn": [
        "An alcohol-based solvent, such as rubbing alcohol, hair spray, or liquid hand sanitizer",
        "A clean cloth or cotton balls",
        "Paper towels",
        "Citrus juice",
        "Milk",
        "Baking soda"
    ],
    "text": " Using an Alcohol-Based Solvent Remove wet ink with a clean cloth. If the ink is still wet, use a clean, dry cloth to gently dab the stain. This will remove the ink that hasn't soaked into the cotton material and dried. Avoid scrubbing or wiping, as this may spread the stain. Select a solvent with a high percentage of alcohol. You'll need a solvent to help break down the ink and remove it. Liquids with a high percentage of alcohol are the most effective solvent for this purpose. Fortunately, there are a handful of readily available options. Methylated spirits or rubbing alcohol are the best option. These are available at hardware stores and pharmacies. Alcohol-based hair spray, nail polish remover, and liquid hand sanitizer that contains alcohol will also work. In a pinch, liquor may work too. Test your solvent before using it. Apply a small amount of the solvent you want to use to a hidden area of the cotton item, such as the inside seam of a piece of clothing. Most cotton items will not be affected by alcohol-based liquids, but it's worth making sure your solvent won't discolor the item. If your solvent discolors your cotton item, try a different solvent before proceeding. Applying the Solvent Position the stain against a paper towel. Place the section of the cotton material that is stained face down against a piece of dry paper towel. This will allow you to work the stain out of the cotton from the other side of the material. Pour the solvent into the stain from the other side. Pour a small amount of your solvent onto the cotton so that it seeps through the material into the stain. Allow the solvent to breakdown the stain by letting it to sit for a minute. Blot the stain from the opposite side. Dampen a cotton ball or piece of cloth with solvent and gently blot the stain from the backside. This will push the marker ink out of the cotton and into the paper towel. Change the paper towel frequently. Continue adding alcohol to the stain in small amounts and blotting. As you do so, remove saturated paper towels from below and replace them with dry paper towels that will soak up your solvent and ink from the stain. Frequent paper towel changes are important, to prevent the cotton from re-absorbing ink that is transferred into the towel. Continue blotting and replacing the paper towel until no more ink transfers and the stain is removed from the cotton material. Let the material air dry. After removing the ink stain, allow the item to air dry and ensure the stain is removed. Avoid machine-drying the material until you're sure the stain is removed, as high-heat drying can make the stain permanent. Once you're sure the stain has been removed, wash the item normally. Trying Other Methods Use a stain remover. Stain removers require less effort on your part, and may work well. Examples include Dawn Power Dissolver, Mr. Clean Multi-Surface Cleaner, and Tide Spray 'n Wash. Follow the directions on the items container, making sure they can safely be used on cotton. Be aware that it may take several applications of a stain remover in order to fully remove a stain. Always test a commercial stain remover on an inconspicuous part of the cotton item. Swap out the alcohol with citrus juice. Citrus juice is an alternative solvent option. Place the stained material face down on clean paper towel. Cut an orange or lemon in half, and dab the fruit's flesh onto the back of the stained area. Switch the paper towel frequently and continue dabbing until the stain is removed. Allow the item to air dry and wash normally. Try to rinse the stain out. You may be able to remove an ink stain without blotting. You will still need to apply a solvent, such as alcohol-based hairspray. Apply the solvent directly to the stain from both sides of the cotton material. Allow the solvent to sit for a few minutes and rinse in cool or warm water. You may need to repeat this process several times. Try allowing the solvent to soak into the stain for a longer period of time, such as 15 minutes, between rinses. Soak the fabric in milk. Fill a bowl or basin with milk, and submerge the stained fabric in it. Allow the cotton to soak overnight, then wash it as you normally would. Make a paste from baking soda. Mix baking soda and water until a paste forms. Add more baking soda if the mixture is too runny, or add water if it is too thick. Put the paste on the stain and let it soak in for 15 minutes. Then, use a brush to scrub the paste into the fabric until the stain is gone. Wash the material as you normally would after removing the stain. Don't brush too hard if the fabric is thin or delicate.",
    "sentences": [
        " Using an Alcohol-Based Solvent Remove wet ink with a clean cloth.",
        "If the ink is still wet, use a clean, dry cloth to gently dab the stain.",
        "This will remove the ink that hasn't soaked into the cotton material and dried.",
        "Avoid scrubbing or wiping, as this may spread the stain.",
        "Select a solvent with a high percentage of alcohol.",
        "You'll need a solvent to help break down the ink and remove it.",
        "Liquids with a high percentage of alcohol are the most effective solvent for this purpose.",
        "Fortunately, there are a handful of readily available options.",
        "Methylated spirits or rubbing alcohol are the best option.",
        "These are available at hardware stores and pharmacies.",
        "Alcohol-based hair spray, nail polish remover, and liquid hand sanitizer that contains alcohol will also work.",
        "In a pinch, liquor may work too.",
        "Test your solvent before using it.",
        "Apply a small amount of the solvent you want to use to a hidden area of the cotton item, such as the inside seam of a piece of clothing.",
        "Most cotton items will not be affected by alcohol-based liquids, but it's worth making sure your solvent won't discolor the item.",
        "If your solvent discolors your cotton item, try a different solvent before proceeding.",
        "Applying the Solvent Position the stain against a paper towel.",
        "Place the section of the cotton material that is stained face down against a piece of dry paper towel.",
        "This will allow you to work the stain out of the cotton from the other side of the material.",
        "Pour the solvent into the stain from the other side.",
        "Pour a small amount of your solvent onto the cotton so that it seeps through the material into the stain.",
        "Allow the solvent to breakdown the stain by letting it to sit for a minute.",
        "Blot the stain from the opposite side.",
        "Dampen a cotton ball or piece of cloth with solvent and gently blot the stain from the backside.",
        "This will push the marker ink out of the cotton and into the paper towel.",
        "Change the paper towel frequently.",
        "Continue adding alcohol to the stain in small amounts and blotting.",
        "As you do so, remove saturated paper towels from below and replace them with dry paper towels that will soak up your solvent and ink from the stain.",
        "Frequent paper towel changes are important, to prevent the cotton from re-absorbing ink that is transferred into the towel.",
        "Continue blotting and replacing the paper towel until no more ink transfers and the stain is removed from the cotton material.",
        "Let the material air dry.",
        "After removing the ink stain, allow the item to air dry and ensure the stain is removed.",
        "Avoid machine-drying the material until you're sure the stain is removed, as high-heat drying can make the stain permanent.",
        "Once you're sure the stain has been removed, wash the item normally.",
        "Trying Other Methods Use a stain remover.",
        "Stain removers require less effort on your part, and may work well.",
        "Examples include Dawn Power Dissolver, Mr. Clean Multi-Surface Cleaner, and Tide Spray 'n Wash.",
        "Follow the directions on the items container, making sure they can safely be used on cotton.",
        "Be aware that it may take several applications of a stain remover in order to fully remove a stain.",
        "Always test a commercial stain remover on an inconspicuous part of the cotton item.",
        "Swap out the alcohol with citrus juice.",
        "Citrus juice is an alternative solvent option.",
        "Place the stained material face down on clean paper towel.",
        "Cut an orange or lemon in half, and dab the fruit's flesh onto the back of the stained area.",
        "Switch the paper towel frequently and continue dabbing until the stain is removed.",
        "Allow the item to air dry and wash normally.",
        "Try to rinse the stain out.",
        "You may be able to remove an ink stain without blotting.",
        "You will still need to apply a solvent, such as alcohol-based hairspray.",
        "Apply the solvent directly to the stain from both sides of the cotton material.",
        "Allow the solvent to sit for a few minutes and rinse in cool or warm water.",
        "You may need to repeat this process several times.",
        "Try allowing the solvent to soak into the stain for a longer period of time, such as 15 minutes, between rinses.",
        "Soak the fabric in milk.",
        "Fill a bowl or basin with milk, and submerge the stained fabric in it.",
        "Allow the cotton to soak overnight, then wash it as you normally would.",
        "Make a paste from baking soda.",
        "Mix baking soda and water until a paste forms.",
        "Add more baking soda if the mixture is too runny, or add water if it is too thick.",
        "Put the paste on the stain and let it soak in for 15 minutes.",
        "Then, use a brush to scrub the paste into the fabric until the stain is gone.",
        "Wash the material as you normally would after removing the stain.",
        "Don't brush too hard if the fabric is thin or delicate."
    ]
}