{
    "title": "How to Make Crayon Egg Candles",
    "url": "https://www.wikihow.com/Make-Crayon-Egg-Candles",
    "category_hierarchy": [
        "Home and Garden",
        "Lighting",
        "Candles"
    ],
    "parts": [
        {
            "name": "Preparing the Eggs",
            "steps": [
                {
                    "headline": "Wash the eggs.",
                    "description": "Wash the eggs thoroughly with warm water to prevent food borne illness."
                },
                {
                    "headline": "Poke two holes in the eggs.",
                    "description": "Using a thumbtack, poke a hole through the top and bottom of each egg. Your grip should be fairly loose so that the egg does not break. The hole should be about the size of the top of the thumbtack."
                },
                {
                    "headline": "Blow the egg whites and yolk out of each egg.",
                    "description": "Place your mouth on one end and blow until the eggs are completely empty."
                },
                {
                    "headline": "Rinse the eggs.",
                    "description": "Place the eggs into a bowl of warm soapy water so that they fill. Once the eggs are filled, blow through each egg to empty them."
                },
                {
                    "headline": "Set the eggs aside.",
                    "description": "Place the eggs in the refrigerator for about 2 days to allow them to completely dry."
                }
            ]
        },
        {
            "name": "Preparing the Wax",
            "steps": [
                {
                    "headline": "Break the crayons and paraffin wax into smaller pieces.",
                    "description": "This will allow them to melt faster and have an even consistency. Use about 3 ounces of paraffin wax per egg."
                },
                {
                    "headline": "Place each into separate plastic containers.",
                    "description": "Each color crayon should have its own container."
                },
                {
                    "headline": "Melt the wax and crayons in a double boiler set up.",
                    "description": "The paraffin wax will turn clear. Fill a pot up with water\nPlace the plastic containers of wax and crayons in the water so that they float\nBring the water to a boil"
                },
                {
                    "headline": "Check the temperature.",
                    "description": "Using a glass thermometer, make sure the paraffin wax is at 125 °F (51.7 °C) or more."
                },
                {
                    "headline": "Combine the paraffin wax with each color crayon.",
                    "description": "Pour the melted paraffin wax directly to the melted crayon."
                }
            ]
        },
        {
            "name": "Filling the Egg",
            "steps": [
                {
                    "headline": "Run the wick through each hole of the eggs.",
                    "description": "Trim the wick so that there is at least half an inch sticking out from each side."
                },
                {
                    "headline": "Patch the top hole of each egg with Play-Doh.",
                    "description": "This allows the egg to not leak by having a solid seal."
                },
                {
                    "headline": "Fill the eggs with the wax and crayon mix.",
                    "description": "Using a funnel, overfill the eggs to assure they are filled to full capacity."
                },
                {
                    "headline": "Keep refilling the eggs.",
                    "description": "As the wax starts to cool, you'll notice the egg is no longer filled to full capacity. You'll need to refill the eggs about 3-4 times."
                },
                {
                    "headline": "Set the eggs aside.",
                    "description": "Place the eggs in the refrigerator for about 2-3 hours to allow the wax to completely cool."
                }
            ]
        },
        {
            "name": "Peeling the Eggs",
            "steps": [
                {
                    "headline": "Remove the Play-Doh.",
                    "description": ""
                },
                {
                    "headline": "Crack the shells.",
                    "description": "This can be done by knocking the eggs on a counter or hitting them all around with a spoon or other utensils."
                },
                {
                    "headline": "Peel the eggs.",
                    "description": "If the shells are sticking to the wax, use a knife to peel it off."
                },
                {
                    "headline": "Trim the wicks to a desired length.",
                    "description": ""
                },
                {
                    "headline": "Polish the egg candles, if desired.",
                    "description": "Use a hair dryer on low heat to just slightly melt the wax. Rub your finger over the wax to give it a shine finish."
                },
                {
                    "headline": "Shave down the bottom of the egg with a knife, if you want to.",
                    "description": "This will flatten down the bottom allowing it to stand on its own."
                }
            ]
        }
    ],
    "tyn": [
        "Eggs",
        "Crayons",
        "Paraffin Wax",
        "Small Plastic Containers",
        "Cooking Pot",
        "Candle Wicks",
        "Play-Doh",
        "Funnel",
        "Glass Thermometer"
    ],
    "text": " Preparing the Eggs Wash the eggs. Wash the eggs thoroughly with warm water to prevent food borne illness. Poke two holes in the eggs. Using a thumbtack, poke a hole through the top and bottom of each egg. Your grip should be fairly loose so that the egg does not break. The hole should be about the size of the top of the thumbtack. Blow the egg whites and yolk out of each egg. Place your mouth on one end and blow until the eggs are completely empty. Rinse the eggs. Place the eggs into a bowl of warm soapy water so that they fill. Once the eggs are filled, blow through each egg to empty them. Set the eggs aside. Place the eggs in the refrigerator for about 2 days to allow them to completely dry. Preparing the Wax Break the crayons and paraffin wax into smaller pieces. This will allow them to melt faster and have an even consistency. Use about 3 ounces of paraffin wax per egg. Place each into separate plastic containers. Each color crayon should have its own container. Melt the wax and crayons in a double boiler set up. The paraffin wax will turn clear. Fill a pot up with water\nPlace the plastic containers of wax and crayons in the water so that they float\nBring the water to a boil Check the temperature. Using a glass thermometer, make sure the paraffin wax is at 125 °F (51.7 °C) or more. Combine the paraffin wax with each color crayon. Pour the melted paraffin wax directly to the melted crayon. Filling the Egg Run the wick through each hole of the eggs. Trim the wick so that there is at least half an inch sticking out from each side. Patch the top hole of each egg with Play-Doh. This allows the egg to not leak by having a solid seal. Fill the eggs with the wax and crayon mix. Using a funnel, overfill the eggs to assure they are filled to full capacity. Keep refilling the eggs. As the wax starts to cool, you'll notice the egg is no longer filled to full capacity. You'll need to refill the eggs about 3-4 times. Set the eggs aside. Place the eggs in the refrigerator for about 2-3 hours to allow the wax to completely cool. Peeling the Eggs Remove the Play-Doh.  Crack the shells. This can be done by knocking the eggs on a counter or hitting them all around with a spoon or other utensils. Peel the eggs. If the shells are sticking to the wax, use a knife to peel it off. Trim the wicks to a desired length.  Polish the egg candles, if desired. Use a hair dryer on low heat to just slightly melt the wax. Rub your finger over the wax to give it a shine finish. Shave down the bottom of the egg with a knife, if you want to. This will flatten down the bottom allowing it to stand on its own.",
    "sentences": [
        " Preparing the Eggs Wash the eggs.",
        "Wash the eggs thoroughly with warm water to prevent food borne illness.",
        "Poke two holes in the eggs.",
        "Using a thumbtack, poke a hole through the top and bottom of each egg.",
        "Your grip should be fairly loose so that the egg does not break.",
        "The hole should be about the size of the top of the thumbtack.",
        "Blow the egg whites and yolk out of each egg.",
        "Place your mouth on one end and blow until the eggs are completely empty.",
        "Rinse the eggs.",
        "Place the eggs into a bowl of warm soapy water so that they fill.",
        "Once the eggs are filled, blow through each egg to empty them.",
        "Set the eggs aside.",
        "Place the eggs in the refrigerator for about 2 days to allow them to completely dry.",
        "Preparing the Wax Break the crayons and paraffin wax into smaller pieces.",
        "This will allow them to melt faster and have an even consistency.",
        "Use about 3 ounces of paraffin wax per egg.",
        "Place each into separate plastic containers.",
        "Each color crayon should have its own container.",
        "Melt the wax and crayons in a double boiler set up.",
        "The paraffin wax will turn clear.",
        "Fill a pot up with water\nPlace the plastic containers of wax and crayons in the water so that they float\nBring the water to a boil Check the temperature.",
        "Using a glass thermometer, make sure the paraffin wax is at 125 °F (51.7 °C) or more.",
        "Combine the paraffin wax with each color crayon.",
        "Pour the melted paraffin wax directly to the melted crayon.",
        "Filling the Egg Run the wick through each hole of the eggs.",
        "Trim the wick so that there is at least half an inch sticking out from each side.",
        "Patch the top hole of each egg with Play-Doh.",
        "This allows the egg to not leak by having a solid seal.",
        "Fill the eggs with the wax and crayon mix.",
        "Using a funnel, overfill the eggs to assure they are filled to full capacity.",
        "Keep refilling the eggs.",
        "As the wax starts to cool, you'll notice the egg is no longer filled to full capacity.",
        "You'll need to refill the eggs about 3-4 times.",
        "Set the eggs aside.",
        "Place the eggs in the refrigerator for about 2-3 hours to allow the wax to completely cool.",
        "Peeling the Eggs Remove the Play-Doh.",
        "Crack the shells.",
        "This can be done by knocking the eggs on a counter or hitting them all around with a spoon or other utensils.",
        "Peel the eggs.",
        "If the shells are sticking to the wax, use a knife to peel it off.",
        "Trim the wicks to a desired length.",
        "Polish the egg candles, if desired.",
        "Use a hair dryer on low heat to just slightly melt the wax.",
        "Rub your finger over the wax to give it a shine finish.",
        "Shave down the bottom of the egg with a knife, if you want to.",
        "This will flatten down the bottom allowing it to stand on its own."
    ]
}