{
    "title": "How to Drive a Short Distance on a Flat Tire",
    "url": "https://www.wikihow.com/Drive-a-Short-Distance-on-a-Flat-Tire",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars",
        "Car Maintenance and Repair",
        "Tires and Suspension"
    ],
    "parts": [
        {
            "name": "Running on a Flat Tire",
            "steps": [
                {
                    "headline": "Drive slowly.",
                    "description": "Try not to go faster than about 15-20 miles per hour on a flat. Doing so may cause irreparable damage to the metal wheel beneath the tire, and could even cause you to lose control of the vehicle. Press down on the accelerator lightly, or, if possible, idle along until you find a suitable place to pull over. Traveling at high speeds will just damage your wheel faster, as higher speeds will subject the wheel to greater forces, without the tire to protect it from bumps and debris. If you’re headed downhill, let the car coast gently on its own momentum with your foot poised on the brake."
                },
                {
                    "headline": "Keep the vehicle on smooth, flat ground.",
                    "description": "Avoid potholes, steep inclines and broken patches of asphalt. Rough road conditions can bang up your rims, causing them to bend and putting your vehicle out of alignment. You should also beware of wet or sandy terrain that could cause you to slip, sink or become stuck. Paved roads, parking lots or the shoulder of the highway or interstate will be your best bet."
                },
                {
                    "headline": "Go as straight as possible.",
                    "description": "Don’t take any steep curves or try to navigate winding avenues while you look for place to pull over. Instead, coast ahead slow and straight, turning the wheel gently when you have an opportunity to exit the flow of traffic. Take the most direct route to get where you’re going. Resist any drag created by the flat by holding the wheel steady, but don’t struggle against it so hard that it compromises your ability to steer. Turning sharply places more strain on the edges of the rim."
                },
                {
                    "headline": "Pull over to a safe spot.",
                    "description": "The first opportunity you get, make your way off the main road and head for the first place you see where traffic is not too heavy. Make sure the vehicle has come to a complete stop, then engage your parking brake and turn on your emergency flashers to signal to other motorists that you’re experiencing car trouble. Pull over somewhere level in case you need to lift your car up on a jack. Don’t get out of your car until you’re sure that traffic is clear on the driver’s side."
                },
                {
                    "headline": "Don’t go far.",
                    "description": "You should never attempt to drive any further than a couple hundred yards on a flat tire, even if it isn’t completely deflated. This may not be enough distance to get you to an auto garage, but you can at least creep along until you’re away from the hazards of the highway. Remember to go slow and pull over as soon as you’re able. You can change a tire almost anywhere in a pinch, so don’t bother trying to find a designated parking area for your car. Get yourself to safety before worrying about how to fix your vehicle."
                }
            ]
        },
        {
            "name": "Dealing with a Flat",
            "steps": [
                {
                    "headline": "Try to make it to a gas station.",
                    "description": "If there’s a gas station within sight, and you’ve been fortunate enough to avoid a total blowout, you may be able to steer the vehicle in carefully and inflate the tire at an air pump. Gas stations also typically stock the sort of supplies needed for basic auto repairs, like tire patching kits, which means there are few better places to be if you experience a flat. Don’t push yourself too hard to get to a gas station. If your destination is more than half a mile away, you’ll be better off pulling over where you are. In some cases, gas station attendants are trained to be able to help stranded drivers change flat tires."
                },
                {
                    "headline": "Keep a spare in your vehicle.",
                    "description": "Most newer vehicles comes equipped with a spare tire either on the back or in a separate compartment in the trunk. If your car or truck is among them, you’re in luck. Just switch the flat tire out with the spare and you’ll be able to make it to a garage for a full repair. If you’re not sure how to change a tire yourself, consult your vehicle’s owner’s manual for a step-by-step walkthrough. Compact spare tires (also known as “donuts”) are designed to carry you about 50 miles maximum, and can only withstand speeds up to 55mph."
                },
                {
                    "headline": "Call a tow truck.",
                    "description": "If you aren't able to make it to a garage or change the tire yourself, you may have no choice but to get a tow. Once you make the call, a wrecker service will be dispatched to take your vehicle to the nearest auto repair center so that you can get the problem fixed without delay. In some cases, the person that shows up may even be able to patch the damaged tire right then and there. Signing up for a roadside assistance program like AAA can be a big help should you find yourself in a bind. Typically, you can expect to wait 45 minutes to an hour for the tow truck driver to arrive. That’s still probably not much longer than it would take for you to change the tire yourself. Keep your cell phone charged when you’re on the road in case you need to place a call in the event of an emergency."
                },
                {
                    "headline": "Invest in a set of run flat tires.",
                    "description": "Run flat tires are specially engineered to be safe to drive on even after they’re totally deflated. The reinforced flat acts as a cushion against the wheel that eases the stress of coasting to a safe stopping location. Whether you don’t have any experience changing a tire or you’d simply prefer not to, run flat tires can save you quite a bit of inconvenience. Some run flat tires can allow drivers to keep going for up to 100 miles at a reduced speed before wearing out."
                }
            ]
        }
    ],
    "tyn": [
        "Spare tire",
        "Car jack and tire changing tools",
        "Reflector lights",
        "Roadside assistance service membership",
        "Tire pressure gauge",
        "Charged cell phone"
    ],
    "text": " Running on a Flat Tire Drive slowly. Try not to go faster than about 15-20 miles per hour on a flat. Doing so may cause irreparable damage to the metal wheel beneath the tire, and could even cause you to lose control of the vehicle. Press down on the accelerator lightly, or, if possible, idle along until you find a suitable place to pull over. Traveling at high speeds will just damage your wheel faster, as higher speeds will subject the wheel to greater forces, without the tire to protect it from bumps and debris. If you’re headed downhill, let the car coast gently on its own momentum with your foot poised on the brake. Keep the vehicle on smooth, flat ground. Avoid potholes, steep inclines and broken patches of asphalt. Rough road conditions can bang up your rims, causing them to bend and putting your vehicle out of alignment. You should also beware of wet or sandy terrain that could cause you to slip, sink or become stuck. Paved roads, parking lots or the shoulder of the highway or interstate will be your best bet. Go as straight as possible. Don’t take any steep curves or try to navigate winding avenues while you look for place to pull over. Instead, coast ahead slow and straight, turning the wheel gently when you have an opportunity to exit the flow of traffic. Take the most direct route to get where you’re going. Resist any drag created by the flat by holding the wheel steady, but don’t struggle against it so hard that it compromises your ability to steer. Turning sharply places more strain on the edges of the rim. Pull over to a safe spot. The first opportunity you get, make your way off the main road and head for the first place you see where traffic is not too heavy. Make sure the vehicle has come to a complete stop, then engage your parking brake and turn on your emergency flashers to signal to other motorists that you’re experiencing car trouble. Pull over somewhere level in case you need to lift your car up on a jack. Don’t get out of your car until you’re sure that traffic is clear on the driver’s side. Don’t go far. You should never attempt to drive any further than a couple hundred yards on a flat tire, even if it isn’t completely deflated. This may not be enough distance to get you to an auto garage, but you can at least creep along until you’re away from the hazards of the highway. Remember to go slow and pull over as soon as you’re able. You can change a tire almost anywhere in a pinch, so don’t bother trying to find a designated parking area for your car. Get yourself to safety before worrying about how to fix your vehicle. Dealing with a Flat Try to make it to a gas station. If there’s a gas station within sight, and you’ve been fortunate enough to avoid a total blowout, you may be able to steer the vehicle in carefully and inflate the tire at an air pump. Gas stations also typically stock the sort of supplies needed for basic auto repairs, like tire patching kits, which means there are few better places to be if you experience a flat. Don’t push yourself too hard to get to a gas station. If your destination is more than half a mile away, you’ll be better off pulling over where you are. In some cases, gas station attendants are trained to be able to help stranded drivers change flat tires. Keep a spare in your vehicle. Most newer vehicles comes equipped with a spare tire either on the back or in a separate compartment in the trunk. If your car or truck is among them, you’re in luck. Just switch the flat tire out with the spare and you’ll be able to make it to a garage for a full repair. If you’re not sure how to change a tire yourself, consult your vehicle’s owner’s manual for a step-by-step walkthrough. Compact spare tires (also known as “donuts”) are designed to carry you about 50 miles maximum, and can only withstand speeds up to 55mph. Call a tow truck. If you aren't able to make it to a garage or change the tire yourself, you may have no choice but to get a tow. Once you make the call, a wrecker service will be dispatched to take your vehicle to the nearest auto repair center so that you can get the problem fixed without delay. In some cases, the person that shows up may even be able to patch the damaged tire right then and there. Signing up for a roadside assistance program like AAA can be a big help should you find yourself in a bind. Typically, you can expect to wait 45 minutes to an hour for the tow truck driver to arrive. That’s still probably not much longer than it would take for you to change the tire yourself. Keep your cell phone charged when you’re on the road in case you need to place a call in the event of an emergency. Invest in a set of run flat tires. Run flat tires are specially engineered to be safe to drive on even after they’re totally deflated. The reinforced flat acts as a cushion against the wheel that eases the stress of coasting to a safe stopping location. Whether you don’t have any experience changing a tire or you’d simply prefer not to, run flat tires can save you quite a bit of inconvenience. Some run flat tires can allow drivers to keep going for up to 100 miles at a reduced speed before wearing out.",
    "sentences": [
        " Running on a Flat Tire Drive slowly.",
        "Try not to go faster than about 15-20 miles per hour on a flat.",
        "Doing so may cause irreparable damage to the metal wheel beneath the tire, and could even cause you to lose control of the vehicle.",
        "Press down on the accelerator lightly, or, if possible, idle along until you find a suitable place to pull over.",
        "Traveling at high speeds will just damage your wheel faster, as higher speeds will subject the wheel to greater forces, without the tire to protect it from bumps and debris.",
        "If you’re headed downhill, let the car coast gently on its own momentum with your foot poised on the brake.",
        "Keep the vehicle on smooth, flat ground.",
        "Avoid potholes, steep inclines and broken patches of asphalt.",
        "Rough road conditions can bang up your rims, causing them to bend and putting your vehicle out of alignment.",
        "You should also beware of wet or sandy terrain that could cause you to slip, sink or become stuck.",
        "Paved roads, parking lots or the shoulder of the highway or interstate will be your best bet.",
        "Go as straight as possible.",
        "Don’t take any steep curves or try to navigate winding avenues while you look for place to pull over.",
        "Instead, coast ahead slow and straight, turning the wheel gently when you have an opportunity to exit the flow of traffic.",
        "Take the most direct route to get where you’re going.",
        "Resist any drag created by the flat by holding the wheel steady, but don’t struggle against it so hard that it compromises your ability to steer.",
        "Turning sharply places more strain on the edges of the rim.",
        "Pull over to a safe spot.",
        "The first opportunity you get, make your way off the main road and head for the first place you see where traffic is not too heavy.",
        "Make sure the vehicle has come to a complete stop, then engage your parking brake and turn on your emergency flashers to signal to other motorists that you’re experiencing car trouble.",
        "Pull over somewhere level in case you need to lift your car up on a jack.",
        "Don’t get out of your car until you’re sure that traffic is clear on the driver’s side.",
        "Don’t go far.",
        "You should never attempt to drive any further than a couple hundred yards on a flat tire, even if it isn’t completely deflated.",
        "This may not be enough distance to get you to an auto garage, but you can at least creep along until you’re away from the hazards of the highway.",
        "Remember to go slow and pull over as soon as you’re able.",
        "You can change a tire almost anywhere in a pinch, so don’t bother trying to find a designated parking area for your car.",
        "Get yourself to safety before worrying about how to fix your vehicle.",
        "Dealing with a Flat Try to make it to a gas station.",
        "If there’s a gas station within sight, and you’ve been fortunate enough to avoid a total blowout, you may be able to steer the vehicle in carefully and inflate the tire at an air pump.",
        "Gas stations also typically stock the sort of supplies needed for basic auto repairs, like tire patching kits, which means there are few better places to be if you experience a flat.",
        "Don’t push yourself too hard to get to a gas station.",
        "If your destination is more than half a mile away, you’ll be better off pulling over where you are.",
        "In some cases, gas station attendants are trained to be able to help stranded drivers change flat tires.",
        "Keep a spare in your vehicle.",
        "Most newer vehicles comes equipped with a spare tire either on the back or in a separate compartment in the trunk.",
        "If your car or truck is among them, you’re in luck.",
        "Just switch the flat tire out with the spare and you’ll be able to make it to a garage for a full repair.",
        "If you’re not sure how to change a tire yourself, consult your vehicle’s owner’s manual for a step-by-step walkthrough.",
        "Compact spare tires (also known as “donuts”) are designed to carry you about 50 miles maximum, and can only withstand speeds up to 55mph.",
        "Call a tow truck.",
        "If you aren't able to make it to a garage or change the tire yourself, you may have no choice but to get a tow.",
        "Once you make the call, a wrecker service will be dispatched to take your vehicle to the nearest auto repair center so that you can get the problem fixed without delay.",
        "In some cases, the person that shows up may even be able to patch the damaged tire right then and there.",
        "Signing up for a roadside assistance program like AAA can be a big help should you find yourself in a bind.",
        "Typically, you can expect to wait 45 minutes to an hour for the tow truck driver to arrive.",
        "That’s still probably not much longer than it would take for you to change the tire yourself.",
        "Keep your cell phone charged when you’re on the road in case you need to place a call in the event of an emergency.",
        "Invest in a set of run flat tires.",
        "Run flat tires are specially engineered to be safe to drive on even after they’re totally deflated.",
        "The reinforced flat acts as a cushion against the wheel that eases the stress of coasting to a safe stopping location.",
        "Whether you don’t have any experience changing a tire or you’d simply prefer not to, run flat tires can save you quite a bit of inconvenience.",
        "Some run flat tires can allow drivers to keep going for up to 100 miles at a reduced speed before wearing out."
    ]
}