{
    "title": "How to Fry Dandelions",
    "url": "https://www.wikihow.com/Fry-Dandelions",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes"
    ],
    "methods": [
        {
            "name": "Prepping Dandelions",
            "steps": [
                {
                    "headline": "Prevent staining.",
                    "description": "Expect dandelions to cause heavy staining when handled, which may be difficult to wash out. Wear an apron and/or clothes that you don’t mind turning yellow. Avoid placing them directly on your countertops if they stain easily. Have paper towels or another protective covering on hand in case you need them."
                },
                {
                    "headline": "Soak and rinse your blossoms.",
                    "description": "Place them in an appropriately sized bowl. Fill the bowl with lukewarm water, then add 1 tablespoon (14.8 ml) of salt. Let them sit for approximately 10 minutes. Then rinse them off under running water. Let them air-dry or, to speed things up, spin them in a salad spinner. Unrinsed blossoms may contain traces of dirt, chemicals, or even insects."
                },
                {
                    "headline": "Remove the stems and sepals.",
                    "description": "First, place your dandelions on a cutting board. Slice off each stem. Once you do, use your fingers to gently remove the sepals (the dark green leaves on the back of each blossom). If you’ve never prepped dandelions before, keep in mind that:\nAny part that’s colored dark green will retain a bitter flavor, so it’s best to get rid of as much of this as possible. Dandelions can be pretty delicate and fall apart quite easily when removing stems and sepals. You may want to prep more than the recipe calls for until you get the knack for it."
                }
            ]
        },
        {
            "name": "Cooking Them Appalachian-Style",
            "steps": [
                {
                    "headline": "Soak your dandelions in egg.",
                    "description": "In a large mixing bowl, crack your eggs open and beat them together. Add your dandelions. Stir them in so that each one is covered in egg."
                },
                {
                    "headline": "Mix your dry ingredients.",
                    "description": "Break out a second mixing bowl. Add your flour, seasoned salt, and ground pepper. Stir until they are evenly mixed."
                },
                {
                    "headline": "Coat your dandelions in flour.",
                    "description": "Take them out of the egg, a few at a time. As you do, hold them over the bowl so the excess egg can drain back into it. From there, transfer them to your bowl of dry ingredients and toss them around until they’re evenly coated. Then gently toss them from hand to hand over the bowl to shake off any extra flour before placing them on a plate. If desired, pour your egg into an airtight container and refrigerate for future use in the next day or two."
                },
                {
                    "headline": "Fry them up.",
                    "description": "Set a large skillet on your stovetop, turn the burner to medium heat, and add your butter. Once that melts, fill the skillet with your floured dandelions. Cook them for about five minutes, or until they turn golden brown. While they cook, line a clean plate with paper towels. Once they’re done, transfer them to your plate so the paper towels can soak up some of the butter before serving."
                }
            ]
        },
        {
            "name": "Breading Dandelions",
            "steps": [
                {
                    "headline": "Combine your wet ingredients.",
                    "description": "Crack your eggs over a mixing bowl. Add your water. Beat the two together until they are evenly mixed."
                },
                {
                    "headline": "Make your breading.",
                    "description": "Pour your panko into a second bowl. Add your salt and pepper. Then zest your lemons in. Stir to combine."
                },
                {
                    "headline": "Bread your dandelions.",
                    "description": "First, dip your blossoms in your egg mixture. Let some of the extra egg drip back into the bowl before moving on to the dry ingredients. Toss them around in the panko mixture to coat them evenly. Stir the panko up again every now and then, since the dry ingredients may separate. Set your breaded blossoms aside for now on a plate."
                },
                {
                    "headline": "Heat your skillet.",
                    "description": "Coat the bottom with olive oil. Keep adding oil until it’s roughly an eighth of an inch thick (0.3 cm). Set the burner to medium heat. To test when it’s ready, toss in a couple pieces of panko, which should begin sizzling right away."
                },
                {
                    "headline": "Cook your blossoms.",
                    "description": "Add your dandelions to the hot oil. Wait about 2 minutes for them to turn golden brown on one side. Flip them over and cook the other side for another minute or so until they do the same."
                },
                {
                    "headline": "Drizzle with lemon juice, then serve.",
                    "description": "Line a clean plate with paper towels. Transfer your dandelions to the plate so the towels can soak up some of the extra oil. Use your leftover lemons to drizzle a little juice over them, then serve."
                }
            ]
        }
    ],
    "tyn": [
        "Apron",
        "Paper towels or similar material",
        "Bowl",
        "Water",
        "Cutting board",
        "Knife",
        "Salad spinner (optional)",
        "Measuring cups and spoons",
        "2 mixing bowls",
        "Egg beater",
        "Spoon for stirring",
        "Spatula",
        "Oven",
        "Large skillet",
        "2 plates",
        "Paper towels"
    ],
    "text": " Prepping Dandelions Prevent staining. Expect dandelions to cause heavy staining when handled, which may be difficult to wash out. Wear an apron and/or clothes that you don’t mind turning yellow. Avoid placing them directly on your countertops if they stain easily. Have paper towels or another protective covering on hand in case you need them. Soak and rinse your blossoms. Place them in an appropriately sized bowl. Fill the bowl with lukewarm water, then add 1 tablespoon (14.8 ml) of salt. Let them sit for approximately 10 minutes. Then rinse them off under running water. Let them air-dry or, to speed things up, spin them in a salad spinner. Unrinsed blossoms may contain traces of dirt, chemicals, or even insects. Remove the stems and sepals. First, place your dandelions on a cutting board. Slice off each stem. Once you do, use your fingers to gently remove the sepals (the dark green leaves on the back of each blossom). If you’ve never prepped dandelions before, keep in mind that:\nAny part that’s colored dark green will retain a bitter flavor, so it’s best to get rid of as much of this as possible. Dandelions can be pretty delicate and fall apart quite easily when removing stems and sepals. You may want to prep more than the recipe calls for until you get the knack for it. Cooking Them Appalachian-Style Soak your dandelions in egg. In a large mixing bowl, crack your eggs open and beat them together. Add your dandelions. Stir them in so that each one is covered in egg. Mix your dry ingredients. Break out a second mixing bowl. Add your flour, seasoned salt, and ground pepper. Stir until they are evenly mixed. Coat your dandelions in flour. Take them out of the egg, a few at a time. As you do, hold them over the bowl so the excess egg can drain back into it. From there, transfer them to your bowl of dry ingredients and toss them around until they’re evenly coated. Then gently toss them from hand to hand over the bowl to shake off any extra flour before placing them on a plate. If desired, pour your egg into an airtight container and refrigerate for future use in the next day or two. Fry them up. Set a large skillet on your stovetop, turn the burner to medium heat, and add your butter. Once that melts, fill the skillet with your floured dandelions. Cook them for about five minutes, or until they turn golden brown. While they cook, line a clean plate with paper towels. Once they’re done, transfer them to your plate so the paper towels can soak up some of the butter before serving. Breading Dandelions Combine your wet ingredients. Crack your eggs over a mixing bowl. Add your water. Beat the two together until they are evenly mixed. Make your breading. Pour your panko into a second bowl. Add your salt and pepper. Then zest your lemons in. Stir to combine. Bread your dandelions. First, dip your blossoms in your egg mixture. Let some of the extra egg drip back into the bowl before moving on to the dry ingredients. Toss them around in the panko mixture to coat them evenly. Stir the panko up again every now and then, since the dry ingredients may separate. Set your breaded blossoms aside for now on a plate. Heat your skillet. Coat the bottom with olive oil. Keep adding oil until it’s roughly an eighth of an inch thick (0.3 cm). Set the burner to medium heat. To test when it’s ready, toss in a couple pieces of panko, which should begin sizzling right away. Cook your blossoms. Add your dandelions to the hot oil. Wait about 2 minutes for them to turn golden brown on one side. Flip them over and cook the other side for another minute or so until they do the same. Drizzle with lemon juice, then serve. Line a clean plate with paper towels. Transfer your dandelions to the plate so the towels can soak up some of the extra oil. Use your leftover lemons to drizzle a little juice over them, then serve.",
    "sentences": [
        " Prepping Dandelions Prevent staining.",
        "Expect dandelions to cause heavy staining when handled, which may be difficult to wash out.",
        "Wear an apron and/or clothes that you don’t mind turning yellow.",
        "Avoid placing them directly on your countertops if they stain easily.",
        "Have paper towels or another protective covering on hand in case you need them.",
        "Soak and rinse your blossoms.",
        "Place them in an appropriately sized bowl.",
        "Fill the bowl with lukewarm water, then add 1 tablespoon (14.8 ml) of salt.",
        "Let them sit for approximately 10 minutes.",
        "Then rinse them off under running water.",
        "Let them air-dry or, to speed things up, spin them in a salad spinner.",
        "Unrinsed blossoms may contain traces of dirt, chemicals, or even insects.",
        "Remove the stems and sepals.",
        "First, place your dandelions on a cutting board.",
        "Slice off each stem.",
        "Once you do, use your fingers to gently remove the sepals (the dark green leaves on the back of each blossom).",
        "If you’ve never prepped dandelions before, keep in mind that:\nAny part that’s colored dark green will retain a bitter flavor, so it’s best to get rid of as much of this as possible.",
        "Dandelions can be pretty delicate and fall apart quite easily when removing stems and sepals.",
        "You may want to prep more than the recipe calls for until you get the knack for it.",
        "Cooking Them Appalachian-Style Soak your dandelions in egg.",
        "In a large mixing bowl, crack your eggs open and beat them together.",
        "Add your dandelions.",
        "Stir them in so that each one is covered in egg.",
        "Mix your dry ingredients.",
        "Break out a second mixing bowl.",
        "Add your flour, seasoned salt, and ground pepper.",
        "Stir until they are evenly mixed.",
        "Coat your dandelions in flour.",
        "Take them out of the egg, a few at a time.",
        "As you do, hold them over the bowl so the excess egg can drain back into it.",
        "From there, transfer them to your bowl of dry ingredients and toss them around until they’re evenly coated.",
        "Then gently toss them from hand to hand over the bowl to shake off any extra flour before placing them on a plate.",
        "If desired, pour your egg into an airtight container and refrigerate for future use in the next day or two.",
        "Fry them up.",
        "Set a large skillet on your stovetop, turn the burner to medium heat, and add your butter.",
        "Once that melts, fill the skillet with your floured dandelions.",
        "Cook them for about five minutes, or until they turn golden brown.",
        "While they cook, line a clean plate with paper towels.",
        "Once they’re done, transfer them to your plate so the paper towels can soak up some of the butter before serving.",
        "Breading Dandelions Combine your wet ingredients.",
        "Crack your eggs over a mixing bowl.",
        "Add your water.",
        "Beat the two together until they are evenly mixed.",
        "Make your breading.",
        "Pour your panko into a second bowl.",
        "Add your salt and pepper.",
        "Then zest your lemons in.",
        "Stir to combine.",
        "Bread your dandelions.",
        "First, dip your blossoms in your egg mixture.",
        "Let some of the extra egg drip back into the bowl before moving on to the dry ingredients.",
        "Toss them around in the panko mixture to coat them evenly.",
        "Stir the panko up again every now and then, since the dry ingredients may separate.",
        "Set your breaded blossoms aside for now on a plate.",
        "Heat your skillet.",
        "Coat the bottom with olive oil.",
        "Keep adding oil until it’s roughly an eighth of an inch thick (0.3 cm).",
        "Set the burner to medium heat.",
        "To test when it’s ready, toss in a couple pieces of panko, which should begin sizzling right away.",
        "Cook your blossoms.",
        "Add your dandelions to the hot oil.",
        "Wait about 2 minutes for them to turn golden brown on one side.",
        "Flip them over and cook the other side for another minute or so until they do the same.",
        "Drizzle with lemon juice, then serve.",
        "Line a clean plate with paper towels.",
        "Transfer your dandelions to the plate so the towels can soak up some of the extra oil.",
        "Use your leftover lemons to drizzle a little juice over them, then serve."
    ]
}