{
    "title": "How to Make Gougeres (French Cheese Puffs)",
    "url": "https://www.wikihow.com/Make-Gougeres-(French-Cheese-Puffs)",
    "category_hierarchy": [
        "Food and Entertaining",
        "Parties",
        "Party Snacks",
        "Cheese Party Snacks"
    ],
    "parts": [
        {
            "name": "Prepping for the Cheese Gougères",
            "steps": [
                {
                    "headline": "Preheat the oven.",
                    "description": "Wait to preheat the oven until you are ready to begin preparing the ingredients. Turn the oven to 425°F (225°C). The oven should be ready by the time you have prepared the ingredients and shaped the dough."
                },
                {
                    "headline": "Line the baking sheets with parchment paper.",
                    "description": "Depending on the amount of and size of gougères you're making, you may need more than one baking sheet. Consider how much room you have in the oven, how many pans you have, and how many people you will be serving. Line the baking tray with parchment paper or a silicone baking mat."
                },
                {
                    "headline": "Heat up the water, butter, salt, and pepper.",
                    "description": "Put the 1/2 cup (118.3 ml) of water, 1 stick (14.8 ml) of unsalted butter, 1/2 teaspoon (4.9 ml) of salt, and 1/2 cup (118.3 ml) of whole milk into a two or four quart saucepan. Stir the ingredients together and bring them to a rolling boil. You can also choose to add a ½ teaspoon (2.47 ml) of dry mustard powder to the mix."
                }
            ]
        },
        {
            "name": "Making the Gougères",
            "steps": [
                {
                    "headline": "Add flour to the mixture.",
                    "description": "Remove the saucepan immediately and add one cup (236.6) of flour once the ingredients have been brought to a boil and melted,. Stir the mixture together until the mixture looks something like mash potatoes."
                },
                {
                    "headline": "Cook the dough.",
                    "description": "Once the mixture has been stirred and formed, return the pan to the stove on medium-low heat. You are doing this to dry out the dough. Cook the dough until it begins to look shiny and can hold a spoon upright on its own. It's okay if you notice some starch buildup at the bottom of the pan."
                },
                {
                    "headline": "Add eggs to the mixture.",
                    "description": "Break the five, large eggs into the pan. Stir in between each egg added. Mix the eggs into the dough by hand with a stiff spatula, with a hand mixer, or with a stand mixer with a paddle attachment. The dough should turn into a smooth, creamy batter. Though the dough is smooth and creamy, it should still be thick enough to stand."
                },
                {
                    "headline": "Add the cheese.",
                    "description": "Put cheese into the mixture after the eggs have been added. A sharp cheese is ideal, like gruyére or cheddar, but you can also use a cheese like comté. The cheese should already be grated at this point. Pour it into the mixture and combine."
                },
                {
                    "headline": "Use an ice cream scope to scoop the dough.",
                    "description": "You can use an ice scream scoop, two spoons, or piping bag with a round trip to form the balls of dough. Tablespoon-sized drops of dough are typical, but you can make the balls as big or as small as you want. Space the dough about an inch apart on the pan and press down any bumps to form smooth, round balls."
                },
                {
                    "headline": "Bake for fifteen minutes.",
                    "description": "Put the pan into the oven and bake for five minutes. After five minutes, lower the heat to 375°F (190°C) and bake for 20 to 25 more minutes. The finished puffs should be golden brown. You can rotate the pans when you lower the heat if you wish."
                },
                {
                    "headline": "Allow the puffs to cool.",
                    "description": "Don't take the gougères out of the oven immediately. Turn the heat off when they are done baking and allow them to sit in the oven for about fifteen minutes so that the insides can dry out. After that, you can remove the pan(s) and allow them to cool for a few more minutes."
                }
            ]
        },
        {
            "name": "Serving and Storing the Finished Gougères",
            "steps": [
                {
                    "headline": "Serve while still warm.",
                    "description": "Gougères arguably taste best when they are still hot and steaming on the inside. They still taste good, however, at room temperature. How they are served is a matter of preference."
                },
                {
                    "headline": "Store in airtight bags.",
                    "description": "If the puffs won't be eaten immediately, store them in airtight bags. Put the airtight bags in the freezer. The frozen puffs can stored for up to two months."
                },
                {
                    "headline": "Reheat for later.",
                    "description": "The gougères still taste good reheated even after being frozen. You should probably allow at least fifteen minutes for the puffs to defrost before putting them in the oven. To reheat, put the puffs in the oven for three to five minutes at 350°F (176.7°C)."
                }
            ]
        }
    ],
    "tyn": [
        "2 (1.9 L) to 4 (3.8 L) quart saucepan",
        "Spoon with a long handle",
        "Baking sheets",
        "Standing mixer (optional)"
    ],
    "text": " Prepping for the Cheese Gougères Preheat the oven. Wait to preheat the oven until you are ready to begin preparing the ingredients. Turn the oven to 425°F (225°C). The oven should be ready by the time you have prepared the ingredients and shaped the dough. Line the baking sheets with parchment paper. Depending on the amount of and size of gougères you're making, you may need more than one baking sheet. Consider how much room you have in the oven, how many pans you have, and how many people you will be serving. Line the baking tray with parchment paper or a silicone baking mat. Heat up the water, butter, salt, and pepper. Put the 1/2 cup (118.3 ml) of water, 1 stick (14.8 ml) of unsalted butter, 1/2 teaspoon (4.9 ml) of salt, and 1/2 cup (118.3 ml) of whole milk into a two or four quart saucepan. Stir the ingredients together and bring them to a rolling boil. You can also choose to add a ½ teaspoon (2.47 ml) of dry mustard powder to the mix. Making the Gougères Add flour to the mixture. Remove the saucepan immediately and add one cup (236.6) of flour once the ingredients have been brought to a boil and melted,. Stir the mixture together until the mixture looks something like mash potatoes. Cook the dough. Once the mixture has been stirred and formed, return the pan to the stove on medium-low heat. You are doing this to dry out the dough. Cook the dough until it begins to look shiny and can hold a spoon upright on its own. It's okay if you notice some starch buildup at the bottom of the pan. Add eggs to the mixture. Break the five, large eggs into the pan. Stir in between each egg added. Mix the eggs into the dough by hand with a stiff spatula, with a hand mixer, or with a stand mixer with a paddle attachment. The dough should turn into a smooth, creamy batter. Though the dough is smooth and creamy, it should still be thick enough to stand. Add the cheese. Put cheese into the mixture after the eggs have been added. A sharp cheese is ideal, like gruyére or cheddar, but you can also use a cheese like comté. The cheese should already be grated at this point. Pour it into the mixture and combine. Use an ice cream scope to scoop the dough. You can use an ice scream scoop, two spoons, or piping bag with a round trip to form the balls of dough. Tablespoon-sized drops of dough are typical, but you can make the balls as big or as small as you want. Space the dough about an inch apart on the pan and press down any bumps to form smooth, round balls. Bake for fifteen minutes. Put the pan into the oven and bake for five minutes. After five minutes, lower the heat to 375°F (190°C) and bake for 20 to 25 more minutes. The finished puffs should be golden brown. You can rotate the pans when you lower the heat if you wish. Allow the puffs to cool. Don't take the gougères out of the oven immediately. Turn the heat off when they are done baking and allow them to sit in the oven for about fifteen minutes so that the insides can dry out. After that, you can remove the pan(s) and allow them to cool for a few more minutes. Serving and Storing the Finished Gougères Serve while still warm. Gougères arguably taste best when they are still hot and steaming on the inside. They still taste good, however, at room temperature. How they are served is a matter of preference. Store in airtight bags. If the puffs won't be eaten immediately, store them in airtight bags. Put the airtight bags in the freezer. The frozen puffs can stored for up to two months. Reheat for later. The gougères still taste good reheated even after being frozen. You should probably allow at least fifteen minutes for the puffs to defrost before putting them in the oven. To reheat, put the puffs in the oven for three to five minutes at 350°F (176.7°C).",
    "sentences": [
        " Prepping for the Cheese Gougères Preheat the oven.",
        "Wait to preheat the oven until you are ready to begin preparing the ingredients.",
        "Turn the oven to 425°F (225°C).",
        "The oven should be ready by the time you have prepared the ingredients and shaped the dough.",
        "Line the baking sheets with parchment paper.",
        "Depending on the amount of and size of gougères you're making, you may need more than one baking sheet.",
        "Consider how much room you have in the oven, how many pans you have, and how many people you will be serving.",
        "Line the baking tray with parchment paper or a silicone baking mat.",
        "Heat up the water, butter, salt, and pepper.",
        "Put the 1/2 cup (118.3 ml) of water, 1 stick (14.8 ml) of unsalted butter, 1/2 teaspoon (4.9 ml) of salt, and 1/2 cup (118.3 ml) of whole milk into a two or four quart saucepan.",
        "Stir the ingredients together and bring them to a rolling boil.",
        "You can also choose to add a ½ teaspoon (2.47 ml) of dry mustard powder to the mix.",
        "Making the Gougères Add flour to the mixture.",
        "Remove the saucepan immediately and add one cup (236.6) of flour once the ingredients have been brought to a boil and melted,.",
        "Stir the mixture together until the mixture looks something like mash potatoes.",
        "Cook the dough.",
        "Once the mixture has been stirred and formed, return the pan to the stove on medium-low heat.",
        "You are doing this to dry out the dough.",
        "Cook the dough until it begins to look shiny and can hold a spoon upright on its own.",
        "It's okay if you notice some starch buildup at the bottom of the pan.",
        "Add eggs to the mixture.",
        "Break the five, large eggs into the pan.",
        "Stir in between each egg added.",
        "Mix the eggs into the dough by hand with a stiff spatula, with a hand mixer, or with a stand mixer with a paddle attachment.",
        "The dough should turn into a smooth, creamy batter.",
        "Though the dough is smooth and creamy, it should still be thick enough to stand.",
        "Add the cheese.",
        "Put cheese into the mixture after the eggs have been added.",
        "A sharp cheese is ideal, like gruyére or cheddar, but you can also use a cheese like comté.",
        "The cheese should already be grated at this point.",
        "Pour it into the mixture and combine.",
        "Use an ice cream scope to scoop the dough.",
        "You can use an ice scream scoop, two spoons, or piping bag with a round trip to form the balls of dough.",
        "Tablespoon-sized drops of dough are typical, but you can make the balls as big or as small as you want.",
        "Space the dough about an inch apart on the pan and press down any bumps to form smooth, round balls.",
        "Bake for fifteen minutes.",
        "Put the pan into the oven and bake for five minutes.",
        "After five minutes, lower the heat to 375°F (190°C) and bake for 20 to 25 more minutes.",
        "The finished puffs should be golden brown.",
        "You can rotate the pans when you lower the heat if you wish.",
        "Allow the puffs to cool.",
        "Don't take the gougères out of the oven immediately.",
        "Turn the heat off when they are done baking and allow them to sit in the oven for about fifteen minutes so that the insides can dry out.",
        "After that, you can remove the pan(s) and allow them to cool for a few more minutes.",
        "Serving and Storing the Finished Gougères Serve while still warm.",
        "Gougères arguably taste best when they are still hot and steaming on the inside.",
        "They still taste good, however, at room temperature.",
        "How they are served is a matter of preference.",
        "Store in airtight bags.",
        "If the puffs won't be eaten immediately, store them in airtight bags.",
        "Put the airtight bags in the freezer.",
        "The frozen puffs can stored for up to two months.",
        "Reheat for later.",
        "The gougères still taste good reheated even after being frozen.",
        "You should probably allow at least fifteen minutes for the puffs to defrost before putting them in the oven.",
        "To reheat, put the puffs in the oven for three to five minutes at 350°F (176.7°C)."
    ]
}