{
    "title": "How to Clean Combat Boots",
    "url": "https://www.wikihow.com/Clean-Combat-Boots",
    "category_hierarchy": [
        "Personal Care and Style",
        "Footwear",
        "Boots"
    ],
    "methods": [
        {
            "name": "Cleaning Your Boots Daily",
            "steps": [
                {
                    "headline": "Buy a boot cleaning doormat.",
                    "description": "Be sure to remove excess dirt and debris from the bottom of your combat boots by purchasing a doormat designed for cleaning the underside of boots and shoes. Different models of this kind of mat are available with bristles, rubber spikes, or grooves. Look for one at local hardware stores, department stores, or online. For instance, the JobSite Boot Scrubber Brush Mat, available online for approximately $17, is a door mat with a wood and plastic base and solid bristles to remove mud and dirt from boots and shoes."
                },
                {
                    "headline": "Wipe down your boots with a dry cloth.",
                    "description": "After removing your boots for the day, wipe them down with a soft, dry cloth to remove dust and dirt. A micro-fibre cleaning cloth is the best bet for this daily maintenance. Focus on the surface of the boots as well as the seams."
                },
                {
                    "headline": "Remove stubborn dirt with a toothbrush.",
                    "description": "If stubborn dirt remains after you wipe down your boots, use a toothbrush to continue cleaning. Place boots on top of paper towels, or on an easy to clean surface. Use small, circular motions to loosen caked on grime."
                }
            ]
        },
        {
            "name": "Removing Stains",
            "steps": [
                {
                    "headline": "Use a stiff brush.",
                    "description": "Use a stiff nylon bristle brush or a barbecue brush to target minor stains. Brush boots outdoors or over a covered surface to capture any dirt that might fall off of your boots. Rub the brush over the stains vigorously to remove them."
                },
                {
                    "headline": "Wipe spots with a sponge.",
                    "description": "Soak a small sponge in water and wring it out until it is moist but not overly wet. In small, circular motions, scrub the remaining stains. To preserve the leather as much as possible, avoid adding any cleaners or other ingredients."
                },
                {
                    "headline": "Use dishwashing liquid.",
                    "description": "For stains that remain after cleaning with water, use dishwashing liquid. Dish soap will bind to stains and remove them more effectively than water alone. Pour the liquid directly onto the stain and rub thoroughly with a cloth or toothbrush. For best results, leave soap on the boots for several minutes, then blot it away with a damp cloth."
                },
                {
                    "headline": "Treat oil stains with baby powder.",
                    "description": "Use baby powder to treat hard-to-remove oil stains. Apply the powder to the stain generously. Let it sit for 30 minutes to absorb the stain, then brush off your boots. Corn starch and baking soda can also be used to absorb oil stains."
                },
                {
                    "headline": "Remove salt stains with vinegar.",
                    "description": "In a small bowl, mix 1/2 cup (4 oz.) of water with ½ cup (4 oz.) white vinegar. Dip a cloth into the mixture and wipe it over your boots. Let them air dry."
                }
            ]
        },
        {
            "name": "Cleaning the Inside",
            "steps": [
                {
                    "headline": "Hand wash the interior of your boots.",
                    "description": "Machine washing combat boots is not an option, so hand wash them a cloth. Place boots in a dry sink, on top of paper towels or an old towel. Add detergent to a wet cloth and gently scrub the inside of your boots."
                },
                {
                    "headline": "Blot the inside of your boots.",
                    "description": "Using another cloth moistened with water, wipe down the inside of your boots. Blot the entire interior of each boot to remove as much soap and water as possible."
                },
                {
                    "headline": "Dry your boots.",
                    "description": "Allow boots to air dry naturally. If possible, clean them at night allow them to dry completely overnight. Avoid drying boots near a heat source (e.g. heating vent) as the materials can warp."
                },
                {
                    "headline": "Keep your boots dry.",
                    "description": "Moisture inside your combat boots can leave a persistent bad odor. Keep your boots in a cool, dry area when you are not wearing them. If they are damp, stuff them with newspaper to absorb the moisture."
                }
            ]
        }
    ],
    "tyn": [
        "A boot cleaning doormat",
        "A soft, dry cloth",
        "A toothbrush",
        "Paper towels",
        "A nylon bristle brush",
        "A small sponge",
        "Dishwashing liquid",
        "Baby powder (or cornstarch or baking soda)",
        "Detergent",
        "Newspaper"
    ],
    "text": " Cleaning Your Boots Daily Buy a boot cleaning doormat. Be sure to remove excess dirt and debris from the bottom of your combat boots by purchasing a doormat designed for cleaning the underside of boots and shoes. Different models of this kind of mat are available with bristles, rubber spikes, or grooves. Look for one at local hardware stores, department stores, or online. For instance, the JobSite Boot Scrubber Brush Mat, available online for approximately $17, is a door mat with a wood and plastic base and solid bristles to remove mud and dirt from boots and shoes. Wipe down your boots with a dry cloth. After removing your boots for the day, wipe them down with a soft, dry cloth to remove dust and dirt. A micro-fibre cleaning cloth is the best bet for this daily maintenance. Focus on the surface of the boots as well as the seams. Remove stubborn dirt with a toothbrush. If stubborn dirt remains after you wipe down your boots, use a toothbrush to continue cleaning. Place boots on top of paper towels, or on an easy to clean surface. Use small, circular motions to loosen caked on grime. Removing Stains Use a stiff brush. Use a stiff nylon bristle brush or a barbecue brush to target minor stains. Brush boots outdoors or over a covered surface to capture any dirt that might fall off of your boots. Rub the brush over the stains vigorously to remove them. Wipe spots with a sponge. Soak a small sponge in water and wring it out until it is moist but not overly wet. In small, circular motions, scrub the remaining stains. To preserve the leather as much as possible, avoid adding any cleaners or other ingredients. Use dishwashing liquid. For stains that remain after cleaning with water, use dishwashing liquid. Dish soap will bind to stains and remove them more effectively than water alone. Pour the liquid directly onto the stain and rub thoroughly with a cloth or toothbrush. For best results, leave soap on the boots for several minutes, then blot it away with a damp cloth. Treat oil stains with baby powder. Use baby powder to treat hard-to-remove oil stains. Apply the powder to the stain generously. Let it sit for 30 minutes to absorb the stain, then brush off your boots. Corn starch and baking soda can also be used to absorb oil stains. Remove salt stains with vinegar. In a small bowl, mix 1/2 cup (4 oz.) of water with ½ cup (4 oz.) white vinegar. Dip a cloth into the mixture and wipe it over your boots. Let them air dry. Cleaning the Inside Hand wash the interior of your boots. Machine washing combat boots is not an option, so hand wash them a cloth. Place boots in a dry sink, on top of paper towels or an old towel. Add detergent to a wet cloth and gently scrub the inside of your boots. Blot the inside of your boots. Using another cloth moistened with water, wipe down the inside of your boots. Blot the entire interior of each boot to remove as much soap and water as possible. Dry your boots. Allow boots to air dry naturally. If possible, clean them at night allow them to dry completely overnight. Avoid drying boots near a heat source (e.g. heating vent) as the materials can warp. Keep your boots dry. Moisture inside your combat boots can leave a persistent bad odor. Keep your boots in a cool, dry area when you are not wearing them. If they are damp, stuff them with newspaper to absorb the moisture.",
    "sentences": [
        " Cleaning Your Boots Daily Buy a boot cleaning doormat.",
        "Be sure to remove excess dirt and debris from the bottom of your combat boots by purchasing a doormat designed for cleaning the underside of boots and shoes.",
        "Different models of this kind of mat are available with bristles, rubber spikes, or grooves.",
        "Look for one at local hardware stores, department stores, or online.",
        "For instance, the JobSite Boot Scrubber Brush Mat, available online for approximately $17, is a door mat with a wood and plastic base and solid bristles to remove mud and dirt from boots and shoes.",
        "Wipe down your boots with a dry cloth.",
        "After removing your boots for the day, wipe them down with a soft, dry cloth to remove dust and dirt.",
        "A micro-fibre cleaning cloth is the best bet for this daily maintenance.",
        "Focus on the surface of the boots as well as the seams.",
        "Remove stubborn dirt with a toothbrush.",
        "If stubborn dirt remains after you wipe down your boots, use a toothbrush to continue cleaning.",
        "Place boots on top of paper towels, or on an easy to clean surface.",
        "Use small, circular motions to loosen caked on grime.",
        "Removing Stains Use a stiff brush.",
        "Use a stiff nylon bristle brush or a barbecue brush to target minor stains.",
        "Brush boots outdoors or over a covered surface to capture any dirt that might fall off of your boots.",
        "Rub the brush over the stains vigorously to remove them.",
        "Wipe spots with a sponge.",
        "Soak a small sponge in water and wring it out until it is moist but not overly wet.",
        "In small, circular motions, scrub the remaining stains.",
        "To preserve the leather as much as possible, avoid adding any cleaners or other ingredients.",
        "Use dishwashing liquid.",
        "For stains that remain after cleaning with water, use dishwashing liquid.",
        "Dish soap will bind to stains and remove them more effectively than water alone.",
        "Pour the liquid directly onto the stain and rub thoroughly with a cloth or toothbrush.",
        "For best results, leave soap on the boots for several minutes, then blot it away with a damp cloth.",
        "Treat oil stains with baby powder.",
        "Use baby powder to treat hard-to-remove oil stains.",
        "Apply the powder to the stain generously.",
        "Let it sit for 30 minutes to absorb the stain, then brush off your boots.",
        "Corn starch and baking soda can also be used to absorb oil stains.",
        "Remove salt stains with vinegar.",
        "In a small bowl, mix 1/2 cup (4 oz.)",
        "of water with ½ cup (4 oz.)",
        "white vinegar.",
        "Dip a cloth into the mixture and wipe it over your boots.",
        "Let them air dry.",
        "Cleaning the Inside Hand wash the interior of your boots.",
        "Machine washing combat boots is not an option, so hand wash them a cloth.",
        "Place boots in a dry sink, on top of paper towels or an old towel.",
        "Add detergent to a wet cloth and gently scrub the inside of your boots.",
        "Blot the inside of your boots.",
        "Using another cloth moistened with water, wipe down the inside of your boots.",
        "Blot the entire interior of each boot to remove as much soap and water as possible.",
        "Dry your boots.",
        "Allow boots to air dry naturally.",
        "If possible, clean them at night allow them to dry completely overnight.",
        "Avoid drying boots near a heat source (e.g.",
        "heating vent) as the materials can warp.",
        "Keep your boots dry.",
        "Moisture inside your combat boots can leave a persistent bad odor.",
        "Keep your boots in a cool, dry area when you are not wearing them.",
        "If they are damp, stuff them with newspaper to absorb the moisture."
    ]
}