{
    "title": "How to Draw a Turkey",
    "url": "https://www.wikihow.com/Draw-a-Turkey",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "methods": [
        {
            "name": "Cartoon Turkey (Beginners)",
            "steps": [
                {
                    "headline": "Draw a squash shape.",
                    "description": ""
                },
                {
                    "headline": "Draw a triangle in the center of the top of your squash.",
                    "description": ""
                },
                {
                    "headline": "Draw two circles slightly above the triangle.",
                    "description": ""
                },
                {
                    "headline": "Draw two, darker circles inside of the circles already drawn.",
                    "description": ""
                },
                {
                    "headline": "Draw a squiggle-line extending from the triangle.",
                    "description": ""
                },
                {
                    "headline": "Draw elongated ovals extended from the squash, until it resembles a fan.",
                    "description": ""
                },
                {
                    "headline": "Draw two, even lines extending from the bottom of the turkey.",
                    "description": ""
                },
                {
                    "headline": "Draw two diagonal lines, extending from close to the bottom of the lines.",
                    "description": ""
                },
                {
                    "headline": "Shade your turkey in the desired colors.",
                    "description": ""
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Cartoon Turkey (Intermediate)",
            "steps": [
                {
                    "headline": "Draw a circle.",
                    "description": ""
                },
                {
                    "headline": "Sketch a small circle on the right side of the big circle.",
                    "description": "Connect the small circle with the big one using two curved lines so that it will look like a head, neck and body. Add two curved lines that make a pointed angle on the head for the beak."
                },
                {
                    "headline": "Sketch two lines with an angle attached to the body.",
                    "description": "Draw a triangle on the ends of each line for the turkey’s legs."
                },
                {
                    "headline": "Draw a fan-like structure on the rear part of the turkey.",
                    "description": ""
                },
                {
                    "headline": "Draw the eyes using small circles.",
                    "description": "Add a curved line line for the eyebrows. Draw the mouth and a dot for the nostril."
                },
                {
                    "headline": "Draw the neck and the caruncles using curved lines cascading from the beak to the neck.",
                    "description": ""
                },
                {
                    "headline": "Draw the wings using a big fluffy shape with three curved lines for the feathers.",
                    "description": ""
                },
                {
                    "headline": "Using the outline, sketch out the turkey’s body and add the legs.",
                    "description": "Sketch a series of curved lines forming a collar just below the neck for feather design."
                },
                {
                    "headline": "Draw the feet.",
                    "description": "A turkey’s feet has three claws in front and a small one at the back."
                },
                {
                    "headline": "Sketch two layers containing a series of curved lines for the turkey’s fan-like tail.",
                    "description": "Make the second layer bigger and more elaborate than the first one."
                },
                {
                    "headline": "Erase unnecessary lines.",
                    "description": ""
                },
                {
                    "headline": "Color the drawing.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Drawing Realistic Turkey",
            "steps": [
                {
                    "headline": "Draw a big circle for the body and an oblong overlapping the big circle on the right side.",
                    "description": ""
                },
                {
                    "headline": "Add a small circle for the head and connect this to the oblong using two curved lines that serves as the neck.",
                    "description": "Add two small curved lines that form a pointed angle to the right side of the head for the beak."
                },
                {
                    "headline": "Draw lines for a rough outline of the legs and add a triangle on each end for the feet.",
                    "description": ""
                },
                {
                    "headline": "Draw a curved line on the left side of the turkey and a fan-like structure for the tail attached to the curved line.",
                    "description": ""
                },
                {
                    "headline": "Draw the eyes and define the beak.",
                    "description": "Draw the snood and the caruncles of the neck using curved strokes."
                },
                {
                    "headline": "Sketch out the body, taking note of the feather patterns.",
                    "description": "Note that the back portion of the turkey is a little bumpy so you can sketch out a few outlines of the feathers too."
                },
                {
                    "headline": "Darken the fan-like shape of the turkey’s tail.",
                    "description": ""
                },
                {
                    "headline": "Sketch and define the legs and toes.",
                    "description": ""
                },
                {
                    "headline": "Draw random small strokes all over the turkey’s body for a feathery appearance.",
                    "description": ""
                },
                {
                    "headline": "Erase unnecessary lines and refine the feathers using small curved strokes.",
                    "description": ""
                },
                {
                    "headline": "Color the drawing.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Making a Chef Turkey",
            "steps": [
                {
                    "headline": "Draw an oblong with an overlapping big circle below it.",
                    "description": "This will form the sketch for the turkey’s body and head."
                },
                {
                    "headline": "Draw the details of the turkey’s head using circles and curve lines for the beak.",
                    "description": ""
                },
                {
                    "headline": "Draw details for the wattle and the head.",
                    "description": ""
                },
                {
                    "headline": "Draw the turkey’s hat or toque to look like a cartoon.",
                    "description": ""
                },
                {
                    "headline": "Draw details for the left wing using curve lines and also for the feet.",
                    "description": ""
                },
                {
                    "headline": "Draw the right wing which holds a ladle.",
                    "description": "Draw also details for the cooking pot."
                },
                {
                    "headline": "Draw the turkey’s fan-shaped tail and details for the feathers.",
                    "description": ""
                },
                {
                    "headline": "Trace with a black pen.",
                    "description": ""
                },
                {
                    "headline": "Color to your liking, then design the background.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Making a Roasted Turkey",
            "steps": [
                {
                    "headline": "Draw a horizontally elongated oblong.",
                    "description": ""
                },
                {
                    "headline": "Draw a more flattened and elongated oblong below the first with an inner overlapping oblong.",
                    "description": "This will be the plate."
                },
                {
                    "headline": "Draw the details for the cut head, wings, and butt.",
                    "description": ""
                },
                {
                    "headline": "Draw an oblong near the butt with small circles or oblongs below it.",
                    "description": ""
                },
                {
                    "headline": "Draw the details for the turkey’s leg with a sketch for the leg bone.",
                    "description": "Draw details for leaves."
                },
                {
                    "headline": "Trace with a pen and erase unnecessary lines.",
                    "description": "Add details."
                },
                {
                    "headline": "Color to your liking!",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Paper",
        "Pencil",
        "Pencil sharpener",
        "Eraser gum",
        "Colored pencils, crayons, watercolors or paint.",
        "Markers"
    ],
    "text": " Cartoon Turkey (Beginners) Draw a squash shape.  Draw a triangle in the center of the top of your squash.  Draw two circles slightly above the triangle.  Draw two, darker circles inside of the circles already drawn.  Draw a squiggle-line extending from the triangle.  Draw elongated ovals extended from the squash, until it resembles a fan.  Draw two, even lines extending from the bottom of the turkey.  Draw two diagonal lines, extending from close to the bottom of the lines.  Shade your turkey in the desired colors.  Finished.  Cartoon Turkey (Intermediate) Draw a circle.  Sketch a small circle on the right side of the big circle. Connect the small circle with the big one using two curved lines so that it will look like a head, neck and body. Add two curved lines that make a pointed angle on the head for the beak. Sketch two lines with an angle attached to the body. Draw a triangle on the ends of each line for the turkey’s legs. Draw a fan-like structure on the rear part of the turkey.  Draw the eyes using small circles. Add a curved line line for the eyebrows. Draw the mouth and a dot for the nostril. Draw the neck and the caruncles using curved lines cascading from the beak to the neck.  Draw the wings using a big fluffy shape with three curved lines for the feathers.  Using the outline, sketch out the turkey’s body and add the legs. Sketch a series of curved lines forming a collar just below the neck for feather design. Draw the feet. A turkey’s feet has three claws in front and a small one at the back. Sketch two layers containing a series of curved lines for the turkey’s fan-like tail. Make the second layer bigger and more elaborate than the first one. Erase unnecessary lines.  Color the drawing.  Drawing Realistic Turkey Draw a big circle for the body and an oblong overlapping the big circle on the right side.  Add a small circle for the head and connect this to the oblong using two curved lines that serves as the neck. Add two small curved lines that form a pointed angle to the right side of the head for the beak. Draw lines for a rough outline of the legs and add a triangle on each end for the feet.  Draw a curved line on the left side of the turkey and a fan-like structure for the tail attached to the curved line.  Draw the eyes and define the beak. Draw the snood and the caruncles of the neck using curved strokes. Sketch out the body, taking note of the feather patterns. Note that the back portion of the turkey is a little bumpy so you can sketch out a few outlines of the feathers too. Darken the fan-like shape of the turkey’s tail.  Sketch and define the legs and toes.  Draw random small strokes all over the turkey’s body for a feathery appearance.  Erase unnecessary lines and refine the feathers using small curved strokes.  Color the drawing.  Making a Chef Turkey Draw an oblong with an overlapping big circle below it. This will form the sketch for the turkey’s body and head. Draw the details of the turkey’s head using circles and curve lines for the beak.  Draw details for the wattle and the head.  Draw the turkey’s hat or toque to look like a cartoon.  Draw details for the left wing using curve lines and also for the feet.  Draw the right wing which holds a ladle. Draw also details for the cooking pot. Draw the turkey’s fan-shaped tail and details for the feathers.  Trace with a black pen.  Color to your liking, then design the background.  Making a Roasted Turkey Draw a horizontally elongated oblong.  Draw a more flattened and elongated oblong below the first with an inner overlapping oblong. This will be the plate. Draw the details for the cut head, wings, and butt.  Draw an oblong near the butt with small circles or oblongs below it.  Draw the details for the turkey’s leg with a sketch for the leg bone. Draw details for leaves. Trace with a pen and erase unnecessary lines. Add details. Color to your liking! ",
    "sentences": [
        " Cartoon Turkey (Beginners) Draw a squash shape.",
        "Draw a triangle in the center of the top of your squash.",
        "Draw two circles slightly above the triangle.",
        "Draw two, darker circles inside of the circles already drawn.",
        "Draw a squiggle-line extending from the triangle.",
        "Draw elongated ovals extended from the squash, until it resembles a fan.",
        "Draw two, even lines extending from the bottom of the turkey.",
        "Draw two diagonal lines, extending from close to the bottom of the lines.",
        "Shade your turkey in the desired colors.",
        "Finished.",
        "Cartoon Turkey (Intermediate) Draw a circle.",
        "Sketch a small circle on the right side of the big circle.",
        "Connect the small circle with the big one using two curved lines so that it will look like a head, neck and body.",
        "Add two curved lines that make a pointed angle on the head for the beak.",
        "Sketch two lines with an angle attached to the body.",
        "Draw a triangle on the ends of each line for the turkey’s legs.",
        "Draw a fan-like structure on the rear part of the turkey.",
        "Draw the eyes using small circles.",
        "Add a curved line line for the eyebrows.",
        "Draw the mouth and a dot for the nostril.",
        "Draw the neck and the caruncles using curved lines cascading from the beak to the neck.",
        "Draw the wings using a big fluffy shape with three curved lines for the feathers.",
        "Using the outline, sketch out the turkey’s body and add the legs.",
        "Sketch a series of curved lines forming a collar just below the neck for feather design.",
        "Draw the feet.",
        "A turkey’s feet has three claws in front and a small one at the back.",
        "Sketch two layers containing a series of curved lines for the turkey’s fan-like tail.",
        "Make the second layer bigger and more elaborate than the first one.",
        "Erase unnecessary lines.",
        "Color the drawing.",
        "Drawing Realistic Turkey Draw a big circle for the body and an oblong overlapping the big circle on the right side.",
        "Add a small circle for the head and connect this to the oblong using two curved lines that serves as the neck.",
        "Add two small curved lines that form a pointed angle to the right side of the head for the beak.",
        "Draw lines for a rough outline of the legs and add a triangle on each end for the feet.",
        "Draw a curved line on the left side of the turkey and a fan-like structure for the tail attached to the curved line.",
        "Draw the eyes and define the beak.",
        "Draw the snood and the caruncles of the neck using curved strokes.",
        "Sketch out the body, taking note of the feather patterns.",
        "Note that the back portion of the turkey is a little bumpy so you can sketch out a few outlines of the feathers too.",
        "Darken the fan-like shape of the turkey’s tail.",
        "Sketch and define the legs and toes.",
        "Draw random small strokes all over the turkey’s body for a feathery appearance.",
        "Erase unnecessary lines and refine the feathers using small curved strokes.",
        "Color the drawing.",
        "Making a Chef Turkey Draw an oblong with an overlapping big circle below it.",
        "This will form the sketch for the turkey’s body and head.",
        "Draw the details of the turkey’s head using circles and curve lines for the beak.",
        "Draw details for the wattle and the head.",
        "Draw the turkey’s hat or toque to look like a cartoon.",
        "Draw details for the left wing using curve lines and also for the feet.",
        "Draw the right wing which holds a ladle.",
        "Draw also details for the cooking pot.",
        "Draw the turkey’s fan-shaped tail and details for the feathers.",
        "Trace with a black pen.",
        "Color to your liking, then design the background.",
        "Making a Roasted Turkey Draw a horizontally elongated oblong.",
        "Draw a more flattened and elongated oblong below the first with an inner overlapping oblong.",
        "This will be the plate.",
        "Draw the details for the cut head, wings, and butt.",
        "Draw an oblong near the butt with small circles or oblongs below it.",
        "Draw the details for the turkey’s leg with a sketch for the leg bone.",
        "Draw details for leaves.",
        "Trace with a pen and erase unnecessary lines.",
        "Add details.",
        "Color to your liking!"
    ]
}