{
    "title": "How to Make Cookie Dough Bark",
    "url": "https://www.wikihow.com/Make-Cookie-Dough-Bark",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Chocolate and Candy"
    ],
    "methods": [
        {
            "name": "Making Chocolate Chip Cookie Dough Bark",
            "steps": [
                {
                    "headline": "Prepare a pan and set up a double boiler.",
                    "description": "Get out a jelly roll pan and line it with waxed paper. Set the pan aside and get out a medium saucepan. Pour 1 inch (2.5 cm) of water in the pan and put it on the stove over medium-high heat. Set a clear oven-safe bowl over the saucepan. The bowl shouldn't touch the water in the saucepan. Leave the double boiler set up, since you'll need to melt more chocolate once your bark is almost assembled."
                },
                {
                    "headline": "Melt the semisweet chocolate with the coconut oil.",
                    "description": "Once the water in the saucepan bubbles gently, pour one (12 ounce of 350 g) bag of semisweet chocolate chips into the bowl of the double boiler. Add 2 tablespoons of the coconut oil and stir the chocolate until it melts. The melted chocolate and oil should be a little thin."
                },
                {
                    "headline": "Spread and chill the melted chocolate.",
                    "description": "Carefully pour the melted chocolate into the prepared jelly roll pan and use a rubber or offset spatula to smooth it out. Try to do this before the chocolate has a chance to set up. Place the pan in the refrigerator and chill the chocolate for 20 minutes. The chocolate should set up and harden before you cover it with the rest of the bark."
                },
                {
                    "headline": "Cream the cookie dough mixture.",
                    "description": "Put 1 cup (226 g) of softened, unsalted butter into a mixing bowl along with 1 cup (200 g) of brown sugar and 2 teaspoons of vanilla. extract. Beat the mixture with a stand or handheld mixer until it's light and fluffy. You'll need to cream the mixture for several minutes for it to lighten."
                },
                {
                    "headline": "Stir in the crushed graham crackers, salt, and milk.",
                    "description": "Use a rubber spatula or spoon to stir in 1 1/2 cups (130 g) of crushed graham crackers and 2 teaspoons of salt until they're incorporated. Slowly stir in 1/3 cup (80 ml) of milk until it's combined. The mixture should be the texture of cookie dough at this point."
                },
                {
                    "headline": "Stir in the mini-chocolate chips and spread the dough in the pan.",
                    "description": "Measure out 2/3 cup (115 g) of mini chocolate chips and stir them into the cookie dough. Take the jelly roll pan of chilled chocolate out of the refrigerator and spread the cookie dough evenly over the chocolate."
                },
                {
                    "headline": "Chill the bark and melt the rest of the chocolate.",
                    "description": "Put the pan of bark back in the refrigerator to chill while you make the chocolate topping. Melt the remaining bag (12 ounces or 350 g) of semisweet chocolate chips and 2 tablespoons of coconut oil in the double boiler. Stir the chocolate, so it melts completely. For a double chocolate, try melting white chocolate chips instead of semisweet."
                },
                {
                    "headline": "Spread the melted chocolate over the dough layer.",
                    "description": "Take the jelly roll pan out of the refrigerator and carefully pour the melted semisweet chocolate over the cookie dough. Use a spoon or spatula to spread it evenly."
                },
                {
                    "headline": "Garnish and chill the bark.",
                    "description": "Open one 3.5-ounce (99 g) package of mini-chocolate chip cookies and set a small handful of them aside. Crush the handful and sprinkle it over the top of the bark. Scatter the remaining whole mini-cookies over the top and place the sheet in the refrigerator. Chill the bark until it's completely set and then break it into pieces. It should take about 2 hours for the bark to set up."
                }
            ]
        },
        {
            "name": "Making Sugar Cookie Dough Bark",
            "steps": [
                {
                    "headline": "Cream the butter and sugar.",
                    "description": "Soften 1/2 cup (113 g) of unsalted butter and place it in a mixing bowl. Add 1/2 cup (100 g) of granulated sugar. Beat the mixture together using a hand or stand mixer. Cream the mixture until it's light and fluffy. You'll need to beat the mixture for several minutes and scrape down the sides of the bowl occasionally."
                },
                {
                    "headline": "Mix in the remaining dough ingredients.",
                    "description": "Slowly mix in 1 teaspoon of vanilla extract, 1 tablespoon of milk, 1 1/3 cups (166 g) of all-purpose flour, and 1/4 teaspoon of salt. Keep mixing until the dough comes together and the flour is incorporated. Don't worry about over mixing the dough, since you won't be baking it."
                },
                {
                    "headline": "Melt the white chocolate.",
                    "description": "Chop 16 ounces (453 g) of white chocolate or get out white chocolate candy melts. Place the chocolate in a microwave-safe bowl and heat it for 30 seconds in the microwave. Stir the chocolate and continue heating the chocolate for 30 second increments until the chocolate melts. You could also set up and melt the chocolate over a double boiler on the stove, if you prefer."
                },
                {
                    "headline": "Spread some of the chocolate on a lined baking sheet.",
                    "description": "Get out a cookie sheet or rimmed baking sheet. Lay waxed or parchment paper on the sheet and scoop half of the melted chocolate onto the sheet. Spread the chocolate to make an 8 x 10-inch (20 to 25 cm) rectangle. Ensure that whatever pan you choose will fit in your refrigerator."
                },
                {
                    "headline": "Scoop and flatten the cookie dough on the chocolate.",
                    "description": "Take the sheet out of the refrigerator. Scoop out large portions of cookie dough and flatten them using your palms. Set the flattened dough on the melted chocolate in the pan. Keep doing this until you've used all of the dough and the chocolate is covered with cookie dough. You can also try rolling out the cookie dough in between two sheets of waxed paper. Use a rolling pin to roll the dough out to the size of the rectangle of chocolate."
                },
                {
                    "headline": "Spread the rest of the white chocolate over the cookie dough.",
                    "description": "Pour the rest of the melted white chocolate over the cookie dough and use a spatula to spread it evenly. Sprinkle the top of the sugar cookie bark with your favorite sprinkles."
                },
                {
                    "headline": "Chill the sugar cookie dough bark.",
                    "description": "Put the sheet in the pan and refrigerate the bark until it's hard. This could take a few hours. Once it's set up, you can use a sharp knife to cut the bark into pieces. Store leftover bark in the refrigerator. Before you're ready to serve the bark, remove it from the fridge and let it sit out until it's at room temperature."
                }
            ]
        },
        {
            "name": "Making Vegan Peanut Butter Cookie Dough Bark",
            "steps": [
                {
                    "headline": "Cream the oil, peanut butter, and brown sugar.",
                    "description": "Place 2 tablespoons of coconut oil, 1/2 cup (133 g) of creamy peanut butter and 1/2 cup (100 g) of packed brown sugar into a mixing bowl. Beat the mixture with a hand or stand mixer until the mixture is combined. Because there's no butter in this, the mixture may not become very light or fluffy."
                },
                {
                    "headline": "Mix in the vanilla, salt, and oat flour.",
                    "description": "Turn the mixer down to low and stir in 2 teaspoons of vanilla extract and 1/8 teaspoon of salt. Scrape down the sides of the bowl and slowly add in 1 cup (92 g) of oat flour. Beat the dough until the flour is just combined. Set the peanut butter dough aside while you prepare the rest of the bark."
                },
                {
                    "headline": "Melt the coconut butter and prepare a jelly roll pan.",
                    "description": "Lay aluminum foil in a jelly roll pan and set it aside. Get out 1 1/2 cups (330 g) of coconut butter and place it in a microwave-safe bowl. Set the bowl over a medium saucepan that has 1 inch (2.5 cm) of water in it. Heat the double boiler, so the water simmers and the coconut butter melts. You could also melt the coconut butter in a 350 degree F (180 C) oven for 5 to 7 minutes. Take the melted butter out before it burns. Avoid using coconut oil in this step because it isn't the same as coconut butter."
                },
                {
                    "headline": "Spread and chill some of the coconut butter.",
                    "description": "Measure out 3/4 cup (180 ml) of the melted coconut butter and pour it into the prepared pan. Spread it evenly with a rubber or offset spatula. Place the pan in the freezer to chill for 5 minutes. Chilling the coconut butter will help it harden quickly."
                },
                {
                    "headline": "Spoon the cookie dough over the chilled coconut butter.",
                    "description": "Remove the pan from the freezer and scoop the peanut butter cookie dough onto the hardened coconut butter. Use your fingers or a butter knife to spread the dough evenly. Your fingers won't stick to the dough because there's a lot of oil in the dough."
                },
                {
                    "headline": "Cover the dough with the rest of the coconut butter.",
                    "description": "Pour the rest of the melted coconut butter across the peanut butter cookie dough in the pan. Use a spatula or knife to spread it evenly. If you want to decorate the bark, you can top it with vegan sprinkles."
                },
                {
                    "headline": "Chill the bark and cut it into pieces.",
                    "description": "Put the pan of bark in the freezer and let it chill for 10 minutes. The coconut butter should be completely hardened. Take the pan out and peel the bark out of the pan and aluminum foil. Cut the bark into squares or a variety of shapes. You can store the leftover bark in an airtight container in the refrigerator."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Jelly roll pan",
        "Cookie or baking sheet",
        "Waxed paper",
        "Measuring cups and spoons",
        "Knife",
        "Rubber spatula",
        "Offset spatula",
        "Medium saucepan",
        "Clear, oven-safe bowl",
        "Mixing bowl",
        "Hand or stand mixer",
        "Parchment paper",
        "Aluminum foil",
        "Butter knife, optional"
    ],
    "text": " Making Chocolate Chip Cookie Dough Bark Prepare a pan and set up a double boiler. Get out a jelly roll pan and line it with waxed paper. Set the pan aside and get out a medium saucepan. Pour 1 inch (2.5 cm) of water in the pan and put it on the stove over medium-high heat. Set a clear oven-safe bowl over the saucepan. The bowl shouldn't touch the water in the saucepan. Leave the double boiler set up, since you'll need to melt more chocolate once your bark is almost assembled. Melt the semisweet chocolate with the coconut oil. Once the water in the saucepan bubbles gently, pour one (12 ounce of 350 g) bag of semisweet chocolate chips into the bowl of the double boiler. Add 2 tablespoons of the coconut oil and stir the chocolate until it melts. The melted chocolate and oil should be a little thin. Spread and chill the melted chocolate. Carefully pour the melted chocolate into the prepared jelly roll pan and use a rubber or offset spatula to smooth it out. Try to do this before the chocolate has a chance to set up. Place the pan in the refrigerator and chill the chocolate for 20 minutes. The chocolate should set up and harden before you cover it with the rest of the bark. Cream the cookie dough mixture. Put 1 cup (226 g) of softened, unsalted butter into a mixing bowl along with 1 cup (200 g) of brown sugar and 2 teaspoons of vanilla. extract. Beat the mixture with a stand or handheld mixer until it's light and fluffy. You'll need to cream the mixture for several minutes for it to lighten. Stir in the crushed graham crackers, salt, and milk. Use a rubber spatula or spoon to stir in 1 1/2 cups (130 g) of crushed graham crackers and 2 teaspoons of salt until they're incorporated. Slowly stir in 1/3 cup (80 ml) of milk until it's combined. The mixture should be the texture of cookie dough at this point. Stir in the mini-chocolate chips and spread the dough in the pan. Measure out 2/3 cup (115 g) of mini chocolate chips and stir them into the cookie dough. Take the jelly roll pan of chilled chocolate out of the refrigerator and spread the cookie dough evenly over the chocolate. Chill the bark and melt the rest of the chocolate. Put the pan of bark back in the refrigerator to chill while you make the chocolate topping. Melt the remaining bag (12 ounces or 350 g) of semisweet chocolate chips and 2 tablespoons of coconut oil in the double boiler. Stir the chocolate, so it melts completely. For a double chocolate, try melting white chocolate chips instead of semisweet. Spread the melted chocolate over the dough layer. Take the jelly roll pan out of the refrigerator and carefully pour the melted semisweet chocolate over the cookie dough. Use a spoon or spatula to spread it evenly. Garnish and chill the bark. Open one 3.5-ounce (99 g) package of mini-chocolate chip cookies and set a small handful of them aside. Crush the handful and sprinkle it over the top of the bark. Scatter the remaining whole mini-cookies over the top and place the sheet in the refrigerator. Chill the bark until it's completely set and then break it into pieces. It should take about 2 hours for the bark to set up. Making Sugar Cookie Dough Bark Cream the butter and sugar. Soften 1/2 cup (113 g) of unsalted butter and place it in a mixing bowl. Add 1/2 cup (100 g) of granulated sugar. Beat the mixture together using a hand or stand mixer. Cream the mixture until it's light and fluffy. You'll need to beat the mixture for several minutes and scrape down the sides of the bowl occasionally. Mix in the remaining dough ingredients. Slowly mix in 1 teaspoon of vanilla extract, 1 tablespoon of milk, 1 1/3 cups (166 g) of all-purpose flour, and 1/4 teaspoon of salt. Keep mixing until the dough comes together and the flour is incorporated. Don't worry about over mixing the dough, since you won't be baking it. Melt the white chocolate. Chop 16 ounces (453 g) of white chocolate or get out white chocolate candy melts. Place the chocolate in a microwave-safe bowl and heat it for 30 seconds in the microwave. Stir the chocolate and continue heating the chocolate for 30 second increments until the chocolate melts. You could also set up and melt the chocolate over a double boiler on the stove, if you prefer. Spread some of the chocolate on a lined baking sheet. Get out a cookie sheet or rimmed baking sheet. Lay waxed or parchment paper on the sheet and scoop half of the melted chocolate onto the sheet. Spread the chocolate to make an 8 x 10-inch (20 to 25 cm) rectangle. Ensure that whatever pan you choose will fit in your refrigerator. Scoop and flatten the cookie dough on the chocolate. Take the sheet out of the refrigerator. Scoop out large portions of cookie dough and flatten them using your palms. Set the flattened dough on the melted chocolate in the pan. Keep doing this until you've used all of the dough and the chocolate is covered with cookie dough. You can also try rolling out the cookie dough in between two sheets of waxed paper. Use a rolling pin to roll the dough out to the size of the rectangle of chocolate. Spread the rest of the white chocolate over the cookie dough. Pour the rest of the melted white chocolate over the cookie dough and use a spatula to spread it evenly. Sprinkle the top of the sugar cookie bark with your favorite sprinkles. Chill the sugar cookie dough bark. Put the sheet in the pan and refrigerate the bark until it's hard. This could take a few hours. Once it's set up, you can use a sharp knife to cut the bark into pieces. Store leftover bark in the refrigerator. Before you're ready to serve the bark, remove it from the fridge and let it sit out until it's at room temperature. Making Vegan Peanut Butter Cookie Dough Bark Cream the oil, peanut butter, and brown sugar. Place 2 tablespoons of coconut oil, 1/2 cup (133 g) of creamy peanut butter and 1/2 cup (100 g) of packed brown sugar into a mixing bowl. Beat the mixture with a hand or stand mixer until the mixture is combined. Because there's no butter in this, the mixture may not become very light or fluffy. Mix in the vanilla, salt, and oat flour. Turn the mixer down to low and stir in 2 teaspoons of vanilla extract and 1/8 teaspoon of salt. Scrape down the sides of the bowl and slowly add in 1 cup (92 g) of oat flour. Beat the dough until the flour is just combined. Set the peanut butter dough aside while you prepare the rest of the bark. Melt the coconut butter and prepare a jelly roll pan. Lay aluminum foil in a jelly roll pan and set it aside. Get out 1 1/2 cups (330 g) of coconut butter and place it in a microwave-safe bowl. Set the bowl over a medium saucepan that has 1 inch (2.5 cm) of water in it. Heat the double boiler, so the water simmers and the coconut butter melts. You could also melt the coconut butter in a 350 degree F (180 C) oven for 5 to 7 minutes. Take the melted butter out before it burns. Avoid using coconut oil in this step because it isn't the same as coconut butter. Spread and chill some of the coconut butter. Measure out 3/4 cup (180 ml) of the melted coconut butter and pour it into the prepared pan. Spread it evenly with a rubber or offset spatula. Place the pan in the freezer to chill for 5 minutes. Chilling the coconut butter will help it harden quickly. Spoon the cookie dough over the chilled coconut butter. Remove the pan from the freezer and scoop the peanut butter cookie dough onto the hardened coconut butter. Use your fingers or a butter knife to spread the dough evenly. Your fingers won't stick to the dough because there's a lot of oil in the dough. Cover the dough with the rest of the coconut butter. Pour the rest of the melted coconut butter across the peanut butter cookie dough in the pan. Use a spatula or knife to spread it evenly. If you want to decorate the bark, you can top it with vegan sprinkles. Chill the bark and cut it into pieces. Put the pan of bark in the freezer and let it chill for 10 minutes. The coconut butter should be completely hardened. Take the pan out and peel the bark out of the pan and aluminum foil. Cut the bark into squares or a variety of shapes. You can store the leftover bark in an airtight container in the refrigerator. Finished. ",
    "sentences": [
        " Making Chocolate Chip Cookie Dough Bark Prepare a pan and set up a double boiler.",
        "Get out a jelly roll pan and line it with waxed paper.",
        "Set the pan aside and get out a medium saucepan.",
        "Pour 1 inch (2.5 cm) of water in the pan and put it on the stove over medium-high heat.",
        "Set a clear oven-safe bowl over the saucepan.",
        "The bowl shouldn't touch the water in the saucepan.",
        "Leave the double boiler set up, since you'll need to melt more chocolate once your bark is almost assembled.",
        "Melt the semisweet chocolate with the coconut oil.",
        "Once the water in the saucepan bubbles gently, pour one (12 ounce of 350 g) bag of semisweet chocolate chips into the bowl of the double boiler.",
        "Add 2 tablespoons of the coconut oil and stir the chocolate until it melts.",
        "The melted chocolate and oil should be a little thin.",
        "Spread and chill the melted chocolate.",
        "Carefully pour the melted chocolate into the prepared jelly roll pan and use a rubber or offset spatula to smooth it out.",
        "Try to do this before the chocolate has a chance to set up.",
        "Place the pan in the refrigerator and chill the chocolate for 20 minutes.",
        "The chocolate should set up and harden before you cover it with the rest of the bark.",
        "Cream the cookie dough mixture.",
        "Put 1 cup (226 g) of softened, unsalted butter into a mixing bowl along with 1 cup (200 g) of brown sugar and 2 teaspoons of vanilla.",
        "extract.",
        "Beat the mixture with a stand or handheld mixer until it's light and fluffy.",
        "You'll need to cream the mixture for several minutes for it to lighten.",
        "Stir in the crushed graham crackers, salt, and milk.",
        "Use a rubber spatula or spoon to stir in 1 1/2 cups (130 g) of crushed graham crackers and 2 teaspoons of salt until they're incorporated.",
        "Slowly stir in 1/3 cup (80 ml) of milk until it's combined.",
        "The mixture should be the texture of cookie dough at this point.",
        "Stir in the mini-chocolate chips and spread the dough in the pan.",
        "Measure out 2/3 cup (115 g) of mini chocolate chips and stir them into the cookie dough.",
        "Take the jelly roll pan of chilled chocolate out of the refrigerator and spread the cookie dough evenly over the chocolate.",
        "Chill the bark and melt the rest of the chocolate.",
        "Put the pan of bark back in the refrigerator to chill while you make the chocolate topping.",
        "Melt the remaining bag (12 ounces or 350 g) of semisweet chocolate chips and 2 tablespoons of coconut oil in the double boiler.",
        "Stir the chocolate, so it melts completely.",
        "For a double chocolate, try melting white chocolate chips instead of semisweet.",
        "Spread the melted chocolate over the dough layer.",
        "Take the jelly roll pan out of the refrigerator and carefully pour the melted semisweet chocolate over the cookie dough.",
        "Use a spoon or spatula to spread it evenly.",
        "Garnish and chill the bark.",
        "Open one 3.5-ounce (99 g) package of mini-chocolate chip cookies and set a small handful of them aside.",
        "Crush the handful and sprinkle it over the top of the bark.",
        "Scatter the remaining whole mini-cookies over the top and place the sheet in the refrigerator.",
        "Chill the bark until it's completely set and then break it into pieces.",
        "It should take about 2 hours for the bark to set up.",
        "Making Sugar Cookie Dough Bark Cream the butter and sugar.",
        "Soften 1/2 cup (113 g) of unsalted butter and place it in a mixing bowl.",
        "Add 1/2 cup (100 g) of granulated sugar.",
        "Beat the mixture together using a hand or stand mixer.",
        "Cream the mixture until it's light and fluffy.",
        "You'll need to beat the mixture for several minutes and scrape down the sides of the bowl occasionally.",
        "Mix in the remaining dough ingredients.",
        "Slowly mix in 1 teaspoon of vanilla extract, 1 tablespoon of milk, 1 1/3 cups (166 g) of all-purpose flour, and 1/4 teaspoon of salt.",
        "Keep mixing until the dough comes together and the flour is incorporated.",
        "Don't worry about over mixing the dough, since you won't be baking it.",
        "Melt the white chocolate.",
        "Chop 16 ounces (453 g) of white chocolate or get out white chocolate candy melts.",
        "Place the chocolate in a microwave-safe bowl and heat it for 30 seconds in the microwave.",
        "Stir the chocolate and continue heating the chocolate for 30 second increments until the chocolate melts.",
        "You could also set up and melt the chocolate over a double boiler on the stove, if you prefer.",
        "Spread some of the chocolate on a lined baking sheet.",
        "Get out a cookie sheet or rimmed baking sheet.",
        "Lay waxed or parchment paper on the sheet and scoop half of the melted chocolate onto the sheet.",
        "Spread the chocolate to make an 8 x 10-inch (20 to 25 cm) rectangle.",
        "Ensure that whatever pan you choose will fit in your refrigerator.",
        "Scoop and flatten the cookie dough on the chocolate.",
        "Take the sheet out of the refrigerator.",
        "Scoop out large portions of cookie dough and flatten them using your palms.",
        "Set the flattened dough on the melted chocolate in the pan.",
        "Keep doing this until you've used all of the dough and the chocolate is covered with cookie dough.",
        "You can also try rolling out the cookie dough in between two sheets of waxed paper.",
        "Use a rolling pin to roll the dough out to the size of the rectangle of chocolate.",
        "Spread the rest of the white chocolate over the cookie dough.",
        "Pour the rest of the melted white chocolate over the cookie dough and use a spatula to spread it evenly.",
        "Sprinkle the top of the sugar cookie bark with your favorite sprinkles.",
        "Chill the sugar cookie dough bark.",
        "Put the sheet in the pan and refrigerate the bark until it's hard.",
        "This could take a few hours.",
        "Once it's set up, you can use a sharp knife to cut the bark into pieces.",
        "Store leftover bark in the refrigerator.",
        "Before you're ready to serve the bark, remove it from the fridge and let it sit out until it's at room temperature.",
        "Making Vegan Peanut Butter Cookie Dough Bark Cream the oil, peanut butter, and brown sugar.",
        "Place 2 tablespoons of coconut oil, 1/2 cup (133 g) of creamy peanut butter and 1/2 cup (100 g) of packed brown sugar into a mixing bowl.",
        "Beat the mixture with a hand or stand mixer until the mixture is combined.",
        "Because there's no butter in this, the mixture may not become very light or fluffy.",
        "Mix in the vanilla, salt, and oat flour.",
        "Turn the mixer down to low and stir in 2 teaspoons of vanilla extract and 1/8 teaspoon of salt.",
        "Scrape down the sides of the bowl and slowly add in 1 cup (92 g) of oat flour.",
        "Beat the dough until the flour is just combined.",
        "Set the peanut butter dough aside while you prepare the rest of the bark.",
        "Melt the coconut butter and prepare a jelly roll pan.",
        "Lay aluminum foil in a jelly roll pan and set it aside.",
        "Get out 1 1/2 cups (330 g) of coconut butter and place it in a microwave-safe bowl.",
        "Set the bowl over a medium saucepan that has 1 inch (2.5 cm) of water in it.",
        "Heat the double boiler, so the water simmers and the coconut butter melts.",
        "You could also melt the coconut butter in a 350 degree F (180 C) oven for 5 to 7 minutes.",
        "Take the melted butter out before it burns.",
        "Avoid using coconut oil in this step because it isn't the same as coconut butter.",
        "Spread and chill some of the coconut butter.",
        "Measure out 3/4 cup (180 ml) of the melted coconut butter and pour it into the prepared pan.",
        "Spread it evenly with a rubber or offset spatula.",
        "Place the pan in the freezer to chill for 5 minutes.",
        "Chilling the coconut butter will help it harden quickly.",
        "Spoon the cookie dough over the chilled coconut butter.",
        "Remove the pan from the freezer and scoop the peanut butter cookie dough onto the hardened coconut butter.",
        "Use your fingers or a butter knife to spread the dough evenly.",
        "Your fingers won't stick to the dough because there's a lot of oil in the dough.",
        "Cover the dough with the rest of the coconut butter.",
        "Pour the rest of the melted coconut butter across the peanut butter cookie dough in the pan.",
        "Use a spatula or knife to spread it evenly.",
        "If you want to decorate the bark, you can top it with vegan sprinkles.",
        "Chill the bark and cut it into pieces.",
        "Put the pan of bark in the freezer and let it chill for 10 minutes.",
        "The coconut butter should be completely hardened.",
        "Take the pan out and peel the bark out of the pan and aluminum foil.",
        "Cut the bark into squares or a variety of shapes.",
        "You can store the leftover bark in an airtight container in the refrigerator.",
        "Finished."
    ]
}