{
    "title": "How to Clean Old Cast Iron",
    "url": "https://www.wikihow.com/Clean-Old-Cast-Iron",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Cleaning"
    ],
    "methods": [
        {
            "name": "Cleaning an Old Cast Iron Skillet",
            "steps": [
                {
                    "headline": "Scrape the rust off with steel wool.",
                    "description": "Apply force to the steel wool as you wipe back and forth to remove all of the rust. The dry rust should begin to peel and flake off. Continue to do this until you expose the raw cast iron under the rust."
                },
                {
                    "headline": "Wash the cast iron with hot water and dish soap.",
                    "description": "Place the old cast iron skillet into your sink and proceed to wash it off with a sponge and dish soap. Work in circular motions all around the cast iron to remove the remainder of rust or dirt that's built up over time. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices. He has a Bachelors in Business Administration and Management from Baruch College. Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tOur Expert Agrees: To clean old cast iron, scrub it with a scrubbing pad and very little dishwashing liquid. Rinse it well, then dry thoroughly."
                },
                {
                    "headline": "Rinse the cast iron under your faucet.",
                    "description": "Run warm or hot water from your faucet and rinse off all of the soap and water from your skillet. Make sure to thoroughly rinse the cast iron or else your food may taste like soap."
                },
                {
                    "headline": "Dry the cast iron.",
                    "description": "Any moisture that's left over on your cast iron will cause it to rust. Dry the cast iron down with a dry rag or terry cloth. Once you've hand dried it, place the skillet on a stovetop and set the heat to high until all of the water and moisture has evaporated."
                }
            ]
        },
        {
            "name": "Re-seasoning Your Cast Iron Skillet",
            "steps": [
                {
                    "headline": "Rub oil into the pan.",
                    "description": "Pour 1-2 tbsps (14.78-29.57 ml) of corn, vegetable, or canola oil to season your cast iron pan. Rub the oil in with a cloth or a paper towel. Make sure that you get both the exterior and interior of the pan saturated in the oil."
                },
                {
                    "headline": "Heat the pan for an hour at 350°F (176°C).",
                    "description": "Preheat your oven to 350°F (176°C). Place the pan upside down on the top rack once it's hot. This will season the pan, adding a protective over the cast iron and will prevent foods from sticking to it."
                },
                {
                    "headline": "Let the pan cool off.",
                    "description": "After the pan has heated for an hour, you can turn off the oven and allow it to cool down. Allowing the pan the cool down naturally in the oven will prevent it from cracking."
                }
            ]
        },
        {
            "name": "Removing Rust with Vinegar",
            "steps": [
                {
                    "headline": "Mix equal parts of white vinegar and water together.",
                    "description": "Vinegar is acidic and will destroy your cast iron if it's exposed to it for too long. This method should only be used for very rusted cast iron items. Combine equal parts of warm water with white vinegar in a tub or sink that's big enough to fit the cast iron item you are cleaning."
                },
                {
                    "headline": "Submerge the cast iron in the solution for 30 minutes.",
                    "description": "Submerging your cast iron in the vinegar and water solution should soften up some of the rust and will allow you to remove it. Do not let your cast iron sit in the vinegar solution or you could damage the cast iron. If your entire cast iron item isn't submerged, it will create an uneven color. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices. He has a Bachelors in Business Administration and Management from Baruch College. Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tLeave the pot in the vinegar for up to an hour for heavy rust. To get rid of rust on cast iron, completely submerge the cookware in white distilled vinegar for about an hour. Then, scrub the cast iron with a scrubbing pad and a little dishwashing liquid, then rinse. You may have to repeat the process, depending on how rusted the cookware is. When you're finished, season the pan by coating it inside and out with vegetable oil, then put it in the oven for an hour at 350°F."
                },
                {
                    "headline": "Wipe the cast iron with a sponge.",
                    "description": "Wipe the rust with a cloth or a sponge. If the rust comes off, then you can stop soaking your cast iron. If the rust is still embedded in the cast iron, continue to soak the cast iron and check back frequently until the rust starts to rub off. Finish scrubbing the cast iron until it's clean and there is no more rust."
                },
                {
                    "headline": "Rinse and dry off your cast iron.",
                    "description": "Once all the rust has been removed and the cast iron is clean, run it under cold water to rinse off any remaining debris or solution. Use a dry cloth to completely dry down the cast iron."
                }
            ]
        },
        {
            "name": "Cleaning Old Cast Iron Ovens",
            "steps": [
                {
                    "headline": "Wear the proper safety equipment.",
                    "description": "Before you work on the stove, make sure that it's off and not hot. If you are removing rust from the cast iron, make sure that you wear gloves and a facemask. Also, make sure the stove is in a well-ventilated area and open up all the windows if you are cleaning it indoors."
                },
                {
                    "headline": "Scrape off the rust with steel wool or wire brush.",
                    "description": "Go back and forth over rusted areas on the stove with a #00 or #000 steel wool or a wire brush until the rust starts to come loose. Continue to do this over all the rusted areas of the cast iron until you've removed all the rust you can. You can also use a 150 to 400 grit sandpaper instead of steel wool."
                },
                {
                    "headline": "Vacuum up any loose dust and dirt.",
                    "description": "Use a vacuum attachment or a shop vac to remove all the dust particles and debris that you were able to sand off the cast iron. Continue to go over the entirety of your oven until all the dust has been removed."
                },
                {
                    "headline": "Apply a cast iron polish to the oven.",
                    "description": "Put some cast iron polish into a rag or cloth and rub it onto the surface of your oven. Apply a thin coat of cast iron polish over the entirety of the oven. This should change the hue of the oven and make it appear shinier. Once you've applied the polish, let it dry for a 24 hour period. You can purchase cast iron polish at fireplace stores or online."
                },
                {
                    "headline": "Scrub the oven with a damp cloth or sponge.",
                    "description": "Make sure that the polish has dried completely before washing off your oven. Use a dry cloth and dab the surface of the oven to test that it has fully dried. If it is dry, scrub the cast iron with a damp cloth. If there is still rust or dirt remaining, you may have to repeat the process of scraping and polishing the oven to get it completely clean."
                },
                {
                    "headline": "Dry off the oven.",
                    "description": "Use a dry terry cloth or cotton rag to completely dry off the oven. Once it's dry, put some dry kindling in the oven and bring it outside. Light a fire and bring the oven to 300°F (148.88°C). Continue to heat it until the oven no longer smokes. Once it stops smoking, your oven is safe to use again. If you are heating the oven indoors, make sure you have plenty of ventilation because the polish smoke is hazardous to your health."
                }
            ]
        }
    ],
    "tyn": [
        "Steel wool",
        "Water",
        "Dish soap",
        "Corn, vegetable, or canola oil",
        "Vacuum",
        "Clean rags",
        "Cast iron polish",
        "Kindling"
    ],
    "text": " Cleaning an Old Cast Iron Skillet Scrape the rust off with steel wool. Apply force to the steel wool as you wipe back and forth to remove all of the rust. The dry rust should begin to peel and flake off. Continue to do this until you expose the raw cast iron under the rust. Wash the cast iron with hot water and dish soap. Place the old cast iron skillet into your sink and proceed to wash it off with a sponge and dish soap. Work in circular motions all around the cast iron to remove the remainder of rust or dirt that's built up over time. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices. He has a Bachelors in Business Administration and Management from Baruch College. Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tOur Expert Agrees: To clean old cast iron, scrub it with a scrubbing pad and very little dishwashing liquid. Rinse it well, then dry thoroughly. Rinse the cast iron under your faucet. Run warm or hot water from your faucet and rinse off all of the soap and water from your skillet. Make sure to thoroughly rinse the cast iron or else your food may taste like soap. Dry the cast iron. Any moisture that's left over on your cast iron will cause it to rust. Dry the cast iron down with a dry rag or terry cloth. Once you've hand dried it, place the skillet on a stovetop and set the heat to high until all of the water and moisture has evaporated. Re-seasoning Your Cast Iron Skillet Rub oil into the pan. Pour 1-2 tbsps (14.78-29.57 ml) of corn, vegetable, or canola oil to season your cast iron pan. Rub the oil in with a cloth or a paper towel. Make sure that you get both the exterior and interior of the pan saturated in the oil. Heat the pan for an hour at 350°F (176°C). Preheat your oven to 350°F (176°C). Place the pan upside down on the top rack once it's hot. This will season the pan, adding a protective over the cast iron and will prevent foods from sticking to it. Let the pan cool off. After the pan has heated for an hour, you can turn off the oven and allow it to cool down. Allowing the pan the cool down naturally in the oven will prevent it from cracking. Removing Rust with Vinegar Mix equal parts of white vinegar and water together. Vinegar is acidic and will destroy your cast iron if it's exposed to it for too long. This method should only be used for very rusted cast iron items. Combine equal parts of warm water with white vinegar in a tub or sink that's big enough to fit the cast iron item you are cleaning. Submerge the cast iron in the solution for 30 minutes. Submerging your cast iron in the vinegar and water solution should soften up some of the rust and will allow you to remove it. Do not let your cast iron sit in the vinegar solution or you could damage the cast iron. If your entire cast iron item isn't submerged, it will create an uneven color. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices. He has a Bachelors in Business Administration and Management from Baruch College. Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tLeave the pot in the vinegar for up to an hour for heavy rust. To get rid of rust on cast iron, completely submerge the cookware in white distilled vinegar for about an hour. Then, scrub the cast iron with a scrubbing pad and a little dishwashing liquid, then rinse. You may have to repeat the process, depending on how rusted the cookware is. When you're finished, season the pan by coating it inside and out with vegetable oil, then put it in the oven for an hour at 350°F. Wipe the cast iron with a sponge. Wipe the rust with a cloth or a sponge. If the rust comes off, then you can stop soaking your cast iron. If the rust is still embedded in the cast iron, continue to soak the cast iron and check back frequently until the rust starts to rub off. Finish scrubbing the cast iron until it's clean and there is no more rust. Rinse and dry off your cast iron. Once all the rust has been removed and the cast iron is clean, run it under cold water to rinse off any remaining debris or solution. Use a dry cloth to completely dry down the cast iron. Cleaning Old Cast Iron Ovens Wear the proper safety equipment. Before you work on the stove, make sure that it's off and not hot. If you are removing rust from the cast iron, make sure that you wear gloves and a facemask. Also, make sure the stove is in a well-ventilated area and open up all the windows if you are cleaning it indoors. Scrape off the rust with steel wool or wire brush. Go back and forth over rusted areas on the stove with a #00 or #000 steel wool or a wire brush until the rust starts to come loose. Continue to do this over all the rusted areas of the cast iron until you've removed all the rust you can. You can also use a 150 to 400 grit sandpaper instead of steel wool. Vacuum up any loose dust and dirt. Use a vacuum attachment or a shop vac to remove all the dust particles and debris that you were able to sand off the cast iron. Continue to go over the entirety of your oven until all the dust has been removed. Apply a cast iron polish to the oven. Put some cast iron polish into a rag or cloth and rub it onto the surface of your oven. Apply a thin coat of cast iron polish over the entirety of the oven. This should change the hue of the oven and make it appear shinier. Once you've applied the polish, let it dry for a 24 hour period. You can purchase cast iron polish at fireplace stores or online. Scrub the oven with a damp cloth or sponge. Make sure that the polish has dried completely before washing off your oven. Use a dry cloth and dab the surface of the oven to test that it has fully dried. If it is dry, scrub the cast iron with a damp cloth. If there is still rust or dirt remaining, you may have to repeat the process of scraping and polishing the oven to get it completely clean. Dry off the oven. Use a dry terry cloth or cotton rag to completely dry off the oven. Once it's dry, put some dry kindling in the oven and bring it outside. Light a fire and bring the oven to 300°F (148.88°C). Continue to heat it until the oven no longer smokes. Once it stops smoking, your oven is safe to use again. If you are heating the oven indoors, make sure you have plenty of ventilation because the polish smoke is hazardous to your health.",
    "sentences": [
        " Cleaning an Old Cast Iron Skillet Scrape the rust off with steel wool.",
        "Apply force to the steel wool as you wipe back and forth to remove all of the rust.",
        "The dry rust should begin to peel and flake off.",
        "Continue to do this until you expose the raw cast iron under the rust.",
        "Wash the cast iron with hot water and dish soap.",
        "Place the old cast iron skillet into your sink and proceed to wash it off with a sponge and dish soap.",
        "Work in circular motions all around the cast iron to remove the remainder of rust or dirt that's built up over time.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices.",
        "He has a Bachelors in Business Administration and Management from Baruch College.",
        "Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tOur Expert Agrees: To clean old cast iron, scrub it with a scrubbing pad and very little dishwashing liquid.",
        "Rinse it well, then dry thoroughly.",
        "Rinse the cast iron under your faucet.",
        "Run warm or hot water from your faucet and rinse off all of the soap and water from your skillet.",
        "Make sure to thoroughly rinse the cast iron or else your food may taste like soap.",
        "Dry the cast iron.",
        "Any moisture that's left over on your cast iron will cause it to rust.",
        "Dry the cast iron down with a dry rag or terry cloth.",
        "Once you've hand dried it, place the skillet on a stovetop and set the heat to high until all of the water and moisture has evaporated.",
        "Re-seasoning Your Cast Iron Skillet Rub oil into the pan.",
        "Pour 1-2 tbsps (14.78-29.57 ml) of corn, vegetable, or canola oil to season your cast iron pan.",
        "Rub the oil in with a cloth or a paper towel.",
        "Make sure that you get both the exterior and interior of the pan saturated in the oil.",
        "Heat the pan for an hour at 350°F (176°C).",
        "Preheat your oven to 350°F (176°C).",
        "Place the pan upside down on the top rack once it's hot.",
        "This will season the pan, adding a protective over the cast iron and will prevent foods from sticking to it.",
        "Let the pan cool off.",
        "After the pan has heated for an hour, you can turn off the oven and allow it to cool down.",
        "Allowing the pan the cool down naturally in the oven will prevent it from cracking.",
        "Removing Rust with Vinegar Mix equal parts of white vinegar and water together.",
        "Vinegar is acidic and will destroy your cast iron if it's exposed to it for too long.",
        "This method should only be used for very rusted cast iron items.",
        "Combine equal parts of warm water with white vinegar in a tub or sink that's big enough to fit the cast iron item you are cleaning.",
        "Submerge the cast iron in the solution for 30 minutes.",
        "Submerging your cast iron in the vinegar and water solution should soften up some of the rust and will allow you to remove it.",
        "Do not let your cast iron sit in the vinegar solution or you could damage the cast iron.",
        "If your entire cast iron item isn't submerged, it will create an uneven color.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices.",
        "He has a Bachelors in Business Administration and Management from Baruch College.",
        "Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tLeave the pot in the vinegar for up to an hour for heavy rust.",
        "To get rid of rust on cast iron, completely submerge the cookware in white distilled vinegar for about an hour.",
        "Then, scrub the cast iron with a scrubbing pad and a little dishwashing liquid, then rinse.",
        "You may have to repeat the process, depending on how rusted the cookware is.",
        "When you're finished, season the pan by coating it inside and out with vegetable oil, then put it in the oven for an hour at 350°F.",
        "Wipe the cast iron with a sponge.",
        "Wipe the rust with a cloth or a sponge.",
        "If the rust comes off, then you can stop soaking your cast iron.",
        "If the rust is still embedded in the cast iron, continue to soak the cast iron and check back frequently until the rust starts to rub off.",
        "Finish scrubbing the cast iron until it's clean and there is no more rust.",
        "Rinse and dry off your cast iron.",
        "Once all the rust has been removed and the cast iron is clean, run it under cold water to rinse off any remaining debris or solution.",
        "Use a dry cloth to completely dry down the cast iron.",
        "Cleaning Old Cast Iron Ovens Wear the proper safety equipment.",
        "Before you work on the stove, make sure that it's off and not hot.",
        "If you are removing rust from the cast iron, make sure that you wear gloves and a facemask.",
        "Also, make sure the stove is in a well-ventilated area and open up all the windows if you are cleaning it indoors.",
        "Scrape off the rust with steel wool or wire brush.",
        "Go back and forth over rusted areas on the stove with a #00 or #000 steel wool or a wire brush until the rust starts to come loose.",
        "Continue to do this over all the rusted areas of the cast iron until you've removed all the rust you can.",
        "You can also use a 150 to 400 grit sandpaper instead of steel wool.",
        "Vacuum up any loose dust and dirt.",
        "Use a vacuum attachment or a shop vac to remove all the dust particles and debris that you were able to sand off the cast iron.",
        "Continue to go over the entirety of your oven until all the dust has been removed.",
        "Apply a cast iron polish to the oven.",
        "Put some cast iron polish into a rag or cloth and rub it onto the surface of your oven.",
        "Apply a thin coat of cast iron polish over the entirety of the oven.",
        "This should change the hue of the oven and make it appear shinier.",
        "Once you've applied the polish, let it dry for a 24 hour period.",
        "You can purchase cast iron polish at fireplace stores or online.",
        "Scrub the oven with a damp cloth or sponge.",
        "Make sure that the polish has dried completely before washing off your oven.",
        "Use a dry cloth and dab the surface of the oven to test that it has fully dried.",
        "If it is dry, scrub the cast iron with a damp cloth.",
        "If there is still rust or dirt remaining, you may have to repeat the process of scraping and polishing the oven to get it completely clean.",
        "Dry off the oven.",
        "Use a dry terry cloth or cotton rag to completely dry off the oven.",
        "Once it's dry, put some dry kindling in the oven and bring it outside.",
        "Light a fire and bring the oven to 300°F (148.88°C).",
        "Continue to heat it until the oven no longer smokes.",
        "Once it stops smoking, your oven is safe to use again.",
        "If you are heating the oven indoors, make sure you have plenty of ventilation because the polish smoke is hazardous to your health."
    ]
}