{
    "title": "How to Clean a Black Sink",
    "url": "https://www.wikihow.com/Clean-a-Black-Sink",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Bathrooms"
    ],
    "methods": [
        {
            "name": "Performing Daily Cleanings",
            "steps": [
                {
                    "headline": "Use a vinegar solution.",
                    "description": "Mix equal parts water and distilled white vinegar in a spray bottle. Spray the solution on soap scum and/or food particles. Use a clean soft cloth to scrub the stain. Move in gentle circular strokes. If you notice a grain in the sink, move with it to avoid damaging the surface."
                },
                {
                    "headline": "Rinse out the sink.",
                    "description": "Cool or lukewarm water will usually do the trick. Target any remaining debris with the sprayer or your hands. Continue rinsing until all debris has been washed down the drain."
                },
                {
                    "headline": "Dry the sink.",
                    "description": "Use a separate cloth that's clean and dry. Make sure the texture is soft to avoid any damage to the surface. Move in gentle circular strokes with the grain until the sink is completely dry."
                }
            ]
        },
        {
            "name": "Removing Soap Buildup",
            "steps": [
                {
                    "headline": "Get a clean cloth or towel.",
                    "description": "Make sure it has a soft texture to avoid damaging your sink. Wet the cloth with lukewarm tap water. Wring out any excess water."
                },
                {
                    "headline": "Use dish detergent.",
                    "description": "Squirt a drop or two of mild dish washing liquid onto the cloth. Scrub in gentle circular strokes until the buildup begins to disappear. Move with the grain of the sink."
                },
                {
                    "headline": "Rinse the sink.",
                    "description": "Use cool water to dilute to dish detergent completely. If you don't have a sprayer, direct the water with your hands or a cup. Target detergent suds and any remaining soap buildup. Continue to rinse until all debris has been flushed down the drain."
                },
                {
                    "headline": "Dry the sink.",
                    "description": "Use a fresh towel or cloth with a soft texture. Move in a gentle circular motion with the grain. Continue until the sink is completely dry."
                }
            ]
        },
        {
            "name": "Removing Limescale",
            "steps": [
                {
                    "headline": "Sprinkle baking soda over the stain.",
                    "description": "Use enough to lightly cover the stains. How much or how little you use depends on the extent of the staining. You don't have to do any measuring. Let the baking soda sit for up to 30 seconds."
                },
                {
                    "headline": "Scrub the stain.",
                    "description": "Use a clean soft cloth. Move in circular gentle strokes until you feel the limescale begin to loosen. Keep your strokes with the grain of the surface. Alternatively, you could make a paste by adding a few drops of water to the baking soda. Use the same gentle circular motions to loosen the limescale."
                },
                {
                    "headline": "Rinse the sink.",
                    "description": "Run lukewarm water over the surface. If you have a sprayer, use it to rinse the sink. Otherwise, direct the stream of water over the surface with your hands or a cup. Keep rinsing until all traces of baking soda and limescale are gone."
                },
                {
                    "headline": "Dry the sink.",
                    "description": "Use a clean cloth or towel with a soft texture. Move in gentle circular strokes with the grain. Continue until the surface of the sink is completely dry. If you leave any water deposits, the lime or calcium in your water will contribute to new buildup."
                }
            ]
        }
    ],
    "tyn": [
        "Soft cloths or towels",
        "White distilled vinegar",
        "Dish detergent",
        "Baking soda"
    ],
    "text": " Performing Daily Cleanings Use a vinegar solution. Mix equal parts water and distilled white vinegar in a spray bottle. Spray the solution on soap scum and/or food particles. Use a clean soft cloth to scrub the stain. Move in gentle circular strokes. If you notice a grain in the sink, move with it to avoid damaging the surface. Rinse out the sink. Cool or lukewarm water will usually do the trick. Target any remaining debris with the sprayer or your hands. Continue rinsing until all debris has been washed down the drain. Dry the sink. Use a separate cloth that's clean and dry. Make sure the texture is soft to avoid any damage to the surface. Move in gentle circular strokes with the grain until the sink is completely dry. Removing Soap Buildup Get a clean cloth or towel. Make sure it has a soft texture to avoid damaging your sink. Wet the cloth with lukewarm tap water. Wring out any excess water. Use dish detergent. Squirt a drop or two of mild dish washing liquid onto the cloth. Scrub in gentle circular strokes until the buildup begins to disappear. Move with the grain of the sink. Rinse the sink. Use cool water to dilute to dish detergent completely. If you don't have a sprayer, direct the water with your hands or a cup. Target detergent suds and any remaining soap buildup. Continue to rinse until all debris has been flushed down the drain. Dry the sink. Use a fresh towel or cloth with a soft texture. Move in a gentle circular motion with the grain. Continue until the sink is completely dry. Removing Limescale Sprinkle baking soda over the stain. Use enough to lightly cover the stains. How much or how little you use depends on the extent of the staining. You don't have to do any measuring. Let the baking soda sit for up to 30 seconds. Scrub the stain. Use a clean soft cloth. Move in circular gentle strokes until you feel the limescale begin to loosen. Keep your strokes with the grain of the surface. Alternatively, you could make a paste by adding a few drops of water to the baking soda. Use the same gentle circular motions to loosen the limescale. Rinse the sink. Run lukewarm water over the surface. If you have a sprayer, use it to rinse the sink. Otherwise, direct the stream of water over the surface with your hands or a cup. Keep rinsing until all traces of baking soda and limescale are gone. Dry the sink. Use a clean cloth or towel with a soft texture. Move in gentle circular strokes with the grain. Continue until the surface of the sink is completely dry. If you leave any water deposits, the lime or calcium in your water will contribute to new buildup.",
    "sentences": [
        " Performing Daily Cleanings Use a vinegar solution.",
        "Mix equal parts water and distilled white vinegar in a spray bottle.",
        "Spray the solution on soap scum and/or food particles.",
        "Use a clean soft cloth to scrub the stain.",
        "Move in gentle circular strokes.",
        "If you notice a grain in the sink, move with it to avoid damaging the surface.",
        "Rinse out the sink.",
        "Cool or lukewarm water will usually do the trick.",
        "Target any remaining debris with the sprayer or your hands.",
        "Continue rinsing until all debris has been washed down the drain.",
        "Dry the sink.",
        "Use a separate cloth that's clean and dry.",
        "Make sure the texture is soft to avoid any damage to the surface.",
        "Move in gentle circular strokes with the grain until the sink is completely dry.",
        "Removing Soap Buildup Get a clean cloth or towel.",
        "Make sure it has a soft texture to avoid damaging your sink.",
        "Wet the cloth with lukewarm tap water.",
        "Wring out any excess water.",
        "Use dish detergent.",
        "Squirt a drop or two of mild dish washing liquid onto the cloth.",
        "Scrub in gentle circular strokes until the buildup begins to disappear.",
        "Move with the grain of the sink.",
        "Rinse the sink.",
        "Use cool water to dilute to dish detergent completely.",
        "If you don't have a sprayer, direct the water with your hands or a cup.",
        "Target detergent suds and any remaining soap buildup.",
        "Continue to rinse until all debris has been flushed down the drain.",
        "Dry the sink.",
        "Use a fresh towel or cloth with a soft texture.",
        "Move in a gentle circular motion with the grain.",
        "Continue until the sink is completely dry.",
        "Removing Limescale Sprinkle baking soda over the stain.",
        "Use enough to lightly cover the stains.",
        "How much or how little you use depends on the extent of the staining.",
        "You don't have to do any measuring.",
        "Let the baking soda sit for up to 30 seconds.",
        "Scrub the stain.",
        "Use a clean soft cloth.",
        "Move in circular gentle strokes until you feel the limescale begin to loosen.",
        "Keep your strokes with the grain of the surface.",
        "Alternatively, you could make a paste by adding a few drops of water to the baking soda.",
        "Use the same gentle circular motions to loosen the limescale.",
        "Rinse the sink.",
        "Run lukewarm water over the surface.",
        "If you have a sprayer, use it to rinse the sink.",
        "Otherwise, direct the stream of water over the surface with your hands or a cup.",
        "Keep rinsing until all traces of baking soda and limescale are gone.",
        "Dry the sink.",
        "Use a clean cloth or towel with a soft texture.",
        "Move in gentle circular strokes with the grain.",
        "Continue until the surface of the sink is completely dry.",
        "If you leave any water deposits, the lime or calcium in your water will contribute to new buildup."
    ]
}