{
    "title": "How to Start a Hot Tub",
    "url": "https://www.wikihow.com/Start-a-Hot-Tub",
    "category_hierarchy": [
        "Home and Garden",
        "Swimming Pools",
        "Hot Tubs"
    ],
    "parts": [
        {
            "name": "Cleaning the Tub",
            "steps": [
                {
                    "headline": "Shut off power to the hot tub.",
                    "description": "While cleaning and getting your hot tub ready, you might accidentally turn it on. Running your hot tub without water or too little water can damage its pump and heater. To prevent this from happening, set your hot tub fuse in your fuse box or electrical panel to “Off.”\nDepending on your home, the location of your fuse box or electrical panel may vary. Frequently, these are located in basements, utility closets, or garages."
                },
                {
                    "headline": "Clear off and clean the hot tub cover.",
                    "description": "Use your hands to remove clumps of leaves and large debris. Rinse the cover with a hose. Mix a half cup (118 ml) of white vinegar in about 3 gallons (11.4 L) of water. Dampen a clean cloth in the solution and wipe the surface of the cover clean. Air dry the cover, then put it away. Some covers may be damaged by harsh cleaners, like bleach. Follow the cover’s care instructions for best results."
                },
                {
                    "headline": "Inspect the condition of the tub.",
                    "description": "Cold water left in your tub during the winter months may have frozen at some point and expanded. This may have caused cracks or splits in your tub. If you notice damage like this, call a hot tub professional to determine your best options for repair."
                },
                {
                    "headline": "Wipe down the inside of the tub with bleach and water.",
                    "description": "Combine a half cup (118 ml) of bleach with 3 gallons (11.4 L) of water in a bucket. Wet a rag in the solution and thoroughly wipe down the entire inside of the tub. Rinse the tub with clean water. Dry remaining water in the tub with towels. Bleach is a harsh chemical. Protect your hands from irritation while working with bleach by wearing a pair of rubber gloves. Always be careful when working with bleach, as it can easily discolor dyed fabric. For this reason, you may want to clean in old clothes or a smock."
                },
                {
                    "headline": "Check drain plugs and fittings.",
                    "description": "Inside the service cabinet on the tub should be several unfastened or opened fittings. Connect and tighten these as directed in your tub’s user manual. Install any plugs removed for the winter. Close all drain valves and open slide valves. Look over the heater for loose connections or missing plugs. Refasten loose connections and replace any plugs that are missing. Replacement parts for your hot tub can be found at most pool and spa stores. In some cases, you may need to order parts from the tub manufacturer."
                },
                {
                    "headline": "Insert a clean filter cartridge.",
                    "description": "When starting up your hot tub, use a clean filter. Open the tub’s filter access. Remove and dispose of the old filter. Replace this with the new filter. Verify the filter is securely installed, then close the filter access. Filter’s can be cleaned and reused. Soak dirty filters in a filter cleaner according to the cleaner’s directions, then replace the filter."
                }
            ]
        },
        {
            "name": "Filling the Tub",
            "steps": [
                {
                    "headline": "Fill the tub with water.",
                    "description": "Feed a garden hose into the filter well of your tub so air is pushed out of its pipes as it fills. Turn on the hose and wait until the tub fills to the appropriate level. Always fill your tub to the level indicated in its user manual and be sure to maintain this level. Low water levels can cause damage to your tub. Take a moment at this point to look over your hot tub. If you see any leaks, turn off the water supply and tighten fixtures until the leaking stops or repair the leak."
                },
                {
                    "headline": "Sanitize the water.",
                    "description": "The amount of sanitizer you use will depend on the size of your tub. Check its user manual to find its volume in gallons or liters. Generally, most hot tubs use one of three kinds of sanitizing agent:\nPowdered chlorine (dichlor). For every 500 gallons (1893 L) use 3 tsp (15 ml). Powdered bromine. For every 500 gallons (1893 L) use 2½ oz (74 ml). 2-part Bromine, like Baqua Spa Sanitize #3. For every 500 gallons (1893 L) use 3 oz (89 ml)."
                },
                {
                    "headline": "Circulate the sanitizer through the tub.",
                    "description": "Set the heater to “Off” or its lowest setting. Return power to your hot tub by switching its fuse to “On” in the fuse box or electrical panel. Turn on the hot tub at its control panel and then allow it to run for at least two hours. As the sanitizer flows through pipes and filters, it will neutralize bacteria in them and break up buildup. When the jets of your tub discharge a steady, uninterrupted flow of water, the air from your lines has been purged."
                },
                {
                    "headline": "Drain the tub.",
                    "description": "Turn off the tub and heater. Depending on your hot tub, the drainage process may vary slightly. Generally, you’ll need to remove a plug or open a drain valve. This will flush loosened buildup and sludge from your pipes and filter. Drain the water until little to none remains inside."
                },
                {
                    "headline": "Refill the tub with water.",
                    "description": "Reinsert your hose into the filter well of your tub and turn on its water supply. Fill the tub to the proper level. Turn the tub on. When you are certain that water is flowing through your tub’s pipes, set the heater to at least 80°F (26.7°C). It’s especially important that your tub reach at least 80°F when using granular chemicals. These may not dissolve properly in cooler temperature."
                },
                {
                    "headline": "Balance the tub’s chemicals.",
                    "description": "When your tub is heated, use a hot tub testing kit to determine its pH and alkalinity. The pH should be between 7.6 and 8.2. Balance this with a pH adjusting agent, like pH Plus or Minus. Alkalinity should be between 100 and 120. Adjust this with a suitable agent, like Alkalinity Plus. Check and adjust the chemistry of your hot tub at least once or twice a week. Tubs that are used frequently should be checked more regularly."
                },
                {
                    "headline": "Operate and adjust your tub with the control panel settings.",
                    "description": "When the tub is filled and the chemicals balanced, turn on the tub at its control panel. Set the thermostat on the panel to your preferred temperature. Keep the tub covered while not in use to decrease its electrical cost. Control panels are usually located near the tub, though some may be inside a protective housing, like a wooden box. The control panel for most tubs includes a power switch, jet control, and a heater thermostat. Newer models may also have displays for error messages. The heater should shut off when the water reaches the temperature on the thermostat. The time it takes for your tub to heat up will vary."
                }
            ]
        },
        {
            "name": "Maintaining the Tub",
            "steps": [
                {
                    "headline": "Erase water lines with white vinegar diluted with water.",
                    "description": "Fill a bucket with a mixture made up of half white vinegar and half water. Stir the mixture to evenly distribute the vinegar and water. Dampen a clean cloth in the mixture and wipe water lines as they appear."
                },
                {
                    "headline": "Rinse and clean filter cartridges.",
                    "description": "Turn off your hot tub before doing filter maintenance. Open the filter access and remove the filter cartridge. Rinse it with fresh water every week to remove buildup. Filters should be soaked in a special filter cleaner at least once a month. The more frequently you use your hot tub, the more frequently it’ll need its filter cleaned. Rinse high use tub filters twice a week; soak twice a month."
                },
                {
                    "headline": "Remove buildup from surface oil removers.",
                    "description": "If you use surface oil removers in your hot tub, like scum balls or scum bugs, these should be cleaned weekly. Remove the oil remover from the water and wring it out completely outside the tub. Rinse the oil remover with fresh water. Oil removers should be replaced regularly according to their usage instructions. Check the label or look up the product online to determine when you should replace your oil remover."
                }
            ]
        }
    ],
    "tyn": [
        "Bleach",
        "Bucket",
        "Clean rags",
        "Filter cartridge",
        "Hot tub chemical testing kit or strips",
        "Rubber gloves (optional; recommended)",
        "Towels",
        "White vinegar"
    ],
    "text": " Cleaning the Tub Shut off power to the hot tub. While cleaning and getting your hot tub ready, you might accidentally turn it on. Running your hot tub without water or too little water can damage its pump and heater. To prevent this from happening, set your hot tub fuse in your fuse box or electrical panel to “Off.”\nDepending on your home, the location of your fuse box or electrical panel may vary. Frequently, these are located in basements, utility closets, or garages. Clear off and clean the hot tub cover. Use your hands to remove clumps of leaves and large debris. Rinse the cover with a hose. Mix a half cup (118 ml) of white vinegar in about 3 gallons (11.4 L) of water. Dampen a clean cloth in the solution and wipe the surface of the cover clean. Air dry the cover, then put it away. Some covers may be damaged by harsh cleaners, like bleach. Follow the cover’s care instructions for best results. Inspect the condition of the tub. Cold water left in your tub during the winter months may have frozen at some point and expanded. This may have caused cracks or splits in your tub. If you notice damage like this, call a hot tub professional to determine your best options for repair. Wipe down the inside of the tub with bleach and water. Combine a half cup (118 ml) of bleach with 3 gallons (11.4 L) of water in a bucket. Wet a rag in the solution and thoroughly wipe down the entire inside of the tub. Rinse the tub with clean water. Dry remaining water in the tub with towels. Bleach is a harsh chemical. Protect your hands from irritation while working with bleach by wearing a pair of rubber gloves. Always be careful when working with bleach, as it can easily discolor dyed fabric. For this reason, you may want to clean in old clothes or a smock. Check drain plugs and fittings. Inside the service cabinet on the tub should be several unfastened or opened fittings. Connect and tighten these as directed in your tub’s user manual. Install any plugs removed for the winter. Close all drain valves and open slide valves. Look over the heater for loose connections or missing plugs. Refasten loose connections and replace any plugs that are missing. Replacement parts for your hot tub can be found at most pool and spa stores. In some cases, you may need to order parts from the tub manufacturer. Insert a clean filter cartridge. When starting up your hot tub, use a clean filter. Open the tub’s filter access. Remove and dispose of the old filter. Replace this with the new filter. Verify the filter is securely installed, then close the filter access. Filter’s can be cleaned and reused. Soak dirty filters in a filter cleaner according to the cleaner’s directions, then replace the filter. Filling the Tub Fill the tub with water. Feed a garden hose into the filter well of your tub so air is pushed out of its pipes as it fills. Turn on the hose and wait until the tub fills to the appropriate level. Always fill your tub to the level indicated in its user manual and be sure to maintain this level. Low water levels can cause damage to your tub. Take a moment at this point to look over your hot tub. If you see any leaks, turn off the water supply and tighten fixtures until the leaking stops or repair the leak. Sanitize the water. The amount of sanitizer you use will depend on the size of your tub. Check its user manual to find its volume in gallons or liters. Generally, most hot tubs use one of three kinds of sanitizing agent:\nPowdered chlorine (dichlor). For every 500 gallons (1893 L) use 3 tsp (15 ml). Powdered bromine. For every 500 gallons (1893 L) use 2½ oz (74 ml). 2-part Bromine, like Baqua Spa Sanitize #3. For every 500 gallons (1893 L) use 3 oz (89 ml). Circulate the sanitizer through the tub. Set the heater to “Off” or its lowest setting. Return power to your hot tub by switching its fuse to “On” in the fuse box or electrical panel. Turn on the hot tub at its control panel and then allow it to run for at least two hours. As the sanitizer flows through pipes and filters, it will neutralize bacteria in them and break up buildup. When the jets of your tub discharge a steady, uninterrupted flow of water, the air from your lines has been purged. Drain the tub. Turn off the tub and heater. Depending on your hot tub, the drainage process may vary slightly. Generally, you’ll need to remove a plug or open a drain valve. This will flush loosened buildup and sludge from your pipes and filter. Drain the water until little to none remains inside. Refill the tub with water. Reinsert your hose into the filter well of your tub and turn on its water supply. Fill the tub to the proper level. Turn the tub on. When you are certain that water is flowing through your tub’s pipes, set the heater to at least 80°F (26.7°C). It’s especially important that your tub reach at least 80°F when using granular chemicals. These may not dissolve properly in cooler temperature. Balance the tub’s chemicals. When your tub is heated, use a hot tub testing kit to determine its pH and alkalinity. The pH should be between 7.6 and 8.2. Balance this with a pH adjusting agent, like pH Plus or Minus. Alkalinity should be between 100 and 120. Adjust this with a suitable agent, like Alkalinity Plus. Check and adjust the chemistry of your hot tub at least once or twice a week. Tubs that are used frequently should be checked more regularly. Operate and adjust your tub with the control panel settings. When the tub is filled and the chemicals balanced, turn on the tub at its control panel. Set the thermostat on the panel to your preferred temperature. Keep the tub covered while not in use to decrease its electrical cost. Control panels are usually located near the tub, though some may be inside a protective housing, like a wooden box. The control panel for most tubs includes a power switch, jet control, and a heater thermostat. Newer models may also have displays for error messages. The heater should shut off when the water reaches the temperature on the thermostat. The time it takes for your tub to heat up will vary. Maintaining the Tub Erase water lines with white vinegar diluted with water. Fill a bucket with a mixture made up of half white vinegar and half water. Stir the mixture to evenly distribute the vinegar and water. Dampen a clean cloth in the mixture and wipe water lines as they appear. Rinse and clean filter cartridges. Turn off your hot tub before doing filter maintenance. Open the filter access and remove the filter cartridge. Rinse it with fresh water every week to remove buildup. Filters should be soaked in a special filter cleaner at least once a month. The more frequently you use your hot tub, the more frequently it’ll need its filter cleaned. Rinse high use tub filters twice a week; soak twice a month. Remove buildup from surface oil removers. If you use surface oil removers in your hot tub, like scum balls or scum bugs, these should be cleaned weekly. Remove the oil remover from the water and wring it out completely outside the tub. Rinse the oil remover with fresh water. Oil removers should be replaced regularly according to their usage instructions. Check the label or look up the product online to determine when you should replace your oil remover.",
    "sentences": [
        " Cleaning the Tub Shut off power to the hot tub.",
        "While cleaning and getting your hot tub ready, you might accidentally turn it on.",
        "Running your hot tub without water or too little water can damage its pump and heater.",
        "To prevent this from happening, set your hot tub fuse in your fuse box or electrical panel to “Off.”\nDepending on your home, the location of your fuse box or electrical panel may vary.",
        "Frequently, these are located in basements, utility closets, or garages.",
        "Clear off and clean the hot tub cover.",
        "Use your hands to remove clumps of leaves and large debris.",
        "Rinse the cover with a hose.",
        "Mix a half cup (118 ml) of white vinegar in about 3 gallons (11.4 L) of water.",
        "Dampen a clean cloth in the solution and wipe the surface of the cover clean.",
        "Air dry the cover, then put it away.",
        "Some covers may be damaged by harsh cleaners, like bleach.",
        "Follow the cover’s care instructions for best results.",
        "Inspect the condition of the tub.",
        "Cold water left in your tub during the winter months may have frozen at some point and expanded.",
        "This may have caused cracks or splits in your tub.",
        "If you notice damage like this, call a hot tub professional to determine your best options for repair.",
        "Wipe down the inside of the tub with bleach and water.",
        "Combine a half cup (118 ml) of bleach with 3 gallons (11.4 L) of water in a bucket.",
        "Wet a rag in the solution and thoroughly wipe down the entire inside of the tub.",
        "Rinse the tub with clean water.",
        "Dry remaining water in the tub with towels.",
        "Bleach is a harsh chemical.",
        "Protect your hands from irritation while working with bleach by wearing a pair of rubber gloves.",
        "Always be careful when working with bleach, as it can easily discolor dyed fabric.",
        "For this reason, you may want to clean in old clothes or a smock.",
        "Check drain plugs and fittings.",
        "Inside the service cabinet on the tub should be several unfastened or opened fittings.",
        "Connect and tighten these as directed in your tub’s user manual.",
        "Install any plugs removed for the winter.",
        "Close all drain valves and open slide valves.",
        "Look over the heater for loose connections or missing plugs.",
        "Refasten loose connections and replace any plugs that are missing.",
        "Replacement parts for your hot tub can be found at most pool and spa stores.",
        "In some cases, you may need to order parts from the tub manufacturer.",
        "Insert a clean filter cartridge.",
        "When starting up your hot tub, use a clean filter.",
        "Open the tub’s filter access.",
        "Remove and dispose of the old filter.",
        "Replace this with the new filter.",
        "Verify the filter is securely installed, then close the filter access.",
        "Filter’s can be cleaned and reused.",
        "Soak dirty filters in a filter cleaner according to the cleaner’s directions, then replace the filter.",
        "Filling the Tub Fill the tub with water.",
        "Feed a garden hose into the filter well of your tub so air is pushed out of its pipes as it fills.",
        "Turn on the hose and wait until the tub fills to the appropriate level.",
        "Always fill your tub to the level indicated in its user manual and be sure to maintain this level.",
        "Low water levels can cause damage to your tub.",
        "Take a moment at this point to look over your hot tub.",
        "If you see any leaks, turn off the water supply and tighten fixtures until the leaking stops or repair the leak.",
        "Sanitize the water.",
        "The amount of sanitizer you use will depend on the size of your tub.",
        "Check its user manual to find its volume in gallons or liters.",
        "Generally, most hot tubs use one of three kinds of sanitizing agent:\nPowdered chlorine (dichlor).",
        "For every 500 gallons (1893 L) use 3 tsp (15 ml).",
        "Powdered bromine.",
        "For every 500 gallons (1893 L) use 2½ oz (74 ml).",
        "2-part Bromine, like Baqua Spa Sanitize #3.",
        "For every 500 gallons (1893 L) use 3 oz (89 ml).",
        "Circulate the sanitizer through the tub.",
        "Set the heater to “Off” or its lowest setting.",
        "Return power to your hot tub by switching its fuse to “On” in the fuse box or electrical panel.",
        "Turn on the hot tub at its control panel and then allow it to run for at least two hours.",
        "As the sanitizer flows through pipes and filters, it will neutralize bacteria in them and break up buildup.",
        "When the jets of your tub discharge a steady, uninterrupted flow of water, the air from your lines has been purged.",
        "Drain the tub.",
        "Turn off the tub and heater.",
        "Depending on your hot tub, the drainage process may vary slightly.",
        "Generally, you’ll need to remove a plug or open a drain valve.",
        "This will flush loosened buildup and sludge from your pipes and filter.",
        "Drain the water until little to none remains inside.",
        "Refill the tub with water.",
        "Reinsert your hose into the filter well of your tub and turn on its water supply.",
        "Fill the tub to the proper level.",
        "Turn the tub on.",
        "When you are certain that water is flowing through your tub’s pipes, set the heater to at least 80°F (26.7°C).",
        "It’s especially important that your tub reach at least 80°F when using granular chemicals.",
        "These may not dissolve properly in cooler temperature.",
        "Balance the tub’s chemicals.",
        "When your tub is heated, use a hot tub testing kit to determine its pH and alkalinity.",
        "The pH should be between 7.6 and 8.2.",
        "Balance this with a pH adjusting agent, like pH Plus or Minus.",
        "Alkalinity should be between 100 and 120.",
        "Adjust this with a suitable agent, like Alkalinity Plus.",
        "Check and adjust the chemistry of your hot tub at least once or twice a week.",
        "Tubs that are used frequently should be checked more regularly.",
        "Operate and adjust your tub with the control panel settings.",
        "When the tub is filled and the chemicals balanced, turn on the tub at its control panel.",
        "Set the thermostat on the panel to your preferred temperature.",
        "Keep the tub covered while not in use to decrease its electrical cost.",
        "Control panels are usually located near the tub, though some may be inside a protective housing, like a wooden box.",
        "The control panel for most tubs includes a power switch, jet control, and a heater thermostat.",
        "Newer models may also have displays for error messages.",
        "The heater should shut off when the water reaches the temperature on the thermostat.",
        "The time it takes for your tub to heat up will vary.",
        "Maintaining the Tub Erase water lines with white vinegar diluted with water.",
        "Fill a bucket with a mixture made up of half white vinegar and half water.",
        "Stir the mixture to evenly distribute the vinegar and water.",
        "Dampen a clean cloth in the mixture and wipe water lines as they appear.",
        "Rinse and clean filter cartridges.",
        "Turn off your hot tub before doing filter maintenance.",
        "Open the filter access and remove the filter cartridge.",
        "Rinse it with fresh water every week to remove buildup.",
        "Filters should be soaked in a special filter cleaner at least once a month.",
        "The more frequently you use your hot tub, the more frequently it’ll need its filter cleaned.",
        "Rinse high use tub filters twice a week; soak twice a month.",
        "Remove buildup from surface oil removers.",
        "If you use surface oil removers in your hot tub, like scum balls or scum bugs, these should be cleaned weekly.",
        "Remove the oil remover from the water and wring it out completely outside the tub.",
        "Rinse the oil remover with fresh water.",
        "Oil removers should be replaced regularly according to their usage instructions.",
        "Check the label or look up the product online to determine when you should replace your oil remover."
    ]
}