{
    "title": "How to Clean a Cast Iron Stove",
    "url": "https://www.wikihow.com/Clean-a-Cast-Iron-Stove",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Cleaning"
    ],
    "parts": [
        {
            "name": "Cleaning the Inside of the Stove",
            "steps": [
                {
                    "headline": "Place an old newspaper on the ground in front of the stove.",
                    "description": "Do this as a protective measure before you begin scooping ashes out of the stove, as they are liable to drop onto the ground. A newspaper will make cleanup much easier. As you’re spreading the newspaper, open the air dampener so that any ash stuck to it will fall into the firebox. The air dampener will be a small knob on the front of the cast iron stove, that you should pull outward to open. If the stove is still warm, use a piece of hooked metal to pull the air dampener open."
                },
                {
                    "headline": "Scoop the ashes out of the fire box.",
                    "description": "Open the glass door on the front of the cast iron stove and, using your metal ash shovel, scoop up all of the leftover ash inside of the stove. Place the shovelfuls of ash into a metal ash bucket. Be meticulous when cleaning the ashes out of the stove; you’ll be able to start your next fire much more easily if there are no leftover ashes in the firebox. Before you begin scooping up the ashes, make sure that the fire is completely out, and there are no live coals. If there are still any red-hot coals, wait for them to cool and go out before shoveling them up."
                },
                {
                    "headline": "Cover the ash can.",
                    "description": "After you’ve finished shoveling the ashes out of the firebox, place the lid back on the ash can. Set the can on a non-flammable surface, like brick or tile. It’s important to let the ash can sit for at least 48 hours before you dispose of the ashes, in case there are still any live coals in the ash. It’s important to keep the can covered, as a slight breeze could lift ash and soot from the can and send it flying through your house. Once you’ve tossed the ashes, you can also pick up the newspapers that you initially spread on the carpet. Be careful not to spill any ash on the floor. Throw the newspapers away."
                },
                {
                    "headline": "Dispose of the ashes.",
                    "description": "When the ash bucket is full (after you’ve shoveled out the fire box several times), you’ll need to dispose of the ashes and empty the bucket. If you live in a rural area, you can simply walk a few hundred feet from your house and spread the ashes out on the ground. Alternately, if you have a compost pile or a garden, toss the ashes on top of the soil. If it’s windy outside, wait for the wind to die down before you spread the ashes. Dormant embers may re-ignite in a strong wind."
                }
            ]
        },
        {
            "name": "Cleaning the Outside of the Stove",
            "steps": [
                {
                    "headline": "Scrape rust off with a wire brush.",
                    "description": "Depending on how old the stove is and how much rust and grime has built up on its outer surface, this may take some serious scrubbing. Focus on applying the wire brush to the top of the cast iron stove, and to other areas where rust is visible. Rust is especially likely to have built up if you’ve rested metal on the top of the cast iron stove. People often leave tea kettles on top, or use the heat of the stove to cook pans of food or raise bread dough. These uses will contribute to rust and grime on the stovetop."
                },
                {
                    "headline": "Apply sandpaper to the exterior of the stove.",
                    "description": "Once you’ve cleaned off the majority of the rust and built-up grime with the wire brush, you can use sandpaper to get of any remaining rust and to generally clean the outside of the cast iron stove. Start with a coarse grain sandpaper, such as 150-grit. Then move on to a more fine-grained sandpaper, even one as fine as 400-grit. Sand the entire outer surface of the cast iron stove. This will remove any marks or scratches made by the wire brush or by the coarse grain sandpaper."
                },
                {
                    "headline": "Wipe the stove down with a vinegar cleaning mixture.",
                    "description": "After you’ve finished sanding the stove, you can clean any lingering smudges of ash or dirt off of the exterior surface using a vinegar cleaning solution. Spray the solution across the surface of the cast iron stove, and wipe it clean using a few old rags. Let the stove dry before you light the next fire inside. To make the vinegar cleaning solution, find an empty spray bottle, and combine inside two parts water to one part vinegar, then add a small amount of dish soap. Shake the spray bottle, and the cleaning solution will be ready to use."
                }
            ]
        },
        {
            "name": "Cleaning the Glass Door and Chimney",
            "steps": [
                {
                    "headline": "Purchase a glass cleaning solution.",
                    "description": "The glass doors on a cast iron stove often become entirely blackened with built up soot and smoke, and can be difficult to clean. The best product to use for the task is a glass cleaning solution that has been specifically designed to clean wood stove front doors. Spray the product onto a couple of old rags, and use the wet rags to wipe the glass door clean. This product should be available at your local hardware store. If you’re having trouble finding it, speak to the sales staff and ask for their assistance. Glass cleaning solution contains ammonia, so be careful not to get any in your eyes. Do not inhale the solution."
                },
                {
                    "headline": "Clean with a mixture of vinegar, water, and soap.",
                    "description": "If you’d prefer to use a non-toxic cleaning solution for the glass door, find or purchase an empty spray bottle. Mix two parts water to one part clear vinegar, and then add a squirt of regular dish soap. Shake the bottle to mix the ingredients. Then, you can spray the vinegar solution directly onto the glass, and rub it clean using old rags. You can find all of these products at your local grocery store or drug store. If you’re already at a hardware store shopping for the other necessary materials, you may be able to find vinegar and a spray bottle there as well. If there are any ashes in the cast iron stove, you can mix in a handful to your mixture before you wipe down the glass. The ashes make the glass noticeably shinier and reduce streaks."
                },
                {
                    "headline": "Clean the chimney and chimney cap.",
                    "description": "Creosote (deposits of tar) will build up at the top of the chimney, and if left long enough, can catch fire and cause a chimney fire. To prevent this and to keep the top of the chimney clean, you’ll need to access the top of the flue via the roof. Remove the chimney cap, and, using a stiff-bristled chimney brush, scrape all of the creosote and deposits of ash and soot. Also brush any built-up creosote off of the chimney cap. You’ll need to climb up on the roof for this step, so take the necessary safety precautions. Have a second person help you by stabilizing the base of the ladder while you’re climbing up. Avoid standing or walking near the edges of the roof, and don’t climb up on a windy day."
                }
            ]
        }
    ],
    "tyn": [
        "Newspaper",
        "Metal shovel",
        "Ash bucket",
        "Wire brush",
        "Sandpaper (400 and 150 grit)",
        "Glass cleaner solution",
        "Old rags",
        "Chimney brush",
        "Spray bottle (optional)",
        "Vinegar (optional)",
        "Dish soap (optional)"
    ],
    "text": " Cleaning the Inside of the Stove Place an old newspaper on the ground in front of the stove. Do this as a protective measure before you begin scooping ashes out of the stove, as they are liable to drop onto the ground. A newspaper will make cleanup much easier. As you’re spreading the newspaper, open the air dampener so that any ash stuck to it will fall into the firebox. The air dampener will be a small knob on the front of the cast iron stove, that you should pull outward to open. If the stove is still warm, use a piece of hooked metal to pull the air dampener open. Scoop the ashes out of the fire box. Open the glass door on the front of the cast iron stove and, using your metal ash shovel, scoop up all of the leftover ash inside of the stove. Place the shovelfuls of ash into a metal ash bucket. Be meticulous when cleaning the ashes out of the stove; you’ll be able to start your next fire much more easily if there are no leftover ashes in the firebox. Before you begin scooping up the ashes, make sure that the fire is completely out, and there are no live coals. If there are still any red-hot coals, wait for them to cool and go out before shoveling them up. Cover the ash can. After you’ve finished shoveling the ashes out of the firebox, place the lid back on the ash can. Set the can on a non-flammable surface, like brick or tile. It’s important to let the ash can sit for at least 48 hours before you dispose of the ashes, in case there are still any live coals in the ash. It’s important to keep the can covered, as a slight breeze could lift ash and soot from the can and send it flying through your house. Once you’ve tossed the ashes, you can also pick up the newspapers that you initially spread on the carpet. Be careful not to spill any ash on the floor. Throw the newspapers away. Dispose of the ashes. When the ash bucket is full (after you’ve shoveled out the fire box several times), you’ll need to dispose of the ashes and empty the bucket. If you live in a rural area, you can simply walk a few hundred feet from your house and spread the ashes out on the ground. Alternately, if you have a compost pile or a garden, toss the ashes on top of the soil. If it’s windy outside, wait for the wind to die down before you spread the ashes. Dormant embers may re-ignite in a strong wind. Cleaning the Outside of the Stove Scrape rust off with a wire brush. Depending on how old the stove is and how much rust and grime has built up on its outer surface, this may take some serious scrubbing. Focus on applying the wire brush to the top of the cast iron stove, and to other areas where rust is visible. Rust is especially likely to have built up if you’ve rested metal on the top of the cast iron stove. People often leave tea kettles on top, or use the heat of the stove to cook pans of food or raise bread dough. These uses will contribute to rust and grime on the stovetop. Apply sandpaper to the exterior of the stove. Once you’ve cleaned off the majority of the rust and built-up grime with the wire brush, you can use sandpaper to get of any remaining rust and to generally clean the outside of the cast iron stove. Start with a coarse grain sandpaper, such as 150-grit. Then move on to a more fine-grained sandpaper, even one as fine as 400-grit. Sand the entire outer surface of the cast iron stove. This will remove any marks or scratches made by the wire brush or by the coarse grain sandpaper. Wipe the stove down with a vinegar cleaning mixture. After you’ve finished sanding the stove, you can clean any lingering smudges of ash or dirt off of the exterior surface using a vinegar cleaning solution. Spray the solution across the surface of the cast iron stove, and wipe it clean using a few old rags. Let the stove dry before you light the next fire inside. To make the vinegar cleaning solution, find an empty spray bottle, and combine inside two parts water to one part vinegar, then add a small amount of dish soap. Shake the spray bottle, and the cleaning solution will be ready to use. Cleaning the Glass Door and Chimney Purchase a glass cleaning solution. The glass doors on a cast iron stove often become entirely blackened with built up soot and smoke, and can be difficult to clean. The best product to use for the task is a glass cleaning solution that has been specifically designed to clean wood stove front doors. Spray the product onto a couple of old rags, and use the wet rags to wipe the glass door clean. This product should be available at your local hardware store. If you’re having trouble finding it, speak to the sales staff and ask for their assistance. Glass cleaning solution contains ammonia, so be careful not to get any in your eyes. Do not inhale the solution. Clean with a mixture of vinegar, water, and soap. If you’d prefer to use a non-toxic cleaning solution for the glass door, find or purchase an empty spray bottle. Mix two parts water to one part clear vinegar, and then add a squirt of regular dish soap. Shake the bottle to mix the ingredients. Then, you can spray the vinegar solution directly onto the glass, and rub it clean using old rags. You can find all of these products at your local grocery store or drug store. If you’re already at a hardware store shopping for the other necessary materials, you may be able to find vinegar and a spray bottle there as well. If there are any ashes in the cast iron stove, you can mix in a handful to your mixture before you wipe down the glass. The ashes make the glass noticeably shinier and reduce streaks. Clean the chimney and chimney cap. Creosote (deposits of tar) will build up at the top of the chimney, and if left long enough, can catch fire and cause a chimney fire. To prevent this and to keep the top of the chimney clean, you’ll need to access the top of the flue via the roof. Remove the chimney cap, and, using a stiff-bristled chimney brush, scrape all of the creosote and deposits of ash and soot. Also brush any built-up creosote off of the chimney cap. You’ll need to climb up on the roof for this step, so take the necessary safety precautions. Have a second person help you by stabilizing the base of the ladder while you’re climbing up. Avoid standing or walking near the edges of the roof, and don’t climb up on a windy day.",
    "sentences": [
        " Cleaning the Inside of the Stove Place an old newspaper on the ground in front of the stove.",
        "Do this as a protective measure before you begin scooping ashes out of the stove, as they are liable to drop onto the ground.",
        "A newspaper will make cleanup much easier.",
        "As you’re spreading the newspaper, open the air dampener so that any ash stuck to it will fall into the firebox.",
        "The air dampener will be a small knob on the front of the cast iron stove, that you should pull outward to open.",
        "If the stove is still warm, use a piece of hooked metal to pull the air dampener open.",
        "Scoop the ashes out of the fire box.",
        "Open the glass door on the front of the cast iron stove and, using your metal ash shovel, scoop up all of the leftover ash inside of the stove.",
        "Place the shovelfuls of ash into a metal ash bucket.",
        "Be meticulous when cleaning the ashes out of the stove; you’ll be able to start your next fire much more easily if there are no leftover ashes in the firebox.",
        "Before you begin scooping up the ashes, make sure that the fire is completely out, and there are no live coals.",
        "If there are still any red-hot coals, wait for them to cool and go out before shoveling them up.",
        "Cover the ash can.",
        "After you’ve finished shoveling the ashes out of the firebox, place the lid back on the ash can.",
        "Set the can on a non-flammable surface, like brick or tile.",
        "It’s important to let the ash can sit for at least 48 hours before you dispose of the ashes, in case there are still any live coals in the ash.",
        "It’s important to keep the can covered, as a slight breeze could lift ash and soot from the can and send it flying through your house.",
        "Once you’ve tossed the ashes, you can also pick up the newspapers that you initially spread on the carpet.",
        "Be careful not to spill any ash on the floor.",
        "Throw the newspapers away.",
        "Dispose of the ashes.",
        "When the ash bucket is full (after you’ve shoveled out the fire box several times), you’ll need to dispose of the ashes and empty the bucket.",
        "If you live in a rural area, you can simply walk a few hundred feet from your house and spread the ashes out on the ground.",
        "Alternately, if you have a compost pile or a garden, toss the ashes on top of the soil.",
        "If it’s windy outside, wait for the wind to die down before you spread the ashes.",
        "Dormant embers may re-ignite in a strong wind.",
        "Cleaning the Outside of the Stove Scrape rust off with a wire brush.",
        "Depending on how old the stove is and how much rust and grime has built up on its outer surface, this may take some serious scrubbing.",
        "Focus on applying the wire brush to the top of the cast iron stove, and to other areas where rust is visible.",
        "Rust is especially likely to have built up if you’ve rested metal on the top of the cast iron stove.",
        "People often leave tea kettles on top, or use the heat of the stove to cook pans of food or raise bread dough.",
        "These uses will contribute to rust and grime on the stovetop.",
        "Apply sandpaper to the exterior of the stove.",
        "Once you’ve cleaned off the majority of the rust and built-up grime with the wire brush, you can use sandpaper to get of any remaining rust and to generally clean the outside of the cast iron stove.",
        "Start with a coarse grain sandpaper, such as 150-grit.",
        "Then move on to a more fine-grained sandpaper, even one as fine as 400-grit.",
        "Sand the entire outer surface of the cast iron stove.",
        "This will remove any marks or scratches made by the wire brush or by the coarse grain sandpaper.",
        "Wipe the stove down with a vinegar cleaning mixture.",
        "After you’ve finished sanding the stove, you can clean any lingering smudges of ash or dirt off of the exterior surface using a vinegar cleaning solution.",
        "Spray the solution across the surface of the cast iron stove, and wipe it clean using a few old rags.",
        "Let the stove dry before you light the next fire inside.",
        "To make the vinegar cleaning solution, find an empty spray bottle, and combine inside two parts water to one part vinegar, then add a small amount of dish soap.",
        "Shake the spray bottle, and the cleaning solution will be ready to use.",
        "Cleaning the Glass Door and Chimney Purchase a glass cleaning solution.",
        "The glass doors on a cast iron stove often become entirely blackened with built up soot and smoke, and can be difficult to clean.",
        "The best product to use for the task is a glass cleaning solution that has been specifically designed to clean wood stove front doors.",
        "Spray the product onto a couple of old rags, and use the wet rags to wipe the glass door clean.",
        "This product should be available at your local hardware store.",
        "If you’re having trouble finding it, speak to the sales staff and ask for their assistance.",
        "Glass cleaning solution contains ammonia, so be careful not to get any in your eyes.",
        "Do not inhale the solution.",
        "Clean with a mixture of vinegar, water, and soap.",
        "If you’d prefer to use a non-toxic cleaning solution for the glass door, find or purchase an empty spray bottle.",
        "Mix two parts water to one part clear vinegar, and then add a squirt of regular dish soap.",
        "Shake the bottle to mix the ingredients.",
        "Then, you can spray the vinegar solution directly onto the glass, and rub it clean using old rags.",
        "You can find all of these products at your local grocery store or drug store.",
        "If you’re already at a hardware store shopping for the other necessary materials, you may be able to find vinegar and a spray bottle there as well.",
        "If there are any ashes in the cast iron stove, you can mix in a handful to your mixture before you wipe down the glass.",
        "The ashes make the glass noticeably shinier and reduce streaks.",
        "Clean the chimney and chimney cap.",
        "Creosote (deposits of tar) will build up at the top of the chimney, and if left long enough, can catch fire and cause a chimney fire.",
        "To prevent this and to keep the top of the chimney clean, you’ll need to access the top of the flue via the roof.",
        "Remove the chimney cap, and, using a stiff-bristled chimney brush, scrape all of the creosote and deposits of ash and soot.",
        "Also brush any built-up creosote off of the chimney cap.",
        "You’ll need to climb up on the roof for this step, so take the necessary safety precautions.",
        "Have a second person help you by stabilizing the base of the ladder while you’re climbing up.",
        "Avoid standing or walking near the edges of the roof, and don’t climb up on a windy day."
    ]
}