{
    "title": "How to Clean an Oven Without Chemicals",
    "url": "https://www.wikihow.com/Clean-an-Oven-Without-Chemicals",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Cleaning"
    ],
    "methods": [
        {
            "name": "Cleaning with Lemon",
            "steps": [
                {
                    "headline": "Cut the lemons.",
                    "description": "Cut two lemons in half. Squeeze the lemon juice into a baking dish. Put the rest of the lemons into the dish. Fill the dish a third of the way with water. If you don’t have lemons, you can use another type of citrus, like oranges."
                },
                {
                    "headline": "Place the baking dish in the oven.",
                    "description": "Turn the oven on to 250°F (121.1°C). Leave the oven on for 30 minutes. Leave the dish in the oven for longer than 30 minutes if there is a lot of build-up in the oven."
                },
                {
                    "headline": "Scrub the oven.",
                    "description": "Remove the dish from the oven after 30 minutes. The lemons act as a natural degreaser and will cause the build-up in the oven to loosen up. Use a scouring pad to remove the loosened build-up. You may need to use a spatula to remove larger chunks of build-up. Wait a few minutes for the oven to cool down before you clean. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAshley Matuska\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tAshley Matuska is the owner and founder of Dashing Maids, a sustainably focused cleaning agency in Denver, Colorado. She has worked in the cleaning industry for over 5 years. Ashley Matuska\t\t\tCleaning Guru\t\t\t\tUse different scrubbers for different types of stains. Ashley Matuska suggests: \"For tough stains on the interior try a pumice stick. You can also use steel wool, but be careful as this can scratch the surface of the oven. For oven window stains use a razor blade to scrape away the residue. For small stains or ones that haven't dried, you can use the rougher side of a sponge and some soap."
                },
                {
                    "headline": "Rinse off the oven.",
                    "description": "Use the leftover lemon water in the baking dish to rinse off the oven. Dip a sponge in the water, and wash off the remainder of the grime. Continue to scrub until the oven is clean. Use a towel to dry off the lemon water. Smoke may emit from the oven while you are cleaning. Open a window and/or turn on the oven fan if this occurs."
                }
            ]
        },
        {
            "name": "Using Baking Soda and Vinegar",
            "steps": [
                {
                    "headline": "Take everything out of the oven.",
                    "description": "First, remove the oven racks. Then take out anything else that may be in the oven, like a baking stone or thermometer. Check to make sure everything has been removed before you begin to clean. If there are any stains on your baking stone when you remove it, now can be a good time to clean it separately."
                },
                {
                    "headline": "Create a paste.",
                    "description": "Mix a ½ cup (170 g) of baking soda with about 3 tablespoons (44.4 mL) of water in a bowl. You can adjust the amount of water if necessary. The mixture should create a spreadable paste."
                },
                {
                    "headline": "Coat the oven with the paste.",
                    "description": "Wear rubber gloves to spread the paste all over the inside of the oven. You can also use a spatula to spread the paste if you don’t want to use your hands. Coat every part of the inside of the oven except the heating elements. The paste may turn brown and/or chunky in some areas. That is normal."
                },
                {
                    "headline": "Let the paste sit overnight.",
                    "description": "Allow the paste to sit for 12 hours or overnight. If you don’t have that much time, let the paste sit for 40 minutes. You may have to let the paste sit again for 30-40 more minutes if the paste doesn’t work as well as desired the first time."
                },
                {
                    "headline": "Wipe the oven down.",
                    "description": "Use a cloth that has been dampened with water to wipe off the paste. You may have to scrub hard to remove some of the paste. If scrubbing doesn’t work, use a spatula to remove as much of the paste as possible."
                },
                {
                    "headline": "Use vinegar.",
                    "description": "Pour white vinegar into a spray bottle. Spray the vinegar inside the oven. The vinegar will cause the paste to foam. Use a damp a cloth to wipe off any residue that remains."
                },
                {
                    "headline": "Put everything back inside the oven.",
                    "description": "Replace the racks inside of the oven once it dries out. You can allow the oven to air dry, or you can use a towel. Put anything else that was in the oven back inside, such as the oven thermometer. The oven should be clean and shiny."
                }
            ]
        },
        {
            "name": "Applying Salt and Vinegar",
            "steps": [
                {
                    "headline": "Turn on the oven.",
                    "description": "Turn the temperature to 150°F (65.5°C). You can choose to clean when the oven is still warm after baking. Clean the oven while it is still warm if you’ve spilled something while baking."
                },
                {
                    "headline": "Sprinkle salt into the oven.",
                    "description": "You can use regular table salt. Spread a generous amount of salt onto the floor of the oven. You don’t have to completely cover the oven floor, but there should be a thin layer of salt."
                },
                {
                    "headline": "Scrub while the oven is still warm.",
                    "description": "Put on oven mitts before you scrub. Use a sponge or rag to scrub before the oven cools down. Scrub until the build-up begins to lift and come off."
                },
                {
                    "headline": "Finish with vinegar and water.",
                    "description": "Spray white vinegar into the oven. Use a rag that has been dampened with water to remove the rest of the spill or build-up. Use a paper towel to dry the oven."
                }
            ]
        }
    ],
    "tyn": [
        "2 lemons",
        "Sponge",
        "Cloth",
        "Baking soda",
        "White vinegar",
        "Salt"
    ],
    "text": " Cleaning with Lemon Cut the lemons. Cut two lemons in half. Squeeze the lemon juice into a baking dish. Put the rest of the lemons into the dish. Fill the dish a third of the way with water. If you don’t have lemons, you can use another type of citrus, like oranges. Place the baking dish in the oven. Turn the oven on to 250°F (121.1°C). Leave the oven on for 30 minutes. Leave the dish in the oven for longer than 30 minutes if there is a lot of build-up in the oven. Scrub the oven. Remove the dish from the oven after 30 minutes. The lemons act as a natural degreaser and will cause the build-up in the oven to loosen up. Use a scouring pad to remove the loosened build-up. You may need to use a spatula to remove larger chunks of build-up. Wait a few minutes for the oven to cool down before you clean. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAshley Matuska\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tAshley Matuska is the owner and founder of Dashing Maids, a sustainably focused cleaning agency in Denver, Colorado. She has worked in the cleaning industry for over 5 years. Ashley Matuska\t\t\tCleaning Guru\t\t\t\tUse different scrubbers for different types of stains. Ashley Matuska suggests: \"For tough stains on the interior try a pumice stick. You can also use steel wool, but be careful as this can scratch the surface of the oven. For oven window stains use a razor blade to scrape away the residue. For small stains or ones that haven't dried, you can use the rougher side of a sponge and some soap. Rinse off the oven. Use the leftover lemon water in the baking dish to rinse off the oven. Dip a sponge in the water, and wash off the remainder of the grime. Continue to scrub until the oven is clean. Use a towel to dry off the lemon water. Smoke may emit from the oven while you are cleaning. Open a window and/or turn on the oven fan if this occurs. Using Baking Soda and Vinegar Take everything out of the oven. First, remove the oven racks. Then take out anything else that may be in the oven, like a baking stone or thermometer. Check to make sure everything has been removed before you begin to clean. If there are any stains on your baking stone when you remove it, now can be a good time to clean it separately. Create a paste. Mix a ½ cup (170 g) of baking soda with about 3 tablespoons (44.4 mL) of water in a bowl. You can adjust the amount of water if necessary. The mixture should create a spreadable paste. Coat the oven with the paste. Wear rubber gloves to spread the paste all over the inside of the oven. You can also use a spatula to spread the paste if you don’t want to use your hands. Coat every part of the inside of the oven except the heating elements. The paste may turn brown and/or chunky in some areas. That is normal. Let the paste sit overnight. Allow the paste to sit for 12 hours or overnight. If you don’t have that much time, let the paste sit for 40 minutes. You may have to let the paste sit again for 30-40 more minutes if the paste doesn’t work as well as desired the first time. Wipe the oven down. Use a cloth that has been dampened with water to wipe off the paste. You may have to scrub hard to remove some of the paste. If scrubbing doesn’t work, use a spatula to remove as much of the paste as possible. Use vinegar. Pour white vinegar into a spray bottle. Spray the vinegar inside the oven. The vinegar will cause the paste to foam. Use a damp a cloth to wipe off any residue that remains. Put everything back inside the oven. Replace the racks inside of the oven once it dries out. You can allow the oven to air dry, or you can use a towel. Put anything else that was in the oven back inside, such as the oven thermometer. The oven should be clean and shiny. Applying Salt and Vinegar Turn on the oven. Turn the temperature to 150°F (65.5°C). You can choose to clean when the oven is still warm after baking. Clean the oven while it is still warm if you’ve spilled something while baking. Sprinkle salt into the oven. You can use regular table salt. Spread a generous amount of salt onto the floor of the oven. You don’t have to completely cover the oven floor, but there should be a thin layer of salt. Scrub while the oven is still warm. Put on oven mitts before you scrub. Use a sponge or rag to scrub before the oven cools down. Scrub until the build-up begins to lift and come off. Finish with vinegar and water. Spray white vinegar into the oven. Use a rag that has been dampened with water to remove the rest of the spill or build-up. Use a paper towel to dry the oven.",
    "sentences": [
        " Cleaning with Lemon Cut the lemons.",
        "Cut two lemons in half.",
        "Squeeze the lemon juice into a baking dish.",
        "Put the rest of the lemons into the dish.",
        "Fill the dish a third of the way with water.",
        "If you don’t have lemons, you can use another type of citrus, like oranges.",
        "Place the baking dish in the oven.",
        "Turn the oven on to 250°F (121.1°C).",
        "Leave the oven on for 30 minutes.",
        "Leave the dish in the oven for longer than 30 minutes if there is a lot of build-up in the oven.",
        "Scrub the oven.",
        "Remove the dish from the oven after 30 minutes.",
        "The lemons act as a natural degreaser and will cause the build-up in the oven to loosen up.",
        "Use a scouring pad to remove the loosened build-up.",
        "You may need to use a spatula to remove larger chunks of build-up.",
        "Wait a few minutes for the oven to cool down before you clean.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAshley Matuska\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tAshley Matuska is the owner and founder of Dashing Maids, a sustainably focused cleaning agency in Denver, Colorado.",
        "She has worked in the cleaning industry for over 5 years.",
        "Ashley Matuska\t\t\tCleaning Guru\t\t\t\tUse different scrubbers for different types of stains.",
        "Ashley Matuska suggests: \"For tough stains on the interior try a pumice stick.",
        "You can also use steel wool, but be careful as this can scratch the surface of the oven.",
        "For oven window stains use a razor blade to scrape away the residue.",
        "For small stains or ones that haven't dried, you can use the rougher side of a sponge and some soap.",
        "Rinse off the oven.",
        "Use the leftover lemon water in the baking dish to rinse off the oven.",
        "Dip a sponge in the water, and wash off the remainder of the grime.",
        "Continue to scrub until the oven is clean.",
        "Use a towel to dry off the lemon water.",
        "Smoke may emit from the oven while you are cleaning.",
        "Open a window and/or turn on the oven fan if this occurs.",
        "Using Baking Soda and Vinegar Take everything out of the oven.",
        "First, remove the oven racks.",
        "Then take out anything else that may be in the oven, like a baking stone or thermometer.",
        "Check to make sure everything has been removed before you begin to clean.",
        "If there are any stains on your baking stone when you remove it, now can be a good time to clean it separately.",
        "Create a paste.",
        "Mix a ½ cup (170 g) of baking soda with about 3 tablespoons (44.4 mL) of water in a bowl.",
        "You can adjust the amount of water if necessary.",
        "The mixture should create a spreadable paste.",
        "Coat the oven with the paste.",
        "Wear rubber gloves to spread the paste all over the inside of the oven.",
        "You can also use a spatula to spread the paste if you don’t want to use your hands.",
        "Coat every part of the inside of the oven except the heating elements.",
        "The paste may turn brown and/or chunky in some areas.",
        "That is normal.",
        "Let the paste sit overnight.",
        "Allow the paste to sit for 12 hours or overnight.",
        "If you don’t have that much time, let the paste sit for 40 minutes.",
        "You may have to let the paste sit again for 30-40 more minutes if the paste doesn’t work as well as desired the first time.",
        "Wipe the oven down.",
        "Use a cloth that has been dampened with water to wipe off the paste.",
        "You may have to scrub hard to remove some of the paste.",
        "If scrubbing doesn’t work, use a spatula to remove as much of the paste as possible.",
        "Use vinegar.",
        "Pour white vinegar into a spray bottle.",
        "Spray the vinegar inside the oven.",
        "The vinegar will cause the paste to foam.",
        "Use a damp a cloth to wipe off any residue that remains.",
        "Put everything back inside the oven.",
        "Replace the racks inside of the oven once it dries out.",
        "You can allow the oven to air dry, or you can use a towel.",
        "Put anything else that was in the oven back inside, such as the oven thermometer.",
        "The oven should be clean and shiny.",
        "Applying Salt and Vinegar Turn on the oven.",
        "Turn the temperature to 150°F (65.5°C).",
        "You can choose to clean when the oven is still warm after baking.",
        "Clean the oven while it is still warm if you’ve spilled something while baking.",
        "Sprinkle salt into the oven.",
        "You can use regular table salt.",
        "Spread a generous amount of salt onto the floor of the oven.",
        "You don’t have to completely cover the oven floor, but there should be a thin layer of salt.",
        "Scrub while the oven is still warm.",
        "Put on oven mitts before you scrub.",
        "Use a sponge or rag to scrub before the oven cools down.",
        "Scrub until the build-up begins to lift and come off.",
        "Finish with vinegar and water.",
        "Spray white vinegar into the oven.",
        "Use a rag that has been dampened with water to remove the rest of the spill or build-up.",
        "Use a paper towel to dry the oven."
    ]
}