{
    "title": "How to Make a Giant Jenga Set",
    "url": "https://www.wikihow.com/Make-a-Giant-Jenga-Set",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games"
    ],
    "parts": [
        {
            "name": "Cutting the Game Pieces",
            "steps": [
                {
                    "headline": "Wear safety glasses and a mask when using an electric saw.",
                    "description": "An electric saw will help you finish this project more quickly, but the sawdust created by this tool can be an eye and lung irritant. Protect your eyes and lungs by wearing safety glasses and a mask while cutting. Electric sanders, too, can launch fine bits of sawdust into the air. Whenever using an electric sander, wear safety glasses and a mask."
                },
                {
                    "headline": "Measure and cut the pieces.",
                    "description": "Use your tape measure and a pencil to mark 10½ in (26.7 cm) segments on the 16 in (40.6 cm) 2x4 boards. Cut the boards into pieces at these marks with a circular saw or hand saw. Be precise; poorly cut pieces will stick out irregularly from your giant Jenga set. Wood may move while you cut it, making it difficult to cut precisely. Use clamps to hold the wood in place while sawing. Always use dangerous tools, like saw, with caution. Improper usage may cause injury or property damage. Circular saws are intended for right-handed users. If you are left-handed, be extra careful when using this tool."
                },
                {
                    "headline": "Sand the cut edges of the game pieces.",
                    "description": "After being cut, the pieces of your Jenga set will likely be rough where they were cut. Prevent splinters or cuts from wood burrs and jagged pieces of wood by sanding the edges until smooth. Although it shouldn't take too long for your to hand sand the edges, you can speed this process up with an electric sander, like an orbital sander."
                },
                {
                    "headline": "Arrange the pieces on a flat area to play without a platform.",
                    "description": "Stack your Jenga tower by aligning three cut pieces flat on a surface, side-by-side, lengthwise. Then stack another three pieces on top of these crosswise. Continue this alternating pattern until all blocks are used. Games can be played without a game platform on sturdy tables, firm and level ground, and most kinds of flooring. Game platforms are especially useful for playing giant Jenga at outdoor events, where the ground might be too soft or not level enough to play."
                }
            ]
        },
        {
            "name": "Building a Game Platform",
            "steps": [
                {
                    "headline": "Measure and cut the plywood base.",
                    "description": "With your pencil and tape measure, outline an 18 in x 18 in (45.7x47.5 cm) square on the plywood sheet. Cut the outlined square free of the sheet with a circular saw or hand saw. Sand the cut edges to take off any roughness. Cutting the plywood base by hand may take a while. Don't worry too much about small mistakes. Poor cuts can be corrected by sanding down irregularities."
                },
                {
                    "headline": "Mark and cut the frame.",
                    "description": "On your 6 ft (1.8 m) long 2x4 pine board, mark out two 15 in (38.1 cm) segments and two 18 in (45.7 cm) segments. Cut your boards at these marks with your saw. Sand the cut edges smooth."
                },
                {
                    "headline": "Screw together the platform.",
                    "description": "Place the cut plywood sheet flat on a work surface. Arrange one of your 18 in pine boards on its narrow edge so it is even with an outside edge of the plywood. Clamp the board in place. Turn the sheet over carefully, and screw the clamped board to the sheet from the top side of the platform. Repeat this process for all boards. When all boards are fastened, the underside of the game platform should be outlined in 2x4 pine boards. Same length pieces of pine board occupy opposite sides of the platform."
                },
                {
                    "headline": "Add feet to the platform, if desired.",
                    "description": "The 2x4 frame under your plywood base should be fairly sturdy, but attaching feet can raise the platform, making it more accessible for taller players. Screw in same size 2x4 pieces of scrap wood at the corners of the bottom of your game platform. Alternatively, you can buy pre-made feet for your platform at your local hardware store or home center. Fasten these as directed in the package instructions at the corners of the platform."
                }
            ]
        },
        {
            "name": "Finishing Your Set",
            "steps": [
                {
                    "headline": "Protect your floors with platform padding.",
                    "description": "Your game platform may scuff less resilient flooring over the course of a game. Prevent this from happening by adding furniture pads to the bottom of your platform or its feet. In most cases, after adhesive backing is removed, these pads can be pressed into place. Furniture pads can be purchased at your local hardware store or home center. Some pads may need to be attached to the frame or feet with an included fastener."
                },
                {
                    "headline": "Paint the game pieces, if desired.",
                    "description": "Many Jenga sets have colorful pieces. Add character and some fun to your set by painting some or all of the pieces different colors. An acrylic latex paint, which is available at hardware stores, should work well for your giant game pieces. Choose bright colors to make your set more eye-catching. A neat looking set could attract potential players. Alternatively, you could apply wood stain to the pieces of your set to create a rich, dignified look. When the game is set up, only the ends and sides of many pieces will be visible. Be sure to paint or stain these areas so that even when stacked, your designs can be seen."
                },
                {
                    "headline": "Play giant jenga.",
                    "description": "Set up and play giant Jenga at reunions, church gatherings, community events, and so on. When setting up, clear fragile items from the playing area. When the set falls, pieces may tumble into and damage personal items. Falling pieces may also cause damage to certain kinds of flooring, like wood. In these cases, lay out a large, thick blanket under the platform and playing area."
                }
            ]
        }
    ],
    "tyn": [
        "¾ in (1.9 cm) thick plywood sheet (at least 18 in x 18 in (45.7x47.5 cm))",
        "16 in (40.6 cm) 2x4 boards (x4; makes a 72-piece set)",
        "6 ft (1.8 m) long 2x4 pine board",
        "Circular saw (or hand saw)",
        "Clamps",
        "Drill (and drill bits)",
        "Dust mask",
        "Measuring tape",
        "Pencil (or a similar writing utensil)",
        "Safety glasses",
        "Sandpaper (120 to 180 grit rating)",
        "Screws"
    ],
    "text": " Cutting the Game Pieces Wear safety glasses and a mask when using an electric saw. An electric saw will help you finish this project more quickly, but the sawdust created by this tool can be an eye and lung irritant. Protect your eyes and lungs by wearing safety glasses and a mask while cutting. Electric sanders, too, can launch fine bits of sawdust into the air. Whenever using an electric sander, wear safety glasses and a mask. Measure and cut the pieces. Use your tape measure and a pencil to mark 10½ in (26.7 cm) segments on the 16 in (40.6 cm) 2x4 boards. Cut the boards into pieces at these marks with a circular saw or hand saw. Be precise; poorly cut pieces will stick out irregularly from your giant Jenga set. Wood may move while you cut it, making it difficult to cut precisely. Use clamps to hold the wood in place while sawing. Always use dangerous tools, like saw, with caution. Improper usage may cause injury or property damage. Circular saws are intended for right-handed users. If you are left-handed, be extra careful when using this tool. Sand the cut edges of the game pieces. After being cut, the pieces of your Jenga set will likely be rough where they were cut. Prevent splinters or cuts from wood burrs and jagged pieces of wood by sanding the edges until smooth. Although it shouldn't take too long for your to hand sand the edges, you can speed this process up with an electric sander, like an orbital sander. Arrange the pieces on a flat area to play without a platform. Stack your Jenga tower by aligning three cut pieces flat on a surface, side-by-side, lengthwise. Then stack another three pieces on top of these crosswise. Continue this alternating pattern until all blocks are used. Games can be played without a game platform on sturdy tables, firm and level ground, and most kinds of flooring. Game platforms are especially useful for playing giant Jenga at outdoor events, where the ground might be too soft or not level enough to play. Building a Game Platform Measure and cut the plywood base. With your pencil and tape measure, outline an 18 in x 18 in (45.7x47.5 cm) square on the plywood sheet. Cut the outlined square free of the sheet with a circular saw or hand saw. Sand the cut edges to take off any roughness. Cutting the plywood base by hand may take a while. Don't worry too much about small mistakes. Poor cuts can be corrected by sanding down irregularities. Mark and cut the frame. On your 6 ft (1.8 m) long 2x4 pine board, mark out two 15 in (38.1 cm) segments and two 18 in (45.7 cm) segments. Cut your boards at these marks with your saw. Sand the cut edges smooth. Screw together the platform. Place the cut plywood sheet flat on a work surface. Arrange one of your 18 in pine boards on its narrow edge so it is even with an outside edge of the plywood. Clamp the board in place. Turn the sheet over carefully, and screw the clamped board to the sheet from the top side of the platform. Repeat this process for all boards. When all boards are fastened, the underside of the game platform should be outlined in 2x4 pine boards. Same length pieces of pine board occupy opposite sides of the platform. Add feet to the platform, if desired. The 2x4 frame under your plywood base should be fairly sturdy, but attaching feet can raise the platform, making it more accessible for taller players. Screw in same size 2x4 pieces of scrap wood at the corners of the bottom of your game platform. Alternatively, you can buy pre-made feet for your platform at your local hardware store or home center. Fasten these as directed in the package instructions at the corners of the platform. Finishing Your Set Protect your floors with platform padding. Your game platform may scuff less resilient flooring over the course of a game. Prevent this from happening by adding furniture pads to the bottom of your platform or its feet. In most cases, after adhesive backing is removed, these pads can be pressed into place. Furniture pads can be purchased at your local hardware store or home center. Some pads may need to be attached to the frame or feet with an included fastener. Paint the game pieces, if desired. Many Jenga sets have colorful pieces. Add character and some fun to your set by painting some or all of the pieces different colors. An acrylic latex paint, which is available at hardware stores, should work well for your giant game pieces. Choose bright colors to make your set more eye-catching. A neat looking set could attract potential players. Alternatively, you could apply wood stain to the pieces of your set to create a rich, dignified look. When the game is set up, only the ends and sides of many pieces will be visible. Be sure to paint or stain these areas so that even when stacked, your designs can be seen. Play giant jenga. Set up and play giant Jenga at reunions, church gatherings, community events, and so on. When setting up, clear fragile items from the playing area. When the set falls, pieces may tumble into and damage personal items. Falling pieces may also cause damage to certain kinds of flooring, like wood. In these cases, lay out a large, thick blanket under the platform and playing area.",
    "sentences": [
        " Cutting the Game Pieces Wear safety glasses and a mask when using an electric saw.",
        "An electric saw will help you finish this project more quickly, but the sawdust created by this tool can be an eye and lung irritant.",
        "Protect your eyes and lungs by wearing safety glasses and a mask while cutting.",
        "Electric sanders, too, can launch fine bits of sawdust into the air.",
        "Whenever using an electric sander, wear safety glasses and a mask.",
        "Measure and cut the pieces.",
        "Use your tape measure and a pencil to mark 10½ in (26.7 cm) segments on the 16 in (40.6 cm) 2x4 boards.",
        "Cut the boards into pieces at these marks with a circular saw or hand saw.",
        "Be precise; poorly cut pieces will stick out irregularly from your giant Jenga set.",
        "Wood may move while you cut it, making it difficult to cut precisely.",
        "Use clamps to hold the wood in place while sawing.",
        "Always use dangerous tools, like saw, with caution.",
        "Improper usage may cause injury or property damage.",
        "Circular saws are intended for right-handed users.",
        "If you are left-handed, be extra careful when using this tool.",
        "Sand the cut edges of the game pieces.",
        "After being cut, the pieces of your Jenga set will likely be rough where they were cut.",
        "Prevent splinters or cuts from wood burrs and jagged pieces of wood by sanding the edges until smooth.",
        "Although it shouldn't take too long for your to hand sand the edges, you can speed this process up with an electric sander, like an orbital sander.",
        "Arrange the pieces on a flat area to play without a platform.",
        "Stack your Jenga tower by aligning three cut pieces flat on a surface, side-by-side, lengthwise.",
        "Then stack another three pieces on top of these crosswise.",
        "Continue this alternating pattern until all blocks are used.",
        "Games can be played without a game platform on sturdy tables, firm and level ground, and most kinds of flooring.",
        "Game platforms are especially useful for playing giant Jenga at outdoor events, where the ground might be too soft or not level enough to play.",
        "Building a Game Platform Measure and cut the plywood base.",
        "With your pencil and tape measure, outline an 18 in x 18 in (45.7x47.5 cm) square on the plywood sheet.",
        "Cut the outlined square free of the sheet with a circular saw or hand saw.",
        "Sand the cut edges to take off any roughness.",
        "Cutting the plywood base by hand may take a while.",
        "Don't worry too much about small mistakes.",
        "Poor cuts can be corrected by sanding down irregularities.",
        "Mark and cut the frame.",
        "On your 6 ft (1.8 m) long 2x4 pine board, mark out two 15 in (38.1 cm) segments and two 18 in (45.7 cm) segments.",
        "Cut your boards at these marks with your saw.",
        "Sand the cut edges smooth.",
        "Screw together the platform.",
        "Place the cut plywood sheet flat on a work surface.",
        "Arrange one of your 18 in pine boards on its narrow edge so it is even with an outside edge of the plywood.",
        "Clamp the board in place.",
        "Turn the sheet over carefully, and screw the clamped board to the sheet from the top side of the platform.",
        "Repeat this process for all boards.",
        "When all boards are fastened, the underside of the game platform should be outlined in 2x4 pine boards.",
        "Same length pieces of pine board occupy opposite sides of the platform.",
        "Add feet to the platform, if desired.",
        "The 2x4 frame under your plywood base should be fairly sturdy, but attaching feet can raise the platform, making it more accessible for taller players.",
        "Screw in same size 2x4 pieces of scrap wood at the corners of the bottom of your game platform.",
        "Alternatively, you can buy pre-made feet for your platform at your local hardware store or home center.",
        "Fasten these as directed in the package instructions at the corners of the platform.",
        "Finishing Your Set Protect your floors with platform padding.",
        "Your game platform may scuff less resilient flooring over the course of a game.",
        "Prevent this from happening by adding furniture pads to the bottom of your platform or its feet.",
        "In most cases, after adhesive backing is removed, these pads can be pressed into place.",
        "Furniture pads can be purchased at your local hardware store or home center.",
        "Some pads may need to be attached to the frame or feet with an included fastener.",
        "Paint the game pieces, if desired.",
        "Many Jenga sets have colorful pieces.",
        "Add character and some fun to your set by painting some or all of the pieces different colors.",
        "An acrylic latex paint, which is available at hardware stores, should work well for your giant game pieces.",
        "Choose bright colors to make your set more eye-catching.",
        "A neat looking set could attract potential players.",
        "Alternatively, you could apply wood stain to the pieces of your set to create a rich, dignified look.",
        "When the game is set up, only the ends and sides of many pieces will be visible.",
        "Be sure to paint or stain these areas so that even when stacked, your designs can be seen.",
        "Play giant jenga.",
        "Set up and play giant Jenga at reunions, church gatherings, community events, and so on.",
        "When setting up, clear fragile items from the playing area.",
        "When the set falls, pieces may tumble into and damage personal items.",
        "Falling pieces may also cause damage to certain kinds of flooring, like wood.",
        "In these cases, lay out a large, thick blanket under the platform and playing area."
    ]
}