{
    "title": "How to Clean Glass",
    "url": "https://www.wikihow.com/Clean-Glass",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Cleaning"
    ],
    "methods": [
        {
            "name": "Cleaning Glass Windows",
            "steps": [
                {
                    "headline": "Lay towels on the windowsills.",
                    "description": "You don’t want the windowsills to get wet with the cleaning solution, especially if they are made of wood. Protect the windowsills by laying towels down over them. Make sure none of the windowsill is left exposed."
                },
                {
                    "headline": "Mix vinegar and water to make a cleaning solution.",
                    "description": "Use four parts water and one-part white vinegar. Pour the water and vinegar in a bowl. You can pour the solution in a spray bottle if you wish to spray it onto the glass surface."
                },
                {
                    "headline": "Dip the cloth into the cleaning solution.",
                    "description": "You can use a cotton cloth, microfiber towel, or even a newspaper to wipe down the glass. Dip the cloth into the mixture. Or, you can spray the cleaning solution onto the cloth. Wring out the excess fluid. Spray the cleaning solution directly onto the glass if you are cleaning a large area."
                },
                {
                    "headline": "Wipe off the glass.",
                    "description": "Begin by wiping the glass in circular motions. Then, wipe the glass with vertical strokes. After that, use horizontal strokes to clean the glass."
                },
                {
                    "headline": "Clean the corners with a cotton swab.",
                    "description": "You can use a cotton swab, or an old, soft toothbrush to clean the corners of the glass window. Dip the cotton swab or toothbrush into the cleaning solution. Scrub the corners of the glass where dirt or dust may have gathered."
                },
                {
                    "headline": "Buff the glass.",
                    "description": "You can use an old T-shirt, newspaper, or even cloth diapers to buff the glass. Rub the glass with your chosen object until it is dry and shiny."
                }
            ]
        },
        {
            "name": "Washing Oven Glass",
            "steps": [
                {
                    "headline": "Clean out the crumbs.",
                    "description": "Begin by cleaning off the crumbs and other debris that may have accumulated on the oven glass. You can use a moistened cloth to loosen and pick up the crumbs. Or, you can use a vacuum attachment."
                },
                {
                    "headline": "Create a paste with baking soda and water.",
                    "description": "Pour a half or full cup of baking soda into a bowl. Add in only enough water to create a paste that resembles the consistency of shaving cream. Spread the paste over the oven glass. Allow it to sit for 15 minutes."
                },
                {
                    "headline": "Scrub the glass.",
                    "description": "Use a dampened rag or microfiber cloth. Scrub the glass until it becomes clean. You may have to scrub firmly for tough grime and debris."
                },
                {
                    "headline": "Rinse and dry off the baking soda mixture.",
                    "description": "Rinse the glass off with water. You can use a wet cloth to do this. Make sure all of the baking soda has been washed off. Use a dry cloth to dry the glass."
                },
                {
                    "headline": "Use a razor to remove grease stains.",
                    "description": "If any tough spots are left, you can remove them with a razor. Gently scrape the spot with the razor. Make sure not to exert too much pressure, or you may scratch the glass. Once all of the remaining spots have been removed, wipe off or vacuum up the debris."
                }
            ]
        },
        {
            "name": "Cleaning Auto Glass",
            "steps": [
                {
                    "headline": "Use a glass-cleaning microfiber towel.",
                    "description": "You can find one online or at many auto parts stores. You can use a regular cloth, but it will probably not clean the glass as well as the glass-cleaning microfiber towel."
                },
                {
                    "headline": "Clean the glass with the damp towel.",
                    "description": "Dampen the microfiber towel with water. You don't need to use a cleaning solution if you're using a glass-cleaning microfiber towel. Wipe down the glass until it becomes clean. You may have to scrub for dead bugs or other tough spots."
                },
                {
                    "headline": "Dry and buff the glass.",
                    "description": "Flip the towel over when you are finished cleaning off the glass. It should be dry on the unused side. Buff the glass until it becomes completely dry."
                }
            ]
        }
    ],
    "tyn": [
        "Towels",
        "White vinegar",
        "Cloth",
        "Cotton swab",
        "Newspaper or old T-shirt",
        "Baking soda",
        "Razor",
        "Glass-cleaning microfiber towel"
    ],
    "text": " Cleaning Glass Windows Lay towels on the windowsills. You don’t want the windowsills to get wet with the cleaning solution, especially if they are made of wood. Protect the windowsills by laying towels down over them. Make sure none of the windowsill is left exposed. Mix vinegar and water to make a cleaning solution. Use four parts water and one-part white vinegar. Pour the water and vinegar in a bowl. You can pour the solution in a spray bottle if you wish to spray it onto the glass surface. Dip the cloth into the cleaning solution. You can use a cotton cloth, microfiber towel, or even a newspaper to wipe down the glass. Dip the cloth into the mixture. Or, you can spray the cleaning solution onto the cloth. Wring out the excess fluid. Spray the cleaning solution directly onto the glass if you are cleaning a large area. Wipe off the glass. Begin by wiping the glass in circular motions. Then, wipe the glass with vertical strokes. After that, use horizontal strokes to clean the glass. Clean the corners with a cotton swab. You can use a cotton swab, or an old, soft toothbrush to clean the corners of the glass window. Dip the cotton swab or toothbrush into the cleaning solution. Scrub the corners of the glass where dirt or dust may have gathered. Buff the glass. You can use an old T-shirt, newspaper, or even cloth diapers to buff the glass. Rub the glass with your chosen object until it is dry and shiny. Washing Oven Glass Clean out the crumbs. Begin by cleaning off the crumbs and other debris that may have accumulated on the oven glass. You can use a moistened cloth to loosen and pick up the crumbs. Or, you can use a vacuum attachment. Create a paste with baking soda and water. Pour a half or full cup of baking soda into a bowl. Add in only enough water to create a paste that resembles the consistency of shaving cream. Spread the paste over the oven glass. Allow it to sit for 15 minutes. Scrub the glass. Use a dampened rag or microfiber cloth. Scrub the glass until it becomes clean. You may have to scrub firmly for tough grime and debris. Rinse and dry off the baking soda mixture. Rinse the glass off with water. You can use a wet cloth to do this. Make sure all of the baking soda has been washed off. Use a dry cloth to dry the glass. Use a razor to remove grease stains. If any tough spots are left, you can remove them with a razor. Gently scrape the spot with the razor. Make sure not to exert too much pressure, or you may scratch the glass. Once all of the remaining spots have been removed, wipe off or vacuum up the debris. Cleaning Auto Glass Use a glass-cleaning microfiber towel. You can find one online or at many auto parts stores. You can use a regular cloth, but it will probably not clean the glass as well as the glass-cleaning microfiber towel. Clean the glass with the damp towel. Dampen the microfiber towel with water. You don't need to use a cleaning solution if you're using a glass-cleaning microfiber towel. Wipe down the glass until it becomes clean. You may have to scrub for dead bugs or other tough spots. Dry and buff the glass. Flip the towel over when you are finished cleaning off the glass. It should be dry on the unused side. Buff the glass until it becomes completely dry.",
    "sentences": [
        " Cleaning Glass Windows Lay towels on the windowsills.",
        "You don’t want the windowsills to get wet with the cleaning solution, especially if they are made of wood.",
        "Protect the windowsills by laying towels down over them.",
        "Make sure none of the windowsill is left exposed.",
        "Mix vinegar and water to make a cleaning solution.",
        "Use four parts water and one-part white vinegar.",
        "Pour the water and vinegar in a bowl.",
        "You can pour the solution in a spray bottle if you wish to spray it onto the glass surface.",
        "Dip the cloth into the cleaning solution.",
        "You can use a cotton cloth, microfiber towel, or even a newspaper to wipe down the glass.",
        "Dip the cloth into the mixture.",
        "Or, you can spray the cleaning solution onto the cloth.",
        "Wring out the excess fluid.",
        "Spray the cleaning solution directly onto the glass if you are cleaning a large area.",
        "Wipe off the glass.",
        "Begin by wiping the glass in circular motions.",
        "Then, wipe the glass with vertical strokes.",
        "After that, use horizontal strokes to clean the glass.",
        "Clean the corners with a cotton swab.",
        "You can use a cotton swab, or an old, soft toothbrush to clean the corners of the glass window.",
        "Dip the cotton swab or toothbrush into the cleaning solution.",
        "Scrub the corners of the glass where dirt or dust may have gathered.",
        "Buff the glass.",
        "You can use an old T-shirt, newspaper, or even cloth diapers to buff the glass.",
        "Rub the glass with your chosen object until it is dry and shiny.",
        "Washing Oven Glass Clean out the crumbs.",
        "Begin by cleaning off the crumbs and other debris that may have accumulated on the oven glass.",
        "You can use a moistened cloth to loosen and pick up the crumbs.",
        "Or, you can use a vacuum attachment.",
        "Create a paste with baking soda and water.",
        "Pour a half or full cup of baking soda into a bowl.",
        "Add in only enough water to create a paste that resembles the consistency of shaving cream.",
        "Spread the paste over the oven glass.",
        "Allow it to sit for 15 minutes.",
        "Scrub the glass.",
        "Use a dampened rag or microfiber cloth.",
        "Scrub the glass until it becomes clean.",
        "You may have to scrub firmly for tough grime and debris.",
        "Rinse and dry off the baking soda mixture.",
        "Rinse the glass off with water.",
        "You can use a wet cloth to do this.",
        "Make sure all of the baking soda has been washed off.",
        "Use a dry cloth to dry the glass.",
        "Use a razor to remove grease stains.",
        "If any tough spots are left, you can remove them with a razor.",
        "Gently scrape the spot with the razor.",
        "Make sure not to exert too much pressure, or you may scratch the glass.",
        "Once all of the remaining spots have been removed, wipe off or vacuum up the debris.",
        "Cleaning Auto Glass Use a glass-cleaning microfiber towel.",
        "You can find one online or at many auto parts stores.",
        "You can use a regular cloth, but it will probably not clean the glass as well as the glass-cleaning microfiber towel.",
        "Clean the glass with the damp towel.",
        "Dampen the microfiber towel with water.",
        "You don't need to use a cleaning solution if you're using a glass-cleaning microfiber towel.",
        "Wipe down the glass until it becomes clean.",
        "You may have to scrub for dead bugs or other tough spots.",
        "Dry and buff the glass.",
        "Flip the towel over when you are finished cleaning off the glass.",
        "It should be dry on the unused side.",
        "Buff the glass until it becomes completely dry."
    ]
}