{
    "title": "How to Eat Purslane",
    "url": "https://www.wikihow.com/Eat-Purslane",
    "category_hierarchy": [
        "Food and Entertaining",
        "Herbs and Spices"
    ],
    "methods": [
        {
            "name": "Making a Summer Purslane Salad",
            "steps": [
                {
                    "headline": "Combine your ingredients in a large mixing bowl.",
                    "description": "Add all solid ingredients to a mixing bowl. With your clean hands or tongs, toss the salad to distribute the ingredients evenly. Drizzle 2 - 3 tbsp (30 - 44 ml) of lemon juice over the ingredients. Thoroughly toss the salad again to spread the juice throughout."
                },
                {
                    "headline": "Season your salad to taste.",
                    "description": "Sprinkle salt on your salad a little by little. Toss the salad and taste it to check its flavor after adding salt each time. To add a little more bite to your salad, similarly add garlic powder or crushed black pepper. Increase tartness by adding more lemon juice. The jalapeno in the salad will be toned down by the flavor of the lemon. For a spicier salad, add a small amount of crushed red pepper and mix it in with the other ingredients."
                },
                {
                    "headline": "Serve the purslane salad as a side.",
                    "description": "The natural citrus flavor of this dish complements fish well, especially if the fish has been seasoned with lemon juice, lemon zest, or lemon pepper. Include this purslane salad with meals where pork is the main dish, like pork chops. Offset the spiciness of your salad by cooking fish dishes, like tilapia, with lemon butter. Broil or bake fish then squeeze a few lemon wedges over it. The flavor profile of this summer purslane salad pairs well with Mexican food. Serve the salad with quesadillas, tacos, and burritos."
                },
                {
                    "headline": "Eat the salad as an appetizer.",
                    "description": "On a hot summer day, this salad will be a refreshing snack. Serve purslane salad with tortilla chips to turn this dish into a light and healthy finger food. Guests can scoop up and eat the salad with chips. Store leftover salad for up to five days in a sealed container in your refrigerator."
                }
            ]
        },
        {
            "name": "Whipping up a Cold Purslane Cucumber Soup",
            "steps": [
                {
                    "headline": "Blend your ingredients.",
                    "description": "Insert all your ingredients into a blender or food processor. Pulse the ingredients until the mixture is smooth and consistent throughout. Add more garlic for a sharper flavor. Make your soup more refreshing by adding a few mint sprigs."
                },
                {
                    "headline": "Thin the mixture, if necessary.",
                    "description": "This recipe makes a relatively thick soup. If you prefer thinner soup, add water to it a little bit at a time while the mixture is still in the blender. Seal the blender and pulse it to mix in the water. Continue adding water until your preferred consistency is reached. You can make your soup richer and creamier by adding yogurt to it. Do so a little at a time and pulse the sealed blender to mix in the yogurt."
                },
                {
                    "headline": "Season the soup to taste.",
                    "description": "When the consistency of the soup is right, it’s time for a taste test. Use a spoon to sample the flavor of your purslane cucumber soup. Add salt, sugar, and other ingredients as necessary to achieve your desired flavor."
                },
                {
                    "headline": "Serve the soup chilled.",
                    "description": "Transfer the soup to a serving bowl or storage container. Chill the soup in your refrigerator and serve it as soon as it is cold. When kept in a sealed container, this soup should stay good for three to four days."
                }
            ]
        },
        {
            "name": "Making Pan Fried Purslane",
            "steps": [
                {
                    "headline": "Prepare the flour, eggs, and breadcrumbs.",
                    "description": "Fill three medium size mixing bowls or shallow dishes each with a moderate amount of flour, eggs, and breadcrumbs. Bowls should only have one ingredient apiece. Whisk or beat the eggs with a fork until they are well blended. Make the breading process easier by lining up the bowls so the first one contains flour, the second beaten eggs, and the third bread crumbs. If you end up running out of an ingredient while making fried purslane, you can always add more. Leftover ingredients should be used immediately in another dish or thrown away."
                },
                {
                    "headline": "Bread the purslane.",
                    "description": "With your clean hands or tongs, pick up a clean stalk of purslane. Coat the stalk thoroughly in flour. Once coated, submerge the stalk completely in the eggs. Allow excess egg to drip into the egg bowl, then roll the purslane in breadcrumbs so it is completely covered. Repeat this process until you have no purslane left. Breaded purslane can be fried one at a time or set off to the side and fried all at once."
                },
                {
                    "headline": "Pan fry the purslane.",
                    "description": "Place a sauté pan over medium heat and coat its bottom with a layer of olive oil. Transfer the purslane to the pan when it is heated. Cook the purslane for roughly five minutes or until the breading is golden brown. Flip the purslane while cooking so both sides fry evenly."
                },
                {
                    "headline": "Eat fried purslane plain or with dipping sauces.",
                    "description": "Remove the purslane from the pan and lay it on paper towel to absorb excess oil. When it has cooled, it’s ready to eat. Lightly salt and pepper the purslane to taste. Try fried purslane with dipping sauces, like catsup, mustard, and sour cream. Experiment with different toppings to discover your favorite way of eating it. For example, you might try a light drizzling of teriyaki or soy sauce on the fried purslane."
                }
            ]
        }
    ],
    "tyn": [
        "Summer Purslane Salad",
        "Mixing bowl (large size)",
        "Tongs (to toss and serve the salad)",
        "Cold Purslane Cucumber Soup",
        "Blender (or food processor)",
        "Serving bowl (or storage container)",
        "Fried Purslane",
        "Mixing bowls (x3; medium size)",
        "Paper towel",
        "Sauté pan",
        "Tongs",
        "Whisk (or fork)"
    ],
    "text": " Making a Summer Purslane Salad Combine your ingredients in a large mixing bowl. Add all solid ingredients to a mixing bowl. With your clean hands or tongs, toss the salad to distribute the ingredients evenly. Drizzle 2 - 3 tbsp (30 - 44 ml) of lemon juice over the ingredients. Thoroughly toss the salad again to spread the juice throughout. Season your salad to taste. Sprinkle salt on your salad a little by little. Toss the salad and taste it to check its flavor after adding salt each time. To add a little more bite to your salad, similarly add garlic powder or crushed black pepper. Increase tartness by adding more lemon juice. The jalapeno in the salad will be toned down by the flavor of the lemon. For a spicier salad, add a small amount of crushed red pepper and mix it in with the other ingredients. Serve the purslane salad as a side. The natural citrus flavor of this dish complements fish well, especially if the fish has been seasoned with lemon juice, lemon zest, or lemon pepper. Include this purslane salad with meals where pork is the main dish, like pork chops. Offset the spiciness of your salad by cooking fish dishes, like tilapia, with lemon butter. Broil or bake fish then squeeze a few lemon wedges over it. The flavor profile of this summer purslane salad pairs well with Mexican food. Serve the salad with quesadillas, tacos, and burritos. Eat the salad as an appetizer. On a hot summer day, this salad will be a refreshing snack. Serve purslane salad with tortilla chips to turn this dish into a light and healthy finger food. Guests can scoop up and eat the salad with chips. Store leftover salad for up to five days in a sealed container in your refrigerator. Whipping up a Cold Purslane Cucumber Soup Blend your ingredients. Insert all your ingredients into a blender or food processor. Pulse the ingredients until the mixture is smooth and consistent throughout. Add more garlic for a sharper flavor. Make your soup more refreshing by adding a few mint sprigs. Thin the mixture, if necessary. This recipe makes a relatively thick soup. If you prefer thinner soup, add water to it a little bit at a time while the mixture is still in the blender. Seal the blender and pulse it to mix in the water. Continue adding water until your preferred consistency is reached. You can make your soup richer and creamier by adding yogurt to it. Do so a little at a time and pulse the sealed blender to mix in the yogurt. Season the soup to taste. When the consistency of the soup is right, it’s time for a taste test. Use a spoon to sample the flavor of your purslane cucumber soup. Add salt, sugar, and other ingredients as necessary to achieve your desired flavor. Serve the soup chilled. Transfer the soup to a serving bowl or storage container. Chill the soup in your refrigerator and serve it as soon as it is cold. When kept in a sealed container, this soup should stay good for three to four days. Making Pan Fried Purslane Prepare the flour, eggs, and breadcrumbs. Fill three medium size mixing bowls or shallow dishes each with a moderate amount of flour, eggs, and breadcrumbs. Bowls should only have one ingredient apiece. Whisk or beat the eggs with a fork until they are well blended. Make the breading process easier by lining up the bowls so the first one contains flour, the second beaten eggs, and the third bread crumbs. If you end up running out of an ingredient while making fried purslane, you can always add more. Leftover ingredients should be used immediately in another dish or thrown away. Bread the purslane. With your clean hands or tongs, pick up a clean stalk of purslane. Coat the stalk thoroughly in flour. Once coated, submerge the stalk completely in the eggs. Allow excess egg to drip into the egg bowl, then roll the purslane in breadcrumbs so it is completely covered. Repeat this process until you have no purslane left. Breaded purslane can be fried one at a time or set off to the side and fried all at once. Pan fry the purslane. Place a sauté pan over medium heat and coat its bottom with a layer of olive oil. Transfer the purslane to the pan when it is heated. Cook the purslane for roughly five minutes or until the breading is golden brown. Flip the purslane while cooking so both sides fry evenly. Eat fried purslane plain or with dipping sauces. Remove the purslane from the pan and lay it on paper towel to absorb excess oil. When it has cooled, it’s ready to eat. Lightly salt and pepper the purslane to taste. Try fried purslane with dipping sauces, like catsup, mustard, and sour cream. Experiment with different toppings to discover your favorite way of eating it. For example, you might try a light drizzling of teriyaki or soy sauce on the fried purslane.",
    "sentences": [
        " Making a Summer Purslane Salad Combine your ingredients in a large mixing bowl.",
        "Add all solid ingredients to a mixing bowl.",
        "With your clean hands or tongs, toss the salad to distribute the ingredients evenly.",
        "Drizzle 2 - 3 tbsp (30 - 44 ml) of lemon juice over the ingredients.",
        "Thoroughly toss the salad again to spread the juice throughout.",
        "Season your salad to taste.",
        "Sprinkle salt on your salad a little by little.",
        "Toss the salad and taste it to check its flavor after adding salt each time.",
        "To add a little more bite to your salad, similarly add garlic powder or crushed black pepper.",
        "Increase tartness by adding more lemon juice.",
        "The jalapeno in the salad will be toned down by the flavor of the lemon.",
        "For a spicier salad, add a small amount of crushed red pepper and mix it in with the other ingredients.",
        "Serve the purslane salad as a side.",
        "The natural citrus flavor of this dish complements fish well, especially if the fish has been seasoned with lemon juice, lemon zest, or lemon pepper.",
        "Include this purslane salad with meals where pork is the main dish, like pork chops.",
        "Offset the spiciness of your salad by cooking fish dishes, like tilapia, with lemon butter.",
        "Broil or bake fish then squeeze a few lemon wedges over it.",
        "The flavor profile of this summer purslane salad pairs well with Mexican food.",
        "Serve the salad with quesadillas, tacos, and burritos.",
        "Eat the salad as an appetizer.",
        "On a hot summer day, this salad will be a refreshing snack.",
        "Serve purslane salad with tortilla chips to turn this dish into a light and healthy finger food.",
        "Guests can scoop up and eat the salad with chips.",
        "Store leftover salad for up to five days in a sealed container in your refrigerator.",
        "Whipping up a Cold Purslane Cucumber Soup Blend your ingredients.",
        "Insert all your ingredients into a blender or food processor.",
        "Pulse the ingredients until the mixture is smooth and consistent throughout.",
        "Add more garlic for a sharper flavor.",
        "Make your soup more refreshing by adding a few mint sprigs.",
        "Thin the mixture, if necessary.",
        "This recipe makes a relatively thick soup.",
        "If you prefer thinner soup, add water to it a little bit at a time while the mixture is still in the blender.",
        "Seal the blender and pulse it to mix in the water.",
        "Continue adding water until your preferred consistency is reached.",
        "You can make your soup richer and creamier by adding yogurt to it.",
        "Do so a little at a time and pulse the sealed blender to mix in the yogurt.",
        "Season the soup to taste.",
        "When the consistency of the soup is right, it’s time for a taste test.",
        "Use a spoon to sample the flavor of your purslane cucumber soup.",
        "Add salt, sugar, and other ingredients as necessary to achieve your desired flavor.",
        "Serve the soup chilled.",
        "Transfer the soup to a serving bowl or storage container.",
        "Chill the soup in your refrigerator and serve it as soon as it is cold.",
        "When kept in a sealed container, this soup should stay good for three to four days.",
        "Making Pan Fried Purslane Prepare the flour, eggs, and breadcrumbs.",
        "Fill three medium size mixing bowls or shallow dishes each with a moderate amount of flour, eggs, and breadcrumbs.",
        "Bowls should only have one ingredient apiece.",
        "Whisk or beat the eggs with a fork until they are well blended.",
        "Make the breading process easier by lining up the bowls so the first one contains flour, the second beaten eggs, and the third bread crumbs.",
        "If you end up running out of an ingredient while making fried purslane, you can always add more.",
        "Leftover ingredients should be used immediately in another dish or thrown away.",
        "Bread the purslane.",
        "With your clean hands or tongs, pick up a clean stalk of purslane.",
        "Coat the stalk thoroughly in flour.",
        "Once coated, submerge the stalk completely in the eggs.",
        "Allow excess egg to drip into the egg bowl, then roll the purslane in breadcrumbs so it is completely covered.",
        "Repeat this process until you have no purslane left.",
        "Breaded purslane can be fried one at a time or set off to the side and fried all at once.",
        "Pan fry the purslane.",
        "Place a sauté pan over medium heat and coat its bottom with a layer of olive oil.",
        "Transfer the purslane to the pan when it is heated.",
        "Cook the purslane for roughly five minutes or until the breading is golden brown.",
        "Flip the purslane while cooking so both sides fry evenly.",
        "Eat fried purslane plain or with dipping sauces.",
        "Remove the purslane from the pan and lay it on paper towel to absorb excess oil.",
        "When it has cooled, it’s ready to eat.",
        "Lightly salt and pepper the purslane to taste.",
        "Try fried purslane with dipping sauces, like catsup, mustard, and sour cream.",
        "Experiment with different toppings to discover your favorite way of eating it.",
        "For example, you might try a light drizzling of teriyaki or soy sauce on the fried purslane."
    ]
}