{
    "title": "How to Make a Fidget Quilt",
    "url": "https://www.wikihow.com/Make-a-Fidget-Quilt",
    "category_hierarchy": [
        "Health",
        "Disability Issues",
        "Autism Spectrum"
    ],
    "parts": [
        {
            "name": "Preparing Your Squares",
            "steps": [
                {
                    "headline": "Make a template of any size.",
                    "description": "A recommended size to start with is 5\" by 5\"."
                },
                {
                    "headline": "Cut 3 squares of the same color of fabric.",
                    "description": "Put a clip on the square to hold your template to the fabric and make it easy to cut."
                },
                {
                    "headline": "Repeat two more times with each fabric color.",
                    "description": "Most completed fidget quilts are usually 17\" by 21\", but you can make yours at any size."
                },
                {
                    "headline": "Sew the squares together into strips.",
                    "description": ""
                },
                {
                    "headline": "Sew the strips together using a 1/4 inch seam.",
                    "description": "This will become your top."
                },
                {
                    "headline": "Iron your top, making sure all the seams are ironed the same direction and are laying flat.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Making a Tassel",
            "steps": [
                {
                    "headline": "Obtain several different yarns and ribbons.",
                    "description": "Your tassel can be any length you want."
                },
                {
                    "headline": "Cut all your ribbons and yarn to the same length.",
                    "description": ""
                },
                {
                    "headline": "Pull them through a ring and fold it in half.",
                    "description": ""
                },
                {
                    "headline": "Use a sturdy piece of string or yarn to tie everything together at the top.",
                    "description": "This should be removable and not washable, so when you're sewing it into the quilt top, you'll sew a small loop of ribbon or a tab to hang the tassel on. This loop is usually made on the top of the quilt, so make sure the border covers it."
                }
            ]
        },
        {
            "name": "Making  Yo-Yos",
            "steps": [
                {
                    "headline": "Cut circles of any size out of fabric.",
                    "description": "The larger the circle, the bigger the yo-yo."
                },
                {
                    "headline": "Hand-sew around the outer edge of the fabric.",
                    "description": ""
                },
                {
                    "headline": "Remove your needle and pull on both ends of the thread.",
                    "description": "It will gather up into a circle. Knot the thread so it stays gathered."
                },
                {
                    "headline": "Use glue to add a big bright button to the center of each yo-yo.",
                    "description": ""
                },
                {
                    "headline": "Add velcro using some glue.",
                    "description": ""
                },
                {
                    "headline": "Sew the other side of the velcro down.",
                    "description": "Your yo-yo's are done."
                }
            ]
        },
        {
            "name": "Adding Other Fidgets and Features",
            "steps": [
                {
                    "headline": "Add a fleece teddy bear to your quilt.",
                    "description": "You can make the bear on an embroidery machine. The finished teddy bear is 7\" by 5\". Consider using a recycled jean pocket to store the teddy bear."
                },
                {
                    "headline": "Decide on which fidgets you want to use.",
                    "description": "You can use any number of fidgets."
                },
                {
                    "headline": "Pin all your fidgets on the top of the quilt.",
                    "description": ""
                },
                {
                    "headline": "Sew the fidgets onto the quilt.",
                    "description": "Make sure they are straight and on the top of the quilt."
                },
                {
                    "headline": "Make sure the ribbons are reinforced so they cannot be pulled off.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Finishing the Quilt",
            "steps": [
                {
                    "headline": "Pick up the back fabric and cut the batting.",
                    "description": "You will need a low loft quilting batting and a coordinating fabric for the back."
                },
                {
                    "headline": "Lay the finished top quilt on top of the batting and cut it a 1/4\" bigger on each of the sides.",
                    "description": ""
                },
                {
                    "headline": "Lay the batting on top of the back fabric.",
                    "description": ""
                },
                {
                    "headline": "Cut the back 1/2\" bigger on each side of the batting so you can fold it over and pin it to the quilt top.",
                    "description": ""
                },
                {
                    "headline": "Pin the top, batting, and back fabric together.",
                    "description": ""
                },
                {
                    "headline": "Fold the backing fabric up 1/4\" so there are no raw edges and fold it once more.",
                    "description": "The back fabric should be pinned to the top fabric. This gives the quilt a nice border."
                },
                {
                    "headline": "Pin the corners by bringing them to a point and folding them in.",
                    "description": "This can be a little tricky, but with patience, you can have a nice, neat corner. If you corner is not perfect, you'll be able to fidget with the loose ends."
                },
                {
                    "headline": "Begin quilting it all together by sewing the border first.",
                    "description": "On the border, you will want to use a fancier stitch which will function as another tactical point on the quilt."
                },
                {
                    "headline": "Quilt the 3 pieces together by using a straight stitch.",
                    "description": "Start in the middle, sew top to bottom, and then sew left to right. You may have to dodge the fidgets, doing this binds all 3 pieces together."
                },
                {
                    "headline": "Finished!",
                    "description": "Your fidget quilt is ready to be given to someone!"
                }
            ]
        }
    ],
    "tyn": [
        "Fabric",
        "Scissors",
        "Batting-low loft batting",
        "Ribbon",
        "Fleece",
        "Buttons",
        "Beads",
        "Sewing machine",
        "Velcro",
        "Yarn",
        "Rings",
        "Zipper"
    ],
    "text": " Preparing Your Squares Make a template of any size. A recommended size to start with is 5\" by 5\". Cut 3 squares of the same color of fabric. Put a clip on the square to hold your template to the fabric and make it easy to cut. Repeat two more times with each fabric color. Most completed fidget quilts are usually 17\" by 21\", but you can make yours at any size. Sew the squares together into strips.  Sew the strips together using a 1/4 inch seam. This will become your top. Iron your top, making sure all the seams are ironed the same direction and are laying flat.  Making a Tassel Obtain several different yarns and ribbons. Your tassel can be any length you want. Cut all your ribbons and yarn to the same length.  Pull them through a ring and fold it in half.  Use a sturdy piece of string or yarn to tie everything together at the top. This should be removable and not washable, so when you're sewing it into the quilt top, you'll sew a small loop of ribbon or a tab to hang the tassel on. This loop is usually made on the top of the quilt, so make sure the border covers it. Making  Yo-Yos Cut circles of any size out of fabric. The larger the circle, the bigger the yo-yo. Hand-sew around the outer edge of the fabric.  Remove your needle and pull on both ends of the thread. It will gather up into a circle. Knot the thread so it stays gathered. Use glue to add a big bright button to the center of each yo-yo.  Add velcro using some glue.  Sew the other side of the velcro down. Your yo-yo's are done. Adding Other Fidgets and Features Add a fleece teddy bear to your quilt. You can make the bear on an embroidery machine. The finished teddy bear is 7\" by 5\". Consider using a recycled jean pocket to store the teddy bear. Decide on which fidgets you want to use. You can use any number of fidgets. Pin all your fidgets on the top of the quilt.  Sew the fidgets onto the quilt. Make sure they are straight and on the top of the quilt. Make sure the ribbons are reinforced so they cannot be pulled off.  Finishing the Quilt Pick up the back fabric and cut the batting. You will need a low loft quilting batting and a coordinating fabric for the back. Lay the finished top quilt on top of the batting and cut it a 1/4\" bigger on each of the sides.  Lay the batting on top of the back fabric.  Cut the back 1/2\" bigger on each side of the batting so you can fold it over and pin it to the quilt top.  Pin the top, batting, and back fabric together.  Fold the backing fabric up 1/4\" so there are no raw edges and fold it once more. The back fabric should be pinned to the top fabric. This gives the quilt a nice border. Pin the corners by bringing them to a point and folding them in. This can be a little tricky, but with patience, you can have a nice, neat corner. If you corner is not perfect, you'll be able to fidget with the loose ends. Begin quilting it all together by sewing the border first. On the border, you will want to use a fancier stitch which will function as another tactical point on the quilt. Quilt the 3 pieces together by using a straight stitch. Start in the middle, sew top to bottom, and then sew left to right. You may have to dodge the fidgets, doing this binds all 3 pieces together. Finished! Your fidget quilt is ready to be given to someone!",
    "sentences": [
        " Preparing Your Squares Make a template of any size.",
        "A recommended size to start with is 5\" by 5\".",
        "Cut 3 squares of the same color of fabric.",
        "Put a clip on the square to hold your template to the fabric and make it easy to cut.",
        "Repeat two more times with each fabric color.",
        "Most completed fidget quilts are usually 17\" by 21\", but you can make yours at any size.",
        "Sew the squares together into strips.",
        "Sew the strips together using a 1/4 inch seam.",
        "This will become your top.",
        "Iron your top, making sure all the seams are ironed the same direction and are laying flat.",
        "Making a Tassel Obtain several different yarns and ribbons.",
        "Your tassel can be any length you want.",
        "Cut all your ribbons and yarn to the same length.",
        "Pull them through a ring and fold it in half.",
        "Use a sturdy piece of string or yarn to tie everything together at the top.",
        "This should be removable and not washable, so when you're sewing it into the quilt top, you'll sew a small loop of ribbon or a tab to hang the tassel on.",
        "This loop is usually made on the top of the quilt, so make sure the border covers it.",
        "Making  Yo-Yos Cut circles of any size out of fabric.",
        "The larger the circle, the bigger the yo-yo.",
        "Hand-sew around the outer edge of the fabric.",
        "Remove your needle and pull on both ends of the thread.",
        "It will gather up into a circle.",
        "Knot the thread so it stays gathered.",
        "Use glue to add a big bright button to the center of each yo-yo.",
        "Add velcro using some glue.",
        "Sew the other side of the velcro down.",
        "Your yo-yo's are done.",
        "Adding Other Fidgets and Features Add a fleece teddy bear to your quilt.",
        "You can make the bear on an embroidery machine.",
        "The finished teddy bear is 7\" by 5\".",
        "Consider using a recycled jean pocket to store the teddy bear.",
        "Decide on which fidgets you want to use.",
        "You can use any number of fidgets.",
        "Pin all your fidgets on the top of the quilt.",
        "Sew the fidgets onto the quilt.",
        "Make sure they are straight and on the top of the quilt.",
        "Make sure the ribbons are reinforced so they cannot be pulled off.",
        "Finishing the Quilt Pick up the back fabric and cut the batting.",
        "You will need a low loft quilting batting and a coordinating fabric for the back.",
        "Lay the finished top quilt on top of the batting and cut it a 1/4\" bigger on each of the sides.",
        "Lay the batting on top of the back fabric.",
        "Cut the back 1/2\" bigger on each side of the batting so you can fold it over and pin it to the quilt top.",
        "Pin the top, batting, and back fabric together.",
        "Fold the backing fabric up 1/4\" so there are no raw edges and fold it once more.",
        "The back fabric should be pinned to the top fabric.",
        "This gives the quilt a nice border.",
        "Pin the corners by bringing them to a point and folding them in.",
        "This can be a little tricky, but with patience, you can have a nice, neat corner.",
        "If you corner is not perfect, you'll be able to fidget with the loose ends.",
        "Begin quilting it all together by sewing the border first.",
        "On the border, you will want to use a fancier stitch which will function as another tactical point on the quilt.",
        "Quilt the 3 pieces together by using a straight stitch.",
        "Start in the middle, sew top to bottom, and then sew left to right.",
        "You may have to dodge the fidgets, doing this binds all 3 pieces together.",
        "Finished!",
        "Your fidget quilt is ready to be given to someone!"
    ]
}