{
    "title": "How to Do Paint Scrape Art",
    "url": "https://www.wikihow.com/Do-Paint-Scrape-Art",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "methods": [
        {
            "name": "Making Paint Scrape Cards",
            "steps": [
                {
                    "headline": "Tape your paper onto a covered work surface.",
                    "description": "Tape a large sheet of wax paper onto a table or countertop to create a protected work surface. Then tape a heavyweight paper, such as cardstock, onto the wax paper. Since it’s taped to the surface, it won’t move around when you scrape it. You can also use a cookie sheet as an easy to clean work surface."
                },
                {
                    "headline": "Squeeze drops of paint along one side of the paper.",
                    "description": "Grab some squeeze bottles of acrylic paint in assorted colors. Apply drops of paint along one edge of the cardstock, leaving the rest of the sheet blank. If the rest of the sheet is blank, you'll be able to drag the colors across the paper without muddying colors."
                },
                {
                    "headline": "Vary the drops’ sizes and colors to create patterns.",
                    "description": "Try arranging the dots in a staggered pattern, or at different distances from the edge of the paper. That way, the lines you'll make by spreading the paint across the paper will have a scalloped pattern."
                },
                {
                    "headline": "Spread the colors with a piece of cardboard.",
                    "description": "Scrape a small square of cardboard or foam board across the paper, starting from the side with the paint drops. Drag the paint drops across the surface in straight lines, curved patterns, or any design that suits your style. Instead of cardboard, you can use an expired credit card or old gift card."
                },
                {
                    "headline": "Fold the paper in half and glue on lettering.",
                    "description": "To create a card, let the paint dry then untape the cardstock from the wax paper or cookie sheet. Fold it in half so the painted sides face out, and choose the side you like best for the front. Grab some letter cutouts or stickers, and glue or stick them onto the front to spell out a greeting."
                }
            ]
        },
        {
            "name": "Using Bright Pastels and Black Paint",
            "steps": [
                {
                    "headline": "Color your entire paper with oil pastels.",
                    "description": "Cover the entire surface of a heavyweight paper with bright pastel colors. You can create any design, from rainbow stripes to polkadots. Just make sure you color the entire sheet of paper. For best results, press hard on the pastels when you color the paper. If you don’t have pastels, you can also use brightly colored crayons."
                },
                {
                    "headline": "Paint the entire surface with black India ink.",
                    "description": "After you’ve colored the paper, paint the entire surface with black India ink. Give the paint time to dry after you’ve covered the whole surface. If you don’t have India ink, try using black poster paint. Pour poster paint into a small bowl and mix in a drop of dish soap to help it stick to the pastel layer."
                },
                {
                    "headline": "Scrape off the black ink to create a design or image.",
                    "description": "Use a paperclip or popsicle stick to scrape lines into the black ink and reveal the bright pastel layer below. You can etch any shapes or designs you’d like. Try making images like stars and planets, a city skyline, flowers, or fireworks. Try experimenting with the paperclip and popsicle stick to create lines with varying thickness and fine details."
                }
            ]
        },
        {
            "name": "Trying Fine Art Scraping Techniques",
            "steps": [
                {
                    "headline": "Use sgraffito to create hair and other linear details.",
                    "description": "Sgraffito is when a painter scratches through a top layer of paint to expose the pigment beneath. It’s great for linear details, like hair. Next time you paint a portrait, try using a thin painting knife or utility blade to scratch thin lines for your figure’s hair. When scraping away a top layer of paint, make sure the undercoat is completely dry or you’ll end up muddying your colors."
                },
                {
                    "headline": "Use a credit card or foam dipped in paint to create details.",
                    "description": "You can use a scraping technique to create details like individual tree trunks in a forest. Try cutting up an expired credit card or piece of foam board. Dip the pieces in paint and dab or scrape them to create details. You can use oil or acrylic paint if you're using a credit card. Pieces of foam board work best with acrylic. Try scraping them across the surface to create bodies of water or windows in a building. You can also lightly dab the paint-dipped pieces right onto your composition to create trees, blades of grass, and other lines."
                },
                {
                    "headline": "Blend horizon lines in a landscape by scumbling.",
                    "description": "Like sgraffito, scumbling involves using a knife to scrape away small sections of a painting’s top coat. First, try painting a sky in your painting's first coats, then use the next layers of paint to suggest a tree-lined horizon. Use a knife to scramble, or remove, bits of the treeline to create small holes where the sky peeks through branches. Scumbling works for oil and acrylic paints. To avoid muddying colors, make sure the undercoat paint is dry before scumbling over it."
                },
                {
                    "headline": "Try making abstract works with scraping tools.",
                    "description": "In addition to portraits and landscapes, paint scraping techniques are useful when creating abstract works. Try spreading layers of paint with a palette knife, spatula, or squeegee. Use the tools to scrape the surface and remove patches of paint, blend pigments, or create expressive gestures. Many great contemporary abstract painters use scraping tools to create improvised marks."
                }
            ]
        }
    ],
    "tyn": [
        "Paint Scrape Cards",
        "Cardstock or other heavyweight paper.",
        "Wax paper",
        "Masking Tape",
        "Acrylic paints",
        "Cardboard, or an old credit or gift card",
        "Letter cutouts or stickers",
        "Paint Scrape Etchings",
        "Oil pastels or crayons",
        "Black India ink or poster paint",
        "Paperclip and popsicle stick",
        "Fine Art Scraping Techniques",
        "Painting knife",
        "Old credit or gift card",
        "Palette knife",
        "Spatula",
        "Squeegee"
    ],
    "text": " Making Paint Scrape Cards Tape your paper onto a covered work surface. Tape a large sheet of wax paper onto a table or countertop to create a protected work surface. Then tape a heavyweight paper, such as cardstock, onto the wax paper. Since it’s taped to the surface, it won’t move around when you scrape it. You can also use a cookie sheet as an easy to clean work surface. Squeeze drops of paint along one side of the paper. Grab some squeeze bottles of acrylic paint in assorted colors. Apply drops of paint along one edge of the cardstock, leaving the rest of the sheet blank. If the rest of the sheet is blank, you'll be able to drag the colors across the paper without muddying colors. Vary the drops’ sizes and colors to create patterns. Try arranging the dots in a staggered pattern, or at different distances from the edge of the paper. That way, the lines you'll make by spreading the paint across the paper will have a scalloped pattern. Spread the colors with a piece of cardboard. Scrape a small square of cardboard or foam board across the paper, starting from the side with the paint drops. Drag the paint drops across the surface in straight lines, curved patterns, or any design that suits your style. Instead of cardboard, you can use an expired credit card or old gift card. Fold the paper in half and glue on lettering. To create a card, let the paint dry then untape the cardstock from the wax paper or cookie sheet. Fold it in half so the painted sides face out, and choose the side you like best for the front. Grab some letter cutouts or stickers, and glue or stick them onto the front to spell out a greeting. Using Bright Pastels and Black Paint Color your entire paper with oil pastels. Cover the entire surface of a heavyweight paper with bright pastel colors. You can create any design, from rainbow stripes to polkadots. Just make sure you color the entire sheet of paper. For best results, press hard on the pastels when you color the paper. If you don’t have pastels, you can also use brightly colored crayons. Paint the entire surface with black India ink. After you’ve colored the paper, paint the entire surface with black India ink. Give the paint time to dry after you’ve covered the whole surface. If you don’t have India ink, try using black poster paint. Pour poster paint into a small bowl and mix in a drop of dish soap to help it stick to the pastel layer. Scrape off the black ink to create a design or image. Use a paperclip or popsicle stick to scrape lines into the black ink and reveal the bright pastel layer below. You can etch any shapes or designs you’d like. Try making images like stars and planets, a city skyline, flowers, or fireworks. Try experimenting with the paperclip and popsicle stick to create lines with varying thickness and fine details. Trying Fine Art Scraping Techniques Use sgraffito to create hair and other linear details. Sgraffito is when a painter scratches through a top layer of paint to expose the pigment beneath. It’s great for linear details, like hair. Next time you paint a portrait, try using a thin painting knife or utility blade to scratch thin lines for your figure’s hair. When scraping away a top layer of paint, make sure the undercoat is completely dry or you’ll end up muddying your colors. Use a credit card or foam dipped in paint to create details. You can use a scraping technique to create details like individual tree trunks in a forest. Try cutting up an expired credit card or piece of foam board. Dip the pieces in paint and dab or scrape them to create details. You can use oil or acrylic paint if you're using a credit card. Pieces of foam board work best with acrylic. Try scraping them across the surface to create bodies of water or windows in a building. You can also lightly dab the paint-dipped pieces right onto your composition to create trees, blades of grass, and other lines. Blend horizon lines in a landscape by scumbling. Like sgraffito, scumbling involves using a knife to scrape away small sections of a painting’s top coat. First, try painting a sky in your painting's first coats, then use the next layers of paint to suggest a tree-lined horizon. Use a knife to scramble, or remove, bits of the treeline to create small holes where the sky peeks through branches. Scumbling works for oil and acrylic paints. To avoid muddying colors, make sure the undercoat paint is dry before scumbling over it. Try making abstract works with scraping tools. In addition to portraits and landscapes, paint scraping techniques are useful when creating abstract works. Try spreading layers of paint with a palette knife, spatula, or squeegee. Use the tools to scrape the surface and remove patches of paint, blend pigments, or create expressive gestures. Many great contemporary abstract painters use scraping tools to create improvised marks.",
    "sentences": [
        " Making Paint Scrape Cards Tape your paper onto a covered work surface.",
        "Tape a large sheet of wax paper onto a table or countertop to create a protected work surface.",
        "Then tape a heavyweight paper, such as cardstock, onto the wax paper.",
        "Since it’s taped to the surface, it won’t move around when you scrape it.",
        "You can also use a cookie sheet as an easy to clean work surface.",
        "Squeeze drops of paint along one side of the paper.",
        "Grab some squeeze bottles of acrylic paint in assorted colors.",
        "Apply drops of paint along one edge of the cardstock, leaving the rest of the sheet blank.",
        "If the rest of the sheet is blank, you'll be able to drag the colors across the paper without muddying colors.",
        "Vary the drops’ sizes and colors to create patterns.",
        "Try arranging the dots in a staggered pattern, or at different distances from the edge of the paper.",
        "That way, the lines you'll make by spreading the paint across the paper will have a scalloped pattern.",
        "Spread the colors with a piece of cardboard.",
        "Scrape a small square of cardboard or foam board across the paper, starting from the side with the paint drops.",
        "Drag the paint drops across the surface in straight lines, curved patterns, or any design that suits your style.",
        "Instead of cardboard, you can use an expired credit card or old gift card.",
        "Fold the paper in half and glue on lettering.",
        "To create a card, let the paint dry then untape the cardstock from the wax paper or cookie sheet.",
        "Fold it in half so the painted sides face out, and choose the side you like best for the front.",
        "Grab some letter cutouts or stickers, and glue or stick them onto the front to spell out a greeting.",
        "Using Bright Pastels and Black Paint Color your entire paper with oil pastels.",
        "Cover the entire surface of a heavyweight paper with bright pastel colors.",
        "You can create any design, from rainbow stripes to polkadots.",
        "Just make sure you color the entire sheet of paper.",
        "For best results, press hard on the pastels when you color the paper.",
        "If you don’t have pastels, you can also use brightly colored crayons.",
        "Paint the entire surface with black India ink.",
        "After you’ve colored the paper, paint the entire surface with black India ink.",
        "Give the paint time to dry after you’ve covered the whole surface.",
        "If you don’t have India ink, try using black poster paint.",
        "Pour poster paint into a small bowl and mix in a drop of dish soap to help it stick to the pastel layer.",
        "Scrape off the black ink to create a design or image.",
        "Use a paperclip or popsicle stick to scrape lines into the black ink and reveal the bright pastel layer below.",
        "You can etch any shapes or designs you’d like.",
        "Try making images like stars and planets, a city skyline, flowers, or fireworks.",
        "Try experimenting with the paperclip and popsicle stick to create lines with varying thickness and fine details.",
        "Trying Fine Art Scraping Techniques Use sgraffito to create hair and other linear details.",
        "Sgraffito is when a painter scratches through a top layer of paint to expose the pigment beneath.",
        "It’s great for linear details, like hair.",
        "Next time you paint a portrait, try using a thin painting knife or utility blade to scratch thin lines for your figure’s hair.",
        "When scraping away a top layer of paint, make sure the undercoat is completely dry or you’ll end up muddying your colors.",
        "Use a credit card or foam dipped in paint to create details.",
        "You can use a scraping technique to create details like individual tree trunks in a forest.",
        "Try cutting up an expired credit card or piece of foam board.",
        "Dip the pieces in paint and dab or scrape them to create details.",
        "You can use oil or acrylic paint if you're using a credit card.",
        "Pieces of foam board work best with acrylic.",
        "Try scraping them across the surface to create bodies of water or windows in a building.",
        "You can also lightly dab the paint-dipped pieces right onto your composition to create trees, blades of grass, and other lines.",
        "Blend horizon lines in a landscape by scumbling.",
        "Like sgraffito, scumbling involves using a knife to scrape away small sections of a painting’s top coat.",
        "First, try painting a sky in your painting's first coats, then use the next layers of paint to suggest a tree-lined horizon.",
        "Use a knife to scramble, or remove, bits of the treeline to create small holes where the sky peeks through branches.",
        "Scumbling works for oil and acrylic paints.",
        "To avoid muddying colors, make sure the undercoat paint is dry before scumbling over it.",
        "Try making abstract works with scraping tools.",
        "In addition to portraits and landscapes, paint scraping techniques are useful when creating abstract works.",
        "Try spreading layers of paint with a palette knife, spatula, or squeegee.",
        "Use the tools to scrape the surface and remove patches of paint, blend pigments, or create expressive gestures.",
        "Many great contemporary abstract painters use scraping tools to create improvised marks."
    ]
}