{
    "title": "How to Blow Dry Curly Hair",
    "url": "https://www.wikihow.com/Blow-Dry-Curly-Hair",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Hair Texture",
        "Curly Hair"
    ],
    "parts": [
        {
            "name": "Preparing to Dry",
            "steps": [
                {
                    "headline": "Wash your hair.",
                    "description": "You will need to wash your hair before drying it, but do not wash your hair every day if possible. When you do wash it, do not use shampoo every time. Do not aggressively rub the shampoo into your hair. Instead, let the water run through it, and gently massage your scalp. Buy a shampoo that is 100% sulfate- and alcohol-free. Sulfates create frizz, and alcohol dries your hair out. You can go 3 days without washing your hair if it is thick. Use dry shampoo in between washed if your hair looks or feels greasy."
                },
                {
                    "headline": "Remove excess water from your hair.",
                    "description": "Take a soft towel and gently squeeze and pat the excess water out of your hair. Do not use too much force while using a towel because it can cause breakage. Your hair should still be wet, but not sopping. You can use a soft, cotton t-shirt instead of a towel to further prevent breakage. Consider investing in a towel specifically made for hair drying."
                },
                {
                    "headline": "Apply a leave-in conditioner.",
                    "description": "It takes natural oils longer to travel from the scalp to the ends of curly hair, which makes curly hair more vulnerable to damage. That is why it is important to condition your hair well. Look for a leave-in conditioner that is made for curly hair. Use a wide-tooth comb to evenly distribute the product throughout your hair. You can also deep condition your hair with a mask every week to keep it moisturized."
                },
                {
                    "headline": "Use a styling product.",
                    "description": "Apply a styling product while your hair is still wet. Using a styling product before drying will help your hair maintain full, bouncy curls. The type of styling product you use depends on your hair type. Distribute the product through your hair from root to ends, scrunch, and then squeeze your hair upwards, towards your scalp. Sprays are best for those with soft curls. Use thicker gels for medium to big curls. A thick gel should have a consistency similar to shampoo and be fairly easy to spread in your hands. Try dense gels for tight coils. A dense gel will probably be a bit sticky and more difficult spread. Don’t use more than a dime-size portion of product. Too much product will make your curls crunchy."
                },
                {
                    "headline": "Use a heat-protectant spray.",
                    "description": "You should use a heat-protectant product no matter what your hair type is, as the heat of blow drying has damaging effects on hair. Heat-protectant products come in both creams and sprays. To use it, divide your hair into 4 sections with clips or bobby pins. Then, coat each section thoroughly with the product of your choice. Some leave-in conditioners are also heat-protectant products, so you may want to choose a product with both benefits."
                }
            ]
        },
        {
            "name": "Drying Curly Hair",
            "steps": [
                {
                    "headline": "Choose a dryer with a diffuser.",
                    "description": "Some hair dryers come with an attachable diffuser, but you may have to buy one separately. A diffuser is a must for curly hair because it dries curls evenly for a full, uniform look. A hair dryer without a diffuser only focuses on one section of hair at a time, which disrupts the curl pattern. A diffuser will also help to prevent frizz."
                },
                {
                    "headline": "Divide your hair into 3 sections.",
                    "description": "You should not dry all of your hair at once. Instead, part it into 3 sections. You may need more or fewer sections depending on the thickness of your hair. Part your hair in the middle and make 2 buns on either side of your head. Leave the back section of your hair in a ponytail or down. Dividing your hair into sections will make sure the heat is distributed evenly while you are drying it. Make sure the sections are clean and neat. Use bobby pins, barrettes, pins, or ponytail holders to hold them in place. Don’t make any section larger than what your pin, barrette, or hair tie can easily hold."
                },
                {
                    "headline": "Put your dryer on a low heat setting.",
                    "description": "A high heat setting is more damaging than a lower setting, and it makes your hair harder to style. Use a low heat setting to start off with. You can switch to a medium heat once your hair begins to dry."
                },
                {
                    "headline": "Start drying at the roots.",
                    "description": "Choose a top section of your hair, take it down, and apply the diffuser to the roots. Constantly move your hair dryer around, and work from root to end on each section of hair. The ends are the most easily damaged part of your hair, so allow them to air dry as long as possible. Keeping the hair dryer in one place for too long promotes damage."
                },
                {
                    "headline": "Use the cool setting.",
                    "description": "Once your hair is dry, bend over and flip your hair. Press the “cool” button, and blast your hair on that setting for a few minutes. Flipping it over and blowing it upside down will add some volume to your hair. You don’t need to do this if you are satisfied with the volume of your hair."
                }
            ]
        },
        {
            "name": "Styling Your Hair",
            "steps": [
                {
                    "headline": "Apply a pomade or oil.",
                    "description": "Once your hair is dry, apply a pomade or oil to your hair to promote smoothness and tame any excess frizz. Take your hair in you hands as if you were putting it in a ponytail, apply the product from roots to the ends, and then let go. Then, massage your scalp for added volume. It is recommended to use a pea-sized drop of product, or only use a few spritzes if you’re using a spray. If that is not enough to coat your hair, then apply a few more drops until every section of hair is covered. If possible, search for organic products that do not have alcohol in them."
                },
                {
                    "headline": "Do not use a brush.",
                    "description": "Avoid brushing your hair until the next time you wash it. If possible, completely avoid using a brush. The bristles of a brush contribute to fraying your hair, therefore promoting frizz. Keeping your brush away from your hair will keep your curls fresh and shapely. Comb out tangles with a wide-tooth comb."
                },
                {
                    "headline": "Maintain your curls.",
                    "description": "Curls can lose their volume pretty quickly, but there are a few things you can do to prevent them from going limp. Along with avoiding a brush, you should also avoid running your fingers through your hair to prevent frizz. To renew volume, spray your hair lightly with water and blow dry on a low heat setting for a few minutes. This will reactivate your styling products. You can make an anti-frizz spray by adding 4 parts water and 1 part conditioner to a spray bottle."
                }
            ]
        }
    ],
    "tyn": [
        "A blow dryer with a diffuser",
        "Towel",
        "Styling and heat-protectant product",
        "Hair clips",
        "A wide-tooth comb"
    ],
    "text": " Preparing to Dry Wash your hair. You will need to wash your hair before drying it, but do not wash your hair every day if possible. When you do wash it, do not use shampoo every time. Do not aggressively rub the shampoo into your hair. Instead, let the water run through it, and gently massage your scalp. Buy a shampoo that is 100% sulfate- and alcohol-free. Sulfates create frizz, and alcohol dries your hair out. You can go 3 days without washing your hair if it is thick. Use dry shampoo in between washed if your hair looks or feels greasy. Remove excess water from your hair. Take a soft towel and gently squeeze and pat the excess water out of your hair. Do not use too much force while using a towel because it can cause breakage. Your hair should still be wet, but not sopping. You can use a soft, cotton t-shirt instead of a towel to further prevent breakage. Consider investing in a towel specifically made for hair drying. Apply a leave-in conditioner. It takes natural oils longer to travel from the scalp to the ends of curly hair, which makes curly hair more vulnerable to damage. That is why it is important to condition your hair well. Look for a leave-in conditioner that is made for curly hair. Use a wide-tooth comb to evenly distribute the product throughout your hair. You can also deep condition your hair with a mask every week to keep it moisturized. Use a styling product. Apply a styling product while your hair is still wet. Using a styling product before drying will help your hair maintain full, bouncy curls. The type of styling product you use depends on your hair type. Distribute the product through your hair from root to ends, scrunch, and then squeeze your hair upwards, towards your scalp. Sprays are best for those with soft curls. Use thicker gels for medium to big curls. A thick gel should have a consistency similar to shampoo and be fairly easy to spread in your hands. Try dense gels for tight coils. A dense gel will probably be a bit sticky and more difficult spread. Don’t use more than a dime-size portion of product. Too much product will make your curls crunchy. Use a heat-protectant spray. You should use a heat-protectant product no matter what your hair type is, as the heat of blow drying has damaging effects on hair. Heat-protectant products come in both creams and sprays. To use it, divide your hair into 4 sections with clips or bobby pins. Then, coat each section thoroughly with the product of your choice. Some leave-in conditioners are also heat-protectant products, so you may want to choose a product with both benefits. Drying Curly Hair Choose a dryer with a diffuser. Some hair dryers come with an attachable diffuser, but you may have to buy one separately. A diffuser is a must for curly hair because it dries curls evenly for a full, uniform look. A hair dryer without a diffuser only focuses on one section of hair at a time, which disrupts the curl pattern. A diffuser will also help to prevent frizz. Divide your hair into 3 sections. You should not dry all of your hair at once. Instead, part it into 3 sections. You may need more or fewer sections depending on the thickness of your hair. Part your hair in the middle and make 2 buns on either side of your head. Leave the back section of your hair in a ponytail or down. Dividing your hair into sections will make sure the heat is distributed evenly while you are drying it. Make sure the sections are clean and neat. Use bobby pins, barrettes, pins, or ponytail holders to hold them in place. Don’t make any section larger than what your pin, barrette, or hair tie can easily hold. Put your dryer on a low heat setting. A high heat setting is more damaging than a lower setting, and it makes your hair harder to style. Use a low heat setting to start off with. You can switch to a medium heat once your hair begins to dry. Start drying at the roots. Choose a top section of your hair, take it down, and apply the diffuser to the roots. Constantly move your hair dryer around, and work from root to end on each section of hair. The ends are the most easily damaged part of your hair, so allow them to air dry as long as possible. Keeping the hair dryer in one place for too long promotes damage. Use the cool setting. Once your hair is dry, bend over and flip your hair. Press the “cool” button, and blast your hair on that setting for a few minutes. Flipping it over and blowing it upside down will add some volume to your hair. You don’t need to do this if you are satisfied with the volume of your hair. Styling Your Hair Apply a pomade or oil. Once your hair is dry, apply a pomade or oil to your hair to promote smoothness and tame any excess frizz. Take your hair in you hands as if you were putting it in a ponytail, apply the product from roots to the ends, and then let go. Then, massage your scalp for added volume. It is recommended to use a pea-sized drop of product, or only use a few spritzes if you’re using a spray. If that is not enough to coat your hair, then apply a few more drops until every section of hair is covered. If possible, search for organic products that do not have alcohol in them. Do not use a brush. Avoid brushing your hair until the next time you wash it. If possible, completely avoid using a brush. The bristles of a brush contribute to fraying your hair, therefore promoting frizz. Keeping your brush away from your hair will keep your curls fresh and shapely. Comb out tangles with a wide-tooth comb. Maintain your curls. Curls can lose their volume pretty quickly, but there are a few things you can do to prevent them from going limp. Along with avoiding a brush, you should also avoid running your fingers through your hair to prevent frizz. To renew volume, spray your hair lightly with water and blow dry on a low heat setting for a few minutes. This will reactivate your styling products. You can make an anti-frizz spray by adding 4 parts water and 1 part conditioner to a spray bottle.",
    "sentences": [
        " Preparing to Dry Wash your hair.",
        "You will need to wash your hair before drying it, but do not wash your hair every day if possible.",
        "When you do wash it, do not use shampoo every time.",
        "Do not aggressively rub the shampoo into your hair.",
        "Instead, let the water run through it, and gently massage your scalp.",
        "Buy a shampoo that is 100% sulfate- and alcohol-free.",
        "Sulfates create frizz, and alcohol dries your hair out.",
        "You can go 3 days without washing your hair if it is thick.",
        "Use dry shampoo in between washed if your hair looks or feels greasy.",
        "Remove excess water from your hair.",
        "Take a soft towel and gently squeeze and pat the excess water out of your hair.",
        "Do not use too much force while using a towel because it can cause breakage.",
        "Your hair should still be wet, but not sopping.",
        "You can use a soft, cotton t-shirt instead of a towel to further prevent breakage.",
        "Consider investing in a towel specifically made for hair drying.",
        "Apply a leave-in conditioner.",
        "It takes natural oils longer to travel from the scalp to the ends of curly hair, which makes curly hair more vulnerable to damage.",
        "That is why it is important to condition your hair well.",
        "Look for a leave-in conditioner that is made for curly hair.",
        "Use a wide-tooth comb to evenly distribute the product throughout your hair.",
        "You can also deep condition your hair with a mask every week to keep it moisturized.",
        "Use a styling product.",
        "Apply a styling product while your hair is still wet.",
        "Using a styling product before drying will help your hair maintain full, bouncy curls.",
        "The type of styling product you use depends on your hair type.",
        "Distribute the product through your hair from root to ends, scrunch, and then squeeze your hair upwards, towards your scalp.",
        "Sprays are best for those with soft curls.",
        "Use thicker gels for medium to big curls.",
        "A thick gel should have a consistency similar to shampoo and be fairly easy to spread in your hands.",
        "Try dense gels for tight coils.",
        "A dense gel will probably be a bit sticky and more difficult spread.",
        "Don’t use more than a dime-size portion of product.",
        "Too much product will make your curls crunchy.",
        "Use a heat-protectant spray.",
        "You should use a heat-protectant product no matter what your hair type is, as the heat of blow drying has damaging effects on hair.",
        "Heat-protectant products come in both creams and sprays.",
        "To use it, divide your hair into 4 sections with clips or bobby pins.",
        "Then, coat each section thoroughly with the product of your choice.",
        "Some leave-in conditioners are also heat-protectant products, so you may want to choose a product with both benefits.",
        "Drying Curly Hair Choose a dryer with a diffuser.",
        "Some hair dryers come with an attachable diffuser, but you may have to buy one separately.",
        "A diffuser is a must for curly hair because it dries curls evenly for a full, uniform look.",
        "A hair dryer without a diffuser only focuses on one section of hair at a time, which disrupts the curl pattern.",
        "A diffuser will also help to prevent frizz.",
        "Divide your hair into 3 sections.",
        "You should not dry all of your hair at once.",
        "Instead, part it into 3 sections.",
        "You may need more or fewer sections depending on the thickness of your hair.",
        "Part your hair in the middle and make 2 buns on either side of your head.",
        "Leave the back section of your hair in a ponytail or down.",
        "Dividing your hair into sections will make sure the heat is distributed evenly while you are drying it.",
        "Make sure the sections are clean and neat.",
        "Use bobby pins, barrettes, pins, or ponytail holders to hold them in place.",
        "Don’t make any section larger than what your pin, barrette, or hair tie can easily hold.",
        "Put your dryer on a low heat setting.",
        "A high heat setting is more damaging than a lower setting, and it makes your hair harder to style.",
        "Use a low heat setting to start off with.",
        "You can switch to a medium heat once your hair begins to dry.",
        "Start drying at the roots.",
        "Choose a top section of your hair, take it down, and apply the diffuser to the roots.",
        "Constantly move your hair dryer around, and work from root to end on each section of hair.",
        "The ends are the most easily damaged part of your hair, so allow them to air dry as long as possible.",
        "Keeping the hair dryer in one place for too long promotes damage.",
        "Use the cool setting.",
        "Once your hair is dry, bend over and flip your hair.",
        "Press the “cool” button, and blast your hair on that setting for a few minutes.",
        "Flipping it over and blowing it upside down will add some volume to your hair.",
        "You don’t need to do this if you are satisfied with the volume of your hair.",
        "Styling Your Hair Apply a pomade or oil.",
        "Once your hair is dry, apply a pomade or oil to your hair to promote smoothness and tame any excess frizz.",
        "Take your hair in you hands as if you were putting it in a ponytail, apply the product from roots to the ends, and then let go.",
        "Then, massage your scalp for added volume.",
        "It is recommended to use a pea-sized drop of product, or only use a few spritzes if you’re using a spray.",
        "If that is not enough to coat your hair, then apply a few more drops until every section of hair is covered.",
        "If possible, search for organic products that do not have alcohol in them.",
        "Do not use a brush.",
        "Avoid brushing your hair until the next time you wash it.",
        "If possible, completely avoid using a brush.",
        "The bristles of a brush contribute to fraying your hair, therefore promoting frizz.",
        "Keeping your brush away from your hair will keep your curls fresh and shapely.",
        "Comb out tangles with a wide-tooth comb.",
        "Maintain your curls.",
        "Curls can lose their volume pretty quickly, but there are a few things you can do to prevent them from going limp.",
        "Along with avoiding a brush, you should also avoid running your fingers through your hair to prevent frizz.",
        "To renew volume, spray your hair lightly with water and blow dry on a low heat setting for a few minutes.",
        "This will reactivate your styling products.",
        "You can make an anti-frizz spray by adding 4 parts water and 1 part conditioner to a spray bottle."
    ]
}