{
    "title": "How to Melt Nutella",
    "url": "https://www.wikihow.com/Melt-Nutella",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Basic Cooking Skills"
    ],
    "methods": [
        {
            "name": "Using a Microwave",
            "steps": [
                {
                    "headline": "Scoop the Nutella into a bowl.",
                    "description": "Determine how much Nutella you need to melt, especially if you're using it for a recipe. Scoop the hard Nutella into a microwave-safe bowl or dish. Avoid using a plastic bowl or plastic spoon to stir the Nutella. These can melt or leach chemicals into the Nutella."
                },
                {
                    "headline": "Microwave the Nutella for 15 seconds.",
                    "description": "Set your microwave to the medium-low setting. Place the uncovered bowl of Nutella in the microwave and heat it for 15 seconds."
                },
                {
                    "headline": "Stir the Nutella and microwave it for 15 more seconds.",
                    "description": "Open the microwave and stir the Nutella with a metal or wooden spoon. This will help it melt evenly. Microwave the Nutella for 15 more seconds."
                },
                {
                    "headline": "Stir the Nutella and check the consistency.",
                    "description": "Stir the Nutella again to see if it's melted or if there are still thick clumps. Continue to microwave the Nutella in 15-second intervals until it's melted. Avoid microwaving the Nutella too much or it can burn and clump up again."
                }
            ]
        },
        {
            "name": "Using Hot Water",
            "steps": [
                {
                    "headline": "Bring a pot of water to boil.",
                    "description": "Fill a water kettle and turn it on to high heat. The water should boil within a few minutes."
                },
                {
                    "headline": "Pour boiling water into a bowl.",
                    "description": "Get out a heat-proof bowl and carefully pour enough hot water to fill the bowl halfway. Avoid pouring in too much water or it will spill over the side of the bowl when you add the Nutella."
                },
                {
                    "headline": "Place the jar of Nutella in the hot water.",
                    "description": "Remove the lid from the jar of Nutella and set the jar into the bowl of hot water. Ensure that water can't get into the jar. If you want to heat a small amount, you can scoop some into a small bowl. You can place this bowl of Nutella into the bowl of hot water as long as water won't come over the sides and into the Nutella."
                },
                {
                    "headline": "Soften and stir the Nutella.",
                    "description": "Let the Nutella sit in the hot water for about 5 minutes. Stir the Nutella with a wooden or metal spoon  and remove it the jar from the water if it's melted. If not, let the Nutella sit in the hot water until it's melted. This is a gentle way of heating the Nutella because you won't actually cook or overheat it."
                }
            ]
        },
        {
            "name": "Using a Hot Knife or Spoon",
            "steps": [
                {
                    "headline": "Heat a metal knife or spoon under hot water.",
                    "description": "If you only need to melt or soften a little bit of Nutella, get out a butter knife or spoon. Run hot water into a cup and put the spoon or knife in the hot water. Let it sit in the cup for about one minute. This will heat up the metal. You can also buy an electric butter spreader. This small knife will actually warm itself so you can use it to scoop out and melt a small amount of Nutella."
                },
                {
                    "headline": "Consider heating the knife or spoon in your coffee or tea.",
                    "description": "Some people find that they always have coffee or tea with their toast and Nutella. For a shortcut, you could simply put your spoon or butter knife directly into your coffee or tea. Leave it in there for one minute to heat up the metal."
                },
                {
                    "headline": "Spread the Nutella until it melts.",
                    "description": "Remove the butter knife or spoon from the hot water, coffee or tea. Quickly wipe it on a clean cloth so you don't get water into your jar of Nutella. Scrape up as much Nutella as you need and spread it on whatever you're using. Keep spreading the Nutella until the heat from the knife or spoon melts it. If your knife or spoon cools off too much, just wipe it clean and reinsert it into the hot water, coffee or tea for another minute. Then you can continue to spread and melt the Nutella."
                }
            ]
        }
    ],
    "tyn": [
        "Water kettle",
        "Metal spoon",
        "Metal butter knife",
        "Electric butter spreader",
        "Cup",
        "Heat-proof bowl",
        "Small saucepan",
        "Microwave"
    ],
    "text": " Using a Microwave Scoop the Nutella into a bowl. Determine how much Nutella you need to melt, especially if you're using it for a recipe. Scoop the hard Nutella into a microwave-safe bowl or dish. Avoid using a plastic bowl or plastic spoon to stir the Nutella. These can melt or leach chemicals into the Nutella. Microwave the Nutella for 15 seconds. Set your microwave to the medium-low setting. Place the uncovered bowl of Nutella in the microwave and heat it for 15 seconds. Stir the Nutella and microwave it for 15 more seconds. Open the microwave and stir the Nutella with a metal or wooden spoon. This will help it melt evenly. Microwave the Nutella for 15 more seconds. Stir the Nutella and check the consistency. Stir the Nutella again to see if it's melted or if there are still thick clumps. Continue to microwave the Nutella in 15-second intervals until it's melted. Avoid microwaving the Nutella too much or it can burn and clump up again. Using Hot Water Bring a pot of water to boil. Fill a water kettle and turn it on to high heat. The water should boil within a few minutes. Pour boiling water into a bowl. Get out a heat-proof bowl and carefully pour enough hot water to fill the bowl halfway. Avoid pouring in too much water or it will spill over the side of the bowl when you add the Nutella. Place the jar of Nutella in the hot water. Remove the lid from the jar of Nutella and set the jar into the bowl of hot water. Ensure that water can't get into the jar. If you want to heat a small amount, you can scoop some into a small bowl. You can place this bowl of Nutella into the bowl of hot water as long as water won't come over the sides and into the Nutella. Soften and stir the Nutella. Let the Nutella sit in the hot water for about 5 minutes. Stir the Nutella with a wooden or metal spoon  and remove it the jar from the water if it's melted. If not, let the Nutella sit in the hot water until it's melted. This is a gentle way of heating the Nutella because you won't actually cook or overheat it. Using a Hot Knife or Spoon Heat a metal knife or spoon under hot water. If you only need to melt or soften a little bit of Nutella, get out a butter knife or spoon. Run hot water into a cup and put the spoon or knife in the hot water. Let it sit in the cup for about one minute. This will heat up the metal. You can also buy an electric butter spreader. This small knife will actually warm itself so you can use it to scoop out and melt a small amount of Nutella. Consider heating the knife or spoon in your coffee or tea. Some people find that they always have coffee or tea with their toast and Nutella. For a shortcut, you could simply put your spoon or butter knife directly into your coffee or tea. Leave it in there for one minute to heat up the metal. Spread the Nutella until it melts. Remove the butter knife or spoon from the hot water, coffee or tea. Quickly wipe it on a clean cloth so you don't get water into your jar of Nutella. Scrape up as much Nutella as you need and spread it on whatever you're using. Keep spreading the Nutella until the heat from the knife or spoon melts it. If your knife or spoon cools off too much, just wipe it clean and reinsert it into the hot water, coffee or tea for another minute. Then you can continue to spread and melt the Nutella.",
    "sentences": [
        " Using a Microwave Scoop the Nutella into a bowl.",
        "Determine how much Nutella you need to melt, especially if you're using it for a recipe.",
        "Scoop the hard Nutella into a microwave-safe bowl or dish.",
        "Avoid using a plastic bowl or plastic spoon to stir the Nutella.",
        "These can melt or leach chemicals into the Nutella.",
        "Microwave the Nutella for 15 seconds.",
        "Set your microwave to the medium-low setting.",
        "Place the uncovered bowl of Nutella in the microwave and heat it for 15 seconds.",
        "Stir the Nutella and microwave it for 15 more seconds.",
        "Open the microwave and stir the Nutella with a metal or wooden spoon.",
        "This will help it melt evenly.",
        "Microwave the Nutella for 15 more seconds.",
        "Stir the Nutella and check the consistency.",
        "Stir the Nutella again to see if it's melted or if there are still thick clumps.",
        "Continue to microwave the Nutella in 15-second intervals until it's melted.",
        "Avoid microwaving the Nutella too much or it can burn and clump up again.",
        "Using Hot Water Bring a pot of water to boil.",
        "Fill a water kettle and turn it on to high heat.",
        "The water should boil within a few minutes.",
        "Pour boiling water into a bowl.",
        "Get out a heat-proof bowl and carefully pour enough hot water to fill the bowl halfway.",
        "Avoid pouring in too much water or it will spill over the side of the bowl when you add the Nutella.",
        "Place the jar of Nutella in the hot water.",
        "Remove the lid from the jar of Nutella and set the jar into the bowl of hot water.",
        "Ensure that water can't get into the jar.",
        "If you want to heat a small amount, you can scoop some into a small bowl.",
        "You can place this bowl of Nutella into the bowl of hot water as long as water won't come over the sides and into the Nutella.",
        "Soften and stir the Nutella.",
        "Let the Nutella sit in the hot water for about 5 minutes.",
        "Stir the Nutella with a wooden or metal spoon  and remove it the jar from the water if it's melted.",
        "If not, let the Nutella sit in the hot water until it's melted.",
        "This is a gentle way of heating the Nutella because you won't actually cook or overheat it.",
        "Using a Hot Knife or Spoon Heat a metal knife or spoon under hot water.",
        "If you only need to melt or soften a little bit of Nutella, get out a butter knife or spoon.",
        "Run hot water into a cup and put the spoon or knife in the hot water.",
        "Let it sit in the cup for about one minute.",
        "This will heat up the metal.",
        "You can also buy an electric butter spreader.",
        "This small knife will actually warm itself so you can use it to scoop out and melt a small amount of Nutella.",
        "Consider heating the knife or spoon in your coffee or tea.",
        "Some people find that they always have coffee or tea with their toast and Nutella.",
        "For a shortcut, you could simply put your spoon or butter knife directly into your coffee or tea.",
        "Leave it in there for one minute to heat up the metal.",
        "Spread the Nutella until it melts.",
        "Remove the butter knife or spoon from the hot water, coffee or tea.",
        "Quickly wipe it on a clean cloth so you don't get water into your jar of Nutella.",
        "Scrape up as much Nutella as you need and spread it on whatever you're using.",
        "Keep spreading the Nutella until the heat from the knife or spoon melts it.",
        "If your knife or spoon cools off too much, just wipe it clean and reinsert it into the hot water, coffee or tea for another minute.",
        "Then you can continue to spread and melt the Nutella."
    ]
}