{
    "title": "How to Make Glass Candy",
    "url": "https://www.wikihow.com/Make-Glass-Candy",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Chocolate and Candy"
    ],
    "methods": [
        {
            "name": "Making the Sugar Mixture on the Stove",
            "steps": [
                {
                    "headline": "Mix sugar, corn syrup, and water together in a medium saucepan.",
                    "description": "Use a whisk to combine 2 cups (400 g) of white sugar, ⁄2 cup (120 mL) of light corn syrup, and 1 cup (240 mL) of water in a saucepan with a heavy bottom. It’s okay if the sugar doesn’t dissolve, but make sure to stir the ingredients so they’re completely combined. When you’re making candy, use the sturdiest pan you have. If you use a saucepan that’s too light, the sugar will scorch as you’re heating it. An 8 in (20 cm) saucepan is perfect for this job."
                },
                {
                    "headline": "Clip a candy thermometer to the side of the pan.",
                    "description": "When you’re making candy, it’s important that the sugar reaches a certain temperature in order for it to set up properly. The easiest way to do this is by monitoring the temperature with a candy thermometer. If you have one that you can attach to the pan, you’ll be able to keep a close eye on the thermometer while keeping your hands free. If your thermometer doesn’t clip to the pan, you can just hold it when it’s time to check the temperature. If you don’t have a candy thermometer, you’ll need to know how to test the candy’s hardness stages by hand."
                },
                {
                    "headline": "Heat the sugar mixture to 300 °F (149 °C), stirring constantly.",
                    "description": "Turn your stove to medium or medium-high heat to heat the sugar, corn syrup, and water to a boil. Use a wooden spoon to stir the mixture continuously while it’s heating. Remember to scrape the sides and the bottom of the bowl frequently so the sugar doesn’t start to crystallize on the surface of the saucepan. At medium-high heat, it should take about 5 minutes for the sugar to come to a boil. If you have the stove set to medium heat, it will take a little longer, but you’ll be less likely to burn the mixture. If the sugar doesn’t reach 300 °F (149 °C), it won’t harden properly, and your glass will be sticky and not brittle. Sugar can scorch very quickly, so don’t leave the pan unattended while you’re doing this! Tip: To test the temperature without a thermometer, drizzle a little of the syrup into a bowl of cold water. At 300–310 °F (149–154 °C), the syrup should form brittle threads that snap when you try to bend them."
                },
                {
                    "headline": "Remove the pan from the heat.",
                    "description": "Once the sugar reaches 300 °F (149 °C), carefully take the hot saucepan off of the stove so it doesn’t burn. At this point, your mixture should be amber-colored and very sticky. Be very careful when you’re moving the pan, as the sugar will be extremely hot!"
                },
                {
                    "headline": "Stir in any flavorings or color you'd like to use.",
                    "description": "It’s perfectly fine to leave your glass as-is if you want. However, if you want colored glass, or if you’d like to add a flavor to the candy, add in your food coloring or flavored extract and stir it in. Work quickly, because you need to pour the sugar out before it starts to harden. For example, if you want to make sea glass, stir in 1-2 drops of blue food coloring, or a combination of blue and white or blue and green. The cool blue sea glass pairs well with 1 teaspoon (4.9 mL) of coconut essential oil, but you could also use peppermint if you prefer. If you’re making stained glass, make several batches of sugar and color each one a different hue. You can even match each color with a different flavor, like cherry or cinnamon for red and lime or apple for green!"
                }
            ]
        },
        {
            "name": "Microwaving the Sugar Mixture",
            "steps": [
                {
                    "headline": "Mix sugar and light corn syrup in a microwave-safe bowl.",
                    "description": "If you’re not comfortable with heating sugar on the stovetop, try making glass candy in the microwave instead! Pour 1 cup (100 g) of sugar and ⁄2 cup (120 mL) of light corn syrup into a bowl and whisk them together thoroughly. It’s okay if the sugar isn’t dissolved when you’re finished. Try to use a bowl that holds about 2 cups (470 mL) of liquid. That way, you won't spill the hot sugar mixture when you're taking the bowl out of the microwave. To tell if a bowl is microwave-safe, look on the bottom for a symbol that looks like 3 wavy lines. Tip: If the bowl doesn’t have a symbol, do a safety test by microwaving the empty bowl along with a separate cup full of water for 1 minute. If the empty bowl is cool after that minute, it’s microwave-safe. If it feels hot to the touch, you should find another bowl."
                },
                {
                    "headline": "Cover the bowl with plastic wrap.",
                    "description": "To keep in the heat and prevent the sugar from bubbling over in the microwave, it’s best to cover the bowl. Tear off a sheet of plastic wrap and stretch it over the mouth of the bowl, then smooth it down the sides of the bowl until it forms a tight seal. If the sugar spills in your microwave, it could be really hard to clean off. Also, you could get burned if you accidentally touch the hot sugar."
                },
                {
                    "headline": "Place the bowl in the microwave for 2-3 minutes.",
                    "description": "If you have an 1100-watt microwave, which is standard for most household microwaves, heat the sugar mixture for about 2-3 minutes on high heat. If your microwave uses a lower wattage, consult the user’s manual to determine the equivalent amount of time for your appliance. The sugar should be a light golden color when it’s finished. Due to the differences in microwaves, temperatures and cooking times may vary. Keep an eye on the sugar while it’s heating. Stop the microwave if the sugar starts to boil over or scorch."
                },
                {
                    "headline": "Replace the plastic wrap, but do not stir the sugar.",
                    "description": "During the first heating, condensation will form on the plastic wrap. To prevent this moisture from getting in the sugar and changing the consistency of your candy, carefully lift away the plastic wrap and replace it with a fresh sheet. However, there’s no need to stir the sugar mixture when you’re doing this. Carefully open the plastic wrap away from your face so you don’t get burned by escaping steam."
                },
                {
                    "headline": "Microwave the sugar for another 2-3 minutes.",
                    "description": "Once you’ve replaced the plastic, return the bowl to the microwave. Heat it for another 2-3 minutes on high, then carefully remove the bowl from the microwave again. If you had to adjust the time the first time you heated the sugar, use that same time again. If you were to test the temperature of the sugar with a candy thermometer, it should be about 300 °F (149 °C). You could also test the temperature by carefully drizzling a little of the sugar into cold water. The sugar should immediately harden into brittle threads, which is called the hard candy stage."
                },
                {
                    "headline": "Stir in any colorings or flavors you want to add.",
                    "description": "You can leave your glass clear and unflavored if you want, or you can add a few drops of your choice of food coloring or ⁄2 teaspoon (2.5 mL) of your favorite flavored extract. If you do add anything, stir it in quickly once you’re finished heating the try matching the color to the flavoring you’re using. Sea glass is a popular version of this treat. Add a drop of blue food coloring to the mixture and a flavoring like coconut or peppermint. When the candy hardens, lightly dust it with powdered sugar."
                }
            ]
        },
        {
            "name": "Molding the Glass",
            "steps": [
                {
                    "headline": "Spray a large baking sheet with non-stick cooking spray.",
                    "description": "To get the effect of a thin sheet of glass, you’ll need to spread the candy across a large baking sheet. While you can use any size baking sheet you like, keep in mind that a bigger sheet will result in thinner, more glass-like candy. If you made a large batch of glass candy on the stovetop, a good size baking pan would be 12 in × 18 in (30 cm × 46 cm), while a 9 in × 13 in (23 cm × 33 cm) pan would probably be best for a smaller batch made in the microwave. You may want to prepare the baking sheet before you heat the sugar, since you'll need to pour it quickly. If you prefer, you can line the pan with wax paper or silicone sheets rather than using cooking spray. If you're making stained glass or another type of glass that you don't want to break into shards, pour the sugar into a silicone stained glass mold instead of a baking sheet."
                },
                {
                    "headline": "Sift powdered sugar across the pan to make opaque or frosted glass.",
                    "description": "A light coating of powdered sugar is a delicious way to get the effect of frosted glass. Just sprinkle about 1 cup (125 g) of powdered sugar directly onto the bottom of the baking sheet. If you'd like, you can sprinkle more powdered sugar on top of the sugar after you've poured it, as well. After the glass has hardened, you can dust off any excess sugar. If you prefer, you can sprinkle the powdered sugar on the glass after it's hardened. This is often done when making sea glass. You can also skip it altogether."
                },
                {
                    "headline": "Pour the sugar mixture into your baking pan quickly.",
                    "description": "Once you’ve heated your sugar up to 300 °F (149 °C) and added any extracts or food coloring, it’s time to create a sheet of glass. Carefully tilt the saucepan away from you and pour the sugar onto your baking sheet. The sugar will spread out over the sheet, but you can move the pan back and forth to help it spread evenly if you’d like. You can also tilt the pan back and forth to help create an even layer of sugar if you want. The sugar will be very hot, and it will stick to your skin if you touch it. Be careful, or you could end up with a nasty burn!"
                },
                {
                    "headline": "Let the sugar harden at room temperature for about 2 hours.",
                    "description": "After you’ve finished spreading the sugar into your baking pan, place it somewhere to allow it to cool completely. However, don’t put it into the refrigerator. The moisture in your fridge could affect the sugar, leaving your glass candy softer than you’d like."
                },
                {
                    "headline": "Drop the pan onto your counter to make broken glass.",
                    "description": "If you want to make shards of jagged glass, pick up your baking sheet about 2 ft (0.61 m) above the countertop, then drop the pan straight down with moderate force. The sheet of sugar glass should shatter into pieces that resemble broken glass. Continue doing this until the pieces of glass are the size you want. You can also use a mallet or another tool to break the glass if you prefer. Once the sugar glass is broken, you can just pick up the pieces to remove them from the pan. If you poured the glass into silicone molds, carefully bend the mold away from the sugar so the pieces pop out."
                },
                {
                    "headline": "Use a dish towel to rub down very sharp edges of broken glass candy.",
                    "description": "If you shattered the glass, you may end up with some dangerously sharp edges. Before you serve your glass candy, take a dish towel and gently buff any sharp corners or edges. In addition to making your candy safer to eat, this will give your glass a slightly aged look. If you’re making broken glass for a Halloween scene, you may want to leave the sharp edges. Just be careful when you’re eating!"
                },
                {
                    "headline": "Store the glass in an airtight container in a cool place.",
                    "description": "If you’re not going to eat the glass candy right away, place it into a container with an airtight lid. Keep it at room temperature, but away from direct sunlight or other heat sources. However, don't place your candy in the refrigerator, since the moisture in the fridge will cause the glass to get very sticky. The candy will last for about a week. You can also divide it into individual cellophane bags. To keep your candy fresh for about 2 weeks, place silica gel packs in the container. You can find these at any home improvement store."
                }
            ]
        }
    ],
    "tyn": [
        "Making the Glass on the Stove",
        "Whisk",
        "Candy thermometer",
        "Medium-size, heavy-bottomed saucepan",
        "Wooden spoon",
        "Microwaving the Sugar",
        "Microwave-safe bowl",
        "Plastic wrap",
        "Microwave",
        "Molding the Glass",
        "12 by 18 inches (30 cm × 46 cm) baking sheet",
        "Wax paper",
        "Dish towel",
        "Airtight container"
    ],
    "text": " Making the Sugar Mixture on the Stove Mix sugar, corn syrup, and water together in a medium saucepan. Use a whisk to combine 2 cups (400 g) of white sugar, ⁄2 cup (120 mL) of light corn syrup, and 1 cup (240 mL) of water in a saucepan with a heavy bottom. It’s okay if the sugar doesn’t dissolve, but make sure to stir the ingredients so they’re completely combined. When you’re making candy, use the sturdiest pan you have. If you use a saucepan that’s too light, the sugar will scorch as you’re heating it. An 8 in (20 cm) saucepan is perfect for this job. Clip a candy thermometer to the side of the pan. When you’re making candy, it’s important that the sugar reaches a certain temperature in order for it to set up properly. The easiest way to do this is by monitoring the temperature with a candy thermometer. If you have one that you can attach to the pan, you’ll be able to keep a close eye on the thermometer while keeping your hands free. If your thermometer doesn’t clip to the pan, you can just hold it when it’s time to check the temperature. If you don’t have a candy thermometer, you’ll need to know how to test the candy’s hardness stages by hand. Heat the sugar mixture to 300 °F (149 °C), stirring constantly. Turn your stove to medium or medium-high heat to heat the sugar, corn syrup, and water to a boil. Use a wooden spoon to stir the mixture continuously while it’s heating. Remember to scrape the sides and the bottom of the bowl frequently so the sugar doesn’t start to crystallize on the surface of the saucepan. At medium-high heat, it should take about 5 minutes for the sugar to come to a boil. If you have the stove set to medium heat, it will take a little longer, but you’ll be less likely to burn the mixture. If the sugar doesn’t reach 300 °F (149 °C), it won’t harden properly, and your glass will be sticky and not brittle. Sugar can scorch very quickly, so don’t leave the pan unattended while you’re doing this! Tip: To test the temperature without a thermometer, drizzle a little of the syrup into a bowl of cold water. At 300–310 °F (149–154 °C), the syrup should form brittle threads that snap when you try to bend them. Remove the pan from the heat. Once the sugar reaches 300 °F (149 °C), carefully take the hot saucepan off of the stove so it doesn’t burn. At this point, your mixture should be amber-colored and very sticky. Be very careful when you’re moving the pan, as the sugar will be extremely hot! Stir in any flavorings or color you'd like to use. It’s perfectly fine to leave your glass as-is if you want. However, if you want colored glass, or if you’d like to add a flavor to the candy, add in your food coloring or flavored extract and stir it in. Work quickly, because you need to pour the sugar out before it starts to harden. For example, if you want to make sea glass, stir in 1-2 drops of blue food coloring, or a combination of blue and white or blue and green. The cool blue sea glass pairs well with 1 teaspoon (4.9 mL) of coconut essential oil, but you could also use peppermint if you prefer. If you’re making stained glass, make several batches of sugar and color each one a different hue. You can even match each color with a different flavor, like cherry or cinnamon for red and lime or apple for green! Microwaving the Sugar Mixture Mix sugar and light corn syrup in a microwave-safe bowl. If you’re not comfortable with heating sugar on the stovetop, try making glass candy in the microwave instead! Pour 1 cup (100 g) of sugar and ⁄2 cup (120 mL) of light corn syrup into a bowl and whisk them together thoroughly. It’s okay if the sugar isn’t dissolved when you’re finished. Try to use a bowl that holds about 2 cups (470 mL) of liquid. That way, you won't spill the hot sugar mixture when you're taking the bowl out of the microwave. To tell if a bowl is microwave-safe, look on the bottom for a symbol that looks like 3 wavy lines. Tip: If the bowl doesn’t have a symbol, do a safety test by microwaving the empty bowl along with a separate cup full of water for 1 minute. If the empty bowl is cool after that minute, it’s microwave-safe. If it feels hot to the touch, you should find another bowl. Cover the bowl with plastic wrap. To keep in the heat and prevent the sugar from bubbling over in the microwave, it’s best to cover the bowl. Tear off a sheet of plastic wrap and stretch it over the mouth of the bowl, then smooth it down the sides of the bowl until it forms a tight seal. If the sugar spills in your microwave, it could be really hard to clean off. Also, you could get burned if you accidentally touch the hot sugar. Place the bowl in the microwave for 2-3 minutes. If you have an 1100-watt microwave, which is standard for most household microwaves, heat the sugar mixture for about 2-3 minutes on high heat. If your microwave uses a lower wattage, consult the user’s manual to determine the equivalent amount of time for your appliance. The sugar should be a light golden color when it’s finished. Due to the differences in microwaves, temperatures and cooking times may vary. Keep an eye on the sugar while it’s heating. Stop the microwave if the sugar starts to boil over or scorch. Replace the plastic wrap, but do not stir the sugar. During the first heating, condensation will form on the plastic wrap. To prevent this moisture from getting in the sugar and changing the consistency of your candy, carefully lift away the plastic wrap and replace it with a fresh sheet. However, there’s no need to stir the sugar mixture when you’re doing this. Carefully open the plastic wrap away from your face so you don’t get burned by escaping steam. Microwave the sugar for another 2-3 minutes. Once you’ve replaced the plastic, return the bowl to the microwave. Heat it for another 2-3 minutes on high, then carefully remove the bowl from the microwave again. If you had to adjust the time the first time you heated the sugar, use that same time again. If you were to test the temperature of the sugar with a candy thermometer, it should be about 300 °F (149 °C). You could also test the temperature by carefully drizzling a little of the sugar into cold water. The sugar should immediately harden into brittle threads, which is called the hard candy stage. Stir in any colorings or flavors you want to add. You can leave your glass clear and unflavored if you want, or you can add a few drops of your choice of food coloring or ⁄2 teaspoon (2.5 mL) of your favorite flavored extract. If you do add anything, stir it in quickly once you’re finished heating the try matching the color to the flavoring you’re using. Sea glass is a popular version of this treat. Add a drop of blue food coloring to the mixture and a flavoring like coconut or peppermint. When the candy hardens, lightly dust it with powdered sugar. Molding the Glass Spray a large baking sheet with non-stick cooking spray. To get the effect of a thin sheet of glass, you’ll need to spread the candy across a large baking sheet. While you can use any size baking sheet you like, keep in mind that a bigger sheet will result in thinner, more glass-like candy. If you made a large batch of glass candy on the stovetop, a good size baking pan would be 12 in × 18 in (30 cm × 46 cm), while a 9 in × 13 in (23 cm × 33 cm) pan would probably be best for a smaller batch made in the microwave. You may want to prepare the baking sheet before you heat the sugar, since you'll need to pour it quickly. If you prefer, you can line the pan with wax paper or silicone sheets rather than using cooking spray. If you're making stained glass or another type of glass that you don't want to break into shards, pour the sugar into a silicone stained glass mold instead of a baking sheet. Sift powdered sugar across the pan to make opaque or frosted glass. A light coating of powdered sugar is a delicious way to get the effect of frosted glass. Just sprinkle about 1 cup (125 g) of powdered sugar directly onto the bottom of the baking sheet. If you'd like, you can sprinkle more powdered sugar on top of the sugar after you've poured it, as well. After the glass has hardened, you can dust off any excess sugar. If you prefer, you can sprinkle the powdered sugar on the glass after it's hardened. This is often done when making sea glass. You can also skip it altogether. Pour the sugar mixture into your baking pan quickly. Once you’ve heated your sugar up to 300 °F (149 °C) and added any extracts or food coloring, it’s time to create a sheet of glass. Carefully tilt the saucepan away from you and pour the sugar onto your baking sheet. The sugar will spread out over the sheet, but you can move the pan back and forth to help it spread evenly if you’d like. You can also tilt the pan back and forth to help create an even layer of sugar if you want. The sugar will be very hot, and it will stick to your skin if you touch it. Be careful, or you could end up with a nasty burn! Let the sugar harden at room temperature for about 2 hours. After you’ve finished spreading the sugar into your baking pan, place it somewhere to allow it to cool completely. However, don’t put it into the refrigerator. The moisture in your fridge could affect the sugar, leaving your glass candy softer than you’d like. Drop the pan onto your counter to make broken glass. If you want to make shards of jagged glass, pick up your baking sheet about 2 ft (0.61 m) above the countertop, then drop the pan straight down with moderate force. The sheet of sugar glass should shatter into pieces that resemble broken glass. Continue doing this until the pieces of glass are the size you want. You can also use a mallet or another tool to break the glass if you prefer. Once the sugar glass is broken, you can just pick up the pieces to remove them from the pan. If you poured the glass into silicone molds, carefully bend the mold away from the sugar so the pieces pop out. Use a dish towel to rub down very sharp edges of broken glass candy. If you shattered the glass, you may end up with some dangerously sharp edges. Before you serve your glass candy, take a dish towel and gently buff any sharp corners or edges. In addition to making your candy safer to eat, this will give your glass a slightly aged look. If you’re making broken glass for a Halloween scene, you may want to leave the sharp edges. Just be careful when you’re eating! Store the glass in an airtight container in a cool place. If you’re not going to eat the glass candy right away, place it into a container with an airtight lid. Keep it at room temperature, but away from direct sunlight or other heat sources. However, don't place your candy in the refrigerator, since the moisture in the fridge will cause the glass to get very sticky. The candy will last for about a week. You can also divide it into individual cellophane bags. To keep your candy fresh for about 2 weeks, place silica gel packs in the container. You can find these at any home improvement store.",
    "sentences": [
        " Making the Sugar Mixture on the Stove Mix sugar, corn syrup, and water together in a medium saucepan.",
        "Use a whisk to combine 2 cups (400 g) of white sugar, ⁄2 cup (120 mL) of light corn syrup, and 1 cup (240 mL) of water in a saucepan with a heavy bottom.",
        "It’s okay if the sugar doesn’t dissolve, but make sure to stir the ingredients so they’re completely combined.",
        "When you’re making candy, use the sturdiest pan you have.",
        "If you use a saucepan that’s too light, the sugar will scorch as you’re heating it.",
        "An 8 in (20 cm) saucepan is perfect for this job.",
        "Clip a candy thermometer to the side of the pan.",
        "When you’re making candy, it’s important that the sugar reaches a certain temperature in order for it to set up properly.",
        "The easiest way to do this is by monitoring the temperature with a candy thermometer.",
        "If you have one that you can attach to the pan, you’ll be able to keep a close eye on the thermometer while keeping your hands free.",
        "If your thermometer doesn’t clip to the pan, you can just hold it when it’s time to check the temperature.",
        "If you don’t have a candy thermometer, you’ll need to know how to test the candy’s hardness stages by hand.",
        "Heat the sugar mixture to 300 °F (149 °C), stirring constantly.",
        "Turn your stove to medium or medium-high heat to heat the sugar, corn syrup, and water to a boil.",
        "Use a wooden spoon to stir the mixture continuously while it’s heating.",
        "Remember to scrape the sides and the bottom of the bowl frequently so the sugar doesn’t start to crystallize on the surface of the saucepan.",
        "At medium-high heat, it should take about 5 minutes for the sugar to come to a boil.",
        "If you have the stove set to medium heat, it will take a little longer, but you’ll be less likely to burn the mixture.",
        "If the sugar doesn’t reach 300 °F (149 °C), it won’t harden properly, and your glass will be sticky and not brittle.",
        "Sugar can scorch very quickly, so don’t leave the pan unattended while you’re doing this!",
        "Tip: To test the temperature without a thermometer, drizzle a little of the syrup into a bowl of cold water.",
        "At 300–310 °F (149–154 °C), the syrup should form brittle threads that snap when you try to bend them.",
        "Remove the pan from the heat.",
        "Once the sugar reaches 300 °F (149 °C), carefully take the hot saucepan off of the stove so it doesn’t burn.",
        "At this point, your mixture should be amber-colored and very sticky.",
        "Be very careful when you’re moving the pan, as the sugar will be extremely hot!",
        "Stir in any flavorings or color you'd like to use.",
        "It’s perfectly fine to leave your glass as-is if you want.",
        "However, if you want colored glass, or if you’d like to add a flavor to the candy, add in your food coloring or flavored extract and stir it in.",
        "Work quickly, because you need to pour the sugar out before it starts to harden.",
        "For example, if you want to make sea glass, stir in 1-2 drops of blue food coloring, or a combination of blue and white or blue and green.",
        "The cool blue sea glass pairs well with 1 teaspoon (4.9 mL) of coconut essential oil, but you could also use peppermint if you prefer.",
        "If you’re making stained glass, make several batches of sugar and color each one a different hue.",
        "You can even match each color with a different flavor, like cherry or cinnamon for red and lime or apple for green!",
        "Microwaving the Sugar Mixture Mix sugar and light corn syrup in a microwave-safe bowl.",
        "If you’re not comfortable with heating sugar on the stovetop, try making glass candy in the microwave instead!",
        "Pour 1 cup (100 g) of sugar and ⁄2 cup (120 mL) of light corn syrup into a bowl and whisk them together thoroughly.",
        "It’s okay if the sugar isn’t dissolved when you’re finished.",
        "Try to use a bowl that holds about 2 cups (470 mL) of liquid.",
        "That way, you won't spill the hot sugar mixture when you're taking the bowl out of the microwave.",
        "To tell if a bowl is microwave-safe, look on the bottom for a symbol that looks like 3 wavy lines.",
        "Tip: If the bowl doesn’t have a symbol, do a safety test by microwaving the empty bowl along with a separate cup full of water for 1 minute.",
        "If the empty bowl is cool after that minute, it’s microwave-safe.",
        "If it feels hot to the touch, you should find another bowl.",
        "Cover the bowl with plastic wrap.",
        "To keep in the heat and prevent the sugar from bubbling over in the microwave, it’s best to cover the bowl.",
        "Tear off a sheet of plastic wrap and stretch it over the mouth of the bowl, then smooth it down the sides of the bowl until it forms a tight seal.",
        "If the sugar spills in your microwave, it could be really hard to clean off.",
        "Also, you could get burned if you accidentally touch the hot sugar.",
        "Place the bowl in the microwave for 2-3 minutes.",
        "If you have an 1100-watt microwave, which is standard for most household microwaves, heat the sugar mixture for about 2-3 minutes on high heat.",
        "If your microwave uses a lower wattage, consult the user’s manual to determine the equivalent amount of time for your appliance.",
        "The sugar should be a light golden color when it’s finished.",
        "Due to the differences in microwaves, temperatures and cooking times may vary.",
        "Keep an eye on the sugar while it’s heating.",
        "Stop the microwave if the sugar starts to boil over or scorch.",
        "Replace the plastic wrap, but do not stir the sugar.",
        "During the first heating, condensation will form on the plastic wrap.",
        "To prevent this moisture from getting in the sugar and changing the consistency of your candy, carefully lift away the plastic wrap and replace it with a fresh sheet.",
        "However, there’s no need to stir the sugar mixture when you’re doing this.",
        "Carefully open the plastic wrap away from your face so you don’t get burned by escaping steam.",
        "Microwave the sugar for another 2-3 minutes.",
        "Once you’ve replaced the plastic, return the bowl to the microwave.",
        "Heat it for another 2-3 minutes on high, then carefully remove the bowl from the microwave again.",
        "If you had to adjust the time the first time you heated the sugar, use that same time again.",
        "If you were to test the temperature of the sugar with a candy thermometer, it should be about 300 °F (149 °C).",
        "You could also test the temperature by carefully drizzling a little of the sugar into cold water.",
        "The sugar should immediately harden into brittle threads, which is called the hard candy stage.",
        "Stir in any colorings or flavors you want to add.",
        "You can leave your glass clear and unflavored if you want, or you can add a few drops of your choice of food coloring or ⁄2 teaspoon (2.5 mL) of your favorite flavored extract.",
        "If you do add anything, stir it in quickly once you’re finished heating the try matching the color to the flavoring you’re using.",
        "Sea glass is a popular version of this treat.",
        "Add a drop of blue food coloring to the mixture and a flavoring like coconut or peppermint.",
        "When the candy hardens, lightly dust it with powdered sugar.",
        "Molding the Glass Spray a large baking sheet with non-stick cooking spray.",
        "To get the effect of a thin sheet of glass, you’ll need to spread the candy across a large baking sheet.",
        "While you can use any size baking sheet you like, keep in mind that a bigger sheet will result in thinner, more glass-like candy.",
        "If you made a large batch of glass candy on the stovetop, a good size baking pan would be 12 in × 18 in (30 cm × 46 cm), while a 9 in × 13 in (23 cm × 33 cm) pan would probably be best for a smaller batch made in the microwave.",
        "You may want to prepare the baking sheet before you heat the sugar, since you'll need to pour it quickly.",
        "If you prefer, you can line the pan with wax paper or silicone sheets rather than using cooking spray.",
        "If you're making stained glass or another type of glass that you don't want to break into shards, pour the sugar into a silicone stained glass mold instead of a baking sheet.",
        "Sift powdered sugar across the pan to make opaque or frosted glass.",
        "A light coating of powdered sugar is a delicious way to get the effect of frosted glass.",
        "Just sprinkle about 1 cup (125 g) of powdered sugar directly onto the bottom of the baking sheet.",
        "If you'd like, you can sprinkle more powdered sugar on top of the sugar after you've poured it, as well.",
        "After the glass has hardened, you can dust off any excess sugar.",
        "If you prefer, you can sprinkle the powdered sugar on the glass after it's hardened.",
        "This is often done when making sea glass.",
        "You can also skip it altogether.",
        "Pour the sugar mixture into your baking pan quickly.",
        "Once you’ve heated your sugar up to 300 °F (149 °C) and added any extracts or food coloring, it’s time to create a sheet of glass.",
        "Carefully tilt the saucepan away from you and pour the sugar onto your baking sheet.",
        "The sugar will spread out over the sheet, but you can move the pan back and forth to help it spread evenly if you’d like.",
        "You can also tilt the pan back and forth to help create an even layer of sugar if you want.",
        "The sugar will be very hot, and it will stick to your skin if you touch it.",
        "Be careful, or you could end up with a nasty burn!",
        "Let the sugar harden at room temperature for about 2 hours.",
        "After you’ve finished spreading the sugar into your baking pan, place it somewhere to allow it to cool completely.",
        "However, don’t put it into the refrigerator.",
        "The moisture in your fridge could affect the sugar, leaving your glass candy softer than you’d like.",
        "Drop the pan onto your counter to make broken glass.",
        "If you want to make shards of jagged glass, pick up your baking sheet about 2 ft (0.61 m) above the countertop, then drop the pan straight down with moderate force.",
        "The sheet of sugar glass should shatter into pieces that resemble broken glass.",
        "Continue doing this until the pieces of glass are the size you want.",
        "You can also use a mallet or another tool to break the glass if you prefer.",
        "Once the sugar glass is broken, you can just pick up the pieces to remove them from the pan.",
        "If you poured the glass into silicone molds, carefully bend the mold away from the sugar so the pieces pop out.",
        "Use a dish towel to rub down very sharp edges of broken glass candy.",
        "If you shattered the glass, you may end up with some dangerously sharp edges.",
        "Before you serve your glass candy, take a dish towel and gently buff any sharp corners or edges.",
        "In addition to making your candy safer to eat, this will give your glass a slightly aged look.",
        "If you’re making broken glass for a Halloween scene, you may want to leave the sharp edges.",
        "Just be careful when you’re eating!",
        "Store the glass in an airtight container in a cool place.",
        "If you’re not going to eat the glass candy right away, place it into a container with an airtight lid.",
        "Keep it at room temperature, but away from direct sunlight or other heat sources.",
        "However, don't place your candy in the refrigerator, since the moisture in the fridge will cause the glass to get very sticky.",
        "The candy will last for about a week.",
        "You can also divide it into individual cellophane bags.",
        "To keep your candy fresh for about 2 weeks, place silica gel packs in the container.",
        "You can find these at any home improvement store."
    ]
}