{
    "title": "How to Install a Door Jamb",
    "url": "https://www.wikihow.com/Install-a-Door-Jamb",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Doors and Windows",
        "Door Replacement",
        "Door Installation"
    ],
    "parts": [
        {
            "name": "Cutting the Jamb Pieces",
            "steps": [
                {
                    "headline": "Measure the width of the door frame.",
                    "description": "Break out the tape measure. You'll need to know how wide your door frame is so the jamb fits in it. Hold the tape measure up to the top of the door frame. Note the measurement and save it for later. Keep in mind that if the door has 2x4 walls, then the frame will be 4-1/2\" (11.4 cm). If the door has 2x6 walls, then the frame will always be 6-1/2\" (16.5 cm)."
                },
                {
                    "headline": "Measure the sides of the door frame.",
                    "description": "Take your tape measure to one side of the door frame. Note the length and mark this on one piece of wood. If you have level ground, this measurement will be the same for the other side. Most likely they'll be different, so measure the other side of the frame and mark its length on another piece of wood. Don't forget to also measure the top part of the frame for the smaller piece of wood."
                },
                {
                    "headline": "Cut the wood.",
                    "description": "Suit up with safety gear, including gloves, safety glasses, and a visor, before turning on your circular saw. Thin the pieces of wood so they fit within the frame. Follow up by cutting their length according to the measurements you took earlier."
                }
            ]
        },
        {
            "name": "Creating and Installing the Jamb",
            "steps": [
                {
                    "headline": "Nail the wood together.",
                    "description": "Lay one of the longer pieces of wood on its side and add a bit of wood glue to the end. Attach the shorter piece to one end of the longer piece. Get your nail gun and hold it square on the outside of the area where the wood meets. Add the nails to secure the pieces together. Align the other piece of wood on the opposite side and attach it the same way."
                },
                {
                    "headline": "Hold the jamb up to the door frame.",
                    "description": "Carefully move your newly-cut wood up into the frame. Since you measured, it should fit in there well. Align the left side against the wall and see if it appears level. Double-check this with a level."
                },
                {
                    "headline": "Level out the jamb with wood strips.",
                    "description": "After attaching the jamb to the frame, place wood strips (shims) under it. Make sure that you do not lift the jamb too much. Figure out where you need to place the shims to level the hinge side from top to bottom. Get these strips from the home improvement store. Slip them between the jamb and frame as needed. Always start with the side where the door will attach to the hinges. Make sure to fasten the hinge side jambs directly to the stud. You can fasten them loosely in case you need to slide a jamb behind it, but it is best to keep it tight."
                },
                {
                    "headline": "Hold the door against the jamb to check for clearance.",
                    "description": "You can hold the jamb in place by lightly hammering in a few nails. Place the door inside the jamb. The door needs to fit comfortably inside the jamb. Look for the gap between the door and jamb to be one-eighth of an inch (.32 cm) on all sides. Add or remove shimming so the door fits. When you're sure the measurements are correct, remove the door."
                },
                {
                    "headline": "Nail the hinge side of the jamb to the frame.",
                    "description": "Get your nail gun again. Make sure the jamb is even against the wall and frame. Begin securing it with nails from top to bottom. Be sure to put a nail through each shim to hold them in place. Weather strips are a good way of hiding screw marks. Screws make exterior doors stronger and more adjustable. Drill a hole in the jamb before adding the screws, then attach the weather strips over them."
                },
                {
                    "headline": "Secure the other sides of the jamb to the frame.",
                    "description": "Move onto the top side. First, hold your level up to the jamb. If it doesn't appear level, add some shims to even it out. Finish by nailing the jamb to the frame. Repeat this with the side opposite the hinges."
                },
                {
                    "headline": "Cut the shims to size with a utility knife.",
                    "description": "The shims will have their ends sticking out of the jamb. Go ahead and take your utility knife or other woodcarving knife and score them, then use your hammer to break off the ends."
                }
            ]
        },
        {
            "name": "Installing Door Stops",
            "steps": [
                {
                    "headline": "Hang the door in the jamb.",
                    "description": "Screw the hinges onto the correct side of the jamb. Unless you are installing a prehung door, you'll need to trace the outline of the hinges on the jamb and cut an indentation using a router or utility knife. Place the door in the jamb and fasten it to the hinges. Make sure it's tight and opening in the right direction. It's ideal to do this first so you can gauge how much space you have for the door stops and align them properly behind the hinges."
                },
                {
                    "headline": "Measure out the stopper width.",
                    "description": "The door stopper (also called stop molding) can be bought pre-cut or fashioned out of wood strips. You will need to measure out how wide the stopper needs to be so that the pieces on each side of the door frame fit together. The moulding goes behind the hinges and rests in the middle of the jamb. Measure it against the jamb until you're sure it's the right thickness. The stop molding is thin. When cutting it yourself, you only need strips of wood about one or two inches (two to five cm) wide."
                },
                {
                    "headline": "Measure the stopper's length on the door jamb.",
                    "description": "Start with the top part. Measure all the way across the jamb so that the stopper will go all the way across the jamb. Now measure the amount of wood needed from top to bottom of both the left and right sides of the jamb."
                },
                {
                    "headline": "Cut your stopper wood down to size.",
                    "description": "Use a saw to trim the wood to the required length. You'll have a shorter piece for the top of the door and two longer pieces for the sides."
                },
                {
                    "headline": "Nail the stopper to the door frame.",
                    "description": "Get your nail gun one more time. Start with the top side. Keep the stopper pieces even and centered in the jamb. Nail the shorter piece to the frame. Nail the other pieces to the sides. When you're done, the closed door should rest inside the jamb."
                }
            ]
        }
    ],
    "tyn": [
        "Wood or jamb kit",
        "Nail gun",
        "Wood shims",
        "Circular saw",
        "Utility knife",
        "Level"
    ],
    "text": " Cutting the Jamb Pieces Measure the width of the door frame. Break out the tape measure. You'll need to know how wide your door frame is so the jamb fits in it. Hold the tape measure up to the top of the door frame. Note the measurement and save it for later. Keep in mind that if the door has 2x4 walls, then the frame will be 4-1/2\" (11.4 cm). If the door has 2x6 walls, then the frame will always be 6-1/2\" (16.5 cm). Measure the sides of the door frame. Take your tape measure to one side of the door frame. Note the length and mark this on one piece of wood. If you have level ground, this measurement will be the same for the other side. Most likely they'll be different, so measure the other side of the frame and mark its length on another piece of wood. Don't forget to also measure the top part of the frame for the smaller piece of wood. Cut the wood. Suit up with safety gear, including gloves, safety glasses, and a visor, before turning on your circular saw. Thin the pieces of wood so they fit within the frame. Follow up by cutting their length according to the measurements you took earlier. Creating and Installing the Jamb Nail the wood together. Lay one of the longer pieces of wood on its side and add a bit of wood glue to the end. Attach the shorter piece to one end of the longer piece. Get your nail gun and hold it square on the outside of the area where the wood meets. Add the nails to secure the pieces together. Align the other piece of wood on the opposite side and attach it the same way. Hold the jamb up to the door frame. Carefully move your newly-cut wood up into the frame. Since you measured, it should fit in there well. Align the left side against the wall and see if it appears level. Double-check this with a level. Level out the jamb with wood strips. After attaching the jamb to the frame, place wood strips (shims) under it. Make sure that you do not lift the jamb too much. Figure out where you need to place the shims to level the hinge side from top to bottom. Get these strips from the home improvement store. Slip them between the jamb and frame as needed. Always start with the side where the door will attach to the hinges. Make sure to fasten the hinge side jambs directly to the stud. You can fasten them loosely in case you need to slide a jamb behind it, but it is best to keep it tight. Hold the door against the jamb to check for clearance. You can hold the jamb in place by lightly hammering in a few nails. Place the door inside the jamb. The door needs to fit comfortably inside the jamb. Look for the gap between the door and jamb to be one-eighth of an inch (.32 cm) on all sides. Add or remove shimming so the door fits. When you're sure the measurements are correct, remove the door. Nail the hinge side of the jamb to the frame. Get your nail gun again. Make sure the jamb is even against the wall and frame. Begin securing it with nails from top to bottom. Be sure to put a nail through each shim to hold them in place. Weather strips are a good way of hiding screw marks. Screws make exterior doors stronger and more adjustable. Drill a hole in the jamb before adding the screws, then attach the weather strips over them. Secure the other sides of the jamb to the frame. Move onto the top side. First, hold your level up to the jamb. If it doesn't appear level, add some shims to even it out. Finish by nailing the jamb to the frame. Repeat this with the side opposite the hinges. Cut the shims to size with a utility knife. The shims will have their ends sticking out of the jamb. Go ahead and take your utility knife or other woodcarving knife and score them, then use your hammer to break off the ends. Installing Door Stops Hang the door in the jamb. Screw the hinges onto the correct side of the jamb. Unless you are installing a prehung door, you'll need to trace the outline of the hinges on the jamb and cut an indentation using a router or utility knife. Place the door in the jamb and fasten it to the hinges. Make sure it's tight and opening in the right direction. It's ideal to do this first so you can gauge how much space you have for the door stops and align them properly behind the hinges. Measure out the stopper width. The door stopper (also called stop molding) can be bought pre-cut or fashioned out of wood strips. You will need to measure out how wide the stopper needs to be so that the pieces on each side of the door frame fit together. The moulding goes behind the hinges and rests in the middle of the jamb. Measure it against the jamb until you're sure it's the right thickness. The stop molding is thin. When cutting it yourself, you only need strips of wood about one or two inches (two to five cm) wide. Measure the stopper's length on the door jamb. Start with the top part. Measure all the way across the jamb so that the stopper will go all the way across the jamb. Now measure the amount of wood needed from top to bottom of both the left and right sides of the jamb. Cut your stopper wood down to size. Use a saw to trim the wood to the required length. You'll have a shorter piece for the top of the door and two longer pieces for the sides. Nail the stopper to the door frame. Get your nail gun one more time. Start with the top side. Keep the stopper pieces even and centered in the jamb. Nail the shorter piece to the frame. Nail the other pieces to the sides. When you're done, the closed door should rest inside the jamb.",
    "sentences": [
        " Cutting the Jamb Pieces Measure the width of the door frame.",
        "Break out the tape measure.",
        "You'll need to know how wide your door frame is so the jamb fits in it.",
        "Hold the tape measure up to the top of the door frame.",
        "Note the measurement and save it for later.",
        "Keep in mind that if the door has 2x4 walls, then the frame will be 4-1/2\" (11.4 cm).",
        "If the door has 2x6 walls, then the frame will always be 6-1/2\" (16.5 cm).",
        "Measure the sides of the door frame.",
        "Take your tape measure to one side of the door frame.",
        "Note the length and mark this on one piece of wood.",
        "If you have level ground, this measurement will be the same for the other side.",
        "Most likely they'll be different, so measure the other side of the frame and mark its length on another piece of wood.",
        "Don't forget to also measure the top part of the frame for the smaller piece of wood.",
        "Cut the wood.",
        "Suit up with safety gear, including gloves, safety glasses, and a visor, before turning on your circular saw.",
        "Thin the pieces of wood so they fit within the frame.",
        "Follow up by cutting their length according to the measurements you took earlier.",
        "Creating and Installing the Jamb Nail the wood together.",
        "Lay one of the longer pieces of wood on its side and add a bit of wood glue to the end.",
        "Attach the shorter piece to one end of the longer piece.",
        "Get your nail gun and hold it square on the outside of the area where the wood meets.",
        "Add the nails to secure the pieces together.",
        "Align the other piece of wood on the opposite side and attach it the same way.",
        "Hold the jamb up to the door frame.",
        "Carefully move your newly-cut wood up into the frame.",
        "Since you measured, it should fit in there well.",
        "Align the left side against the wall and see if it appears level.",
        "Double-check this with a level.",
        "Level out the jamb with wood strips.",
        "After attaching the jamb to the frame, place wood strips (shims) under it.",
        "Make sure that you do not lift the jamb too much.",
        "Figure out where you need to place the shims to level the hinge side from top to bottom.",
        "Get these strips from the home improvement store.",
        "Slip them between the jamb and frame as needed.",
        "Always start with the side where the door will attach to the hinges.",
        "Make sure to fasten the hinge side jambs directly to the stud.",
        "You can fasten them loosely in case you need to slide a jamb behind it, but it is best to keep it tight.",
        "Hold the door against the jamb to check for clearance.",
        "You can hold the jamb in place by lightly hammering in a few nails.",
        "Place the door inside the jamb.",
        "The door needs to fit comfortably inside the jamb.",
        "Look for the gap between the door and jamb to be one-eighth of an inch (.32 cm) on all sides.",
        "Add or remove shimming so the door fits.",
        "When you're sure the measurements are correct, remove the door.",
        "Nail the hinge side of the jamb to the frame.",
        "Get your nail gun again.",
        "Make sure the jamb is even against the wall and frame.",
        "Begin securing it with nails from top to bottom.",
        "Be sure to put a nail through each shim to hold them in place.",
        "Weather strips are a good way of hiding screw marks.",
        "Screws make exterior doors stronger and more adjustable.",
        "Drill a hole in the jamb before adding the screws, then attach the weather strips over them.",
        "Secure the other sides of the jamb to the frame.",
        "Move onto the top side.",
        "First, hold your level up to the jamb.",
        "If it doesn't appear level, add some shims to even it out.",
        "Finish by nailing the jamb to the frame.",
        "Repeat this with the side opposite the hinges.",
        "Cut the shims to size with a utility knife.",
        "The shims will have their ends sticking out of the jamb.",
        "Go ahead and take your utility knife or other woodcarving knife and score them, then use your hammer to break off the ends.",
        "Installing Door Stops Hang the door in the jamb.",
        "Screw the hinges onto the correct side of the jamb.",
        "Unless you are installing a prehung door, you'll need to trace the outline of the hinges on the jamb and cut an indentation using a router or utility knife.",
        "Place the door in the jamb and fasten it to the hinges.",
        "Make sure it's tight and opening in the right direction.",
        "It's ideal to do this first so you can gauge how much space you have for the door stops and align them properly behind the hinges.",
        "Measure out the stopper width.",
        "The door stopper (also called stop molding) can be bought pre-cut or fashioned out of wood strips.",
        "You will need to measure out how wide the stopper needs to be so that the pieces on each side of the door frame fit together.",
        "The moulding goes behind the hinges and rests in the middle of the jamb.",
        "Measure it against the jamb until you're sure it's the right thickness.",
        "The stop molding is thin.",
        "When cutting it yourself, you only need strips of wood about one or two inches (two to five cm) wide.",
        "Measure the stopper's length on the door jamb.",
        "Start with the top part.",
        "Measure all the way across the jamb so that the stopper will go all the way across the jamb.",
        "Now measure the amount of wood needed from top to bottom of both the left and right sides of the jamb.",
        "Cut your stopper wood down to size.",
        "Use a saw to trim the wood to the required length.",
        "You'll have a shorter piece for the top of the door and two longer pieces for the sides.",
        "Nail the stopper to the door frame.",
        "Get your nail gun one more time.",
        "Start with the top side.",
        "Keep the stopper pieces even and centered in the jamb.",
        "Nail the shorter piece to the frame.",
        "Nail the other pieces to the sides.",
        "When you're done, the closed door should rest inside the jamb."
    ]
}