{
    "title": "How to Make a Neliel Mask",
    "url": "https://www.wikihow.com/Make-a-Neliel-Mask",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Movies",
        "Filmmaking",
        "Animation"
    ],
    "parts": [
        {
            "name": "Creating the Base",
            "steps": [
                {
                    "headline": "Find lots of reference images of the mask.",
                    "description": "There are several variations of the mask, so pick the one that goes with your cosplay. It would be a good idea to include images not just from the anime, but real-life photos of the mask as well. This includes masks that other cosplayers have made and prop masks available in cosplay shops. Print the images out or have them easily accessible on a tablet, cell phone, or computer."
                },
                {
                    "headline": "Cover a Styrofoam wig head with plastic wrap.",
                    "description": "Tape down the edges of the plastic wrap with masking tape so that it does not move around. You don't have to cover the entire wig head; as long as you have the top part covered, you are good."
                },
                {
                    "headline": "roll some paper clay out into a thin sheet.",
                    "description": "You can use a rolling pin, a can, jar, or even a glass. Do not use ceramic or stone clay for this, however. It will be too heavy and fragile."
                },
                {
                    "headline": "Drape the sheet over the wig head and trim it.",
                    "description": "Smooth the rolled-out clay sheet onto the wig head, then use a knife to cut it into the rough shape of the mask. You can cut the clay using a plastic knife or a craft blade. Pull away the excess clay, bunch it up, and set it aside."
                },
                {
                    "headline": "Cut the sheet to refine the shape of the mask.",
                    "description": "The mask is based on a skull, so it will be narrower on the bottom and more rounded on the top. If you are doing the broken version, cut out a jagged shape from the bottom right corner of the mask. Don't cut the shapes for the teeth just yet; you will be adding those on separately."
                },
                {
                    "headline": "Carve out holes for the eyes.",
                    "description": "Study the shape of the eyes on your reference pictures, then try to replicate them on the mask itself as best you can. Sketch them out with a pencil first to create grooves, then cut them out. You can use a craft blade or some sort of sharp, pointed toll for this."
                },
                {
                    "headline": "Smooth out any jagged edges.",
                    "description": "Wet your finger in a glass of water, then smooth out the cut edges inside the eye sockets and around the mask. Don't worry about making it too perfect at this point."
                },
                {
                    "headline": "Add some height to the nose bridge, sockets, and cheekbones.",
                    "description": "Roll out a tube of clay for the nose bridge, and place it onto the mask. Smooth it out with your fingers to blend the seam. Repeat the process for the eyebrow ridge above the eye sockets and the check bones."
                },
                {
                    "headline": "Add any other details.",
                    "description": "If you are making the cracked/broken version of the mask, use a blunt, pointed tool, such as a pencil or knitting needle, to carve cracks into the mask. Use a medium touch; carve deep enough so that you can see the cracks, but not so deep as to cut through the clay. At this point, you can also create light indents along the bottom edge of the mask where you want the teeth to go."
                },
                {
                    "headline": "Allow the mask to dry.",
                    "description": "Once the mask is dry, take it off of the wig head. You may have to remove it along with the plastic wrap first, then peel the plastic wrap away. Once you have the mask off of the head, flip it over, and let the inside dry as well. Most paper clays will lighten as they dry. Store your leftover clay in an airtight container. You will need to do more sculpting once the base of the mask is dry."
                },
                {
                    "headline": "Sand the mask smooth, if needed.",
                    "description": "Get a some fine-grit sandpaper, and gently buff the surface and edges of the mask until it is smooth. You can use small scraps of sandpaper or a sanding sponge for this."
                }
            ]
        },
        {
            "name": "Creating the Horns",
            "steps": [
                {
                    "headline": "Twist newspaper or aluminum foil into two horn shapes.",
                    "description": "Begin by twisting a straight horn first, then curve it into a C-shape, like Neliel's horns. Make these horns a little smaller than you want them to be; you will be covering them with more clay shortly. Creating the base out of newspaper or foil will not only help you save on clay, but it will also make the horns lighter. Create a tapering effect by twisting the material tighter at the tips. Wrap tape around newspaper horns to help them keep their shape."
                },
                {
                    "headline": "Roll out thin sheets of clay, then wrap them around the horns.",
                    "description": "Roll out the clay using the same method at before. Wrap the sheets around each horn, then trim off the excess."
                },
                {
                    "headline": "Smooth out any bumps or seam lines, then let the clay dry.",
                    "description": "Try to make the horns as smooth as possible. If you used aluminum foil, you may have a few rough patches; leave these alone for now. Alternatively, you can carve horizontal lines or rings into the horns for texture."
                },
                {
                    "headline": "Sand the horns smooth, then add more clay if needed.",
                    "description": "Gently buff the horns smooth with fine-grit sandpaper. If there are any rough patches in your sculpting, such as pits, spikes, or ridges, you can wrap the horns with another thin sheet of clay. Smooth out this second layer, let it dry, then sand it smooth again."
                },
                {
                    "headline": "Secure the horns to the mask with more clay.",
                    "description": "Roll out a rope of clay, and wrap it around the base of your first horn. Press the horn against the top part of the mask, then smooth out the seams. Repeat this step for the second horn as well. The base of the horns need to be attached to the top of the skull, just above the sockets. The points of the horns need to curve downward to the cheekbones."
                },
                {
                    "headline": "Use additional pieces of clay to smooth the seams between the mask and horns.",
                    "description": "Roll out skinny ropes of clay, then press them into the gaps between the horns and the mask. Smooth them out using your finger or a clay sculpting tool. Leave the very points of the horns alone; do not fill in any gaps."
                },
                {
                    "headline": "Allow the mask to dry.",
                    "description": "If you notice any rough patches in your sculpting, smooth it down with fine-grit sandpaper using the same technique as before."
                }
            ]
        },
        {
            "name": "Adding the Teeth and Other Details",
            "steps": [
                {
                    "headline": "Sculpt fang-shaped teeth out of your leftover clay.",
                    "description": "Use your reference images as a guide. If you added indents into the bottom edge of the mask, make sure that the teeth can fit those indents."
                },
                {
                    "headline": "Secure the teeth to the bottom edge of the mask.",
                    "description": "Make sure that the top edge of each tooth overlaps the bottom edge of the mask by about ½ inch (1.27 centimeters). This will help make it more secure."
                },
                {
                    "headline": "Blend the teeth into the back of the mask.",
                    "description": "Flip the mask over, and use some sort of tool to blend the back of the teeth into the bottom edge of the mask. You can use an actual clay blending tool for this, but pencils and knitting needles will also work."
                },
                {
                    "headline": "Consider smoothing the seams on the front of the mask.",
                    "description": "Trace the seams between the teeth and the mask with a pencil or knitting needle. It would also be a good idea to trace the seams between the teeth as well. This will seal the joints while still making them look separate."
                },
                {
                    "headline": "Allow the teeth to dry.",
                    "description": "The teeth should finish drying much faster than the mask due to their size. Once again, if you notice any rough patches on the teeth, sand them smooth with fine-grit sandpaper."
                }
            ]
        },
        {
            "name": "Finishing the Mask",
            "steps": [
                {
                    "headline": "Coat the mask with a layer of white primer.",
                    "description": "You can use the spray-on kind or the brush-on kind. You can also use gesso as well. Make sure that you coat the horns as well. If you want a more finished piece, coat the inside of the mask as well."
                },
                {
                    "headline": "Coat the entire the mask with white paint.",
                    "description": "You can use either spray paint or acrylic paint for this. If you are using acrylic paint that comes in a tube rather than a bottle, it may be very thick, which could lead to brushstrokes. Thin this paint out with some water; you want it to have the same consistency as half-and-half or creamer."
                },
                {
                    "headline": "Consider adding some shading with light, grey acrylic paint.",
                    "description": "You don't have to do this, but it will make your mask look more three-dimensional. Apply the shading to the grooves between the teeth, and the space between the mask and the horns. Add more shading to the inside of the sockets, the edges of the nose bridge, and under the cheekbones. Finish off with more shading all around the edge of the mask. Make the grey lighter than you think it needs to be. Acrylic paint tends to dry a few shades darker. You can also use grey eyeshadow or chalk pastel (not oil) and a soft, fluffy paintbrush."
                },
                {
                    "headline": "Add more details with black paint, if needed.",
                    "description": "If you added engravings for the nostrils and/or the broken mask, fill these in with a thin paintbrush and black acrylic paint. If you want to, you can fill the gaps in between the mask and the tops of the teeth, as well as the spaces between the teeth."
                },
                {
                    "headline": "Consider cutting out backings for the eyes.",
                    "description": "Trace the sockets onto a sheet of thin cardboard or black craft foam. Cut the backings out a little larger than you tracked them. You don't have to do this, but it will help add more depth to the mask and make it \"screen accurate.\""
                },
                {
                    "headline": "Paint the backings black, then let them dry.",
                    "description": "You can do this with black spray paint or black acrylic paint. It would be a good idea to do this step, even if you used black craft foam. This will help make the black even darker."
                },
                {
                    "headline": "Glue the backings to the inside of the mask to cover up the eye sockets.",
                    "description": "Flip the mask over and outline the sockets using glue; liquid glue would work the best. Press the backings into the matching eye socket, painted-side-down. Allow the glue to dry. Avoid using hot glue on bare paper clay. Paper clay does not always take hot glue."
                },
                {
                    "headline": "Add a strap, if desired.",
                    "description": "You don't have to do this, but it will help keep the mask more secure on your head. There are a few ways you can go about doing this. Here are some ideas to get you started:\nSecure D rings to the inside of the mask with strips of fabric and tacky glue or industrial-strength glue. Add an elastic strap between the two D rings. Drill a hole on each side of the mask, then thread elastic or ribbon through the holes. Glue eyes from a hooks-and-eyes kit to the sides of the mask, then sew the mask to your wig through the hooks. You can also secure it with bobby pins instead."
                }
            ]
        }
    ],
    "tyn": [
        "Styrofoam wig head",
        "Plastic wrap",
        "Paper clay",
        "Masking tape",
        "Fine-grit sandpaper",
        "Sculpting tools",
        "White paint",
        "Black paint",
        "Paintbrushes",
        "Thin cardboard or black craft foam (optional, for eye backing)"
    ],
    "text": " Creating the Base Find lots of reference images of the mask. There are several variations of the mask, so pick the one that goes with your cosplay. It would be a good idea to include images not just from the anime, but real-life photos of the mask as well. This includes masks that other cosplayers have made and prop masks available in cosplay shops. Print the images out or have them easily accessible on a tablet, cell phone, or computer. Cover a Styrofoam wig head with plastic wrap. Tape down the edges of the plastic wrap with masking tape so that it does not move around. You don't have to cover the entire wig head; as long as you have the top part covered, you are good. roll some paper clay out into a thin sheet. You can use a rolling pin, a can, jar, or even a glass. Do not use ceramic or stone clay for this, however. It will be too heavy and fragile. Drape the sheet over the wig head and trim it. Smooth the rolled-out clay sheet onto the wig head, then use a knife to cut it into the rough shape of the mask. You can cut the clay using a plastic knife or a craft blade. Pull away the excess clay, bunch it up, and set it aside. Cut the sheet to refine the shape of the mask. The mask is based on a skull, so it will be narrower on the bottom and more rounded on the top. If you are doing the broken version, cut out a jagged shape from the bottom right corner of the mask. Don't cut the shapes for the teeth just yet; you will be adding those on separately. Carve out holes for the eyes. Study the shape of the eyes on your reference pictures, then try to replicate them on the mask itself as best you can. Sketch them out with a pencil first to create grooves, then cut them out. You can use a craft blade or some sort of sharp, pointed toll for this. Smooth out any jagged edges. Wet your finger in a glass of water, then smooth out the cut edges inside the eye sockets and around the mask. Don't worry about making it too perfect at this point. Add some height to the nose bridge, sockets, and cheekbones. Roll out a tube of clay for the nose bridge, and place it onto the mask. Smooth it out with your fingers to blend the seam. Repeat the process for the eyebrow ridge above the eye sockets and the check bones. Add any other details. If you are making the cracked/broken version of the mask, use a blunt, pointed tool, such as a pencil or knitting needle, to carve cracks into the mask. Use a medium touch; carve deep enough so that you can see the cracks, but not so deep as to cut through the clay. At this point, you can also create light indents along the bottom edge of the mask where you want the teeth to go. Allow the mask to dry. Once the mask is dry, take it off of the wig head. You may have to remove it along with the plastic wrap first, then peel the plastic wrap away. Once you have the mask off of the head, flip it over, and let the inside dry as well. Most paper clays will lighten as they dry. Store your leftover clay in an airtight container. You will need to do more sculpting once the base of the mask is dry. Sand the mask smooth, if needed. Get a some fine-grit sandpaper, and gently buff the surface and edges of the mask until it is smooth. You can use small scraps of sandpaper or a sanding sponge for this. Creating the Horns Twist newspaper or aluminum foil into two horn shapes. Begin by twisting a straight horn first, then curve it into a C-shape, like Neliel's horns. Make these horns a little smaller than you want them to be; you will be covering them with more clay shortly. Creating the base out of newspaper or foil will not only help you save on clay, but it will also make the horns lighter. Create a tapering effect by twisting the material tighter at the tips. Wrap tape around newspaper horns to help them keep their shape. Roll out thin sheets of clay, then wrap them around the horns. Roll out the clay using the same method at before. Wrap the sheets around each horn, then trim off the excess. Smooth out any bumps or seam lines, then let the clay dry. Try to make the horns as smooth as possible. If you used aluminum foil, you may have a few rough patches; leave these alone for now. Alternatively, you can carve horizontal lines or rings into the horns for texture. Sand the horns smooth, then add more clay if needed. Gently buff the horns smooth with fine-grit sandpaper. If there are any rough patches in your sculpting, such as pits, spikes, or ridges, you can wrap the horns with another thin sheet of clay. Smooth out this second layer, let it dry, then sand it smooth again. Secure the horns to the mask with more clay. Roll out a rope of clay, and wrap it around the base of your first horn. Press the horn against the top part of the mask, then smooth out the seams. Repeat this step for the second horn as well. The base of the horns need to be attached to the top of the skull, just above the sockets. The points of the horns need to curve downward to the cheekbones. Use additional pieces of clay to smooth the seams between the mask and horns. Roll out skinny ropes of clay, then press them into the gaps between the horns and the mask. Smooth them out using your finger or a clay sculpting tool. Leave the very points of the horns alone; do not fill in any gaps. Allow the mask to dry. If you notice any rough patches in your sculpting, smooth it down with fine-grit sandpaper using the same technique as before. Adding the Teeth and Other Details Sculpt fang-shaped teeth out of your leftover clay. Use your reference images as a guide. If you added indents into the bottom edge of the mask, make sure that the teeth can fit those indents. Secure the teeth to the bottom edge of the mask. Make sure that the top edge of each tooth overlaps the bottom edge of the mask by about ½ inch (1.27 centimeters). This will help make it more secure. Blend the teeth into the back of the mask. Flip the mask over, and use some sort of tool to blend the back of the teeth into the bottom edge of the mask. You can use an actual clay blending tool for this, but pencils and knitting needles will also work. Consider smoothing the seams on the front of the mask. Trace the seams between the teeth and the mask with a pencil or knitting needle. It would also be a good idea to trace the seams between the teeth as well. This will seal the joints while still making them look separate. Allow the teeth to dry. The teeth should finish drying much faster than the mask due to their size. Once again, if you notice any rough patches on the teeth, sand them smooth with fine-grit sandpaper. Finishing the Mask Coat the mask with a layer of white primer. You can use the spray-on kind or the brush-on kind. You can also use gesso as well. Make sure that you coat the horns as well. If you want a more finished piece, coat the inside of the mask as well. Coat the entire the mask with white paint. You can use either spray paint or acrylic paint for this. If you are using acrylic paint that comes in a tube rather than a bottle, it may be very thick, which could lead to brushstrokes. Thin this paint out with some water; you want it to have the same consistency as half-and-half or creamer. Consider adding some shading with light, grey acrylic paint. You don't have to do this, but it will make your mask look more three-dimensional. Apply the shading to the grooves between the teeth, and the space between the mask and the horns. Add more shading to the inside of the sockets, the edges of the nose bridge, and under the cheekbones. Finish off with more shading all around the edge of the mask. Make the grey lighter than you think it needs to be. Acrylic paint tends to dry a few shades darker. You can also use grey eyeshadow or chalk pastel (not oil) and a soft, fluffy paintbrush. Add more details with black paint, if needed. If you added engravings for the nostrils and/or the broken mask, fill these in with a thin paintbrush and black acrylic paint. If you want to, you can fill the gaps in between the mask and the tops of the teeth, as well as the spaces between the teeth. Consider cutting out backings for the eyes. Trace the sockets onto a sheet of thin cardboard or black craft foam. Cut the backings out a little larger than you tracked them. You don't have to do this, but it will help add more depth to the mask and make it \"screen accurate.\" Paint the backings black, then let them dry. You can do this with black spray paint or black acrylic paint. It would be a good idea to do this step, even if you used black craft foam. This will help make the black even darker. Glue the backings to the inside of the mask to cover up the eye sockets. Flip the mask over and outline the sockets using glue; liquid glue would work the best. Press the backings into the matching eye socket, painted-side-down. Allow the glue to dry. Avoid using hot glue on bare paper clay. Paper clay does not always take hot glue. Add a strap, if desired. You don't have to do this, but it will help keep the mask more secure on your head. There are a few ways you can go about doing this. Here are some ideas to get you started:\nSecure D rings to the inside of the mask with strips of fabric and tacky glue or industrial-strength glue. Add an elastic strap between the two D rings. Drill a hole on each side of the mask, then thread elastic or ribbon through the holes. Glue eyes from a hooks-and-eyes kit to the sides of the mask, then sew the mask to your wig through the hooks. You can also secure it with bobby pins instead.",
    "sentences": [
        " Creating the Base Find lots of reference images of the mask.",
        "There are several variations of the mask, so pick the one that goes with your cosplay.",
        "It would be a good idea to include images not just from the anime, but real-life photos of the mask as well.",
        "This includes masks that other cosplayers have made and prop masks available in cosplay shops.",
        "Print the images out or have them easily accessible on a tablet, cell phone, or computer.",
        "Cover a Styrofoam wig head with plastic wrap.",
        "Tape down the edges of the plastic wrap with masking tape so that it does not move around.",
        "You don't have to cover the entire wig head; as long as you have the top part covered, you are good.",
        "roll some paper clay out into a thin sheet.",
        "You can use a rolling pin, a can, jar, or even a glass.",
        "Do not use ceramic or stone clay for this, however.",
        "It will be too heavy and fragile.",
        "Drape the sheet over the wig head and trim it.",
        "Smooth the rolled-out clay sheet onto the wig head, then use a knife to cut it into the rough shape of the mask.",
        "You can cut the clay using a plastic knife or a craft blade.",
        "Pull away the excess clay, bunch it up, and set it aside.",
        "Cut the sheet to refine the shape of the mask.",
        "The mask is based on a skull, so it will be narrower on the bottom and more rounded on the top.",
        "If you are doing the broken version, cut out a jagged shape from the bottom right corner of the mask.",
        "Don't cut the shapes for the teeth just yet; you will be adding those on separately.",
        "Carve out holes for the eyes.",
        "Study the shape of the eyes on your reference pictures, then try to replicate them on the mask itself as best you can.",
        "Sketch them out with a pencil first to create grooves, then cut them out.",
        "You can use a craft blade or some sort of sharp, pointed toll for this.",
        "Smooth out any jagged edges.",
        "Wet your finger in a glass of water, then smooth out the cut edges inside the eye sockets and around the mask.",
        "Don't worry about making it too perfect at this point.",
        "Add some height to the nose bridge, sockets, and cheekbones.",
        "Roll out a tube of clay for the nose bridge, and place it onto the mask.",
        "Smooth it out with your fingers to blend the seam.",
        "Repeat the process for the eyebrow ridge above the eye sockets and the check bones.",
        "Add any other details.",
        "If you are making the cracked/broken version of the mask, use a blunt, pointed tool, such as a pencil or knitting needle, to carve cracks into the mask.",
        "Use a medium touch; carve deep enough so that you can see the cracks, but not so deep as to cut through the clay.",
        "At this point, you can also create light indents along the bottom edge of the mask where you want the teeth to go.",
        "Allow the mask to dry.",
        "Once the mask is dry, take it off of the wig head.",
        "You may have to remove it along with the plastic wrap first, then peel the plastic wrap away.",
        "Once you have the mask off of the head, flip it over, and let the inside dry as well.",
        "Most paper clays will lighten as they dry.",
        "Store your leftover clay in an airtight container.",
        "You will need to do more sculpting once the base of the mask is dry.",
        "Sand the mask smooth, if needed.",
        "Get a some fine-grit sandpaper, and gently buff the surface and edges of the mask until it is smooth.",
        "You can use small scraps of sandpaper or a sanding sponge for this.",
        "Creating the Horns Twist newspaper or aluminum foil into two horn shapes.",
        "Begin by twisting a straight horn first, then curve it into a C-shape, like Neliel's horns.",
        "Make these horns a little smaller than you want them to be; you will be covering them with more clay shortly.",
        "Creating the base out of newspaper or foil will not only help you save on clay, but it will also make the horns lighter.",
        "Create a tapering effect by twisting the material tighter at the tips.",
        "Wrap tape around newspaper horns to help them keep their shape.",
        "Roll out thin sheets of clay, then wrap them around the horns.",
        "Roll out the clay using the same method at before.",
        "Wrap the sheets around each horn, then trim off the excess.",
        "Smooth out any bumps or seam lines, then let the clay dry.",
        "Try to make the horns as smooth as possible.",
        "If you used aluminum foil, you may have a few rough patches; leave these alone for now.",
        "Alternatively, you can carve horizontal lines or rings into the horns for texture.",
        "Sand the horns smooth, then add more clay if needed.",
        "Gently buff the horns smooth with fine-grit sandpaper.",
        "If there are any rough patches in your sculpting, such as pits, spikes, or ridges, you can wrap the horns with another thin sheet of clay.",
        "Smooth out this second layer, let it dry, then sand it smooth again.",
        "Secure the horns to the mask with more clay.",
        "Roll out a rope of clay, and wrap it around the base of your first horn.",
        "Press the horn against the top part of the mask, then smooth out the seams.",
        "Repeat this step for the second horn as well.",
        "The base of the horns need to be attached to the top of the skull, just above the sockets.",
        "The points of the horns need to curve downward to the cheekbones.",
        "Use additional pieces of clay to smooth the seams between the mask and horns.",
        "Roll out skinny ropes of clay, then press them into the gaps between the horns and the mask.",
        "Smooth them out using your finger or a clay sculpting tool.",
        "Leave the very points of the horns alone; do not fill in any gaps.",
        "Allow the mask to dry.",
        "If you notice any rough patches in your sculpting, smooth it down with fine-grit sandpaper using the same technique as before.",
        "Adding the Teeth and Other Details Sculpt fang-shaped teeth out of your leftover clay.",
        "Use your reference images as a guide.",
        "If you added indents into the bottom edge of the mask, make sure that the teeth can fit those indents.",
        "Secure the teeth to the bottom edge of the mask.",
        "Make sure that the top edge of each tooth overlaps the bottom edge of the mask by about ½ inch (1.27 centimeters).",
        "This will help make it more secure.",
        "Blend the teeth into the back of the mask.",
        "Flip the mask over, and use some sort of tool to blend the back of the teeth into the bottom edge of the mask.",
        "You can use an actual clay blending tool for this, but pencils and knitting needles will also work.",
        "Consider smoothing the seams on the front of the mask.",
        "Trace the seams between the teeth and the mask with a pencil or knitting needle.",
        "It would also be a good idea to trace the seams between the teeth as well.",
        "This will seal the joints while still making them look separate.",
        "Allow the teeth to dry.",
        "The teeth should finish drying much faster than the mask due to their size.",
        "Once again, if you notice any rough patches on the teeth, sand them smooth with fine-grit sandpaper.",
        "Finishing the Mask Coat the mask with a layer of white primer.",
        "You can use the spray-on kind or the brush-on kind.",
        "You can also use gesso as well.",
        "Make sure that you coat the horns as well.",
        "If you want a more finished piece, coat the inside of the mask as well.",
        "Coat the entire the mask with white paint.",
        "You can use either spray paint or acrylic paint for this.",
        "If you are using acrylic paint that comes in a tube rather than a bottle, it may be very thick, which could lead to brushstrokes.",
        "Thin this paint out with some water; you want it to have the same consistency as half-and-half or creamer.",
        "Consider adding some shading with light, grey acrylic paint.",
        "You don't have to do this, but it will make your mask look more three-dimensional.",
        "Apply the shading to the grooves between the teeth, and the space between the mask and the horns.",
        "Add more shading to the inside of the sockets, the edges of the nose bridge, and under the cheekbones.",
        "Finish off with more shading all around the edge of the mask.",
        "Make the grey lighter than you think it needs to be.",
        "Acrylic paint tends to dry a few shades darker.",
        "You can also use grey eyeshadow or chalk pastel (not oil) and a soft, fluffy paintbrush.",
        "Add more details with black paint, if needed.",
        "If you added engravings for the nostrils and/or the broken mask, fill these in with a thin paintbrush and black acrylic paint.",
        "If you want to, you can fill the gaps in between the mask and the tops of the teeth, as well as the spaces between the teeth.",
        "Consider cutting out backings for the eyes.",
        "Trace the sockets onto a sheet of thin cardboard or black craft foam.",
        "Cut the backings out a little larger than you tracked them.",
        "You don't have to do this, but it will help add more depth to the mask and make it \"screen accurate.\"",
        "Paint the backings black, then let them dry.",
        "You can do this with black spray paint or black acrylic paint.",
        "It would be a good idea to do this step, even if you used black craft foam.",
        "This will help make the black even darker.",
        "Glue the backings to the inside of the mask to cover up the eye sockets.",
        "Flip the mask over and outline the sockets using glue; liquid glue would work the best.",
        "Press the backings into the matching eye socket, painted-side-down.",
        "Allow the glue to dry.",
        "Avoid using hot glue on bare paper clay.",
        "Paper clay does not always take hot glue.",
        "Add a strap, if desired.",
        "You don't have to do this, but it will help keep the mask more secure on your head.",
        "There are a few ways you can go about doing this.",
        "Here are some ideas to get you started:\nSecure D rings to the inside of the mask with strips of fabric and tacky glue or industrial-strength glue.",
        "Add an elastic strap between the two D rings.",
        "Drill a hole on each side of the mask, then thread elastic or ribbon through the holes.",
        "Glue eyes from a hooks-and-eyes kit to the sides of the mask, then sew the mask to your wig through the hooks.",
        "You can also secure it with bobby pins instead."
    ]
}