{
    "title": "How to Fix Your Whole Life",
    "url": "https://www.wikihow.com/Fix-Your-Whole-Life",
    "category_hierarchy": [
        "Finance and Business",
        "Business"
    ],
    "methods": [
        {
            "name": "Figuring Out What Makes You Happy",
            "steps": [
                {
                    "headline": "Uncover your passions.",
                    "description": "When you are living a life you are passionate about there will be little to fix. Chances are, you are not feeling passionate right now. If not, go back to square one and find out what you truly need to be doing to live a fulfilled and happy life. Grab paper and a pen and complete the journaling exercises below. On your paper, answer the following:\nWhy am I here? – Consider your current purpose in life, and the variables that contributed to you being where you are right now. What kind of choices could you make or steer clear from in the future? Create a list of 20-50 things that make you happy. What is the best thing that has ever happened to me? What are five things I like about me? List three traits or characteristics others would use to describe you. My dream is…\nAfter you have answered all of the above, tie it all together. How can you realign your current purpose with meeting your dreams? How can you surround yourself with more things that make you happy? How can you make others see the positive traits or abilities that you see in yourself?"
                },
                {
                    "headline": "Think back to when and how you lost sight of these passions.",
                    "description": "Now that you have gotten a good understanding of the things that make you happy, look at your life and try to discern what led to you becoming disconnected from these passions. For example, sometimes we have goals and aspirations in life that do not fit with our parents’ or families’ goals. We might let go of our own passions to please others. Doing so might bring us pleasure for a short time, but eventually we become unhappy because we are not satisfying our core passions. Consider another example: Maybe you once had a passion for helping others before college. When you graduated and entered the rat race, you lost touch with that passion in favor of making money and getting the bills paid."
                },
                {
                    "headline": "Don't underestimate the value of community and finding your optimal place in it.",
                    "description": "This will lead you onto a path that self-perpetuates success, because you will be aligned both socially and virtuously with the ways in which you can be most useful in life. Value being useful over being busy."
                },
                {
                    "headline": "Prioritize your passions and values no matter where life takes you.",
                    "description": "As you have probably guessed, you lost touch with your passions when you began to prioritize others’ passions and values or less important aspects of life above those things that you truly believe in. You can fix this. When you prioritize your core values, or plan your day so that it is full in a spiritually satisfying way, you have a better chance at feeling this way more often. Research shows that this method of prioritizing good vibes, for example, is more effective than constantly chasing happiness 24/7. Look at that list of items that make you happy. Consider ways you can be proactive and incorporate some of these things or activities into your daily life. This way, whenever you get the chance, you are engaging in activities that bring you joy and peace of mind. For example, if you enjoy nature, you might schedule daily walks in the morning or the evening with either your dog, a partner or a friend."
                },
                {
                    "headline": "Live in the present.",
                    "description": "Live in the present moment, not in the past or future. Ruminating about past situations and worrying about future situations only subtracts from your life right now. Take an active hand in creating your own happiness by focusing on the here and now. Pause throughout your day and strive to be present-focused. Take several deep, cleansing breaths. Think about your environment and physical sensations. What do you see, smell, or hear? What are you feeling in your body? Continue to breathe deeply as you orient yourself to what's happening in this very moment."
                }
            ]
        },
        {
            "name": "Evaluating What Needs to Change",
            "steps": [
                {
                    "headline": "Take it slow.",
                    "description": "Fixing your whole life can be an overwhelming project. Understand that meaningful change cannot be implemented overnight. Changing even a single bad habit can be challenging. Know that it's okay, and expected, for you to take baby steps. Remember the first step in meaningful change is awareness of where your problems lie. Just being real with yourself and shining a light on your habits is incredibly instrumental towards fixing these issues. To build confidence about your self-improvement project, start small. Pick one area at a time in which you would like to improve. Work exclusively in this area until you have seen marked improvement, and then move to a new area. You may find that the positive changes you make in one area of life trickle down into other areas without you even trying."
                },
                {
                    "headline": "Examine problematic behavior patterns.",
                    "description": "To fix your life, you need to look closely at the factors that are contributing to you being stuck in this rut. It’s hard to acknowledge that we are the ones standing in the way of our happiness. Nonetheless, recognizing this gives you power, since you are the only one who can make changes to improve your life. Think about which behaviors you do repeatedly that result in you feeling dissatisfied about life. People who are chronically unhappy often share similar habits. These include the following:Playing the victim\nUsing alcohol, drugs, food, sex or other addictive behaviors to cope\nFeeling powerless to change their emotional state\nNeglecting health\nHaving rocky relationships"
                },
                {
                    "headline": "Ask yourself whether your thoughts are bringing you down.",
                    "description": "It’s common to experience negative thoughts periodically in life. However, if your life is constantly letting you down, your train of thought might be to blame. What’s running through your head all day on a loop has the power to cripple you and make you feel powerless at improving your life. Here are the 8 negative thought patterns of chronically unhappy people. Are you guilty of any of these? Self-defeating talk: “I can’t…” or “I’m not good enough…”\nRuminating negatively about the past: Rewinding or playing back horrible or stressful events that occurred previously in your life. Assuming the worst: Presuming the negative in all situations, or looking at life with a “glass half empty” attitude\nComparing yourself critically to others: Viewing others as more attractive, wealthier, or having better lives\nPlaying the victim: Choosing to look at yourself as weak or incapable of dealing with challenging people or situations\nStruggling to forgive yourself: Wallowing in guilt over past mistakes\nBlaming: Attributing your misfortunes to others\nFearing failure or mistakes: Setting unreasonably high standards and being perfectionistic"
                },
                {
                    "headline": "Take a closer look at your relationships.",
                    "description": "If your life is undesirable right now, you may need to assess your social circle. Ideally, you want to surround yourself with people who are positive, uplifting, and who see you value as a person. Such relationships are essential to happiness. However, if your relationships drain you, de-motivate you, or contribute to you maintaining unhealthy habits, then you may need to re-evaluate them. If you are an adult, then you must take responsibility for your role in any toxic relationships. Despite what you believe, you alone have the power to break free. So, if you chose to remain in such a relationship, you must acknowledge that are doing so at the sacrifice of your own well-being."
                }
            ]
        },
        {
            "name": "Making Healthy Changes",
            "steps": [
                {
                    "headline": "Improve your physical health.",
                    "description": "If you are neglecting your health, it can be hard to enjoy life. Failing to eat, sleep, and be active can obviously result in poor physical health and obesity, but neglecting your health can also lead to depression, anxiety, and even premature aging. Make positive changes to your health in order to improve your well-being and life satisfaction. Strive to do the following:\nEat a balanced diet\nGet regular exercise and sleep\nMaintain a healthy weight\nStop smoking\nLimit alcohol consumption\nGo to the doctor for regular check-ups"
                },
                {
                    "headline": "Get psychological help for addictive behaviors.",
                    "description": "Substance abuse, gambling or sex addictions may be incredibly difficult to overcome without professional assistance. Take the first step in removing these unhealthy behaviors by consulting with a psychologist."
                },
                {
                    "headline": "Develop a positive attitude.",
                    "description": "If every morning you wake up and think that your life sucks, then you will believe it after time. Create a shift in how you view the world and your life by making these small changes:\nCongratulate yourself on every success (no matter how small). Be your own biggest fan. Instead of saying “I can’t” aim to say “I can” more. Be patient. You create a self-fulfilling prophecy when you expect results in an unrealistic time-frame. Give your life time to take shape. Focus on the positive changes you are making daily."
                },
                {
                    "headline": "Pay attention to your thoughts.",
                    "description": "Negative thoughts result in a negative mood state, while positive thoughts lead to a positive mood. Take note when you are  engaging in negative thinking and attempt to transform these thoughts into more realistic and positive ones. Reframe your thinking by doing the following:\nListen for negative or unhelpful thoughts by monitoring your self-talk. When you catch yourself thinking negatively, alter your thoughts into more realistic or helpful self-statements. For example, \"I screwed up the interview! I will never get a job!\" can be reframed into \"I won't know how I did on the interview until several days. I may have performed better than I think; I'll have to be patient and see.\""
                },
                {
                    "headline": "Practice gratitude.",
                    "description": "Rather than focusing on what’s going wrong, or what you are not happy about in your life, notice those things that make you fortunate, such as having a home, friends who care about you, and a secure job. Start a gratitude journal. This can be a traditional journal or in a cellphone app. Make a commitment to writing about what you are thankful for several times each week. These may include things you thought would go wrong but didn't in your day, things you can't imagine living without, or people who have been helpful in your life."
                },
                {
                    "headline": "Practice self-care.",
                    "description": "Regularly take time out for yourself. Life can seem unfulfilling when we spend every moment of every day in a hamster wheel, performing. Schedule in your own “me time” and do something that brings you peace. Staying in touch with your state of mind is integral to emotional health. Make the effort to engage in stress-reducing activities on a regular basis. These activities might be reading a novel, playing with your pet, meditating, doing yoga, or painting."
                },
                {
                    "headline": "Develop a strong support system.",
                    "description": "Strive to maintain healthy interactions with people who make you feel good about yourself and your life. If you do not currently have many people like this in your life, go out and find some. You can connect with new people in a variety of ways – through your work, school, church, volunteer position, or in a club or group relating to a hobby. step out of your comfort zone and strike up a conversation with someone you see in your day-to-day routine but know nothing about."
                }
            ]
        }
    ],
    "tyn": [
        "Pen and paper",
        "Supportive family and friends",
        "Willpower"
    ],
    "text": " Figuring Out What Makes You Happy Uncover your passions. When you are living a life you are passionate about there will be little to fix. Chances are, you are not feeling passionate right now. If not, go back to square one and find out what you truly need to be doing to live a fulfilled and happy life. Grab paper and a pen and complete the journaling exercises below. On your paper, answer the following:\nWhy am I here? – Consider your current purpose in life, and the variables that contributed to you being where you are right now. What kind of choices could you make or steer clear from in the future? Create a list of 20-50 things that make you happy. What is the best thing that has ever happened to me? What are five things I like about me? List three traits or characteristics others would use to describe you. My dream is…\nAfter you have answered all of the above, tie it all together. How can you realign your current purpose with meeting your dreams? How can you surround yourself with more things that make you happy? How can you make others see the positive traits or abilities that you see in yourself? Think back to when and how you lost sight of these passions. Now that you have gotten a good understanding of the things that make you happy, look at your life and try to discern what led to you becoming disconnected from these passions. For example, sometimes we have goals and aspirations in life that do not fit with our parents’ or families’ goals. We might let go of our own passions to please others. Doing so might bring us pleasure for a short time, but eventually we become unhappy because we are not satisfying our core passions. Consider another example: Maybe you once had a passion for helping others before college. When you graduated and entered the rat race, you lost touch with that passion in favor of making money and getting the bills paid. Don't underestimate the value of community and finding your optimal place in it. This will lead you onto a path that self-perpetuates success, because you will be aligned both socially and virtuously with the ways in which you can be most useful in life. Value being useful over being busy. Prioritize your passions and values no matter where life takes you. As you have probably guessed, you lost touch with your passions when you began to prioritize others’ passions and values or less important aspects of life above those things that you truly believe in. You can fix this. When you prioritize your core values, or plan your day so that it is full in a spiritually satisfying way, you have a better chance at feeling this way more often. Research shows that this method of prioritizing good vibes, for example, is more effective than constantly chasing happiness 24/7. Look at that list of items that make you happy. Consider ways you can be proactive and incorporate some of these things or activities into your daily life. This way, whenever you get the chance, you are engaging in activities that bring you joy and peace of mind. For example, if you enjoy nature, you might schedule daily walks in the morning or the evening with either your dog, a partner or a friend. Live in the present. Live in the present moment, not in the past or future. Ruminating about past situations and worrying about future situations only subtracts from your life right now. Take an active hand in creating your own happiness by focusing on the here and now. Pause throughout your day and strive to be present-focused. Take several deep, cleansing breaths. Think about your environment and physical sensations. What do you see, smell, or hear? What are you feeling in your body? Continue to breathe deeply as you orient yourself to what's happening in this very moment. Evaluating What Needs to Change Take it slow. Fixing your whole life can be an overwhelming project. Understand that meaningful change cannot be implemented overnight. Changing even a single bad habit can be challenging. Know that it's okay, and expected, for you to take baby steps. Remember the first step in meaningful change is awareness of where your problems lie. Just being real with yourself and shining a light on your habits is incredibly instrumental towards fixing these issues. To build confidence about your self-improvement project, start small. Pick one area at a time in which you would like to improve. Work exclusively in this area until you have seen marked improvement, and then move to a new area. You may find that the positive changes you make in one area of life trickle down into other areas without you even trying. Examine problematic behavior patterns. To fix your life, you need to look closely at the factors that are contributing to you being stuck in this rut. It’s hard to acknowledge that we are the ones standing in the way of our happiness. Nonetheless, recognizing this gives you power, since you are the only one who can make changes to improve your life. Think about which behaviors you do repeatedly that result in you feeling dissatisfied about life. People who are chronically unhappy often share similar habits. These include the following:Playing the victim\nUsing alcohol, drugs, food, sex or other addictive behaviors to cope\nFeeling powerless to change their emotional state\nNeglecting health\nHaving rocky relationships Ask yourself whether your thoughts are bringing you down. It’s common to experience negative thoughts periodically in life. However, if your life is constantly letting you down, your train of thought might be to blame. What’s running through your head all day on a loop has the power to cripple you and make you feel powerless at improving your life. Here are the 8 negative thought patterns of chronically unhappy people. Are you guilty of any of these? Self-defeating talk: “I can’t…” or “I’m not good enough…”\nRuminating negatively about the past: Rewinding or playing back horrible or stressful events that occurred previously in your life. Assuming the worst: Presuming the negative in all situations, or looking at life with a “glass half empty” attitude\nComparing yourself critically to others: Viewing others as more attractive, wealthier, or having better lives\nPlaying the victim: Choosing to look at yourself as weak or incapable of dealing with challenging people or situations\nStruggling to forgive yourself: Wallowing in guilt over past mistakes\nBlaming: Attributing your misfortunes to others\nFearing failure or mistakes: Setting unreasonably high standards and being perfectionistic Take a closer look at your relationships. If your life is undesirable right now, you may need to assess your social circle. Ideally, you want to surround yourself with people who are positive, uplifting, and who see you value as a person. Such relationships are essential to happiness. However, if your relationships drain you, de-motivate you, or contribute to you maintaining unhealthy habits, then you may need to re-evaluate them. If you are an adult, then you must take responsibility for your role in any toxic relationships. Despite what you believe, you alone have the power to break free. So, if you chose to remain in such a relationship, you must acknowledge that are doing so at the sacrifice of your own well-being. Making Healthy Changes Improve your physical health. If you are neglecting your health, it can be hard to enjoy life. Failing to eat, sleep, and be active can obviously result in poor physical health and obesity, but neglecting your health can also lead to depression, anxiety, and even premature aging. Make positive changes to your health in order to improve your well-being and life satisfaction. Strive to do the following:\nEat a balanced diet\nGet regular exercise and sleep\nMaintain a healthy weight\nStop smoking\nLimit alcohol consumption\nGo to the doctor for regular check-ups Get psychological help for addictive behaviors. Substance abuse, gambling or sex addictions may be incredibly difficult to overcome without professional assistance. Take the first step in removing these unhealthy behaviors by consulting with a psychologist. Develop a positive attitude. If every morning you wake up and think that your life sucks, then you will believe it after time. Create a shift in how you view the world and your life by making these small changes:\nCongratulate yourself on every success (no matter how small). Be your own biggest fan. Instead of saying “I can’t” aim to say “I can” more. Be patient. You create a self-fulfilling prophecy when you expect results in an unrealistic time-frame. Give your life time to take shape. Focus on the positive changes you are making daily. Pay attention to your thoughts. Negative thoughts result in a negative mood state, while positive thoughts lead to a positive mood. Take note when you are  engaging in negative thinking and attempt to transform these thoughts into more realistic and positive ones. Reframe your thinking by doing the following:\nListen for negative or unhelpful thoughts by monitoring your self-talk. When you catch yourself thinking negatively, alter your thoughts into more realistic or helpful self-statements. For example, \"I screwed up the interview! I will never get a job!\" can be reframed into \"I won't know how I did on the interview until several days. I may have performed better than I think; I'll have to be patient and see.\" Practice gratitude. Rather than focusing on what’s going wrong, or what you are not happy about in your life, notice those things that make you fortunate, such as having a home, friends who care about you, and a secure job. Start a gratitude journal. This can be a traditional journal or in a cellphone app. Make a commitment to writing about what you are thankful for several times each week. These may include things you thought would go wrong but didn't in your day, things you can't imagine living without, or people who have been helpful in your life. Practice self-care. Regularly take time out for yourself. Life can seem unfulfilling when we spend every moment of every day in a hamster wheel, performing. Schedule in your own “me time” and do something that brings you peace. Staying in touch with your state of mind is integral to emotional health. Make the effort to engage in stress-reducing activities on a regular basis. These activities might be reading a novel, playing with your pet, meditating, doing yoga, or painting. Develop a strong support system. Strive to maintain healthy interactions with people who make you feel good about yourself and your life. If you do not currently have many people like this in your life, go out and find some. You can connect with new people in a variety of ways – through your work, school, church, volunteer position, or in a club or group relating to a hobby. step out of your comfort zone and strike up a conversation with someone you see in your day-to-day routine but know nothing about.",
    "sentences": [
        " Figuring Out What Makes You Happy Uncover your passions.",
        "When you are living a life you are passionate about there will be little to fix.",
        "Chances are, you are not feeling passionate right now.",
        "If not, go back to square one and find out what you truly need to be doing to live a fulfilled and happy life.",
        "Grab paper and a pen and complete the journaling exercises below.",
        "On your paper, answer the following:\nWhy am I here?",
        "– Consider your current purpose in life, and the variables that contributed to you being where you are right now.",
        "What kind of choices could you make or steer clear from in the future?",
        "Create a list of 20-50 things that make you happy.",
        "What is the best thing that has ever happened to me?",
        "What are five things I like about me?",
        "List three traits or characteristics others would use to describe you.",
        "My dream is…\nAfter you have answered all of the above, tie it all together.",
        "How can you realign your current purpose with meeting your dreams?",
        "How can you surround yourself with more things that make you happy?",
        "How can you make others see the positive traits or abilities that you see in yourself?",
        "Think back to when and how you lost sight of these passions.",
        "Now that you have gotten a good understanding of the things that make you happy, look at your life and try to discern what led to you becoming disconnected from these passions.",
        "For example, sometimes we have goals and aspirations in life that do not fit with our parents’ or families’ goals.",
        "We might let go of our own passions to please others.",
        "Doing so might bring us pleasure for a short time, but eventually we become unhappy because we are not satisfying our core passions.",
        "Consider another example: Maybe you once had a passion for helping others before college.",
        "When you graduated and entered the rat race, you lost touch with that passion in favor of making money and getting the bills paid.",
        "Don't underestimate the value of community and finding your optimal place in it.",
        "This will lead you onto a path that self-perpetuates success, because you will be aligned both socially and virtuously with the ways in which you can be most useful in life.",
        "Value being useful over being busy.",
        "Prioritize your passions and values no matter where life takes you.",
        "As you have probably guessed, you lost touch with your passions when you began to prioritize others’ passions and values or less important aspects of life above those things that you truly believe in.",
        "You can fix this.",
        "When you prioritize your core values, or plan your day so that it is full in a spiritually satisfying way, you have a better chance at feeling this way more often.",
        "Research shows that this method of prioritizing good vibes, for example, is more effective than constantly chasing happiness 24/7.",
        "Look at that list of items that make you happy.",
        "Consider ways you can be proactive and incorporate some of these things or activities into your daily life.",
        "This way, whenever you get the chance, you are engaging in activities that bring you joy and peace of mind.",
        "For example, if you enjoy nature, you might schedule daily walks in the morning or the evening with either your dog, a partner or a friend.",
        "Live in the present.",
        "Live in the present moment, not in the past or future.",
        "Ruminating about past situations and worrying about future situations only subtracts from your life right now.",
        "Take an active hand in creating your own happiness by focusing on the here and now.",
        "Pause throughout your day and strive to be present-focused.",
        "Take several deep, cleansing breaths.",
        "Think about your environment and physical sensations.",
        "What do you see, smell, or hear?",
        "What are you feeling in your body?",
        "Continue to breathe deeply as you orient yourself to what's happening in this very moment.",
        "Evaluating What Needs to Change Take it slow.",
        "Fixing your whole life can be an overwhelming project.",
        "Understand that meaningful change cannot be implemented overnight.",
        "Changing even a single bad habit can be challenging.",
        "Know that it's okay, and expected, for you to take baby steps.",
        "Remember the first step in meaningful change is awareness of where your problems lie.",
        "Just being real with yourself and shining a light on your habits is incredibly instrumental towards fixing these issues.",
        "To build confidence about your self-improvement project, start small.",
        "Pick one area at a time in which you would like to improve.",
        "Work exclusively in this area until you have seen marked improvement, and then move to a new area.",
        "You may find that the positive changes you make in one area of life trickle down into other areas without you even trying.",
        "Examine problematic behavior patterns.",
        "To fix your life, you need to look closely at the factors that are contributing to you being stuck in this rut.",
        "It’s hard to acknowledge that we are the ones standing in the way of our happiness.",
        "Nonetheless, recognizing this gives you power, since you are the only one who can make changes to improve your life.",
        "Think about which behaviors you do repeatedly that result in you feeling dissatisfied about life.",
        "People who are chronically unhappy often share similar habits.",
        "These include the following:Playing the victim\nUsing alcohol, drugs, food, sex or other addictive behaviors to cope\nFeeling powerless to change their emotional state\nNeglecting health\nHaving rocky relationships Ask yourself whether your thoughts are bringing you down.",
        "It’s common to experience negative thoughts periodically in life.",
        "However, if your life is constantly letting you down, your train of thought might be to blame.",
        "What’s running through your head all day on a loop has the power to cripple you and make you feel powerless at improving your life.",
        "Here are the 8 negative thought patterns of chronically unhappy people.",
        "Are you guilty of any of these?",
        "Self-defeating talk: “I can’t…” or “I’m not good enough…”\nRuminating negatively about the past: Rewinding or playing back horrible or stressful events that occurred previously in your life.",
        "Assuming the worst: Presuming the negative in all situations, or looking at life with a “glass half empty” attitude\nComparing yourself critically to others: Viewing others as more attractive, wealthier, or having better lives\nPlaying the victim: Choosing to look at yourself as weak or incapable of dealing with challenging people or situations\nStruggling to forgive yourself: Wallowing in guilt over past mistakes\nBlaming: Attributing your misfortunes to others\nFearing failure or mistakes: Setting unreasonably high standards and being perfectionistic Take a closer look at your relationships.",
        "If your life is undesirable right now, you may need to assess your social circle.",
        "Ideally, you want to surround yourself with people who are positive, uplifting, and who see you value as a person.",
        "Such relationships are essential to happiness.",
        "However, if your relationships drain you, de-motivate you, or contribute to you maintaining unhealthy habits, then you may need to re-evaluate them.",
        "If you are an adult, then you must take responsibility for your role in any toxic relationships.",
        "Despite what you believe, you alone have the power to break free.",
        "So, if you chose to remain in such a relationship, you must acknowledge that are doing so at the sacrifice of your own well-being.",
        "Making Healthy Changes Improve your physical health.",
        "If you are neglecting your health, it can be hard to enjoy life.",
        "Failing to eat, sleep, and be active can obviously result in poor physical health and obesity, but neglecting your health can also lead to depression, anxiety, and even premature aging.",
        "Make positive changes to your health in order to improve your well-being and life satisfaction.",
        "Strive to do the following:\nEat a balanced diet\nGet regular exercise and sleep\nMaintain a healthy weight\nStop smoking\nLimit alcohol consumption\nGo to the doctor for regular check-ups Get psychological help for addictive behaviors.",
        "Substance abuse, gambling or sex addictions may be incredibly difficult to overcome without professional assistance.",
        "Take the first step in removing these unhealthy behaviors by consulting with a psychologist.",
        "Develop a positive attitude.",
        "If every morning you wake up and think that your life sucks, then you will believe it after time.",
        "Create a shift in how you view the world and your life by making these small changes:\nCongratulate yourself on every success (no matter how small).",
        "Be your own biggest fan.",
        "Instead of saying “I can’t” aim to say “I can” more.",
        "Be patient.",
        "You create a self-fulfilling prophecy when you expect results in an unrealistic time-frame.",
        "Give your life time to take shape.",
        "Focus on the positive changes you are making daily.",
        "Pay attention to your thoughts.",
        "Negative thoughts result in a negative mood state, while positive thoughts lead to a positive mood.",
        "Take note when you are  engaging in negative thinking and attempt to transform these thoughts into more realistic and positive ones.",
        "Reframe your thinking by doing the following:\nListen for negative or unhelpful thoughts by monitoring your self-talk.",
        "When you catch yourself thinking negatively, alter your thoughts into more realistic or helpful self-statements.",
        "For example, \"I screwed up the interview!",
        "I will never get a job!\"",
        "can be reframed into \"I won't know how I did on the interview until several days.",
        "I may have performed better than I think; I'll have to be patient and see.\"",
        "Practice gratitude.",
        "Rather than focusing on what’s going wrong, or what you are not happy about in your life, notice those things that make you fortunate, such as having a home, friends who care about you, and a secure job.",
        "Start a gratitude journal.",
        "This can be a traditional journal or in a cellphone app.",
        "Make a commitment to writing about what you are thankful for several times each week.",
        "These may include things you thought would go wrong but didn't in your day, things you can't imagine living without, or people who have been helpful in your life.",
        "Practice self-care.",
        "Regularly take time out for yourself.",
        "Life can seem unfulfilling when we spend every moment of every day in a hamster wheel, performing.",
        "Schedule in your own “me time” and do something that brings you peace.",
        "Staying in touch with your state of mind is integral to emotional health.",
        "Make the effort to engage in stress-reducing activities on a regular basis.",
        "These activities might be reading a novel, playing with your pet, meditating, doing yoga, or painting.",
        "Develop a strong support system.",
        "Strive to maintain healthy interactions with people who make you feel good about yourself and your life.",
        "If you do not currently have many people like this in your life, go out and find some.",
        "You can connect with new people in a variety of ways – through your work, school, church, volunteer position, or in a club or group relating to a hobby.",
        "step out of your comfort zone and strike up a conversation with someone you see in your day-to-day routine but know nothing about."
    ]
}