{
    "title": "How to Make a Tomato Cage Christmas Tree",
    "url": "https://www.wikihow.com/Make-a-Tomato-Cage-Christmas-Tree",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Christmas"
    ],
    "parts": [
        {
            "name": "Building the Base",
            "steps": [
                {
                    "headline": "Get a heavy-duty tomato cage from a gardening supply store.",
                    "description": "They are different from regular plant teepees in that they have a round base instead of a triangular one. Choose your cage's height based on how tall you want the tree to be."
                },
                {
                    "headline": "Tie the bottom of the tomato cage to form a cone.",
                    "description": "Take the prongs above the smallest ring, and gather them together. Secure them with a small piece of wire, a twist tie, or a zip tie. Use heavy-duty wire cutters to cut off any excess material from your tie."
                },
                {
                    "headline": "Get a pot that's wider than the largest ring on your tomato cage.",
                    "description": "You will be putting your tomato cage tree into this, so make sure that it looks festive. The pot does not need to have a drainage hole at the bottom. Listed below are some ideas to get you started:\nFor a classical touch, get a silver or gold pot; you can also get a plain pot, and spray paint it gold or silver. For a more elegant pot, get something that's either black or white, and glossy, with an ornate deign on it. Urns work great for this. For something more festive, paint a terracotta pot white, then add red and green stripes or polka dots. For a rustic look, use a wine barrel planter."
                },
                {
                    "headline": "Fill the pot with soil or rocks.",
                    "description": "If your pot has a drainage hole at the bottom, plug it up with something first, like a piece of paper, screen or tile. Fill the pot until you are 2 inches (5.08 centimeters) from the rim. Alternatively, you can set another, smaller pot into the larger one to help weigh it down instead."
                },
                {
                    "headline": "Set the cage, largest-ring-down, onto the soil.",
                    "description": "Use U-shaped pins to secure the bottom-most ring to the soil. You can also cut off the bottom-most ring with heavy-duty wire cutters, then use the prongs to stick the tree into the soil.If you didn't use rocks or soil, set the cage down into the empty pot as far as it will go, then secure the bottom-most ring to the pot with duct tape."
                }
            ]
        },
        {
            "name": "Adding the Greenery",
            "steps": [
                {
                    "headline": "Get a 9-foot (2.75-meter) wired, unlit evergreen garland.",
                    "description": "Don't use a pre-lit garland. This way, if the lights burn out, you won't have to take apart the entire tree just to change them. How many garlands you need depends on the size of the tree:\nFor a large tree, you will need three garlands. For a medium tree, you will need two garlands. For a small tree, you will need one garland."
                },
                {
                    "headline": "Secure the garland to the bottom-most ring.",
                    "description": "Stand the tree up on something stable. Use wires, twist ties, or zip ties to secure the garland to the bottom-most ring on your tree. Tuck the ends of the wire or twist tie down and out of sight. If you are using a zip tie, be sure to cut the excess off."
                },
                {
                    "headline": "Wrap the garland around the bottom-most ring.",
                    "description": "Secure it to the metal ring every couple of inches/centimeters with another piece of wire, twist tie, or zip tie. Alternatively, you can wrap one of its mini branches around the ring instead. If you choose to secure the garland to the rings by using its mini branches, be sure to wrap the branch around the core of the garland as well."
                },
                {
                    "headline": "Continue wrapping the garland around the tree, fluffing it as you go.",
                    "description": "When you reach the end of one garland, simply add on another one, and keep wrapping. Try to space the garland so that it covers the entire cage; you do not want to see any gaps or holes. Remember to secure it to the metal rings, just like you did the first one."
                },
                {
                    "headline": "Secure the end of the garland to the top of the tree.",
                    "description": "Use a small piece of wire, a twist tie, or a zip tie for this. For a more realistic touch, bend one of the branches at the very tip upward—just like in a real tree. If you have any excess garland, wrap it back down towards the bottom of the tree."
                }
            ]
        },
        {
            "name": "Adding the Lights and Decorations",
            "steps": [
                {
                    "headline": "Get a strand(s) of 100-bulb Christmas lights.",
                    "description": "White lights will give you the most classical look, but you can also use multi-colored ones for a more festive touch. How many strands you get depends on the size of your tree:\nFor a large tree, you will need two strands of 100 lights. For a medium tree, you will need two strands of 100 lights. For a small tree, you will need one strand of 100 lights."
                },
                {
                    "headline": "Secure the end of your lights to the top of the tree.",
                    "description": "Find the end of the lights that has the outlet on it (not the prongs). Secure it to the top of the tree with a small piece of wire, a twist tie, or a zip tie. Try to attach it directly to the metal base."
                },
                {
                    "headline": "Wrap the strand around the tree.",
                    "description": "When you reach the end of one strand, plug it into the outlet end of the next strand, and keep on wrapping. You'll need two strands for a large or medium tree, and only one strand for a small tree."
                },
                {
                    "headline": "Decorate the tree as desired.",
                    "description": "You can go as simple or as extravagant as you like with this. Keep in mind, however, that because of its topiary-like shape, simple designs will work much better. Here are some ideas to get you started:\nFor a classic look, add a red, velvet bow to the top of the tree. Wrap the tails around the tree, like a garland. For a fancy twist, hang some ornaments on the tree. Snowflakes, stars, or balls are all great choices. For a natural look, use Christmas picks, such as berries, crabapples, and pinecones."
                }
            ]
        }
    ],
    "tyn": [
        "Heavy-duty tomato cage",
        "9-foot (2.75-meter), wired, unlit garland",
        "100-bulb Christmas lights",
        "Zip ties",
        "Christmas bow (optional)",
        "Ornaments (optional)"
    ],
    "text": " Building the Base Get a heavy-duty tomato cage from a gardening supply store. They are different from regular plant teepees in that they have a round base instead of a triangular one. Choose your cage's height based on how tall you want the tree to be. Tie the bottom of the tomato cage to form a cone. Take the prongs above the smallest ring, and gather them together. Secure them with a small piece of wire, a twist tie, or a zip tie. Use heavy-duty wire cutters to cut off any excess material from your tie. Get a pot that's wider than the largest ring on your tomato cage. You will be putting your tomato cage tree into this, so make sure that it looks festive. The pot does not need to have a drainage hole at the bottom. Listed below are some ideas to get you started:\nFor a classical touch, get a silver or gold pot; you can also get a plain pot, and spray paint it gold or silver. For a more elegant pot, get something that's either black or white, and glossy, with an ornate deign on it. Urns work great for this. For something more festive, paint a terracotta pot white, then add red and green stripes or polka dots. For a rustic look, use a wine barrel planter. Fill the pot with soil or rocks. If your pot has a drainage hole at the bottom, plug it up with something first, like a piece of paper, screen or tile. Fill the pot until you are 2 inches (5.08 centimeters) from the rim. Alternatively, you can set another, smaller pot into the larger one to help weigh it down instead. Set the cage, largest-ring-down, onto the soil. Use U-shaped pins to secure the bottom-most ring to the soil. You can also cut off the bottom-most ring with heavy-duty wire cutters, then use the prongs to stick the tree into the soil.If you didn't use rocks or soil, set the cage down into the empty pot as far as it will go, then secure the bottom-most ring to the pot with duct tape. Adding the Greenery Get a 9-foot (2.75-meter) wired, unlit evergreen garland. Don't use a pre-lit garland. This way, if the lights burn out, you won't have to take apart the entire tree just to change them. How many garlands you need depends on the size of the tree:\nFor a large tree, you will need three garlands. For a medium tree, you will need two garlands. For a small tree, you will need one garland. Secure the garland to the bottom-most ring. Stand the tree up on something stable. Use wires, twist ties, or zip ties to secure the garland to the bottom-most ring on your tree. Tuck the ends of the wire or twist tie down and out of sight. If you are using a zip tie, be sure to cut the excess off. Wrap the garland around the bottom-most ring. Secure it to the metal ring every couple of inches/centimeters with another piece of wire, twist tie, or zip tie. Alternatively, you can wrap one of its mini branches around the ring instead. If you choose to secure the garland to the rings by using its mini branches, be sure to wrap the branch around the core of the garland as well. Continue wrapping the garland around the tree, fluffing it as you go. When you reach the end of one garland, simply add on another one, and keep wrapping. Try to space the garland so that it covers the entire cage; you do not want to see any gaps or holes. Remember to secure it to the metal rings, just like you did the first one. Secure the end of the garland to the top of the tree. Use a small piece of wire, a twist tie, or a zip tie for this. For a more realistic touch, bend one of the branches at the very tip upward—just like in a real tree. If you have any excess garland, wrap it back down towards the bottom of the tree. Adding the Lights and Decorations Get a strand(s) of 100-bulb Christmas lights. White lights will give you the most classical look, but you can also use multi-colored ones for a more festive touch. How many strands you get depends on the size of your tree:\nFor a large tree, you will need two strands of 100 lights. For a medium tree, you will need two strands of 100 lights. For a small tree, you will need one strand of 100 lights. Secure the end of your lights to the top of the tree. Find the end of the lights that has the outlet on it (not the prongs). Secure it to the top of the tree with a small piece of wire, a twist tie, or a zip tie. Try to attach it directly to the metal base. Wrap the strand around the tree. When you reach the end of one strand, plug it into the outlet end of the next strand, and keep on wrapping. You'll need two strands for a large or medium tree, and only one strand for a small tree. Decorate the tree as desired. You can go as simple or as extravagant as you like with this. Keep in mind, however, that because of its topiary-like shape, simple designs will work much better. Here are some ideas to get you started:\nFor a classic look, add a red, velvet bow to the top of the tree. Wrap the tails around the tree, like a garland. For a fancy twist, hang some ornaments on the tree. Snowflakes, stars, or balls are all great choices. For a natural look, use Christmas picks, such as berries, crabapples, and pinecones.",
    "sentences": [
        " Building the Base Get a heavy-duty tomato cage from a gardening supply store.",
        "They are different from regular plant teepees in that they have a round base instead of a triangular one.",
        "Choose your cage's height based on how tall you want the tree to be.",
        "Tie the bottom of the tomato cage to form a cone.",
        "Take the prongs above the smallest ring, and gather them together.",
        "Secure them with a small piece of wire, a twist tie, or a zip tie.",
        "Use heavy-duty wire cutters to cut off any excess material from your tie.",
        "Get a pot that's wider than the largest ring on your tomato cage.",
        "You will be putting your tomato cage tree into this, so make sure that it looks festive.",
        "The pot does not need to have a drainage hole at the bottom.",
        "Listed below are some ideas to get you started:\nFor a classical touch, get a silver or gold pot; you can also get a plain pot, and spray paint it gold or silver.",
        "For a more elegant pot, get something that's either black or white, and glossy, with an ornate deign on it.",
        "Urns work great for this.",
        "For something more festive, paint a terracotta pot white, then add red and green stripes or polka dots.",
        "For a rustic look, use a wine barrel planter.",
        "Fill the pot with soil or rocks.",
        "If your pot has a drainage hole at the bottom, plug it up with something first, like a piece of paper, screen or tile.",
        "Fill the pot until you are 2 inches (5.08 centimeters) from the rim.",
        "Alternatively, you can set another, smaller pot into the larger one to help weigh it down instead.",
        "Set the cage, largest-ring-down, onto the soil.",
        "Use U-shaped pins to secure the bottom-most ring to the soil.",
        "You can also cut off the bottom-most ring with heavy-duty wire cutters, then use the prongs to stick the tree into the soil.If you didn't use rocks or soil, set the cage down into the empty pot as far as it will go, then secure the bottom-most ring to the pot with duct tape.",
        "Adding the Greenery Get a 9-foot (2.75-meter) wired, unlit evergreen garland.",
        "Don't use a pre-lit garland.",
        "This way, if the lights burn out, you won't have to take apart the entire tree just to change them.",
        "How many garlands you need depends on the size of the tree:\nFor a large tree, you will need three garlands.",
        "For a medium tree, you will need two garlands.",
        "For a small tree, you will need one garland.",
        "Secure the garland to the bottom-most ring.",
        "Stand the tree up on something stable.",
        "Use wires, twist ties, or zip ties to secure the garland to the bottom-most ring on your tree.",
        "Tuck the ends of the wire or twist tie down and out of sight.",
        "If you are using a zip tie, be sure to cut the excess off.",
        "Wrap the garland around the bottom-most ring.",
        "Secure it to the metal ring every couple of inches/centimeters with another piece of wire, twist tie, or zip tie.",
        "Alternatively, you can wrap one of its mini branches around the ring instead.",
        "If you choose to secure the garland to the rings by using its mini branches, be sure to wrap the branch around the core of the garland as well.",
        "Continue wrapping the garland around the tree, fluffing it as you go.",
        "When you reach the end of one garland, simply add on another one, and keep wrapping.",
        "Try to space the garland so that it covers the entire cage; you do not want to see any gaps or holes.",
        "Remember to secure it to the metal rings, just like you did the first one.",
        "Secure the end of the garland to the top of the tree.",
        "Use a small piece of wire, a twist tie, or a zip tie for this.",
        "For a more realistic touch, bend one of the branches at the very tip upward—just like in a real tree.",
        "If you have any excess garland, wrap it back down towards the bottom of the tree.",
        "Adding the Lights and Decorations Get a strand(s) of 100-bulb Christmas lights.",
        "White lights will give you the most classical look, but you can also use multi-colored ones for a more festive touch.",
        "How many strands you get depends on the size of your tree:\nFor a large tree, you will need two strands of 100 lights.",
        "For a medium tree, you will need two strands of 100 lights.",
        "For a small tree, you will need one strand of 100 lights.",
        "Secure the end of your lights to the top of the tree.",
        "Find the end of the lights that has the outlet on it (not the prongs).",
        "Secure it to the top of the tree with a small piece of wire, a twist tie, or a zip tie.",
        "Try to attach it directly to the metal base.",
        "Wrap the strand around the tree.",
        "When you reach the end of one strand, plug it into the outlet end of the next strand, and keep on wrapping.",
        "You'll need two strands for a large or medium tree, and only one strand for a small tree.",
        "Decorate the tree as desired.",
        "You can go as simple or as extravagant as you like with this.",
        "Keep in mind, however, that because of its topiary-like shape, simple designs will work much better.",
        "Here are some ideas to get you started:\nFor a classic look, add a red, velvet bow to the top of the tree.",
        "Wrap the tails around the tree, like a garland.",
        "For a fancy twist, hang some ornaments on the tree.",
        "Snowflakes, stars, or balls are all great choices.",
        "For a natural look, use Christmas picks, such as berries, crabapples, and pinecones."
    ]
}