{
    "title": "How to Crumble Tofu",
    "url": "https://www.wikihow.com/Crumble-Tofu",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Vegetarian",
        "Tofu and Tempeh"
    ],
    "parts": [
        {
            "name": "Preparing and Blotting Tofu",
            "steps": [
                {
                    "headline": "Purchase extra-firm tofu.",
                    "description": "You should be able to find tofu at any local grocery store, supermarket, or health-food store. Tofu is packaged according to the degree of hardness, ranging from Extra Soft to Extra Firm. Silken or soft tofu will not crumble well, so purchase a very firm tofu. Tofu needs to be refrigerated, so check the store’s refrigerated aisles, especially in the “Organic” or “Vegan” sections. Tofu is typically sold in containers between 10 and 14 ounces (280 and 400 grams)."
                },
                {
                    "headline": "Prepare a large bowl and paper towels.",
                    "description": "Find a large plastic or ceramic bowl in your kitchen. You’ll use this bowl to crumble the tofu into. After you’ve found a bowl, layer several paper towels on top of your kitchen counter. You’ll use these shortly to drain the tofu. Remember to wash and rinse the bowl before you use it, so that you won’t contaminate the tofu that you crumble into it."
                },
                {
                    "headline": "Open the tofu container.",
                    "description": "When you buy the tofu, it should come sealed in a plastic container. The container may have a pull-tab on top that you can tug on to open it up. If there is no tab to open the tofu with, you’ll need to get out a pair of scissors and slice the container open. If you notice that the tofu’s container is damaged or torn open, take it back to the grocery store. The store should be able to issue a refund or exchange the damaged tofu."
                },
                {
                    "headline": "Blot the tofu block.",
                    "description": "Once you have opened the tofu packaging, pour out all of the water inside the packaging. Then, remove the tofu block. Set the tofu block on top of the paper towels that you’ve already laid out on your kitchen counter. Let the tofu sit for 5–10 minutes so that water can drain from it. Instead of paper towels, you can also blot the tofu on top of a regular dish towel."
                }
            ]
        },
        {
            "name": "Pressing and Crumbling Tofu",
            "steps": [
                {
                    "headline": "Press the tofu with a baking sheet.",
                    "description": "Once your tofu has been blotted on paper towels (or a dish towel) for 10 minutes, set another layer of paper towels (or another dish towel) on top of the tofu. Then place a baking sheet on top of the upper layer of towels. Pressing liquid out of the tofu is important when preparing firmer tofus. If you eat firm tofu while it’s still soggy with water, the flavor will be diluted."
                },
                {
                    "headline": "Place some weight on top of the baking sheet.",
                    "description": "Once you’ve placed a baking sheet on top of the tofu, add weight on top of the baking sheet. A few canned goods will do. The cans will provide the necessary weight to press the rest of the moisture out of your tofu. If you don’t have accessible canned goods, you could use a few books as a substitute."
                },
                {
                    "headline": "Use your hands to crumble the tofu into a bowl.",
                    "description": "Pick up the block of tofu with both hands, and hold it firmly over the bowl. Using your thumbs, break small pieces of tofu off from the main block. Aim to crumble off chunks that are no larger than 1/4 inch (0.6 cm) across."
                },
                {
                    "headline": "Refrigerate leftover crumbled tofu.",
                    "description": "Based on the recipe that you’re using, you may not need to use the entire block of tofu. If you’ve crumbled more than necessary, you can easily save the leftover tofu in your fridge. Put the crumbled tofu in an airtight plastic container, and cover the tofu with cool tap water before putting the container in the fridge. Alternately, if you know you won’t need all of the tofu in advance, only crumble what you’ll need. Then, refrigerate the remnant of the tofu block using the same method."
                }
            ]
        },
        {
            "name": "Using Crumbled Tofu",
            "steps": [
                {
                    "headline": "Find a recipe to use the tofu in.",
                    "description": "Unless you’re planning to eat the tofu cold and raw, you’ll need to plan ahead and find a suitable recipe. Crumbling tofu—unlike other methods, such as slicing or dicing—will help the dish it’s added to have a more consistent texture. Crumbled tofu works well in dishes like dumplings or casseroles. Try making these steamed and crumbled tofu potstickers."
                },
                {
                    "headline": "Try the crumbled tofu with a pasta dish.",
                    "description": "Crumbled tofu doesn’t have to be only eaten in casseroles and dumplings. It can also complement pasta dishes in both taste and texture. Try making a dish with spicy garlic noodles with crumbled tofu."
                },
                {
                    "headline": "Use crumbled tofu in a salad.",
                    "description": "Tofu is commonly added to salads as a protein-rich meat substitute. Crumbled tofu provides a texture which offsets the crunch of most other salad ingredients. Try adding crumbled tofu to steamed broccoli, along with garlic and a couple of other seasonings, for a simple Korean-inspired salad. Think of adding crumbled tofu to a salad like adding feta cheese. In fact, the crumbled chunks will probably have similar sizes."
                }
            ]
        }
    ],
    "tyn": [
        "Tofu",
        "Scissors",
        "Paper towels",
        "Dish towels (optional)",
        "Baking sheet",
        "Cans (for weight)",
        "A large bowl"
    ],
    "text": " Preparing and Blotting Tofu Purchase extra-firm tofu. You should be able to find tofu at any local grocery store, supermarket, or health-food store. Tofu is packaged according to the degree of hardness, ranging from Extra Soft to Extra Firm. Silken or soft tofu will not crumble well, so purchase a very firm tofu. Tofu needs to be refrigerated, so check the store’s refrigerated aisles, especially in the “Organic” or “Vegan” sections. Tofu is typically sold in containers between 10 and 14 ounces (280 and 400 grams). Prepare a large bowl and paper towels. Find a large plastic or ceramic bowl in your kitchen. You’ll use this bowl to crumble the tofu into. After you’ve found a bowl, layer several paper towels on top of your kitchen counter. You’ll use these shortly to drain the tofu. Remember to wash and rinse the bowl before you use it, so that you won’t contaminate the tofu that you crumble into it. Open the tofu container. When you buy the tofu, it should come sealed in a plastic container. The container may have a pull-tab on top that you can tug on to open it up. If there is no tab to open the tofu with, you’ll need to get out a pair of scissors and slice the container open. If you notice that the tofu’s container is damaged or torn open, take it back to the grocery store. The store should be able to issue a refund or exchange the damaged tofu. Blot the tofu block. Once you have opened the tofu packaging, pour out all of the water inside the packaging. Then, remove the tofu block. Set the tofu block on top of the paper towels that you’ve already laid out on your kitchen counter. Let the tofu sit for 5–10 minutes so that water can drain from it. Instead of paper towels, you can also blot the tofu on top of a regular dish towel. Pressing and Crumbling Tofu Press the tofu with a baking sheet. Once your tofu has been blotted on paper towels (or a dish towel) for 10 minutes, set another layer of paper towels (or another dish towel) on top of the tofu. Then place a baking sheet on top of the upper layer of towels. Pressing liquid out of the tofu is important when preparing firmer tofus. If you eat firm tofu while it’s still soggy with water, the flavor will be diluted. Place some weight on top of the baking sheet. Once you’ve placed a baking sheet on top of the tofu, add weight on top of the baking sheet. A few canned goods will do. The cans will provide the necessary weight to press the rest of the moisture out of your tofu. If you don’t have accessible canned goods, you could use a few books as a substitute. Use your hands to crumble the tofu into a bowl. Pick up the block of tofu with both hands, and hold it firmly over the bowl. Using your thumbs, break small pieces of tofu off from the main block. Aim to crumble off chunks that are no larger than 1/4 inch (0.6 cm) across. Refrigerate leftover crumbled tofu. Based on the recipe that you’re using, you may not need to use the entire block of tofu. If you’ve crumbled more than necessary, you can easily save the leftover tofu in your fridge. Put the crumbled tofu in an airtight plastic container, and cover the tofu with cool tap water before putting the container in the fridge. Alternately, if you know you won’t need all of the tofu in advance, only crumble what you’ll need. Then, refrigerate the remnant of the tofu block using the same method. Using Crumbled Tofu Find a recipe to use the tofu in. Unless you’re planning to eat the tofu cold and raw, you’ll need to plan ahead and find a suitable recipe. Crumbling tofu—unlike other methods, such as slicing or dicing—will help the dish it’s added to have a more consistent texture. Crumbled tofu works well in dishes like dumplings or casseroles. Try making these steamed and crumbled tofu potstickers. Try the crumbled tofu with a pasta dish. Crumbled tofu doesn’t have to be only eaten in casseroles and dumplings. It can also complement pasta dishes in both taste and texture. Try making a dish with spicy garlic noodles with crumbled tofu. Use crumbled tofu in a salad. Tofu is commonly added to salads as a protein-rich meat substitute. Crumbled tofu provides a texture which offsets the crunch of most other salad ingredients. Try adding crumbled tofu to steamed broccoli, along with garlic and a couple of other seasonings, for a simple Korean-inspired salad. Think of adding crumbled tofu to a salad like adding feta cheese. In fact, the crumbled chunks will probably have similar sizes.",
    "sentences": [
        " Preparing and Blotting Tofu Purchase extra-firm tofu.",
        "You should be able to find tofu at any local grocery store, supermarket, or health-food store.",
        "Tofu is packaged according to the degree of hardness, ranging from Extra Soft to Extra Firm.",
        "Silken or soft tofu will not crumble well, so purchase a very firm tofu.",
        "Tofu needs to be refrigerated, so check the store’s refrigerated aisles, especially in the “Organic” or “Vegan” sections.",
        "Tofu is typically sold in containers between 10 and 14 ounces (280 and 400 grams).",
        "Prepare a large bowl and paper towels.",
        "Find a large plastic or ceramic bowl in your kitchen.",
        "You’ll use this bowl to crumble the tofu into.",
        "After you’ve found a bowl, layer several paper towels on top of your kitchen counter.",
        "You’ll use these shortly to drain the tofu.",
        "Remember to wash and rinse the bowl before you use it, so that you won’t contaminate the tofu that you crumble into it.",
        "Open the tofu container.",
        "When you buy the tofu, it should come sealed in a plastic container.",
        "The container may have a pull-tab on top that you can tug on to open it up.",
        "If there is no tab to open the tofu with, you’ll need to get out a pair of scissors and slice the container open.",
        "If you notice that the tofu’s container is damaged or torn open, take it back to the grocery store.",
        "The store should be able to issue a refund or exchange the damaged tofu.",
        "Blot the tofu block.",
        "Once you have opened the tofu packaging, pour out all of the water inside the packaging.",
        "Then, remove the tofu block.",
        "Set the tofu block on top of the paper towels that you’ve already laid out on your kitchen counter.",
        "Let the tofu sit for 5–10 minutes so that water can drain from it.",
        "Instead of paper towels, you can also blot the tofu on top of a regular dish towel.",
        "Pressing and Crumbling Tofu Press the tofu with a baking sheet.",
        "Once your tofu has been blotted on paper towels (or a dish towel) for 10 minutes, set another layer of paper towels (or another dish towel) on top of the tofu.",
        "Then place a baking sheet on top of the upper layer of towels.",
        "Pressing liquid out of the tofu is important when preparing firmer tofus.",
        "If you eat firm tofu while it’s still soggy with water, the flavor will be diluted.",
        "Place some weight on top of the baking sheet.",
        "Once you’ve placed a baking sheet on top of the tofu, add weight on top of the baking sheet.",
        "A few canned goods will do.",
        "The cans will provide the necessary weight to press the rest of the moisture out of your tofu.",
        "If you don’t have accessible canned goods, you could use a few books as a substitute.",
        "Use your hands to crumble the tofu into a bowl.",
        "Pick up the block of tofu with both hands, and hold it firmly over the bowl.",
        "Using your thumbs, break small pieces of tofu off from the main block.",
        "Aim to crumble off chunks that are no larger than 1/4 inch (0.6 cm) across.",
        "Refrigerate leftover crumbled tofu.",
        "Based on the recipe that you’re using, you may not need to use the entire block of tofu.",
        "If you’ve crumbled more than necessary, you can easily save the leftover tofu in your fridge.",
        "Put the crumbled tofu in an airtight plastic container, and cover the tofu with cool tap water before putting the container in the fridge.",
        "Alternately, if you know you won’t need all of the tofu in advance, only crumble what you’ll need.",
        "Then, refrigerate the remnant of the tofu block using the same method.",
        "Using Crumbled Tofu Find a recipe to use the tofu in.",
        "Unless you’re planning to eat the tofu cold and raw, you’ll need to plan ahead and find a suitable recipe.",
        "Crumbling tofu—unlike other methods, such as slicing or dicing—will help the dish it’s added to have a more consistent texture.",
        "Crumbled tofu works well in dishes like dumplings or casseroles.",
        "Try making these steamed and crumbled tofu potstickers.",
        "Try the crumbled tofu with a pasta dish.",
        "Crumbled tofu doesn’t have to be only eaten in casseroles and dumplings.",
        "It can also complement pasta dishes in both taste and texture.",
        "Try making a dish with spicy garlic noodles with crumbled tofu.",
        "Use crumbled tofu in a salad.",
        "Tofu is commonly added to salads as a protein-rich meat substitute.",
        "Crumbled tofu provides a texture which offsets the crunch of most other salad ingredients.",
        "Try adding crumbled tofu to steamed broccoli, along with garlic and a couple of other seasonings, for a simple Korean-inspired salad.",
        "Think of adding crumbled tofu to a salad like adding feta cheese.",
        "In fact, the crumbled chunks will probably have similar sizes."
    ]
}