{
    "title": "How to Make a Camo Cake",
    "url": "https://www.wikihow.com/Make-a-Camo-Cake",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking",
        "Cakes"
    ],
    "parts": [
        {
            "name": "Baking the Cake",
            "steps": [
                {
                    "headline": "Preheat the oven according to the temperature on the boxed mix.",
                    "description": "Read the instructions on the box to find out what temperature this should be. In most cases, it will be around 350°F (177°C). You can use your own from-scratch recipe (white or yellow cake) if you prefer. In this case, preheat the oven to the temperature stated by the recipe."
                },
                {
                    "headline": "Grease the cake pans and line them with parchment paper.",
                    "description": "Grease two 8 or 9-inch (20.32 or 22.86-centimeter) cake pans. Line each pan with a circle cut from parchment paper."
                },
                {
                    "headline": "Prepare the boxed cake mix following the instructions on the back.",
                    "description": "You need enough batter to make two 8 or 9-inch (20.32 or 22.86-centimeter) cakes. Most boxes will make enough batter to fill two pans. f you are using your own recipe, simply follow the instructions in the recipe. Check the back of your box to find out how many 8 or 9-inch (20.32 or 22.86-centimeter) pans it can fill. Make a second batch, if needed. Be sure to add the extra ingredients listed on the box—typically, this will be eggs, water, and oil or melted butter. If you are using your own recipe, simply follow the instructions in the recipe."
                },
                {
                    "headline": "Divide the cake batter evenly between 4 bowls.",
                    "description": "This will allow you to dye the cake different colors for a camo effect. If you are only looking to make a basic cake with camo frosting, skip this step."
                },
                {
                    "headline": "Stir green, brown, and black gel food coloring into the divided batter.",
                    "description": "Set one of the bowls aside and leave it as-is. Color the remaining bowls green, brown, and black, using a separate color for each bowl. Start with ¼ teaspoon of food coloring, then add more if needed. Use a separate spoon for each bowl so that you don't mix colors. You can also stir a tiny amount of beige food coloring into the remaining white bowl if you'd like a little less contrast."
                },
                {
                    "headline": "Alternate spooning different colors of batter into lightly greased pans.",
                    "description": "Start with a few small blobs of black batter in both pans. Follow up larger blobs of brown, white, and green batter. Keep layering blobs in both pan simultaneously until the you have used up all the batter. Plan on filling each pan ½ to ⅔ of the way full."
                },
                {
                    "headline": "Bake the cakes in a pre-heated oven according to package directions.",
                    "description": "Once again, how long this takes depends on the type of cake mix or recipe you are using, so read the instructions carefully. In most cases, this will be about 40 minutes. The cakes are done if a toothpick poked into the center comes out clean."
                },
                {
                    "headline": "Allow the cakes to cool before removing them from the pans.",
                    "description": "Let the cakes cool in their pans for 10 to 15 minutes first, then remove them. Place the cakes onto a wire rack and let them finish cooling off. Be sure to remove the parchment paper circle if it is stuck to the cake. The cakes must be completely cool before you frost them; otherwise, the frosting will melt. Give the cakes a nicer finish by sawing off the top bump. Eat the scraps or turn them into cake pops."
                }
            ]
        },
        {
            "name": "Making the Frosting",
            "steps": [
                {
                    "headline": "Cream the butter, then add the vanilla extract.",
                    "description": "Place the softened butter into a mixer, then blend it until it turns smooth and creamy. Add the vanilla extract, then blend it for a few more seconds to mix it in. You can do this with an electric mixer or a food processor fitted with whisks."
                },
                {
                    "headline": "Beat in half of the sugar and most of the milk.",
                    "description": "Add 3 to 4 cups (345 to 403 grams) of sugar and 2 tablespoons (30 milliliters) of whole milk. Blend everything together using a medium speed setting."
                },
                {
                    "headline": "Add in the rest of the sugar and milk, then blend until smooth.",
                    "description": "Pour in the rest of the sugar and the milk. Blend everything together using a medium speed setting for 3 to 4 minutes. Finish off by beating on slow for 1 to 2 minutes. This will make your frosting even smoother and remove air bubbles."
                },
                {
                    "headline": "Divide the frosting between 4 bowls.",
                    "description": "Keep half of the frosting in the mixer to use as your filling and crumb coat. Divide the rest of the frosting between 3 bowls."
                },
                {
                    "headline": "Stir green, brown, and beige food coloring into 3 of the bowls.",
                    "description": "Add 2 to 3 drops of green, brown, and beige gel food coloring into the 3 small bowls; use one color for each bowl. Stir the food coloring into each bowl using a separate spoon so as not to mix colors. Leave the bigger bowl of white frosting plain. If the colors are not dark or bright enough, add more food coloring."
                },
                {
                    "headline": "Place the colored frosting into separate piping bags.",
                    "description": "Cut the tips off of 3 piping bags, then insert a round decorating tip into each one. Place the bags into cups to keep them steady, then fill each one with its own color of frosting. Leave the white frosting in its own bowl. If you plan on using the frosting to make other designs, use a coupler so that you can switch the tips out."
                }
            ]
        },
        {
            "name": "Decorating the Cake",
            "steps": [
                {
                    "headline": "Fill the cake with the white frosting.",
                    "description": "Place one of the cakes onto a plate, and coat the top with your white frosting. Add some sliced strawberries, if desired, then place the second cake on top."
                },
                {
                    "headline": "Apply another thin coat of white frosting onto the cake.",
                    "description": "Spoon some more of the white frosting on top of the cake, then spread it towards the edges with an off-set cake decorating spatula. Apply more frosting to the sides, and spread it out. This is known as the \"crumb coat.\" Keep the crumb coat thin. This coat is simply to give you a foundation to decorate on and prevent crumbs from getting into your frosting."
                },
                {
                    "headline": "Refrigerate the cake for 30 minutes.",
                    "description": "This will set the crumb coat. During this time, it would be a good idea to refrigerate the piping bags with the rest of the frosting as well to keep it from turning too soft."
                },
                {
                    "headline": "Pipe a blob shape onto the side of the cake.",
                    "description": "Once the crumb coat has set, take the cake and the piping bags out of the fridge. Choose a color to start with, then outline your first blob. It should look like a warped circle or oval with wavy lines."
                },
                {
                    "headline": "Fill the blob in using the same.",
                    "description": "Move the pipe back-and-forth in a zigzag motion as you fill the entire blob in. Make sure that the filling is touching the outline. Keep the filling frost level with the outline; don't let it bunch up."
                },
                {
                    "headline": "Outline and fill more blobs onto the cake.",
                    "description": "Finish the sides first, then do the top. Switch colors as you work. Don't let two blobs of the same color touch—not even in the corners. If you are having trouble making the blob shapes look random, try drawing them with your opposite hand."
                },
                {
                    "headline": "Let the frosting set for 3 to 5 minutes.",
                    "description": "Do not rush on ahead; otherwise, the frosting will stick to whatever you are using to smooth it with. You can test the frosting for doneness by touching it lightly with your finger—it shouldn't stick to your finger."
                },
                {
                    "headline": "Iron the blobs out using a paper towel and fondant smoother.",
                    "description": "Choose a smooth-textured paper towel, and place it against the side of the cake. Run your fondant smoother across the paper towel using small, circular motions. Work in patches, starting from the sides and finishing with the top. You can also use a high-density foam roller, just make sure that it is clean!"
                },
                {
                    "headline": "Pipe the rest of the frosting onto the edges, if desired.",
                    "description": "Fit a piping bag with a large, star-shaped tip. Squeeze the remaining frosting into the bag, alternating colors. Twist the bag shut, then pipe your multi-colored frosting onto the edges of the cake. For a simpler design, choose a color for the border, then switch the tip out for a large, star-shaped tip instead."
                }
            ]
        }
    ],
    "tyn": [
        "Two 8 to 9-inch (20.32 to 22.86-centimeter) round cake pans",
        "Parchment paper",
        "Large mixing bowl",
        "Whisk",
        "4 small mixing bowls",
        "Electric mixer",
        "Piping bags",
        "Round decorating tips",
        "Large star-shaped decorating tip (optional)",
        "Off-set cake decorating spatula",
        "Fondant smoother",
        "Smooth-textured paper towel"
    ],
    "text": " Baking the Cake Preheat the oven according to the temperature on the boxed mix. Read the instructions on the box to find out what temperature this should be. In most cases, it will be around 350°F (177°C). You can use your own from-scratch recipe (white or yellow cake) if you prefer. In this case, preheat the oven to the temperature stated by the recipe. Grease the cake pans and line them with parchment paper. Grease two 8 or 9-inch (20.32 or 22.86-centimeter) cake pans. Line each pan with a circle cut from parchment paper. Prepare the boxed cake mix following the instructions on the back. You need enough batter to make two 8 or 9-inch (20.32 or 22.86-centimeter) cakes. Most boxes will make enough batter to fill two pans. f you are using your own recipe, simply follow the instructions in the recipe. Check the back of your box to find out how many 8 or 9-inch (20.32 or 22.86-centimeter) pans it can fill. Make a second batch, if needed. Be sure to add the extra ingredients listed on the box—typically, this will be eggs, water, and oil or melted butter. If you are using your own recipe, simply follow the instructions in the recipe. Divide the cake batter evenly between 4 bowls. This will allow you to dye the cake different colors for a camo effect. If you are only looking to make a basic cake with camo frosting, skip this step. Stir green, brown, and black gel food coloring into the divided batter. Set one of the bowls aside and leave it as-is. Color the remaining bowls green, brown, and black, using a separate color for each bowl. Start with ¼ teaspoon of food coloring, then add more if needed. Use a separate spoon for each bowl so that you don't mix colors. You can also stir a tiny amount of beige food coloring into the remaining white bowl if you'd like a little less contrast. Alternate spooning different colors of batter into lightly greased pans. Start with a few small blobs of black batter in both pans. Follow up larger blobs of brown, white, and green batter. Keep layering blobs in both pan simultaneously until the you have used up all the batter. Plan on filling each pan ½ to ⅔ of the way full. Bake the cakes in a pre-heated oven according to package directions. Once again, how long this takes depends on the type of cake mix or recipe you are using, so read the instructions carefully. In most cases, this will be about 40 minutes. The cakes are done if a toothpick poked into the center comes out clean. Allow the cakes to cool before removing them from the pans. Let the cakes cool in their pans for 10 to 15 minutes first, then remove them. Place the cakes onto a wire rack and let them finish cooling off. Be sure to remove the parchment paper circle if it is stuck to the cake. The cakes must be completely cool before you frost them; otherwise, the frosting will melt. Give the cakes a nicer finish by sawing off the top bump. Eat the scraps or turn them into cake pops. Making the Frosting Cream the butter, then add the vanilla extract. Place the softened butter into a mixer, then blend it until it turns smooth and creamy. Add the vanilla extract, then blend it for a few more seconds to mix it in. You can do this with an electric mixer or a food processor fitted with whisks. Beat in half of the sugar and most of the milk. Add 3 to 4 cups (345 to 403 grams) of sugar and 2 tablespoons (30 milliliters) of whole milk. Blend everything together using a medium speed setting. Add in the rest of the sugar and milk, then blend until smooth. Pour in the rest of the sugar and the milk. Blend everything together using a medium speed setting for 3 to 4 minutes. Finish off by beating on slow for 1 to 2 minutes. This will make your frosting even smoother and remove air bubbles. Divide the frosting between 4 bowls. Keep half of the frosting in the mixer to use as your filling and crumb coat. Divide the rest of the frosting between 3 bowls. Stir green, brown, and beige food coloring into 3 of the bowls. Add 2 to 3 drops of green, brown, and beige gel food coloring into the 3 small bowls; use one color for each bowl. Stir the food coloring into each bowl using a separate spoon so as not to mix colors. Leave the bigger bowl of white frosting plain. If the colors are not dark or bright enough, add more food coloring. Place the colored frosting into separate piping bags. Cut the tips off of 3 piping bags, then insert a round decorating tip into each one. Place the bags into cups to keep them steady, then fill each one with its own color of frosting. Leave the white frosting in its own bowl. If you plan on using the frosting to make other designs, use a coupler so that you can switch the tips out. Decorating the Cake Fill the cake with the white frosting. Place one of the cakes onto a plate, and coat the top with your white frosting. Add some sliced strawberries, if desired, then place the second cake on top. Apply another thin coat of white frosting onto the cake. Spoon some more of the white frosting on top of the cake, then spread it towards the edges with an off-set cake decorating spatula. Apply more frosting to the sides, and spread it out. This is known as the \"crumb coat.\" Keep the crumb coat thin. This coat is simply to give you a foundation to decorate on and prevent crumbs from getting into your frosting. Refrigerate the cake for 30 minutes. This will set the crumb coat. During this time, it would be a good idea to refrigerate the piping bags with the rest of the frosting as well to keep it from turning too soft. Pipe a blob shape onto the side of the cake. Once the crumb coat has set, take the cake and the piping bags out of the fridge. Choose a color to start with, then outline your first blob. It should look like a warped circle or oval with wavy lines. Fill the blob in using the same. Move the pipe back-and-forth in a zigzag motion as you fill the entire blob in. Make sure that the filling is touching the outline. Keep the filling frost level with the outline; don't let it bunch up. Outline and fill more blobs onto the cake. Finish the sides first, then do the top. Switch colors as you work. Don't let two blobs of the same color touch—not even in the corners. If you are having trouble making the blob shapes look random, try drawing them with your opposite hand. Let the frosting set for 3 to 5 minutes. Do not rush on ahead; otherwise, the frosting will stick to whatever you are using to smooth it with. You can test the frosting for doneness by touching it lightly with your finger—it shouldn't stick to your finger. Iron the blobs out using a paper towel and fondant smoother. Choose a smooth-textured paper towel, and place it against the side of the cake. Run your fondant smoother across the paper towel using small, circular motions. Work in patches, starting from the sides and finishing with the top. You can also use a high-density foam roller, just make sure that it is clean! Pipe the rest of the frosting onto the edges, if desired. Fit a piping bag with a large, star-shaped tip. Squeeze the remaining frosting into the bag, alternating colors. Twist the bag shut, then pipe your multi-colored frosting onto the edges of the cake. For a simpler design, choose a color for the border, then switch the tip out for a large, star-shaped tip instead.",
    "sentences": [
        " Baking the Cake Preheat the oven according to the temperature on the boxed mix.",
        "Read the instructions on the box to find out what temperature this should be.",
        "In most cases, it will be around 350°F (177°C).",
        "You can use your own from-scratch recipe (white or yellow cake) if you prefer.",
        "In this case, preheat the oven to the temperature stated by the recipe.",
        "Grease the cake pans and line them with parchment paper.",
        "Grease two 8 or 9-inch (20.32 or 22.86-centimeter) cake pans.",
        "Line each pan with a circle cut from parchment paper.",
        "Prepare the boxed cake mix following the instructions on the back.",
        "You need enough batter to make two 8 or 9-inch (20.32 or 22.86-centimeter) cakes.",
        "Most boxes will make enough batter to fill two pans.",
        "f you are using your own recipe, simply follow the instructions in the recipe.",
        "Check the back of your box to find out how many 8 or 9-inch (20.32 or 22.86-centimeter) pans it can fill.",
        "Make a second batch, if needed.",
        "Be sure to add the extra ingredients listed on the box—typically, this will be eggs, water, and oil or melted butter.",
        "If you are using your own recipe, simply follow the instructions in the recipe.",
        "Divide the cake batter evenly between 4 bowls.",
        "This will allow you to dye the cake different colors for a camo effect.",
        "If you are only looking to make a basic cake with camo frosting, skip this step.",
        "Stir green, brown, and black gel food coloring into the divided batter.",
        "Set one of the bowls aside and leave it as-is.",
        "Color the remaining bowls green, brown, and black, using a separate color for each bowl.",
        "Start with ¼ teaspoon of food coloring, then add more if needed.",
        "Use a separate spoon for each bowl so that you don't mix colors.",
        "You can also stir a tiny amount of beige food coloring into the remaining white bowl if you'd like a little less contrast.",
        "Alternate spooning different colors of batter into lightly greased pans.",
        "Start with a few small blobs of black batter in both pans.",
        "Follow up larger blobs of brown, white, and green batter.",
        "Keep layering blobs in both pan simultaneously until the you have used up all the batter.",
        "Plan on filling each pan ½ to ⅔ of the way full.",
        "Bake the cakes in a pre-heated oven according to package directions.",
        "Once again, how long this takes depends on the type of cake mix or recipe you are using, so read the instructions carefully.",
        "In most cases, this will be about 40 minutes.",
        "The cakes are done if a toothpick poked into the center comes out clean.",
        "Allow the cakes to cool before removing them from the pans.",
        "Let the cakes cool in their pans for 10 to 15 minutes first, then remove them.",
        "Place the cakes onto a wire rack and let them finish cooling off.",
        "Be sure to remove the parchment paper circle if it is stuck to the cake.",
        "The cakes must be completely cool before you frost them; otherwise, the frosting will melt.",
        "Give the cakes a nicer finish by sawing off the top bump.",
        "Eat the scraps or turn them into cake pops.",
        "Making the Frosting Cream the butter, then add the vanilla extract.",
        "Place the softened butter into a mixer, then blend it until it turns smooth and creamy.",
        "Add the vanilla extract, then blend it for a few more seconds to mix it in.",
        "You can do this with an electric mixer or a food processor fitted with whisks.",
        "Beat in half of the sugar and most of the milk.",
        "Add 3 to 4 cups (345 to 403 grams) of sugar and 2 tablespoons (30 milliliters) of whole milk.",
        "Blend everything together using a medium speed setting.",
        "Add in the rest of the sugar and milk, then blend until smooth.",
        "Pour in the rest of the sugar and the milk.",
        "Blend everything together using a medium speed setting for 3 to 4 minutes.",
        "Finish off by beating on slow for 1 to 2 minutes.",
        "This will make your frosting even smoother and remove air bubbles.",
        "Divide the frosting between 4 bowls.",
        "Keep half of the frosting in the mixer to use as your filling and crumb coat.",
        "Divide the rest of the frosting between 3 bowls.",
        "Stir green, brown, and beige food coloring into 3 of the bowls.",
        "Add 2 to 3 drops of green, brown, and beige gel food coloring into the 3 small bowls; use one color for each bowl.",
        "Stir the food coloring into each bowl using a separate spoon so as not to mix colors.",
        "Leave the bigger bowl of white frosting plain.",
        "If the colors are not dark or bright enough, add more food coloring.",
        "Place the colored frosting into separate piping bags.",
        "Cut the tips off of 3 piping bags, then insert a round decorating tip into each one.",
        "Place the bags into cups to keep them steady, then fill each one with its own color of frosting.",
        "Leave the white frosting in its own bowl.",
        "If you plan on using the frosting to make other designs, use a coupler so that you can switch the tips out.",
        "Decorating the Cake Fill the cake with the white frosting.",
        "Place one of the cakes onto a plate, and coat the top with your white frosting.",
        "Add some sliced strawberries, if desired, then place the second cake on top.",
        "Apply another thin coat of white frosting onto the cake.",
        "Spoon some more of the white frosting on top of the cake, then spread it towards the edges with an off-set cake decorating spatula.",
        "Apply more frosting to the sides, and spread it out.",
        "This is known as the \"crumb coat.\"",
        "Keep the crumb coat thin.",
        "This coat is simply to give you a foundation to decorate on and prevent crumbs from getting into your frosting.",
        "Refrigerate the cake for 30 minutes.",
        "This will set the crumb coat.",
        "During this time, it would be a good idea to refrigerate the piping bags with the rest of the frosting as well to keep it from turning too soft.",
        "Pipe a blob shape onto the side of the cake.",
        "Once the crumb coat has set, take the cake and the piping bags out of the fridge.",
        "Choose a color to start with, then outline your first blob.",
        "It should look like a warped circle or oval with wavy lines.",
        "Fill the blob in using the same.",
        "Move the pipe back-and-forth in a zigzag motion as you fill the entire blob in.",
        "Make sure that the filling is touching the outline.",
        "Keep the filling frost level with the outline; don't let it bunch up.",
        "Outline and fill more blobs onto the cake.",
        "Finish the sides first, then do the top.",
        "Switch colors as you work.",
        "Don't let two blobs of the same color touch—not even in the corners.",
        "If you are having trouble making the blob shapes look random, try drawing them with your opposite hand.",
        "Let the frosting set for 3 to 5 minutes.",
        "Do not rush on ahead; otherwise, the frosting will stick to whatever you are using to smooth it with.",
        "You can test the frosting for doneness by touching it lightly with your finger—it shouldn't stick to your finger.",
        "Iron the blobs out using a paper towel and fondant smoother.",
        "Choose a smooth-textured paper towel, and place it against the side of the cake.",
        "Run your fondant smoother across the paper towel using small, circular motions.",
        "Work in patches, starting from the sides and finishing with the top.",
        "You can also use a high-density foam roller, just make sure that it is clean!",
        "Pipe the rest of the frosting onto the edges, if desired.",
        "Fit a piping bag with a large, star-shaped tip.",
        "Squeeze the remaining frosting into the bag, alternating colors.",
        "Twist the bag shut, then pipe your multi-colored frosting onto the edges of the cake.",
        "For a simpler design, choose a color for the border, then switch the tip out for a large, star-shaped tip instead."
    ]
}