{
    "title": "How to Make a Flounce Skirt",
    "url": "https://www.wikihow.com/Make-a-Flounce-Skirt",
    "category_hierarchy": [
        "Personal Care and Style",
        "Clothing",
        "Clothes by Type",
        "Dresses and Skirts"
    ],
    "parts": [
        {
            "name": "Creating the A-Line Skirt",
            "steps": [
                {
                    "headline": "Take your measurements.",
                    "description": "Measure around your waist to determine the size of your skirt. Then, measure from your natural waist to where you would like the skirt’s hemline to be, including the flounce at the bottom of the skirt. For example, if you want the skirt to be knee-length, then measure the distance from your waist to your knees. Make sure to record your measurements."
                },
                {
                    "headline": "Trace the width of your waist onto your fabric.",
                    "description": "Your waist measurement will help you to determine how wide to make your skirt, but you will also need to create the A-line shape of your skirt. To do this, mark your fabric several inches in from the edge and at the top of the fabric. Then, measure across the fabric to the distance of your waist measurement plus 2” (5 cm) for seam allowance. For example, if your waist measurement was 32” (81 cm), then you would need to measure a distance of 34” (84 cm) across your skirt."
                },
                {
                    "headline": "Calculate the length of your fabric.",
                    "description": "To get the length of skirt you want, subtract the length of your flounce from the total length you want the skirt to be. Then, add 2” (5 cm) for your seam allowances. For example, if you would like your skirt to be a total of 28” (71 cm) long, but you want your flounce to be 4” (10 cm) long, then you would subtract 4” (10 cm) from 28” (71 cm) for a total of 24” (61 cm). Then, you would add 2” (5 cm) to 24” (61 cm) for a total of 26” (66 cm). This would be the length of your skirt fabric. Mark your fabric with two lines extending straight down from the ends of the lines that indicate the waist length. These lines should be the calculated length of your skirt. For example, if you determined that the skirt would be 26” (66 cm), then this is how long the lines should be."
                },
                {
                    "headline": "Draw a sloping line from the waist to the bottom of the skirt.",
                    "description": "Next, draw a line from one edge of your waist line and extending out towards the edges of your fabric. Stop the line when it reaches the bottom of the length line. Repeat this on the other side. Connect the bottom of the two lines by drawing a line that extends across the bottom of the skirt. You can make the slope of your skirt as dramatic or narrow as you like. However, keep in mind that you will be adding a flounce at the bottom, so it is best not to make it too dramatic. Try making a line that extends out about 5” (12.5 cm) on either side of the skirt."
                },
                {
                    "headline": "Cut out your fabric pieces.",
                    "description": "After you have traced the A-line skirt shape onto your fabric, cut it out. Follow the lines you made along the top, bottom, and sides of the skirt. Make sure to cut right along the lines and not inside or outside of them."
                },
                {
                    "headline": "Pin the side edges of your skirt fabric together.",
                    "description": "Next, pin together the side edges (the sloping areas) of your skirt fabric except for a 7” (18 cm) area extending from the waist of the skirt. This is where you will place the zipper. Make sure that the right sides of the fabric are facing each other and that the edges are all even. The top and bottom edges of your skirt fabric should be even as well, but you will not be pinning these areas."
                },
                {
                    "headline": "Sew along the pinned edges.",
                    "description": "Sew a straight stitch from the bottom of the skirt up to the end of the pinned area. Remove the pins as you go and then cut any excess threads. Do not sew over the area where you will place the zipper. Leave this area open."
                }
            ]
        },
        {
            "name": "Adding the Flounce",
            "steps": [
                {
                    "headline": "Measure the circumference of your skirt’s hemline.",
                    "description": "Measure around the bottom of your skirt to find the circumference. This measurement will be the circumference of the first circle that you trace onto your fabric. For example, if the circumference of your skirt’s bottom is 40” (102 cm), then this is the circumference of your first circle."
                },
                {
                    "headline": "Trace a circle onto your fabric.",
                    "description": "Trace the circumference of your first circle onto the fabric. Use a large plate or bowl to help you get the circumference and make an even circle."
                },
                {
                    "headline": "Create a larger circle around your hemline circle.",
                    "description": "After you finish tracing the first circle, trace a larger circle around the outside of this one. Measure from the edge of your first circle to the length you want your flounce to be plus 1” (2.5 cm). Then, mark this distance on the fabric in several places around the circle. Use these points to help you draw your outer circle. For example, if you want your flounce to be 4” (10 cm) long, then you will need to make marks that are 5” (12.5 cm) from the edge of the first circle."
                },
                {
                    "headline": "Cut out the circular piece.",
                    "description": "Cut out the inner circle of your first tracing, and then cut around the outside of your larger circle. This will leave you with a large circular strip. Make sure there is an opening in the circular strip by cutting through the fabric in one section. This will make it easier to attach the circular strip to the bottom of your skirt."
                },
                {
                    "headline": "Snip the fabric by about ½” (1.3 cm) on the inner edge of the strip.",
                    "description": "To make it a little easier to gather and sew the circular strip to the bottom of your skirt. Cut a ½” (1.3 cm) notch into the strip about every 3” (7.5 cm). Do this all the way across the strip."
                },
                {
                    "headline": "Pin the strip to the bottom of your skirt.",
                    "description": "Next, pin the inner part of the circular strip to the bottom of the skirt so that the right sides of the fabric are facing each other. The notches you cut in the strip should make it easier to gather the fabric and pin all the way around. Make sure that the edges of the skirt and circular strip are even. Line up the open edge of the circular strip with the seam in your skirt. This will result in a neater looking finished product."
                },
                {
                    "headline": "Sew along the edges.",
                    "description": "When you have the circular strip and skirt bottom aligned the way you want, begin sewing a straight stitch around the edges of the two pieces. Sew about 1” (2.5 cm) from the raw edges to ensure that the notches in your circular strip will not show. Remove the pins as you go."
                },
                {
                    "headline": "Sew together the open edge of the circular strip.",
                    "description": "After you finish attaching the circular strip to the skirt, you will still have an open edge in your skirt that you will need to close up. Line up the edges so that the right sides of the fabric are facing each other and sew a straight stitch across the two pieces about ½” (1.3 cm) from the edges."
                }
            ]
        },
        {
            "name": "Finishing the Skirt",
            "steps": [
                {
                    "headline": "Topstitch over the seam allowance if desired.",
                    "description": "If the seam between your skirt and the flounce at the bottom is noticeable, then you may want to topstitch over it to flatten it out. Pin down the seam so that it is lying flat against the inside of the skirt, and then sew a straight stitch across it. Remove the pins as you sew."
                },
                {
                    "headline": "Hem the waist.",
                    "description": "To hem the waist, fold down about 1” (2.5 cm) of the fabric so that the raw edges are hidden on the inside of the skirt. Then, sew around the edge of the skirt to secure the fabric in place. Remove the pins as you sew and then snip any excess threads when you are done. Make sure that you do not sew across the area where you will be placing the zipper. Leave this part of the skirt open."
                },
                {
                    "headline": "Pin and sew the zipper in place.",
                    "description": "Adding the zipper is a simple process. Unzip the zipper and then pin the fabric parts of the zipper to the right sides of the skirt so that the zipper’s teeth are facing out and away from each other. Then, sew the zipper in place. Sew along the fabric edge of the zipper and through the fabric edges of the zipper opening on the skirt. Remove the pins as you sew and snip any excess threads as well."
                },
                {
                    "headline": "Hem the flounce, if desired.",
                    "description": "It is not absolutely necessary to hem the flounce in many cases. However, you may want to hem the flounce if the fabric seems like it will fray. Hemming the flounce is just like hemming the bottom of a skirt. Fold up about ½” (1.3 cm) of the fabric around the bottom edge of the flounce, pin it in place, and then sew a straight stitch or zigzag stitch to secure the hem."
                }
            ]
        }
    ],
    "tyn": [
        "Fabric in the type and color of your choice",
        "Chalk",
        "Circular object to trace (optional)",
        "Measuring tape",
        "Scissors",
        "Pins",
        "Sewing machine",
        "7” (18 cm) zipper"
    ],
    "text": " Creating the A-Line Skirt Take your measurements. Measure around your waist to determine the size of your skirt. Then, measure from your natural waist to where you would like the skirt’s hemline to be, including the flounce at the bottom of the skirt. For example, if you want the skirt to be knee-length, then measure the distance from your waist to your knees. Make sure to record your measurements. Trace the width of your waist onto your fabric. Your waist measurement will help you to determine how wide to make your skirt, but you will also need to create the A-line shape of your skirt. To do this, mark your fabric several inches in from the edge and at the top of the fabric. Then, measure across the fabric to the distance of your waist measurement plus 2” (5 cm) for seam allowance. For example, if your waist measurement was 32” (81 cm), then you would need to measure a distance of 34” (84 cm) across your skirt. Calculate the length of your fabric. To get the length of skirt you want, subtract the length of your flounce from the total length you want the skirt to be. Then, add 2” (5 cm) for your seam allowances. For example, if you would like your skirt to be a total of 28” (71 cm) long, but you want your flounce to be 4” (10 cm) long, then you would subtract 4” (10 cm) from 28” (71 cm) for a total of 24” (61 cm). Then, you would add 2” (5 cm) to 24” (61 cm) for a total of 26” (66 cm). This would be the length of your skirt fabric. Mark your fabric with two lines extending straight down from the ends of the lines that indicate the waist length. These lines should be the calculated length of your skirt. For example, if you determined that the skirt would be 26” (66 cm), then this is how long the lines should be. Draw a sloping line from the waist to the bottom of the skirt. Next, draw a line from one edge of your waist line and extending out towards the edges of your fabric. Stop the line when it reaches the bottom of the length line. Repeat this on the other side. Connect the bottom of the two lines by drawing a line that extends across the bottom of the skirt. You can make the slope of your skirt as dramatic or narrow as you like. However, keep in mind that you will be adding a flounce at the bottom, so it is best not to make it too dramatic. Try making a line that extends out about 5” (12.5 cm) on either side of the skirt. Cut out your fabric pieces. After you have traced the A-line skirt shape onto your fabric, cut it out. Follow the lines you made along the top, bottom, and sides of the skirt. Make sure to cut right along the lines and not inside or outside of them. Pin the side edges of your skirt fabric together. Next, pin together the side edges (the sloping areas) of your skirt fabric except for a 7” (18 cm) area extending from the waist of the skirt. This is where you will place the zipper. Make sure that the right sides of the fabric are facing each other and that the edges are all even. The top and bottom edges of your skirt fabric should be even as well, but you will not be pinning these areas. Sew along the pinned edges. Sew a straight stitch from the bottom of the skirt up to the end of the pinned area. Remove the pins as you go and then cut any excess threads. Do not sew over the area where you will place the zipper. Leave this area open. Adding the Flounce Measure the circumference of your skirt’s hemline. Measure around the bottom of your skirt to find the circumference. This measurement will be the circumference of the first circle that you trace onto your fabric. For example, if the circumference of your skirt’s bottom is 40” (102 cm), then this is the circumference of your first circle. Trace a circle onto your fabric. Trace the circumference of your first circle onto the fabric. Use a large plate or bowl to help you get the circumference and make an even circle. Create a larger circle around your hemline circle. After you finish tracing the first circle, trace a larger circle around the outside of this one. Measure from the edge of your first circle to the length you want your flounce to be plus 1” (2.5 cm). Then, mark this distance on the fabric in several places around the circle. Use these points to help you draw your outer circle. For example, if you want your flounce to be 4” (10 cm) long, then you will need to make marks that are 5” (12.5 cm) from the edge of the first circle. Cut out the circular piece. Cut out the inner circle of your first tracing, and then cut around the outside of your larger circle. This will leave you with a large circular strip. Make sure there is an opening in the circular strip by cutting through the fabric in one section. This will make it easier to attach the circular strip to the bottom of your skirt. Snip the fabric by about ½” (1.3 cm) on the inner edge of the strip. To make it a little easier to gather and sew the circular strip to the bottom of your skirt. Cut a ½” (1.3 cm) notch into the strip about every 3” (7.5 cm). Do this all the way across the strip. Pin the strip to the bottom of your skirt. Next, pin the inner part of the circular strip to the bottom of the skirt so that the right sides of the fabric are facing each other. The notches you cut in the strip should make it easier to gather the fabric and pin all the way around. Make sure that the edges of the skirt and circular strip are even. Line up the open edge of the circular strip with the seam in your skirt. This will result in a neater looking finished product. Sew along the edges. When you have the circular strip and skirt bottom aligned the way you want, begin sewing a straight stitch around the edges of the two pieces. Sew about 1” (2.5 cm) from the raw edges to ensure that the notches in your circular strip will not show. Remove the pins as you go. Sew together the open edge of the circular strip. After you finish attaching the circular strip to the skirt, you will still have an open edge in your skirt that you will need to close up. Line up the edges so that the right sides of the fabric are facing each other and sew a straight stitch across the two pieces about ½” (1.3 cm) from the edges. Finishing the Skirt Topstitch over the seam allowance if desired. If the seam between your skirt and the flounce at the bottom is noticeable, then you may want to topstitch over it to flatten it out. Pin down the seam so that it is lying flat against the inside of the skirt, and then sew a straight stitch across it. Remove the pins as you sew. Hem the waist. To hem the waist, fold down about 1” (2.5 cm) of the fabric so that the raw edges are hidden on the inside of the skirt. Then, sew around the edge of the skirt to secure the fabric in place. Remove the pins as you sew and then snip any excess threads when you are done. Make sure that you do not sew across the area where you will be placing the zipper. Leave this part of the skirt open. Pin and sew the zipper in place. Adding the zipper is a simple process. Unzip the zipper and then pin the fabric parts of the zipper to the right sides of the skirt so that the zipper’s teeth are facing out and away from each other. Then, sew the zipper in place. Sew along the fabric edge of the zipper and through the fabric edges of the zipper opening on the skirt. Remove the pins as you sew and snip any excess threads as well. Hem the flounce, if desired. It is not absolutely necessary to hem the flounce in many cases. However, you may want to hem the flounce if the fabric seems like it will fray. Hemming the flounce is just like hemming the bottom of a skirt. Fold up about ½” (1.3 cm) of the fabric around the bottom edge of the flounce, pin it in place, and then sew a straight stitch or zigzag stitch to secure the hem.",
    "sentences": [
        " Creating the A-Line Skirt Take your measurements.",
        "Measure around your waist to determine the size of your skirt.",
        "Then, measure from your natural waist to where you would like the skirt’s hemline to be, including the flounce at the bottom of the skirt.",
        "For example, if you want the skirt to be knee-length, then measure the distance from your waist to your knees.",
        "Make sure to record your measurements.",
        "Trace the width of your waist onto your fabric.",
        "Your waist measurement will help you to determine how wide to make your skirt, but you will also need to create the A-line shape of your skirt.",
        "To do this, mark your fabric several inches in from the edge and at the top of the fabric.",
        "Then, measure across the fabric to the distance of your waist measurement plus 2” (5 cm) for seam allowance.",
        "For example, if your waist measurement was 32” (81 cm), then you would need to measure a distance of 34” (84 cm) across your skirt.",
        "Calculate the length of your fabric.",
        "To get the length of skirt you want, subtract the length of your flounce from the total length you want the skirt to be.",
        "Then, add 2” (5 cm) for your seam allowances.",
        "For example, if you would like your skirt to be a total of 28” (71 cm) long, but you want your flounce to be 4” (10 cm) long, then you would subtract 4” (10 cm) from 28” (71 cm) for a total of 24” (61 cm).",
        "Then, you would add 2” (5 cm) to 24” (61 cm) for a total of 26” (66 cm).",
        "This would be the length of your skirt fabric.",
        "Mark your fabric with two lines extending straight down from the ends of the lines that indicate the waist length.",
        "These lines should be the calculated length of your skirt.",
        "For example, if you determined that the skirt would be 26” (66 cm), then this is how long the lines should be.",
        "Draw a sloping line from the waist to the bottom of the skirt.",
        "Next, draw a line from one edge of your waist line and extending out towards the edges of your fabric.",
        "Stop the line when it reaches the bottom of the length line.",
        "Repeat this on the other side.",
        "Connect the bottom of the two lines by drawing a line that extends across the bottom of the skirt.",
        "You can make the slope of your skirt as dramatic or narrow as you like.",
        "However, keep in mind that you will be adding a flounce at the bottom, so it is best not to make it too dramatic.",
        "Try making a line that extends out about 5” (12.5 cm) on either side of the skirt.",
        "Cut out your fabric pieces.",
        "After you have traced the A-line skirt shape onto your fabric, cut it out.",
        "Follow the lines you made along the top, bottom, and sides of the skirt.",
        "Make sure to cut right along the lines and not inside or outside of them.",
        "Pin the side edges of your skirt fabric together.",
        "Next, pin together the side edges (the sloping areas) of your skirt fabric except for a 7” (18 cm) area extending from the waist of the skirt.",
        "This is where you will place the zipper.",
        "Make sure that the right sides of the fabric are facing each other and that the edges are all even.",
        "The top and bottom edges of your skirt fabric should be even as well, but you will not be pinning these areas.",
        "Sew along the pinned edges.",
        "Sew a straight stitch from the bottom of the skirt up to the end of the pinned area.",
        "Remove the pins as you go and then cut any excess threads.",
        "Do not sew over the area where you will place the zipper.",
        "Leave this area open.",
        "Adding the Flounce Measure the circumference of your skirt’s hemline.",
        "Measure around the bottom of your skirt to find the circumference.",
        "This measurement will be the circumference of the first circle that you trace onto your fabric.",
        "For example, if the circumference of your skirt’s bottom is 40” (102 cm), then this is the circumference of your first circle.",
        "Trace a circle onto your fabric.",
        "Trace the circumference of your first circle onto the fabric.",
        "Use a large plate or bowl to help you get the circumference and make an even circle.",
        "Create a larger circle around your hemline circle.",
        "After you finish tracing the first circle, trace a larger circle around the outside of this one.",
        "Measure from the edge of your first circle to the length you want your flounce to be plus 1” (2.5 cm).",
        "Then, mark this distance on the fabric in several places around the circle.",
        "Use these points to help you draw your outer circle.",
        "For example, if you want your flounce to be 4” (10 cm) long, then you will need to make marks that are 5” (12.5 cm) from the edge of the first circle.",
        "Cut out the circular piece.",
        "Cut out the inner circle of your first tracing, and then cut around the outside of your larger circle.",
        "This will leave you with a large circular strip.",
        "Make sure there is an opening in the circular strip by cutting through the fabric in one section.",
        "This will make it easier to attach the circular strip to the bottom of your skirt.",
        "Snip the fabric by about ½” (1.3 cm) on the inner edge of the strip.",
        "To make it a little easier to gather and sew the circular strip to the bottom of your skirt.",
        "Cut a ½” (1.3 cm) notch into the strip about every 3” (7.5 cm).",
        "Do this all the way across the strip.",
        "Pin the strip to the bottom of your skirt.",
        "Next, pin the inner part of the circular strip to the bottom of the skirt so that the right sides of the fabric are facing each other.",
        "The notches you cut in the strip should make it easier to gather the fabric and pin all the way around.",
        "Make sure that the edges of the skirt and circular strip are even.",
        "Line up the open edge of the circular strip with the seam in your skirt.",
        "This will result in a neater looking finished product.",
        "Sew along the edges.",
        "When you have the circular strip and skirt bottom aligned the way you want, begin sewing a straight stitch around the edges of the two pieces.",
        "Sew about 1” (2.5 cm) from the raw edges to ensure that the notches in your circular strip will not show.",
        "Remove the pins as you go.",
        "Sew together the open edge of the circular strip.",
        "After you finish attaching the circular strip to the skirt, you will still have an open edge in your skirt that you will need to close up.",
        "Line up the edges so that the right sides of the fabric are facing each other and sew a straight stitch across the two pieces about ½” (1.3 cm) from the edges.",
        "Finishing the Skirt Topstitch over the seam allowance if desired.",
        "If the seam between your skirt and the flounce at the bottom is noticeable, then you may want to topstitch over it to flatten it out.",
        "Pin down the seam so that it is lying flat against the inside of the skirt, and then sew a straight stitch across it.",
        "Remove the pins as you sew.",
        "Hem the waist.",
        "To hem the waist, fold down about 1” (2.5 cm) of the fabric so that the raw edges are hidden on the inside of the skirt.",
        "Then, sew around the edge of the skirt to secure the fabric in place.",
        "Remove the pins as you sew and then snip any excess threads when you are done.",
        "Make sure that you do not sew across the area where you will be placing the zipper.",
        "Leave this part of the skirt open.",
        "Pin and sew the zipper in place.",
        "Adding the zipper is a simple process.",
        "Unzip the zipper and then pin the fabric parts of the zipper to the right sides of the skirt so that the zipper’s teeth are facing out and away from each other.",
        "Then, sew the zipper in place.",
        "Sew along the fabric edge of the zipper and through the fabric edges of the zipper opening on the skirt.",
        "Remove the pins as you sew and snip any excess threads as well.",
        "Hem the flounce, if desired.",
        "It is not absolutely necessary to hem the flounce in many cases.",
        "However, you may want to hem the flounce if the fabric seems like it will fray.",
        "Hemming the flounce is just like hemming the bottom of a skirt.",
        "Fold up about ½” (1.3 cm) of the fabric around the bottom edge of the flounce, pin it in place, and then sew a straight stitch or zigzag stitch to secure the hem."
    ]
}