{
    "title": "How to Illuminate House Numbers",
    "url": "https://www.wikihow.com/Illuminate-House-Numbers",
    "category_hierarchy": [
        "Home and Garden",
        "Lighting"
    ],
    "methods": [
        {
            "name": "Installing a Wall Light Fixture",
            "steps": [
                {
                    "headline": "Locate electrical wires in the outside walls of your house.",
                    "description": "You may have electrical wires running on the side of your house already, near where your house numbers are. These probably won't be exposed, so pull up electrical plans of your house or ask an electrician for an assessment to determine where your wires are and how to access them. If there are no accessible electrical wires near where your house numbers, ask an electrician to install some. Explain that you're putting in a light fixture to illuminate your house numbers and tell him exactly where you want to connect the wires to the light."
                },
                {
                    "headline": "Turn off the circuit breaker connected to your outlet.",
                    "description": "The switches on your circuit breaker should be labeled so that you can turn off the power to just the one outlet you're working on. If you can't determine which outlet that is, ask your electrician."
                },
                {
                    "headline": "Choose a light that suits your purposes.",
                    "description": "Some lights will need to be turned on with a switch. Installation will be simple, but you might get tired of turning on the light every night. A motion-sensored light is more convenient, but might snap on at the slightest disturbance. You could also use a solar-powered light, which is convenient and energy-efficient but may not be as bright."
                },
                {
                    "headline": "Attach the light fixture bracket to the junction box.",
                    "description": "The junction box is the area where the electrical wires are housed. The wires should be poking out a bit where you'll be attaching them to your light. The bracket, which will be included with your light fixture, is metal and often circular. Attach the bracket to the wall around the junction box with screws and a screwdriver."
                },
                {
                    "headline": "Assemble the light fixture.",
                    "description": "If your light is sold in parts, assemble them now using the instructions provided."
                },
                {
                    "headline": "Attach the fixture wires to the wires from the house.",
                    "description": "If necessary, strip a few inches of the insulation off of the wires with a wire stripper. Match up the wires by color; the black wire from your light should match the black wire from the house, red should match red, etc. Connect each pair of matched wires using an outdoor wire connector. Place the exposed ends into the capsule and twist it firmly. Give the wires a few tugs afterwards to make sure they're tightly attached."
                },
                {
                    "headline": "Screw the new fixture onto the bracket.",
                    "description": "Set the wires back into the junction box. Then, use screws and a screwdriver to attach the entire light fixture onto your wall."
                },
                {
                    "headline": "Turn the power back on.",
                    "description": "Now that your light is in place, go back to your circuit breaker and flip the power back on to make sure that the light works. If the light isn't working, go back to your fixture. Make sure all your wires are connected correctly and your light firmly attached to the wall. If it's still not working, call an electrician for help."
                }
            ]
        },
        {
            "name": "Using Ground Lighting",
            "steps": [
                {
                    "headline": "Choose solar lighting for easy installation.",
                    "description": "Solar-powered lights don't require wiring, so installation will be easier. You'll need to find a nice sunny spot to place the solar panel, which will likely not be attached to the light itself."
                },
                {
                    "headline": "Choose standard plug-in lighting for reliability.",
                    "description": "If you don't think the sunlight in your area is strong enough for a solar-powered light or you don't want to find a good area for your panel, look for ground lights. They usually come in a kit with all the necessary components, including a stake, a power pack, and the light(s) themselves."
                },
                {
                    "headline": "Check for underground utilities before you install.",
                    "description": "In the US and Canada, call 811 and tell the representative about your project. They'll take down the information and notify your utility company to mark buried lines so you won't run into them. You won't be digging too deeply into the ground for this installation, but you should still make sure you won't be running into any shallow pipes or wiring. In other countries, call your utilities supplier to make sure you don't run into any lines during your installation."
                },
                {
                    "headline": "Place your lighting power pack near an outlet.",
                    "description": "Don't plug it in just yet--you want to wait until your light is assembled so you don't injure yourself. You can use a GFCI (Ground Fault Circuit Interrupter) outlet connected to your house, or purchase an outdoor outlet post that you'll drive into the ground on a stake."
                },
                {
                    "headline": "Point your light up at your house numbers.",
                    "description": "It may be able to stand alone, or it might come with a stake you need to push into the ground. Follow any assembling instructions that the light comes with, such as what kind of lightbulb it needs. Place the light at least a foot from the foundation of the house. You'll be able to adjust it later if the light doesn't fall exactly on the numbers."
                },
                {
                    "headline": "Lay out the cable and connect it to the lights.",
                    "description": "Starting at the power pack, run the cable along the ground towards the light and connect it using a cable connector."
                },
                {
                    "headline": "Dig a shallow trench into the soil all along the cable path.",
                    "description": "Use a small trowel to carefully shift the dirt or grass aside and push the cable down inside. The trench should be fairly narrow, only large enough to accommodate the cord. You may need to dig slightly deeper or wider in the area around the light to accommodate for extra cable. If your cable is running along concrete or other ground you can't dig into, try to place it behind bushes or other objects. It's alright if it's slightly visible, but make sure it isn't so out in the open that people could trip on it."
                },
                {
                    "headline": "Connect the cable to the power pack.",
                    "description": "Plug the pack into the outlet to test the light. Try shifting the light from side to side if it doesn't fall directly on the numbers. Once you have it in place, use dirt to close up the trenches around the cables."
                },
                {
                    "headline": "Set the light's timer to “dusk to dawn” settings.",
                    "description": "If you're using a plug-in light, you should be able to set the power pack to turn on when the sun goes down and flip off again in the mornings. Solar lights will likely do this automatically, but read the instructions to be sure."
                }
            ]
        },
        {
            "name": "Making LED-Lit House Numbers",
            "steps": [
                {
                    "headline": "Cut a piece of Plexiglass to your desired size.",
                    "description": "Your plexiglass should be about ⁄2 inch (1.3 cm) thick, and you should aim to cut it to about 9 inches (23 cm) long. Use both hands to operate the circular saw and cut off any extra parts smoothly. Be very careful when operating the circular saw. Stand to one side of the blade and clamp down your Plexiglas securely. Wear safety goggles and tuck back any loose hair or clothing. If your plexiglass is slightly cut up on one end from the blade, sand it down with a fine-grain sandpaper and run a hot torch over it quickly to make it clear again."
                },
                {
                    "headline": "Trace your house numbers onto the plexiglas.",
                    "description": "Use a large, clear font and place the numbers evenly. Write them with a dark, washable marker you can wipe away afterwards. For a modern look, fonts like Century Gothic or Neutra are good choices. For something slightly curlier, look at French Chic."
                },
                {
                    "headline": "Score the numbers onto the surface with a router or Dremmel tool.",
                    "description": "Lay your plexiglass on a cutting board or work table and clamp it down. Carefully move your router over the stenciled numbers to score them into the surface. You're not trying to carve them deeply into the surface; just ⁄16 inch (0.16 cm) thick is fine."
                },
                {
                    "headline": "Cut out one long side of a long, square-ended aluminum tube.",
                    "description": "This tube will go on top of your plexiglas, and will serve as the housing and protection for your LED lights. Keep the tube firmly weighed down at one end, or ask someone to hold it in place. Measure about ⁄8 inch (0.32 cm) in from the long sides of your tube and draw a straight line lengthwise down the tube. Use an angle grinder with a metal to cut along these lines. This will create lips that will help hold your plexiglass in place. As with the circular saw, use glasses and exercise extreme caution while operating. Thoroughly read the instructions and warnings in the manual before using. The tube should be a square, about ⁄4 in × ⁄4 in (1.9 cm × 1.9 cm)."
                },
                {
                    "headline": "Cut your tube to the same length as your plexiglas.",
                    "description": "Using the same angle grinder, cut through the tube to make it the same length as your plexiglas."
                },
                {
                    "headline": "Decide where to place the grooves on your plexiglas.",
                    "description": "Cutting shallow grooves near the top of the plexiglass will let you slide the tube on easily and securely. Place the tube on top of the plexiglas and decide how far down you'd like it to clamp on. Mark that spot on both sides of the glass and use a ruler to draw a straight line across, starting from your markings."
                },
                {
                    "headline": "Cut a groove into the top of your plexiglas.",
                    "description": "Use a short blade on your circular saw that will make a very shallow groove. Lay the glass flat with the numbers facing up, then position the blade on the line you just marked off. Run the circular saw over it smoothly, then flip the Plexiglas over so that the numbers are facing down. Repeat the process and carve a groove into this side as well. These grooves will help hold the aluminum tube in place."
                },
                {
                    "headline": "Purchase an LED lighting kit.",
                    "description": "The kit should include an LED light string with adhesive coating, a receiver, a remote control, and a battery power supply. You can find kits online or at hardware supply stores."
                },
                {
                    "headline": "Cut your LED light string to the same length as your plexiglas.",
                    "description": "The string will have lines labeled “Cut,” which lets you know where to make your cuts. Measure out a length of string that is the same length as your plexiglas, or slightly longer. Use a pair of scissors to snip the extra away. Start from the end of the string that's attached to the receiver and power supply. You don't want to cut away access to your power!"
                },
                {
                    "headline": "Tape your LED lights into the aluminum tube.",
                    "description": "Peel away the adhesive backing on the tape and center it on the inside of your aluminum tube. Press it firmly into place. If you have some extra string sticking out, bend it and tuck it into the tube."
                },
                {
                    "headline": "Slide the tube onto the top of the plexiglas.",
                    "description": "The aluminum should fit snugly onto the grooves. Plug in the receiver and power source to admire the effect of the lighting through the plexiglas and the numbers."
                },
                {
                    "headline": "Set the number outside or attach it to the wall.",
                    "description": "Use screws and a screwdriver to attach your address number to the front of your house, or prop it up against the wall. Use your remote to turn it on each day."
                }
            ]
        }
    ],
    "tyn": [
        "Installing a Wall Light Fixture",
        "Wall light fixture",
        "Fixture bracket",
        "Screws",
        "Screwdriver",
        "Wire stripper",
        "Outdoor wire connector",
        "Using Ground Lighting",
        "Ground light, solar or plug-in",
        "Outdoor power outlet or outlet post",
        "Small trowel",
        "Making LED-Lit House Numbers",
        "Plexiglas, ",
        "1⁄2",
        "1",
        "⁄",
        "2",
        " inch (1.3 cm) thick",
        "Safety goggles",
        "Clamp",
        "Circular saw",
        "Fine-grain sandpaper (optional)",
        "Blowtorch (optional)",
        "Washable marker",
        "Router or Dremmel tool",
        "Long aluminum tube with square ends, about ",
        "3⁄4",
        "3",
        "4",
        " in × ",
        " in (1.9 cm × 1.9 cm)",
        "Angle grinder",
        "LED lighting kit: adhesive LED lights, receiver, remote, power pack",
        "Scissors"
    ],
    "text": " Installing a Wall Light Fixture Locate electrical wires in the outside walls of your house. You may have electrical wires running on the side of your house already, near where your house numbers are. These probably won't be exposed, so pull up electrical plans of your house or ask an electrician for an assessment to determine where your wires are and how to access them. If there are no accessible electrical wires near where your house numbers, ask an electrician to install some. Explain that you're putting in a light fixture to illuminate your house numbers and tell him exactly where you want to connect the wires to the light. Turn off the circuit breaker connected to your outlet. The switches on your circuit breaker should be labeled so that you can turn off the power to just the one outlet you're working on. If you can't determine which outlet that is, ask your electrician. Choose a light that suits your purposes. Some lights will need to be turned on with a switch. Installation will be simple, but you might get tired of turning on the light every night. A motion-sensored light is more convenient, but might snap on at the slightest disturbance. You could also use a solar-powered light, which is convenient and energy-efficient but may not be as bright. Attach the light fixture bracket to the junction box. The junction box is the area where the electrical wires are housed. The wires should be poking out a bit where you'll be attaching them to your light. The bracket, which will be included with your light fixture, is metal and often circular. Attach the bracket to the wall around the junction box with screws and a screwdriver. Assemble the light fixture. If your light is sold in parts, assemble them now using the instructions provided. Attach the fixture wires to the wires from the house. If necessary, strip a few inches of the insulation off of the wires with a wire stripper. Match up the wires by color; the black wire from your light should match the black wire from the house, red should match red, etc. Connect each pair of matched wires using an outdoor wire connector. Place the exposed ends into the capsule and twist it firmly. Give the wires a few tugs afterwards to make sure they're tightly attached. Screw the new fixture onto the bracket. Set the wires back into the junction box. Then, use screws and a screwdriver to attach the entire light fixture onto your wall. Turn the power back on. Now that your light is in place, go back to your circuit breaker and flip the power back on to make sure that the light works. If the light isn't working, go back to your fixture. Make sure all your wires are connected correctly and your light firmly attached to the wall. If it's still not working, call an electrician for help. Using Ground Lighting Choose solar lighting for easy installation. Solar-powered lights don't require wiring, so installation will be easier. You'll need to find a nice sunny spot to place the solar panel, which will likely not be attached to the light itself. Choose standard plug-in lighting for reliability. If you don't think the sunlight in your area is strong enough for a solar-powered light or you don't want to find a good area for your panel, look for ground lights. They usually come in a kit with all the necessary components, including a stake, a power pack, and the light(s) themselves. Check for underground utilities before you install. In the US and Canada, call 811 and tell the representative about your project. They'll take down the information and notify your utility company to mark buried lines so you won't run into them. You won't be digging too deeply into the ground for this installation, but you should still make sure you won't be running into any shallow pipes or wiring. In other countries, call your utilities supplier to make sure you don't run into any lines during your installation. Place your lighting power pack near an outlet. Don't plug it in just yet--you want to wait until your light is assembled so you don't injure yourself. You can use a GFCI (Ground Fault Circuit Interrupter) outlet connected to your house, or purchase an outdoor outlet post that you'll drive into the ground on a stake. Point your light up at your house numbers. It may be able to stand alone, or it might come with a stake you need to push into the ground. Follow any assembling instructions that the light comes with, such as what kind of lightbulb it needs. Place the light at least a foot from the foundation of the house. You'll be able to adjust it later if the light doesn't fall exactly on the numbers. Lay out the cable and connect it to the lights. Starting at the power pack, run the cable along the ground towards the light and connect it using a cable connector. Dig a shallow trench into the soil all along the cable path. Use a small trowel to carefully shift the dirt or grass aside and push the cable down inside. The trench should be fairly narrow, only large enough to accommodate the cord. You may need to dig slightly deeper or wider in the area around the light to accommodate for extra cable. If your cable is running along concrete or other ground you can't dig into, try to place it behind bushes or other objects. It's alright if it's slightly visible, but make sure it isn't so out in the open that people could trip on it. Connect the cable to the power pack. Plug the pack into the outlet to test the light. Try shifting the light from side to side if it doesn't fall directly on the numbers. Once you have it in place, use dirt to close up the trenches around the cables. Set the light's timer to “dusk to dawn” settings. If you're using a plug-in light, you should be able to set the power pack to turn on when the sun goes down and flip off again in the mornings. Solar lights will likely do this automatically, but read the instructions to be sure. Making LED-Lit House Numbers Cut a piece of Plexiglass to your desired size. Your plexiglass should be about ⁄2 inch (1.3 cm) thick, and you should aim to cut it to about 9 inches (23 cm) long. Use both hands to operate the circular saw and cut off any extra parts smoothly. Be very careful when operating the circular saw. Stand to one side of the blade and clamp down your Plexiglas securely. Wear safety goggles and tuck back any loose hair or clothing. If your plexiglass is slightly cut up on one end from the blade, sand it down with a fine-grain sandpaper and run a hot torch over it quickly to make it clear again. Trace your house numbers onto the plexiglas. Use a large, clear font and place the numbers evenly. Write them with a dark, washable marker you can wipe away afterwards. For a modern look, fonts like Century Gothic or Neutra are good choices. For something slightly curlier, look at French Chic. Score the numbers onto the surface with a router or Dremmel tool. Lay your plexiglass on a cutting board or work table and clamp it down. Carefully move your router over the stenciled numbers to score them into the surface. You're not trying to carve them deeply into the surface; just ⁄16 inch (0.16 cm) thick is fine. Cut out one long side of a long, square-ended aluminum tube. This tube will go on top of your plexiglas, and will serve as the housing and protection for your LED lights. Keep the tube firmly weighed down at one end, or ask someone to hold it in place. Measure about ⁄8 inch (0.32 cm) in from the long sides of your tube and draw a straight line lengthwise down the tube. Use an angle grinder with a metal to cut along these lines. This will create lips that will help hold your plexiglass in place. As with the circular saw, use glasses and exercise extreme caution while operating. Thoroughly read the instructions and warnings in the manual before using. The tube should be a square, about ⁄4 in × ⁄4 in (1.9 cm × 1.9 cm). Cut your tube to the same length as your plexiglas. Using the same angle grinder, cut through the tube to make it the same length as your plexiglas. Decide where to place the grooves on your plexiglas. Cutting shallow grooves near the top of the plexiglass will let you slide the tube on easily and securely. Place the tube on top of the plexiglas and decide how far down you'd like it to clamp on. Mark that spot on both sides of the glass and use a ruler to draw a straight line across, starting from your markings. Cut a groove into the top of your plexiglas. Use a short blade on your circular saw that will make a very shallow groove. Lay the glass flat with the numbers facing up, then position the blade on the line you just marked off. Run the circular saw over it smoothly, then flip the Plexiglas over so that the numbers are facing down. Repeat the process and carve a groove into this side as well. These grooves will help hold the aluminum tube in place. Purchase an LED lighting kit. The kit should include an LED light string with adhesive coating, a receiver, a remote control, and a battery power supply. You can find kits online or at hardware supply stores. Cut your LED light string to the same length as your plexiglas. The string will have lines labeled “Cut,” which lets you know where to make your cuts. Measure out a length of string that is the same length as your plexiglas, or slightly longer. Use a pair of scissors to snip the extra away. Start from the end of the string that's attached to the receiver and power supply. You don't want to cut away access to your power! Tape your LED lights into the aluminum tube. Peel away the adhesive backing on the tape and center it on the inside of your aluminum tube. Press it firmly into place. If you have some extra string sticking out, bend it and tuck it into the tube. Slide the tube onto the top of the plexiglas. The aluminum should fit snugly onto the grooves. Plug in the receiver and power source to admire the effect of the lighting through the plexiglas and the numbers. Set the number outside or attach it to the wall. Use screws and a screwdriver to attach your address number to the front of your house, or prop it up against the wall. Use your remote to turn it on each day.",
    "sentences": [
        " Installing a Wall Light Fixture Locate electrical wires in the outside walls of your house.",
        "You may have electrical wires running on the side of your house already, near where your house numbers are.",
        "These probably won't be exposed, so pull up electrical plans of your house or ask an electrician for an assessment to determine where your wires are and how to access them.",
        "If there are no accessible electrical wires near where your house numbers, ask an electrician to install some.",
        "Explain that you're putting in a light fixture to illuminate your house numbers and tell him exactly where you want to connect the wires to the light.",
        "Turn off the circuit breaker connected to your outlet.",
        "The switches on your circuit breaker should be labeled so that you can turn off the power to just the one outlet you're working on.",
        "If you can't determine which outlet that is, ask your electrician.",
        "Choose a light that suits your purposes.",
        "Some lights will need to be turned on with a switch.",
        "Installation will be simple, but you might get tired of turning on the light every night.",
        "A motion-sensored light is more convenient, but might snap on at the slightest disturbance.",
        "You could also use a solar-powered light, which is convenient and energy-efficient but may not be as bright.",
        "Attach the light fixture bracket to the junction box.",
        "The junction box is the area where the electrical wires are housed.",
        "The wires should be poking out a bit where you'll be attaching them to your light.",
        "The bracket, which will be included with your light fixture, is metal and often circular.",
        "Attach the bracket to the wall around the junction box with screws and a screwdriver.",
        "Assemble the light fixture.",
        "If your light is sold in parts, assemble them now using the instructions provided.",
        "Attach the fixture wires to the wires from the house.",
        "If necessary, strip a few inches of the insulation off of the wires with a wire stripper.",
        "Match up the wires by color; the black wire from your light should match the black wire from the house, red should match red, etc.",
        "Connect each pair of matched wires using an outdoor wire connector.",
        "Place the exposed ends into the capsule and twist it firmly.",
        "Give the wires a few tugs afterwards to make sure they're tightly attached.",
        "Screw the new fixture onto the bracket.",
        "Set the wires back into the junction box.",
        "Then, use screws and a screwdriver to attach the entire light fixture onto your wall.",
        "Turn the power back on.",
        "Now that your light is in place, go back to your circuit breaker and flip the power back on to make sure that the light works.",
        "If the light isn't working, go back to your fixture.",
        "Make sure all your wires are connected correctly and your light firmly attached to the wall.",
        "If it's still not working, call an electrician for help.",
        "Using Ground Lighting Choose solar lighting for easy installation.",
        "Solar-powered lights don't require wiring, so installation will be easier.",
        "You'll need to find a nice sunny spot to place the solar panel, which will likely not be attached to the light itself.",
        "Choose standard plug-in lighting for reliability.",
        "If you don't think the sunlight in your area is strong enough for a solar-powered light or you don't want to find a good area for your panel, look for ground lights.",
        "They usually come in a kit with all the necessary components, including a stake, a power pack, and the light(s) themselves.",
        "Check for underground utilities before you install.",
        "In the US and Canada, call 811 and tell the representative about your project.",
        "They'll take down the information and notify your utility company to mark buried lines so you won't run into them.",
        "You won't be digging too deeply into the ground for this installation, but you should still make sure you won't be running into any shallow pipes or wiring.",
        "In other countries, call your utilities supplier to make sure you don't run into any lines during your installation.",
        "Place your lighting power pack near an outlet.",
        "Don't plug it in just yet--you want to wait until your light is assembled so you don't injure yourself.",
        "You can use a GFCI (Ground Fault Circuit Interrupter) outlet connected to your house, or purchase an outdoor outlet post that you'll drive into the ground on a stake.",
        "Point your light up at your house numbers.",
        "It may be able to stand alone, or it might come with a stake you need to push into the ground.",
        "Follow any assembling instructions that the light comes with, such as what kind of lightbulb it needs.",
        "Place the light at least a foot from the foundation of the house.",
        "You'll be able to adjust it later if the light doesn't fall exactly on the numbers.",
        "Lay out the cable and connect it to the lights.",
        "Starting at the power pack, run the cable along the ground towards the light and connect it using a cable connector.",
        "Dig a shallow trench into the soil all along the cable path.",
        "Use a small trowel to carefully shift the dirt or grass aside and push the cable down inside.",
        "The trench should be fairly narrow, only large enough to accommodate the cord.",
        "You may need to dig slightly deeper or wider in the area around the light to accommodate for extra cable.",
        "If your cable is running along concrete or other ground you can't dig into, try to place it behind bushes or other objects.",
        "It's alright if it's slightly visible, but make sure it isn't so out in the open that people could trip on it.",
        "Connect the cable to the power pack.",
        "Plug the pack into the outlet to test the light.",
        "Try shifting the light from side to side if it doesn't fall directly on the numbers.",
        "Once you have it in place, use dirt to close up the trenches around the cables.",
        "Set the light's timer to “dusk to dawn” settings.",
        "If you're using a plug-in light, you should be able to set the power pack to turn on when the sun goes down and flip off again in the mornings.",
        "Solar lights will likely do this automatically, but read the instructions to be sure.",
        "Making LED-Lit House Numbers Cut a piece of Plexiglass to your desired size.",
        "Your plexiglass should be about ⁄2 inch (1.3 cm) thick, and you should aim to cut it to about 9 inches (23 cm) long.",
        "Use both hands to operate the circular saw and cut off any extra parts smoothly.",
        "Be very careful when operating the circular saw.",
        "Stand to one side of the blade and clamp down your Plexiglas securely.",
        "Wear safety goggles and tuck back any loose hair or clothing.",
        "If your plexiglass is slightly cut up on one end from the blade, sand it down with a fine-grain sandpaper and run a hot torch over it quickly to make it clear again.",
        "Trace your house numbers onto the plexiglas.",
        "Use a large, clear font and place the numbers evenly.",
        "Write them with a dark, washable marker you can wipe away afterwards.",
        "For a modern look, fonts like Century Gothic or Neutra are good choices.",
        "For something slightly curlier, look at French Chic.",
        "Score the numbers onto the surface with a router or Dremmel tool.",
        "Lay your plexiglass on a cutting board or work table and clamp it down.",
        "Carefully move your router over the stenciled numbers to score them into the surface.",
        "You're not trying to carve them deeply into the surface; just ⁄16 inch (0.16 cm) thick is fine.",
        "Cut out one long side of a long, square-ended aluminum tube.",
        "This tube will go on top of your plexiglas, and will serve as the housing and protection for your LED lights.",
        "Keep the tube firmly weighed down at one end, or ask someone to hold it in place.",
        "Measure about ⁄8 inch (0.32 cm) in from the long sides of your tube and draw a straight line lengthwise down the tube.",
        "Use an angle grinder with a metal to cut along these lines.",
        "This will create lips that will help hold your plexiglass in place.",
        "As with the circular saw, use glasses and exercise extreme caution while operating.",
        "Thoroughly read the instructions and warnings in the manual before using.",
        "The tube should be a square, about ⁄4 in × ⁄4 in (1.9 cm × 1.9 cm).",
        "Cut your tube to the same length as your plexiglas.",
        "Using the same angle grinder, cut through the tube to make it the same length as your plexiglas.",
        "Decide where to place the grooves on your plexiglas.",
        "Cutting shallow grooves near the top of the plexiglass will let you slide the tube on easily and securely.",
        "Place the tube on top of the plexiglas and decide how far down you'd like it to clamp on.",
        "Mark that spot on both sides of the glass and use a ruler to draw a straight line across, starting from your markings.",
        "Cut a groove into the top of your plexiglas.",
        "Use a short blade on your circular saw that will make a very shallow groove.",
        "Lay the glass flat with the numbers facing up, then position the blade on the line you just marked off.",
        "Run the circular saw over it smoothly, then flip the Plexiglas over so that the numbers are facing down.",
        "Repeat the process and carve a groove into this side as well.",
        "These grooves will help hold the aluminum tube in place.",
        "Purchase an LED lighting kit.",
        "The kit should include an LED light string with adhesive coating, a receiver, a remote control, and a battery power supply.",
        "You can find kits online or at hardware supply stores.",
        "Cut your LED light string to the same length as your plexiglas.",
        "The string will have lines labeled “Cut,” which lets you know where to make your cuts.",
        "Measure out a length of string that is the same length as your plexiglas, or slightly longer.",
        "Use a pair of scissors to snip the extra away.",
        "Start from the end of the string that's attached to the receiver and power supply.",
        "You don't want to cut away access to your power!",
        "Tape your LED lights into the aluminum tube.",
        "Peel away the adhesive backing on the tape and center it on the inside of your aluminum tube.",
        "Press it firmly into place.",
        "If you have some extra string sticking out, bend it and tuck it into the tube.",
        "Slide the tube onto the top of the plexiglas.",
        "The aluminum should fit snugly onto the grooves.",
        "Plug in the receiver and power source to admire the effect of the lighting through the plexiglas and the numbers.",
        "Set the number outside or attach it to the wall.",
        "Use screws and a screwdriver to attach your address number to the front of your house, or prop it up against the wall.",
        "Use your remote to turn it on each day."
    ]
}