{
    "title": "How to Dye Feathers",
    "url": "https://www.wikihow.com/Dye-Feathers",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Nature Crafts"
    ],
    "parts": [
        {
            "name": "Creating a Color Bath",
            "steps": [
                {
                    "headline": "Protect yourself and your workspace.",
                    "description": "Place several layers of newspaper over your workspace to ensure any drips or spills won’t ruin your countertop or table. Keep paper towels handy in case of a spill. Wear old clothes or an apron, and put on rubber gloves to protect your skin from the dye."
                },
                {
                    "headline": "Mix a dye bath in a bowl.",
                    "description": "You can use powder or liquid fabric dye. Refer to the package instructions for the ratio of dye to water. Generally, you’ll use a ¼ cup (59 mL) of liquid dye or 1 tablespoon (15 mL) of powdered dye with 1 quart (946 mL) of hot water. The water temperature should be about 140° F (60° C)."
                },
                {
                    "headline": "Use food coloring to make a color bath.",
                    "description": "Fill a container that your feathers will fit in with 2 parts hot water (140° F or 60° C) and 1 part vinegar. Add 1 drop of food coloring at a time until you reach the desired shade—5 or 6 drops should be plenty."
                },
                {
                    "headline": "Make a color bath from drink mix.",
                    "description": "Powdered drink mixes, like Kool-Aid, can be used to dye feathers. Feel free to mix colors together, if desired. Use 1 6.2-gram package of drink mix per 1 cup (237 mL) of hot water (140° F or 60° C). Add the mix and the water to a large bowl. If the color is too light, add more drink mix. If it is too dark, add more water."
                },
                {
                    "headline": "Mix the color bath with a stir stick.",
                    "description": "Use a wooden skewer you don’t mind throwing away or a stainless steel spoon, which the color won’t stain. Make sure to thoroughly combine the ingredients, stirring until all the powder is dissolved, if applicable."
                }
            ]
        },
        {
            "name": "Coloring the Feathers",
            "steps": [
                {
                    "headline": "Wash natural feathers with mild soap.",
                    "description": "Natural feathers need to be washed first to remove oils that can prevent the dye from sticking. Fill a bowl or bucket with warm water and a small amount of mild soap. Place the feathers in the bowl and swirl them around. Let them sit for a few minutes, then rinse them with running water. If you purchased your feathers from a craft store you can skip this step."
                },
                {
                    "headline": "Submerge the feathers in the color bath.",
                    "description": "Carefully place the feathers in the color bath, making sure that all parts and tips are submerged. Press down on the feathers with your stir stick or skewer to keep them submerged if they begin to float."
                },
                {
                    "headline": "Allow them to soak until they reach the desired color.",
                    "description": "Feathers will absorb color quickly, so they may only need to sit in the color bath for as little as 2 minutes. If you want a darker color, you may need to leave them in for up to 15 minutes. Stir the mixture every few minutes to ensure the color gets absorbed evenly. A small amount of color will come out when you rinse the feathers, so let them soak until they are a shade darker than desired."
                },
                {
                    "headline": "Rinse the feathers with cool water.",
                    "description": "Carefully remove the feathers from the color bath and transfer them to the sink. Use cool, running water to remove the excess color. Keep rinsing the feathers until the water runs clear. After this rinse, the color shouldn’t fade or rub off as it is permanent."
                },
                {
                    "headline": "Let the feathers air dry.",
                    "description": "Lay the feathers out on several layers of newspaper or paper towel. Turn them over a few times throughout the process to ensure both sides dry fully. Alternatively, you can speed up the process by using a blow dryer on a cool setting."
                }
            ]
        }
    ],
    "tyn": [
        "Old clothes or apron",
        "Rubber gloves",
        "Newspaper",
        "Paper towels",
        "Bowls or buckets",
        "Water",
        "Mild soap",
        "Fabric dye, food coloring, or powdered drink mix",
        "Vinegar (if using food coloring)",
        "Skewer, stainless steel spoon, or stir stick"
    ],
    "text": " Creating a Color Bath Protect yourself and your workspace. Place several layers of newspaper over your workspace to ensure any drips or spills won’t ruin your countertop or table. Keep paper towels handy in case of a spill. Wear old clothes or an apron, and put on rubber gloves to protect your skin from the dye. Mix a dye bath in a bowl. You can use powder or liquid fabric dye. Refer to the package instructions for the ratio of dye to water. Generally, you’ll use a ¼ cup (59 mL) of liquid dye or 1 tablespoon (15 mL) of powdered dye with 1 quart (946 mL) of hot water. The water temperature should be about 140° F (60° C). Use food coloring to make a color bath. Fill a container that your feathers will fit in with 2 parts hot water (140° F or 60° C) and 1 part vinegar. Add 1 drop of food coloring at a time until you reach the desired shade—5 or 6 drops should be plenty. Make a color bath from drink mix. Powdered drink mixes, like Kool-Aid, can be used to dye feathers. Feel free to mix colors together, if desired. Use 1 6.2-gram package of drink mix per 1 cup (237 mL) of hot water (140° F or 60° C). Add the mix and the water to a large bowl. If the color is too light, add more drink mix. If it is too dark, add more water. Mix the color bath with a stir stick. Use a wooden skewer you don’t mind throwing away or a stainless steel spoon, which the color won’t stain. Make sure to thoroughly combine the ingredients, stirring until all the powder is dissolved, if applicable. Coloring the Feathers Wash natural feathers with mild soap. Natural feathers need to be washed first to remove oils that can prevent the dye from sticking. Fill a bowl or bucket with warm water and a small amount of mild soap. Place the feathers in the bowl and swirl them around. Let them sit for a few minutes, then rinse them with running water. If you purchased your feathers from a craft store you can skip this step. Submerge the feathers in the color bath. Carefully place the feathers in the color bath, making sure that all parts and tips are submerged. Press down on the feathers with your stir stick or skewer to keep them submerged if they begin to float. Allow them to soak until they reach the desired color. Feathers will absorb color quickly, so they may only need to sit in the color bath for as little as 2 minutes. If you want a darker color, you may need to leave them in for up to 15 minutes. Stir the mixture every few minutes to ensure the color gets absorbed evenly. A small amount of color will come out when you rinse the feathers, so let them soak until they are a shade darker than desired. Rinse the feathers with cool water. Carefully remove the feathers from the color bath and transfer them to the sink. Use cool, running water to remove the excess color. Keep rinsing the feathers until the water runs clear. After this rinse, the color shouldn’t fade or rub off as it is permanent. Let the feathers air dry. Lay the feathers out on several layers of newspaper or paper towel. Turn them over a few times throughout the process to ensure both sides dry fully. Alternatively, you can speed up the process by using a blow dryer on a cool setting.",
    "sentences": [
        " Creating a Color Bath Protect yourself and your workspace.",
        "Place several layers of newspaper over your workspace to ensure any drips or spills won’t ruin your countertop or table.",
        "Keep paper towels handy in case of a spill.",
        "Wear old clothes or an apron, and put on rubber gloves to protect your skin from the dye.",
        "Mix a dye bath in a bowl.",
        "You can use powder or liquid fabric dye.",
        "Refer to the package instructions for the ratio of dye to water.",
        "Generally, you’ll use a ¼ cup (59 mL) of liquid dye or 1 tablespoon (15 mL) of powdered dye with 1 quart (946 mL) of hot water.",
        "The water temperature should be about 140° F (60° C).",
        "Use food coloring to make a color bath.",
        "Fill a container that your feathers will fit in with 2 parts hot water (140° F or 60° C) and 1 part vinegar.",
        "Add 1 drop of food coloring at a time until you reach the desired shade—5 or 6 drops should be plenty.",
        "Make a color bath from drink mix.",
        "Powdered drink mixes, like Kool-Aid, can be used to dye feathers.",
        "Feel free to mix colors together, if desired.",
        "Use 1 6.2-gram package of drink mix per 1 cup (237 mL) of hot water (140° F or 60° C).",
        "Add the mix and the water to a large bowl.",
        "If the color is too light, add more drink mix.",
        "If it is too dark, add more water.",
        "Mix the color bath with a stir stick.",
        "Use a wooden skewer you don’t mind throwing away or a stainless steel spoon, which the color won’t stain.",
        "Make sure to thoroughly combine the ingredients, stirring until all the powder is dissolved, if applicable.",
        "Coloring the Feathers Wash natural feathers with mild soap.",
        "Natural feathers need to be washed first to remove oils that can prevent the dye from sticking.",
        "Fill a bowl or bucket with warm water and a small amount of mild soap.",
        "Place the feathers in the bowl and swirl them around.",
        "Let them sit for a few minutes, then rinse them with running water.",
        "If you purchased your feathers from a craft store you can skip this step.",
        "Submerge the feathers in the color bath.",
        "Carefully place the feathers in the color bath, making sure that all parts and tips are submerged.",
        "Press down on the feathers with your stir stick or skewer to keep them submerged if they begin to float.",
        "Allow them to soak until they reach the desired color.",
        "Feathers will absorb color quickly, so they may only need to sit in the color bath for as little as 2 minutes.",
        "If you want a darker color, you may need to leave them in for up to 15 minutes.",
        "Stir the mixture every few minutes to ensure the color gets absorbed evenly.",
        "A small amount of color will come out when you rinse the feathers, so let them soak until they are a shade darker than desired.",
        "Rinse the feathers with cool water.",
        "Carefully remove the feathers from the color bath and transfer them to the sink.",
        "Use cool, running water to remove the excess color.",
        "Keep rinsing the feathers until the water runs clear.",
        "After this rinse, the color shouldn’t fade or rub off as it is permanent.",
        "Let the feathers air dry.",
        "Lay the feathers out on several layers of newspaper or paper towel.",
        "Turn them over a few times throughout the process to ensure both sides dry fully.",
        "Alternatively, you can speed up the process by using a blow dryer on a cool setting."
    ]
}