{
    "title": "How to Sew a Hole in Jeans",
    "url": "https://www.wikihow.com/Sew-a-Hole-in-Jeans",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Laundry"
    ],
    "methods": [
        {
            "name": "Sewing a Small Hole",
            "steps": [
                {
                    "headline": "Trim away the frayed edges.",
                    "description": "Before sewing over the hole, trim away some of the excess thread around the edges of the hole. This will make it easier to sew the hole closed and reduce the visibility of the seam. Don’t cut into the fabric surrounding the hole. Only cut the frayed denim."
                },
                {
                    "headline": "Thread a needle.",
                    "description": "Use thread that closely matches the color of your denim. This will help to make the seam less visible. A heavy duty thread also works best for sewing denim. Insert the end of your thread through the eye of the needle, and then pull the thread through until you have about 18 inches (46 cm) of thread extending from each side of the needle’s eye."
                },
                {
                    "headline": "Tie a knot in the thread.",
                    "description": "Cut both strands of the thread at the 18 inches (46 cm) mark. The, tie a knot in the ends of the thread strands. This will help to anchor your thread to the inside of the jeans as you sew."
                },
                {
                    "headline": "Insert the needle 0.5 inches (1.3 cm) from the side of hole.",
                    "description": "Start by insert your needle from the inside of your jeans about 0.5 inches (1.3 cm) from the hole. This will ensure that you can fully cover the hole with the thread and it will anchor the thread at a strong point in the denim. If the denim is weak at the 0.5 inches (1.3 cm), then insert it 1 inch (2.5 cm) from the edge of the hole instead."
                },
                {
                    "headline": "Weave through the denim on the edges of the hole.",
                    "description": "Start weaving stitches across the area right beside the hole and work towards it. Insert your needle about 0.25 inches (0.64 cm) from the top of the hole to 0.25 inches (0.64 cm) from the bottom of the hole. After the needle comes out at the bottom of the hole, bring it back up and through the area above the hole again."
                },
                {
                    "headline": "Work all the way across and beyond the hole.",
                    "description": "Continue to weave in and out of the denim beside the edges of the hole. Tug on the thread after every few stitches to close the hole. Keep going until you reach the point 0.5 inches (1.3 cm) from the other side of the hole."
                },
                {
                    "headline": "Tie off the thread inside of your jeans.",
                    "description": "When you finish sewing up the hole, insert the needle through the denim at the 0.5 inches (1.3 cm) mark. Then, tie off the thread inside of the jeans to secure your stitches."
                }
            ]
        },
        {
            "name": "Sewing a Patch Over a Large Hole",
            "steps": [
                {
                    "headline": "Trim away the frayed edges.",
                    "description": "A patched hole will look cleaner if you trim away the frayed edges first. Use a pair of sharp scissors to cut away any frayed edges, but do not cut into the fabric. Leave the denim surrounding the jeans intact."
                },
                {
                    "headline": "Cut a piece of matching denim fabric to cover the hole.",
                    "description": "You can either buy some denim patch material that matches your jeans or you can buy some matching denim fabric. Either way, you will need to cut the material to the size you need to cover the hole. Measure across the hole and add 1 inch (2.5 cm) to each measurement. This will ensure that you have about 0.5 inches (1.3 cm) of fabric going past the edge of the hole. For example, if the hole you are covering measures 3 inches (7.6 cm) by 4 inches (10 cm), then make a patch that is 4 inches (10 cm) by 5 inches (13 cm). If the fabric is weak on the edges of the hole, then add more length to your measurements to ensure that you will be sewing into strong areas of the denim fabric."
                },
                {
                    "headline": "Line up the patch over the hole and pin it into place.",
                    "description": "Place the patch over the hole so that the outer part of the denim will be showing. Then, pin it into place to hold it in place. Place pins along the edges of the patch."
                },
                {
                    "headline": "Sew around the edges of the patch.",
                    "description": "A sewing machine works best for sewing a patch into place. Set your sewing machine to the zigzag setting, and sew around the outer edges of the patch to secure it. Be careful not to sew across the pins because this may damage your machine."
                }
            ]
        }
    ],
    "tyn": [
        "Sewing a Small Hole",
        "Scissors",
        "Needle",
        "Heavy duty thread that matches your denim color",
        "Sewing a Patch Over a Large Hole",
        "Ruler or measuring tape",
        "Patch material that matches your denim color",
        "Sewing machine"
    ],
    "text": " Sewing a Small Hole Trim away the frayed edges. Before sewing over the hole, trim away some of the excess thread around the edges of the hole. This will make it easier to sew the hole closed and reduce the visibility of the seam. Don’t cut into the fabric surrounding the hole. Only cut the frayed denim. Thread a needle. Use thread that closely matches the color of your denim. This will help to make the seam less visible. A heavy duty thread also works best for sewing denim. Insert the end of your thread through the eye of the needle, and then pull the thread through until you have about 18 inches (46 cm) of thread extending from each side of the needle’s eye. Tie a knot in the thread. Cut both strands of the thread at the 18 inches (46 cm) mark. The, tie a knot in the ends of the thread strands. This will help to anchor your thread to the inside of the jeans as you sew. Insert the needle 0.5 inches (1.3 cm) from the side of hole. Start by insert your needle from the inside of your jeans about 0.5 inches (1.3 cm) from the hole. This will ensure that you can fully cover the hole with the thread and it will anchor the thread at a strong point in the denim. If the denim is weak at the 0.5 inches (1.3 cm), then insert it 1 inch (2.5 cm) from the edge of the hole instead. Weave through the denim on the edges of the hole. Start weaving stitches across the area right beside the hole and work towards it. Insert your needle about 0.25 inches (0.64 cm) from the top of the hole to 0.25 inches (0.64 cm) from the bottom of the hole. After the needle comes out at the bottom of the hole, bring it back up and through the area above the hole again. Work all the way across and beyond the hole. Continue to weave in and out of the denim beside the edges of the hole. Tug on the thread after every few stitches to close the hole. Keep going until you reach the point 0.5 inches (1.3 cm) from the other side of the hole. Tie off the thread inside of your jeans. When you finish sewing up the hole, insert the needle through the denim at the 0.5 inches (1.3 cm) mark. Then, tie off the thread inside of the jeans to secure your stitches. Sewing a Patch Over a Large Hole Trim away the frayed edges. A patched hole will look cleaner if you trim away the frayed edges first. Use a pair of sharp scissors to cut away any frayed edges, but do not cut into the fabric. Leave the denim surrounding the jeans intact. Cut a piece of matching denim fabric to cover the hole. You can either buy some denim patch material that matches your jeans or you can buy some matching denim fabric. Either way, you will need to cut the material to the size you need to cover the hole. Measure across the hole and add 1 inch (2.5 cm) to each measurement. This will ensure that you have about 0.5 inches (1.3 cm) of fabric going past the edge of the hole. For example, if the hole you are covering measures 3 inches (7.6 cm) by 4 inches (10 cm), then make a patch that is 4 inches (10 cm) by 5 inches (13 cm). If the fabric is weak on the edges of the hole, then add more length to your measurements to ensure that you will be sewing into strong areas of the denim fabric. Line up the patch over the hole and pin it into place. Place the patch over the hole so that the outer part of the denim will be showing. Then, pin it into place to hold it in place. Place pins along the edges of the patch. Sew around the edges of the patch. A sewing machine works best for sewing a patch into place. Set your sewing machine to the zigzag setting, and sew around the outer edges of the patch to secure it. Be careful not to sew across the pins because this may damage your machine.",
    "sentences": [
        " Sewing a Small Hole Trim away the frayed edges.",
        "Before sewing over the hole, trim away some of the excess thread around the edges of the hole.",
        "This will make it easier to sew the hole closed and reduce the visibility of the seam.",
        "Don’t cut into the fabric surrounding the hole.",
        "Only cut the frayed denim.",
        "Thread a needle.",
        "Use thread that closely matches the color of your denim.",
        "This will help to make the seam less visible.",
        "A heavy duty thread also works best for sewing denim.",
        "Insert the end of your thread through the eye of the needle, and then pull the thread through until you have about 18 inches (46 cm) of thread extending from each side of the needle’s eye.",
        "Tie a knot in the thread.",
        "Cut both strands of the thread at the 18 inches (46 cm) mark.",
        "The, tie a knot in the ends of the thread strands.",
        "This will help to anchor your thread to the inside of the jeans as you sew.",
        "Insert the needle 0.5 inches (1.3 cm) from the side of hole.",
        "Start by insert your needle from the inside of your jeans about 0.5 inches (1.3 cm) from the hole.",
        "This will ensure that you can fully cover the hole with the thread and it will anchor the thread at a strong point in the denim.",
        "If the denim is weak at the 0.5 inches (1.3 cm), then insert it 1 inch (2.5 cm) from the edge of the hole instead.",
        "Weave through the denim on the edges of the hole.",
        "Start weaving stitches across the area right beside the hole and work towards it.",
        "Insert your needle about 0.25 inches (0.64 cm) from the top of the hole to 0.25 inches (0.64 cm) from the bottom of the hole.",
        "After the needle comes out at the bottom of the hole, bring it back up and through the area above the hole again.",
        "Work all the way across and beyond the hole.",
        "Continue to weave in and out of the denim beside the edges of the hole.",
        "Tug on the thread after every few stitches to close the hole.",
        "Keep going until you reach the point 0.5 inches (1.3 cm) from the other side of the hole.",
        "Tie off the thread inside of your jeans.",
        "When you finish sewing up the hole, insert the needle through the denim at the 0.5 inches (1.3 cm) mark.",
        "Then, tie off the thread inside of the jeans to secure your stitches.",
        "Sewing a Patch Over a Large Hole Trim away the frayed edges.",
        "A patched hole will look cleaner if you trim away the frayed edges first.",
        "Use a pair of sharp scissors to cut away any frayed edges, but do not cut into the fabric.",
        "Leave the denim surrounding the jeans intact.",
        "Cut a piece of matching denim fabric to cover the hole.",
        "You can either buy some denim patch material that matches your jeans or you can buy some matching denim fabric.",
        "Either way, you will need to cut the material to the size you need to cover the hole.",
        "Measure across the hole and add 1 inch (2.5 cm) to each measurement.",
        "This will ensure that you have about 0.5 inches (1.3 cm) of fabric going past the edge of the hole.",
        "For example, if the hole you are covering measures 3 inches (7.6 cm) by 4 inches (10 cm), then make a patch that is 4 inches (10 cm) by 5 inches (13 cm).",
        "If the fabric is weak on the edges of the hole, then add more length to your measurements to ensure that you will be sewing into strong areas of the denim fabric.",
        "Line up the patch over the hole and pin it into place.",
        "Place the patch over the hole so that the outer part of the denim will be showing.",
        "Then, pin it into place to hold it in place.",
        "Place pins along the edges of the patch.",
        "Sew around the edges of the patch.",
        "A sewing machine works best for sewing a patch into place.",
        "Set your sewing machine to the zigzag setting, and sew around the outer edges of the patch to secure it.",
        "Be careful not to sew across the pins because this may damage your machine."
    ]
}