{
    "title": "How to Kill Grass",
    "url": "https://www.wikihow.com/Kill-Grass",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening"
    ],
    "methods": [
        {
            "name": "Smothering Grass",
            "steps": [
                {
                    "headline": "Mow the area of grass if it’s taller than 3 inches (7.6 cm).",
                    "description": "Short grass will give you an even surface to work on. Don’t water the grass after you mow it. You want the grass to be as dried out as possible."
                },
                {
                    "headline": "Cover the grass with newspaper or cardboard.",
                    "description": "If you use newspaper, you’ll want a layer over the grass that’s 10 sheets thick. If you use cardboard, make a layer that's 1 sheet thick. Lay the cardboard or newspaper flat over the grass so the pieces overlap by 2 inches (5.1 cm). Make sure all of the grass you want to kill is covered."
                },
                {
                    "headline": "Hose down the sheets until they’re soaked.",
                    "description": "Soaking the sheets of newspaper or cardboard will prevent them from blowing away. Don’t turn the hose on full blast or it could cause the sheets to lift off the grass."
                },
                {
                    "headline": "Add a 7-inch layer of organic mulch over the sheets.",
                    "description": "Use any kind of organic mulch, like wood chips, bark, or dried leaves. Spread the mulch over the newspaper or cardboard sheets so there’s an even layer. When you’re finished, you shouldn’t be able to see any of the sheets you put down."
                },
                {
                    "headline": "Water the mulch with a hose.",
                    "description": "You want the mulch to be completely soaked. This will compact it and keep it in place."
                },
                {
                    "headline": "Wait 2 months for the grass to die.",
                    "description": "The grass underneath the sheets and mulch will slowly dry out and die from a lack of sunlight and nutrients. Leave the mulch as is for 2 months. Planting anything in the mulch could allow the grass to grow back through. Don't worry about watering the mulch while you're waiting for the grass to die. Avoid walking on the mulch a lot when you're waiting for the grass to die so you don't accidentally expose the sheets underneath."
                },
                {
                    "headline": "Till the mulch at least 6 inches (15 cm) into the soil.",
                    "description": "Once your grass is dead, set a tiller to a depth of at least 6 inches (15 cm) and go over the entire area with it. This will mix the paper and mulch into the soil, which may help to enrich it and also reduce the amount of clean up you’ll have to do. It may take longer than 2 months for your grass to die. Check a section of your lawn to make sure it’s dead before moving on to tilling. Once the grass under the sheets has died and you’ve tilled the area, you can plant a new lawn or garden in the mulch."
                }
            ]
        },
        {
            "name": "Using an Herbicide",
            "steps": [
                {
                    "headline": "Get a container of glyphosate.",
                    "description": "Glyphosate is a non-selective herbicide that will kill grass and any other plants exposed to it. Glyphosate is sold by a variety of brands, so search online or visit a local garden store to decide which one works best for you. Look for a glyphosate with a spray applicator so it’s easy to apply to the grass you want to kill. Read the label on a container of glyphosate to see how many square feet of grass it kills. For example, if the area of grass you're trying to kill is 3,000 square feet (280 m), and the container of glyphosate you want has a coverage of 1,500 square feet (140 m), you would need 2 containers."
                },
                {
                    "headline": "Apply the glyphosate to the grass when it’s not windy or rainy.",
                    "description": "Wind and rain can carry the herbicide away from the area of grass you’re spraying, so check the forecast before you use the glyphosate. Choose a day when it’s not going to rain for at least 48 hours."
                },
                {
                    "headline": "Put on protective gear before you apply the glyphosate.",
                    "description": "Always wear protective goggles, a long-sleeved shirt, long pants, and closed-toe shoes when you're using an herbicide. You should also put on gloves and a hat before you use the glyphosate. It’s important that none of the herbicide gets on your skin. If any glyphosate gets on your skin, immediately wash it off with soap and water in the shower."
                },
                {
                    "headline": "Cover the grass you want to kill with glyphosate.",
                    "description": "Carefully read the application directions that came with your glyphosate. Spray an even layer of glyphosate over the surface of the grass until the entire area of grass is covered."
                },
                {
                    "headline": "Wait 2 weeks for the grass to die.",
                    "description": "It can take up to 7 days for the grass to absorb the glyphosate and another 7 days for it to die. Don’t water the grass during this time period. As time goes on, you should start to see the grass wither and turn brown."
                },
                {
                    "headline": "Restore the soil with a fertilizer and organic mulch if you want to plant in it.",
                    "description": "Spread out an even layer of organic mulch, like wood chips or dried leaves, over the soil the grass used to be in. Then, add a starter fertilizer to the mulch. Water the area thoroughly and let it set for at least 1 week before you plant anything new in the soil."
                }
            ]
        }
    ],
    "tyn": [
        "Smothering Grass",
        "Lawn mower",
        "Hose",
        "Newspaper or cardboard",
        "Organic mulch",
        "Using an Herbicide",
        "Glyphosate",
        "Protective goggles",
        "Dust mask",
        "Respirator",
        "Long-sleeve shirt",
        "Long pants",
        "Gloves",
        "Hat"
    ],
    "text": " Smothering Grass Mow the area of grass if it’s taller than 3 inches (7.6 cm). Short grass will give you an even surface to work on. Don’t water the grass after you mow it. You want the grass to be as dried out as possible. Cover the grass with newspaper or cardboard. If you use newspaper, you’ll want a layer over the grass that’s 10 sheets thick. If you use cardboard, make a layer that's 1 sheet thick. Lay the cardboard or newspaper flat over the grass so the pieces overlap by 2 inches (5.1 cm). Make sure all of the grass you want to kill is covered. Hose down the sheets until they’re soaked. Soaking the sheets of newspaper or cardboard will prevent them from blowing away. Don’t turn the hose on full blast or it could cause the sheets to lift off the grass. Add a 7-inch layer of organic mulch over the sheets. Use any kind of organic mulch, like wood chips, bark, or dried leaves. Spread the mulch over the newspaper or cardboard sheets so there’s an even layer. When you’re finished, you shouldn’t be able to see any of the sheets you put down. Water the mulch with a hose. You want the mulch to be completely soaked. This will compact it and keep it in place. Wait 2 months for the grass to die. The grass underneath the sheets and mulch will slowly dry out and die from a lack of sunlight and nutrients. Leave the mulch as is for 2 months. Planting anything in the mulch could allow the grass to grow back through. Don't worry about watering the mulch while you're waiting for the grass to die. Avoid walking on the mulch a lot when you're waiting for the grass to die so you don't accidentally expose the sheets underneath. Till the mulch at least 6 inches (15 cm) into the soil. Once your grass is dead, set a tiller to a depth of at least 6 inches (15 cm) and go over the entire area with it. This will mix the paper and mulch into the soil, which may help to enrich it and also reduce the amount of clean up you’ll have to do. It may take longer than 2 months for your grass to die. Check a section of your lawn to make sure it’s dead before moving on to tilling. Once the grass under the sheets has died and you’ve tilled the area, you can plant a new lawn or garden in the mulch. Using an Herbicide Get a container of glyphosate. Glyphosate is a non-selective herbicide that will kill grass and any other plants exposed to it. Glyphosate is sold by a variety of brands, so search online or visit a local garden store to decide which one works best for you. Look for a glyphosate with a spray applicator so it’s easy to apply to the grass you want to kill. Read the label on a container of glyphosate to see how many square feet of grass it kills. For example, if the area of grass you're trying to kill is 3,000 square feet (280 m), and the container of glyphosate you want has a coverage of 1,500 square feet (140 m), you would need 2 containers. Apply the glyphosate to the grass when it’s not windy or rainy. Wind and rain can carry the herbicide away from the area of grass you’re spraying, so check the forecast before you use the glyphosate. Choose a day when it’s not going to rain for at least 48 hours. Put on protective gear before you apply the glyphosate. Always wear protective goggles, a long-sleeved shirt, long pants, and closed-toe shoes when you're using an herbicide. You should also put on gloves and a hat before you use the glyphosate. It’s important that none of the herbicide gets on your skin. If any glyphosate gets on your skin, immediately wash it off with soap and water in the shower. Cover the grass you want to kill with glyphosate. Carefully read the application directions that came with your glyphosate. Spray an even layer of glyphosate over the surface of the grass until the entire area of grass is covered. Wait 2 weeks for the grass to die. It can take up to 7 days for the grass to absorb the glyphosate and another 7 days for it to die. Don’t water the grass during this time period. As time goes on, you should start to see the grass wither and turn brown. Restore the soil with a fertilizer and organic mulch if you want to plant in it. Spread out an even layer of organic mulch, like wood chips or dried leaves, over the soil the grass used to be in. Then, add a starter fertilizer to the mulch. Water the area thoroughly and let it set for at least 1 week before you plant anything new in the soil.",
    "sentences": [
        " Smothering Grass Mow the area of grass if it’s taller than 3 inches (7.6 cm).",
        "Short grass will give you an even surface to work on.",
        "Don’t water the grass after you mow it.",
        "You want the grass to be as dried out as possible.",
        "Cover the grass with newspaper or cardboard.",
        "If you use newspaper, you’ll want a layer over the grass that’s 10 sheets thick.",
        "If you use cardboard, make a layer that's 1 sheet thick.",
        "Lay the cardboard or newspaper flat over the grass so the pieces overlap by 2 inches (5.1 cm).",
        "Make sure all of the grass you want to kill is covered.",
        "Hose down the sheets until they’re soaked.",
        "Soaking the sheets of newspaper or cardboard will prevent them from blowing away.",
        "Don’t turn the hose on full blast or it could cause the sheets to lift off the grass.",
        "Add a 7-inch layer of organic mulch over the sheets.",
        "Use any kind of organic mulch, like wood chips, bark, or dried leaves.",
        "Spread the mulch over the newspaper or cardboard sheets so there’s an even layer.",
        "When you’re finished, you shouldn’t be able to see any of the sheets you put down.",
        "Water the mulch with a hose.",
        "You want the mulch to be completely soaked.",
        "This will compact it and keep it in place.",
        "Wait 2 months for the grass to die.",
        "The grass underneath the sheets and mulch will slowly dry out and die from a lack of sunlight and nutrients.",
        "Leave the mulch as is for 2 months.",
        "Planting anything in the mulch could allow the grass to grow back through.",
        "Don't worry about watering the mulch while you're waiting for the grass to die.",
        "Avoid walking on the mulch a lot when you're waiting for the grass to die so you don't accidentally expose the sheets underneath.",
        "Till the mulch at least 6 inches (15 cm) into the soil.",
        "Once your grass is dead, set a tiller to a depth of at least 6 inches (15 cm) and go over the entire area with it.",
        "This will mix the paper and mulch into the soil, which may help to enrich it and also reduce the amount of clean up you’ll have to do.",
        "It may take longer than 2 months for your grass to die.",
        "Check a section of your lawn to make sure it’s dead before moving on to tilling.",
        "Once the grass under the sheets has died and you’ve tilled the area, you can plant a new lawn or garden in the mulch.",
        "Using an Herbicide Get a container of glyphosate.",
        "Glyphosate is a non-selective herbicide that will kill grass and any other plants exposed to it.",
        "Glyphosate is sold by a variety of brands, so search online or visit a local garden store to decide which one works best for you.",
        "Look for a glyphosate with a spray applicator so it’s easy to apply to the grass you want to kill.",
        "Read the label on a container of glyphosate to see how many square feet of grass it kills.",
        "For example, if the area of grass you're trying to kill is 3,000 square feet (280 m), and the container of glyphosate you want has a coverage of 1,500 square feet (140 m), you would need 2 containers.",
        "Apply the glyphosate to the grass when it’s not windy or rainy.",
        "Wind and rain can carry the herbicide away from the area of grass you’re spraying, so check the forecast before you use the glyphosate.",
        "Choose a day when it’s not going to rain for at least 48 hours.",
        "Put on protective gear before you apply the glyphosate.",
        "Always wear protective goggles, a long-sleeved shirt, long pants, and closed-toe shoes when you're using an herbicide.",
        "You should also put on gloves and a hat before you use the glyphosate.",
        "It’s important that none of the herbicide gets on your skin.",
        "If any glyphosate gets on your skin, immediately wash it off with soap and water in the shower.",
        "Cover the grass you want to kill with glyphosate.",
        "Carefully read the application directions that came with your glyphosate.",
        "Spray an even layer of glyphosate over the surface of the grass until the entire area of grass is covered.",
        "Wait 2 weeks for the grass to die.",
        "It can take up to 7 days for the grass to absorb the glyphosate and another 7 days for it to die.",
        "Don’t water the grass during this time period.",
        "As time goes on, you should start to see the grass wither and turn brown.",
        "Restore the soil with a fertilizer and organic mulch if you want to plant in it.",
        "Spread out an even layer of organic mulch, like wood chips or dried leaves, over the soil the grass used to be in.",
        "Then, add a starter fertilizer to the mulch.",
        "Water the area thoroughly and let it set for at least 1 week before you plant anything new in the soil."
    ]
}