{
    "title": "How to Cook Escarole",
    "url": "https://www.wikihow.com/Cook-Escarole",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables"
    ],
    "methods": [
        {
            "name": "Sautéing Escarole with Garlic",
            "steps": [
                {
                    "headline": "Wash the escarole 2 times.",
                    "description": "Peel away and discard any outer leaves that look bruised or damaged. Take a sharp knife and cut away the bottom stem from each head of escarole. Fill a clean sink or bowl with cold water and add the escarole leaves. Swish them around and drain the water. Fill the sink or bowl again and wash the leaves 1 more time before you drain the water. You should trim about 1 inch (2.5 cm) off of the bottoms."
                },
                {
                    "headline": "Boil the escarole for 5 minutes.",
                    "description": "Fill a large pot with water and add several pinches of salt. Turn the heat on to high and bring the water to boil. Add the washed escarole leaves and stir them a little. Boil the escarole for 5 minutes so it softens. Depending on the amount of escarole you have, you'll probably need at least a 3-quart (2.8 liter) pot."
                },
                {
                    "headline": "Sauté the garlic for 1 minute over medium heat.",
                    "description": "While the escarole is boiling, pour 2 tablespoons (30 ml) of olive oil into a large skillet. Turn the heat to medium and add 2 to 3 cloves of garlic that you've peeled and barely crushed with the palm of your hand. Stir the garlic and let it cook until it browns just a little. Remove the garlic and turn off the heat. Leave the oil to cool down in the skillet a little. It should now be flavored with garlic."
                },
                {
                    "headline": "Drain the escarole and add it to the skillet.",
                    "description": "Set a colander or strainer into the sink. Turn off the heat and slowly drain the escarole through the colander. Use tongs to transfer the escarole into the skillet with the garlic oil. It's alright if the escarole isn't completely dry or drained."
                },
                {
                    "headline": "Season and simmer the escarole for 5 minutes over medium heat.",
                    "description": "Sprinkle salt and pepper according to your taste over the escarole. Stir the escarole and turn the burner to medium heat so it begins to bubble gently. Put the lid on the skillet and simmer the escarole until it softens even more."
                },
                {
                    "headline": "Stir in optional ingredients and simmer for 5 more minutes.",
                    "description": "If you'd like to flavor the sautéed escarole with any additional ingredients, add them to the skillet and stir the escarole well. Put the lid back on the pot and simmer the escarole for another 5 minutes. Consider stirring in 1 or 2 of the following:\nA handful of capers, well washed and squeezed\nA handful of black olives\n4 anchovy fillets\nA handful of pine nuts\nA handful of raisins, soaked for 1 hour until soft and drained"
                },
                {
                    "headline": "Check to see if the escarole is tender and serve it.",
                    "description": "Remove the lid and taste a little of the escarole to see if it's as soft as you like it. If it's too tough, put the lid back on and simmer it for 2 to 4 more minutes. If it's too watery, leave the lid off of the pot and increase the heat so the water evaporates. Serve the sautéed escarole with your favorite meat dish, roasted vegetables, or whole grains. Store the leftover escarole in an airtight container. Refrigerate the escarole and use it within 3 to 5 days."
                }
            ]
        },
        {
            "name": "Making Spaghetti with Escarole and Bacon",
            "steps": [
                {
                    "headline": "Fry the bacon over medium heat for 5 minutes.",
                    "description": "Place 1/4 pound (113 g) of bacon that's sliced crosswise into thin strips about 2 centimeters (0.8 in) thick in a deep skillet. Turn the heat to medium and stir the bacon occasionally as it cooks. Fry the bacon until it's crisp and brown. Transfer the cooked bacon to a small bowl and discard the grease from the skillet. The skillet should be at least 2 inches (5.1 cm) deep."
                },
                {
                    "headline": "Sauté the garlic, pepper flakes, and anchovy paste for 30 seconds.",
                    "description": "Pour 2 tablespoons (30 ml) of olive oil into the skillet you used to cook the bacon. Turn the heat to medium-low and stir in 3 cloves of minced garlic, 1/4 teaspoon (0.5 g) of red-pepper flakes, and 1 1/2 teaspoons (7.5 g) of anchovy paste. Continue to stir and cook the aromatics until you can smell them. This should take about 30 seconds."
                },
                {
                    "headline": "Slice the escarole into ⁄2 inch (1.3 cm) strips.",
                    "description": "Rinse 1 head of escarole and use a sharp knife to cut off the bottom stem. Remove and discard the bottom 1 inch (2.5 cm) of the head. Cut the leaves into ⁄2 inch (1.3 cm) strips. and fill a clean sink or bowl with cold water. Add the escarole leaves and swish them around. Drain and refill the sink with water before washing the leaves 1 more time. Drain the water again."
                },
                {
                    "headline": "Boil the spaghetti in salted water for 12 minutes.",
                    "description": "Bring a large pot of salted water to boil over high heat. Add 3/4 pound (340 g) of dry spaghetti to the boiling water and stir it to break up the noodles. Boil the pasta for 12 minutes, so it's just tender. Place a colander or strainer in the sink and drain the spaghetti into it. You'll need to use at least a 5-quart (4.7 liters) pot."
                },
                {
                    "headline": "Stir the escarole into the spiced oil and cook it for 3 minutes.",
                    "description": "Stir a handful of the escarole strips into the skillet. Continue to stir in the rest of the escarole and cook it over medium-low heat. The escarole should wilt after 3 minutes."
                },
                {
                    "headline": "Stir in the stock and bring it to a simmer.",
                    "description": "Pour 2/3 cup (160 ml) of chicken stock into the skillet with the escarole. Stir in 1/4 teaspoon (1.25 g) of the salt and cook the mixture until the stock begins to bubble gently."
                },
                {
                    "headline": "Reduce the heat and cook the covered mixture for 5 minutes.",
                    "description": "Turn the heat back down to medium-low and place a lid on the skillet. Let the escarole cook until it softens a little."
                },
                {
                    "headline": "Stir the pasta, parmesan, bacon, butter, and salt into the escarole.",
                    "description": "Remove the lid from the pot of escarole and stir in the drained spaghetti. Stir in 1/3 cup (33 g) of grated Parmesan, 1 tablespoon (14 g) butter, bacon, and the remaining 1/4 teaspoon (1.25 g) of salt. Serve the escarole pasta immediately. Store the leftover escarole pasta in an airtight container in the refrigerator for 3 to 4 days."
                }
            ]
        },
        {
            "name": "Making Escarole and Meatball Soup",
            "steps": [
                {
                    "headline": "Combine the meatball mixture.",
                    "description": "Place 1 pound (453 g) of ground beef into a mixing bowl and add ½ cups (45 g) of seasoned bread crumbs, ½ cups (50 g) of grated parmesan, and ½ cups (50 g) of grated pecorino. Use a spatula or your fingers to mix in:\n1/4 cup (60 ml) olive oil\n1 tablespoon (4 g) dried Italian seasoning\n1 clove minced garlic\n1 minced yellow onion\n1 small bunch of minced parsley\n1 lightly beaten egg\nKosher salt and freshly ground black pepper, to taste"
                },
                {
                    "headline": "Shape the mixture into 30 meatballs and chill them.",
                    "description": "Divide the meatball mixture into 30 evenly sized pieces. The meatballs should be 1.5 inches (3.8 cm) in size. Place them on a sheet and refrigerate the meatballs while you prepare the escarole. Consider using a small cookie scoop to divide the mixture into balls."
                },
                {
                    "headline": "Sauté the onions and sliced garlic for 10 minutes.",
                    "description": "Pour the remaining 1/4 cup (60 ml) of olive oil into a large saucepan and turn the heat to medium-high. Thinly slice the remaining 3 cloves of garlic and 2 medium yellow onions. Stir the garlic and onions into the oil. Cook and stir the onions and garlic until they're lightly brown and a little soft. This should take about 10 minutes. Use an 8-quart (7.5 liter) saucepan."
                },
                {
                    "headline": "Cut 2 large heads of escarole.",
                    "description": "Cut off the bottom ends of the escarole and discard them. If the escarole have tough cores, remove and discard them. Cut the escarole into 2-inch pieces and place them in a sink or bowl full of cold water. Swirl the leaves around to clean them and drain the water. Fill the sink or bowl 1 more time to wash them. Drain the leaves."
                },
                {
                    "headline": "Add the escarole and cook it for 6 minutes.",
                    "description": "Stir the escarole pieces into the sautéed onions and cook them until they wilt. This should take about 6 minutes at medium-high heat."
                },
                {
                    "headline": "Pour in the chicken stock and bring it to a boil.",
                    "description": "Add 8 cups (1.89 liters) of chicken stock to the escarole and turn the heat up to high. Bring the chicken stock to a vigorous boil."
                },
                {
                    "headline": "Reduce the heat, add the meatballs, and simmer the soup for 20 minutes.",
                    "description": "Turn the heat down to medium-low and stir in the chilled meatballs. Let the soup bubble gently for 20 minutes so the meatballs cook completely. Stir the soup occasionally to keep it from sticking to the bottom of the pan."
                },
                {
                    "headline": "Season and serve the escarole and meatball soup.",
                    "description": "Taste the soup and add salt and pepper according to your preferences. Serve the soup immediately with cooked white rice. Consider garnishing the soup with more parmesan cheese. You can store the leftover escarole and meatball soup in an airtight container in the refrigerator. Use the soup within 3 to 4 days."
                }
            ]
        }
    ],
    "tyn": [
        "Sautéed Escarole with Garlic",
        "Measuring cups and spoons",
        "Knife and cutting board",
        "Sink or bowl",
        "3-quart (2.8 liter) pot or larger",
        "Spoon",
        "Large skillet with lid",
        "Colander or strainer",
        "Tongs",
        "Spaghetti with Escarole and Bacon",
        "Deep skillet with lid",
        "5-quart (4.7 liters) pot",
        "Escarole and Meatball Soup",
        "Mixing bowl",
        "Baking sheet",
        "8-quart (7.5 liter) saucepan",
        "Ladle"
    ],
    "text": " Sautéing Escarole with Garlic Wash the escarole 2 times. Peel away and discard any outer leaves that look bruised or damaged. Take a sharp knife and cut away the bottom stem from each head of escarole. Fill a clean sink or bowl with cold water and add the escarole leaves. Swish them around and drain the water. Fill the sink or bowl again and wash the leaves 1 more time before you drain the water. You should trim about 1 inch (2.5 cm) off of the bottoms. Boil the escarole for 5 minutes. Fill a large pot with water and add several pinches of salt. Turn the heat on to high and bring the water to boil. Add the washed escarole leaves and stir them a little. Boil the escarole for 5 minutes so it softens. Depending on the amount of escarole you have, you'll probably need at least a 3-quart (2.8 liter) pot. Sauté the garlic for 1 minute over medium heat. While the escarole is boiling, pour 2 tablespoons (30 ml) of olive oil into a large skillet. Turn the heat to medium and add 2 to 3 cloves of garlic that you've peeled and barely crushed with the palm of your hand. Stir the garlic and let it cook until it browns just a little. Remove the garlic and turn off the heat. Leave the oil to cool down in the skillet a little. It should now be flavored with garlic. Drain the escarole and add it to the skillet. Set a colander or strainer into the sink. Turn off the heat and slowly drain the escarole through the colander. Use tongs to transfer the escarole into the skillet with the garlic oil. It's alright if the escarole isn't completely dry or drained. Season and simmer the escarole for 5 minutes over medium heat. Sprinkle salt and pepper according to your taste over the escarole. Stir the escarole and turn the burner to medium heat so it begins to bubble gently. Put the lid on the skillet and simmer the escarole until it softens even more. Stir in optional ingredients and simmer for 5 more minutes. If you'd like to flavor the sautéed escarole with any additional ingredients, add them to the skillet and stir the escarole well. Put the lid back on the pot and simmer the escarole for another 5 minutes. Consider stirring in 1 or 2 of the following:\nA handful of capers, well washed and squeezed\nA handful of black olives\n4 anchovy fillets\nA handful of pine nuts\nA handful of raisins, soaked for 1 hour until soft and drained Check to see if the escarole is tender and serve it. Remove the lid and taste a little of the escarole to see if it's as soft as you like it. If it's too tough, put the lid back on and simmer it for 2 to 4 more minutes. If it's too watery, leave the lid off of the pot and increase the heat so the water evaporates. Serve the sautéed escarole with your favorite meat dish, roasted vegetables, or whole grains. Store the leftover escarole in an airtight container. Refrigerate the escarole and use it within 3 to 5 days. Making Spaghetti with Escarole and Bacon Fry the bacon over medium heat for 5 minutes. Place 1/4 pound (113 g) of bacon that's sliced crosswise into thin strips about 2 centimeters (0.8 in) thick in a deep skillet. Turn the heat to medium and stir the bacon occasionally as it cooks. Fry the bacon until it's crisp and brown. Transfer the cooked bacon to a small bowl and discard the grease from the skillet. The skillet should be at least 2 inches (5.1 cm) deep. Sauté the garlic, pepper flakes, and anchovy paste for 30 seconds. Pour 2 tablespoons (30 ml) of olive oil into the skillet you used to cook the bacon. Turn the heat to medium-low and stir in 3 cloves of minced garlic, 1/4 teaspoon (0.5 g) of red-pepper flakes, and 1 1/2 teaspoons (7.5 g) of anchovy paste. Continue to stir and cook the aromatics until you can smell them. This should take about 30 seconds. Slice the escarole into ⁄2 inch (1.3 cm) strips. Rinse 1 head of escarole and use a sharp knife to cut off the bottom stem. Remove and discard the bottom 1 inch (2.5 cm) of the head. Cut the leaves into ⁄2 inch (1.3 cm) strips. and fill a clean sink or bowl with cold water. Add the escarole leaves and swish them around. Drain and refill the sink with water before washing the leaves 1 more time. Drain the water again. Boil the spaghetti in salted water for 12 minutes. Bring a large pot of salted water to boil over high heat. Add 3/4 pound (340 g) of dry spaghetti to the boiling water and stir it to break up the noodles. Boil the pasta for 12 minutes, so it's just tender. Place a colander or strainer in the sink and drain the spaghetti into it. You'll need to use at least a 5-quart (4.7 liters) pot. Stir the escarole into the spiced oil and cook it for 3 minutes. Stir a handful of the escarole strips into the skillet. Continue to stir in the rest of the escarole and cook it over medium-low heat. The escarole should wilt after 3 minutes. Stir in the stock and bring it to a simmer. Pour 2/3 cup (160 ml) of chicken stock into the skillet with the escarole. Stir in 1/4 teaspoon (1.25 g) of the salt and cook the mixture until the stock begins to bubble gently. Reduce the heat and cook the covered mixture for 5 minutes. Turn the heat back down to medium-low and place a lid on the skillet. Let the escarole cook until it softens a little. Stir the pasta, parmesan, bacon, butter, and salt into the escarole. Remove the lid from the pot of escarole and stir in the drained spaghetti. Stir in 1/3 cup (33 g) of grated Parmesan, 1 tablespoon (14 g) butter, bacon, and the remaining 1/4 teaspoon (1.25 g) of salt. Serve the escarole pasta immediately. Store the leftover escarole pasta in an airtight container in the refrigerator for 3 to 4 days. Making Escarole and Meatball Soup Combine the meatball mixture. Place 1 pound (453 g) of ground beef into a mixing bowl and add ½ cups (45 g) of seasoned bread crumbs, ½ cups (50 g) of grated parmesan, and ½ cups (50 g) of grated pecorino. Use a spatula or your fingers to mix in:\n1/4 cup (60 ml) olive oil\n1 tablespoon (4 g) dried Italian seasoning\n1 clove minced garlic\n1 minced yellow onion\n1 small bunch of minced parsley\n1 lightly beaten egg\nKosher salt and freshly ground black pepper, to taste Shape the mixture into 30 meatballs and chill them. Divide the meatball mixture into 30 evenly sized pieces. The meatballs should be 1.5 inches (3.8 cm) in size. Place them on a sheet and refrigerate the meatballs while you prepare the escarole. Consider using a small cookie scoop to divide the mixture into balls. Sauté the onions and sliced garlic for 10 minutes. Pour the remaining 1/4 cup (60 ml) of olive oil into a large saucepan and turn the heat to medium-high. Thinly slice the remaining 3 cloves of garlic and 2 medium yellow onions. Stir the garlic and onions into the oil. Cook and stir the onions and garlic until they're lightly brown and a little soft. This should take about 10 minutes. Use an 8-quart (7.5 liter) saucepan. Cut 2 large heads of escarole. Cut off the bottom ends of the escarole and discard them. If the escarole have tough cores, remove and discard them. Cut the escarole into 2-inch pieces and place them in a sink or bowl full of cold water. Swirl the leaves around to clean them and drain the water. Fill the sink or bowl 1 more time to wash them. Drain the leaves. Add the escarole and cook it for 6 minutes. Stir the escarole pieces into the sautéed onions and cook them until they wilt. This should take about 6 minutes at medium-high heat. Pour in the chicken stock and bring it to a boil. Add 8 cups (1.89 liters) of chicken stock to the escarole and turn the heat up to high. Bring the chicken stock to a vigorous boil. Reduce the heat, add the meatballs, and simmer the soup for 20 minutes. Turn the heat down to medium-low and stir in the chilled meatballs. Let the soup bubble gently for 20 minutes so the meatballs cook completely. Stir the soup occasionally to keep it from sticking to the bottom of the pan. Season and serve the escarole and meatball soup. Taste the soup and add salt and pepper according to your preferences. Serve the soup immediately with cooked white rice. Consider garnishing the soup with more parmesan cheese. You can store the leftover escarole and meatball soup in an airtight container in the refrigerator. Use the soup within 3 to 4 days.",
    "sentences": [
        " Sautéing Escarole with Garlic Wash the escarole 2 times.",
        "Peel away and discard any outer leaves that look bruised or damaged.",
        "Take a sharp knife and cut away the bottom stem from each head of escarole.",
        "Fill a clean sink or bowl with cold water and add the escarole leaves.",
        "Swish them around and drain the water.",
        "Fill the sink or bowl again and wash the leaves 1 more time before you drain the water.",
        "You should trim about 1 inch (2.5 cm) off of the bottoms.",
        "Boil the escarole for 5 minutes.",
        "Fill a large pot with water and add several pinches of salt.",
        "Turn the heat on to high and bring the water to boil.",
        "Add the washed escarole leaves and stir them a little.",
        "Boil the escarole for 5 minutes so it softens.",
        "Depending on the amount of escarole you have, you'll probably need at least a 3-quart (2.8 liter) pot.",
        "Sauté the garlic for 1 minute over medium heat.",
        "While the escarole is boiling, pour 2 tablespoons (30 ml) of olive oil into a large skillet.",
        "Turn the heat to medium and add 2 to 3 cloves of garlic that you've peeled and barely crushed with the palm of your hand.",
        "Stir the garlic and let it cook until it browns just a little.",
        "Remove the garlic and turn off the heat.",
        "Leave the oil to cool down in the skillet a little.",
        "It should now be flavored with garlic.",
        "Drain the escarole and add it to the skillet.",
        "Set a colander or strainer into the sink.",
        "Turn off the heat and slowly drain the escarole through the colander.",
        "Use tongs to transfer the escarole into the skillet with the garlic oil.",
        "It's alright if the escarole isn't completely dry or drained.",
        "Season and simmer the escarole for 5 minutes over medium heat.",
        "Sprinkle salt and pepper according to your taste over the escarole.",
        "Stir the escarole and turn the burner to medium heat so it begins to bubble gently.",
        "Put the lid on the skillet and simmer the escarole until it softens even more.",
        "Stir in optional ingredients and simmer for 5 more minutes.",
        "If you'd like to flavor the sautéed escarole with any additional ingredients, add them to the skillet and stir the escarole well.",
        "Put the lid back on the pot and simmer the escarole for another 5 minutes.",
        "Consider stirring in 1 or 2 of the following:\nA handful of capers, well washed and squeezed\nA handful of black olives\n4 anchovy fillets\nA handful of pine nuts\nA handful of raisins, soaked for 1 hour until soft and drained Check to see if the escarole is tender and serve it.",
        "Remove the lid and taste a little of the escarole to see if it's as soft as you like it.",
        "If it's too tough, put the lid back on and simmer it for 2 to 4 more minutes.",
        "If it's too watery, leave the lid off of the pot and increase the heat so the water evaporates.",
        "Serve the sautéed escarole with your favorite meat dish, roasted vegetables, or whole grains.",
        "Store the leftover escarole in an airtight container.",
        "Refrigerate the escarole and use it within 3 to 5 days.",
        "Making Spaghetti with Escarole and Bacon Fry the bacon over medium heat for 5 minutes.",
        "Place 1/4 pound (113 g) of bacon that's sliced crosswise into thin strips about 2 centimeters (0.8 in) thick in a deep skillet.",
        "Turn the heat to medium and stir the bacon occasionally as it cooks.",
        "Fry the bacon until it's crisp and brown.",
        "Transfer the cooked bacon to a small bowl and discard the grease from the skillet.",
        "The skillet should be at least 2 inches (5.1 cm) deep.",
        "Sauté the garlic, pepper flakes, and anchovy paste for 30 seconds.",
        "Pour 2 tablespoons (30 ml) of olive oil into the skillet you used to cook the bacon.",
        "Turn the heat to medium-low and stir in 3 cloves of minced garlic, 1/4 teaspoon (0.5 g) of red-pepper flakes, and 1 1/2 teaspoons (7.5 g) of anchovy paste.",
        "Continue to stir and cook the aromatics until you can smell them.",
        "This should take about 30 seconds.",
        "Slice the escarole into ⁄2 inch (1.3 cm) strips.",
        "Rinse 1 head of escarole and use a sharp knife to cut off the bottom stem.",
        "Remove and discard the bottom 1 inch (2.5 cm) of the head.",
        "Cut the leaves into ⁄2 inch (1.3 cm) strips.",
        "and fill a clean sink or bowl with cold water.",
        "Add the escarole leaves and swish them around.",
        "Drain and refill the sink with water before washing the leaves 1 more time.",
        "Drain the water again.",
        "Boil the spaghetti in salted water for 12 minutes.",
        "Bring a large pot of salted water to boil over high heat.",
        "Add 3/4 pound (340 g) of dry spaghetti to the boiling water and stir it to break up the noodles.",
        "Boil the pasta for 12 minutes, so it's just tender.",
        "Place a colander or strainer in the sink and drain the spaghetti into it.",
        "You'll need to use at least a 5-quart (4.7 liters) pot.",
        "Stir the escarole into the spiced oil and cook it for 3 minutes.",
        "Stir a handful of the escarole strips into the skillet.",
        "Continue to stir in the rest of the escarole and cook it over medium-low heat.",
        "The escarole should wilt after 3 minutes.",
        "Stir in the stock and bring it to a simmer.",
        "Pour 2/3 cup (160 ml) of chicken stock into the skillet with the escarole.",
        "Stir in 1/4 teaspoon (1.25 g) of the salt and cook the mixture until the stock begins to bubble gently.",
        "Reduce the heat and cook the covered mixture for 5 minutes.",
        "Turn the heat back down to medium-low and place a lid on the skillet.",
        "Let the escarole cook until it softens a little.",
        "Stir the pasta, parmesan, bacon, butter, and salt into the escarole.",
        "Remove the lid from the pot of escarole and stir in the drained spaghetti.",
        "Stir in 1/3 cup (33 g) of grated Parmesan, 1 tablespoon (14 g) butter, bacon, and the remaining 1/4 teaspoon (1.25 g) of salt.",
        "Serve the escarole pasta immediately.",
        "Store the leftover escarole pasta in an airtight container in the refrigerator for 3 to 4 days.",
        "Making Escarole and Meatball Soup Combine the meatball mixture.",
        "Place 1 pound (453 g) of ground beef into a mixing bowl and add ½ cups (45 g) of seasoned bread crumbs, ½ cups (50 g) of grated parmesan, and ½ cups (50 g) of grated pecorino.",
        "Use a spatula or your fingers to mix in:\n1/4 cup (60 ml) olive oil\n1 tablespoon (4 g) dried Italian seasoning\n1 clove minced garlic\n1 minced yellow onion\n1 small bunch of minced parsley\n1 lightly beaten egg\nKosher salt and freshly ground black pepper, to taste Shape the mixture into 30 meatballs and chill them.",
        "Divide the meatball mixture into 30 evenly sized pieces.",
        "The meatballs should be 1.5 inches (3.8 cm) in size.",
        "Place them on a sheet and refrigerate the meatballs while you prepare the escarole.",
        "Consider using a small cookie scoop to divide the mixture into balls.",
        "Sauté the onions and sliced garlic for 10 minutes.",
        "Pour the remaining 1/4 cup (60 ml) of olive oil into a large saucepan and turn the heat to medium-high.",
        "Thinly slice the remaining 3 cloves of garlic and 2 medium yellow onions.",
        "Stir the garlic and onions into the oil.",
        "Cook and stir the onions and garlic until they're lightly brown and a little soft.",
        "This should take about 10 minutes.",
        "Use an 8-quart (7.5 liter) saucepan.",
        "Cut 2 large heads of escarole.",
        "Cut off the bottom ends of the escarole and discard them.",
        "If the escarole have tough cores, remove and discard them.",
        "Cut the escarole into 2-inch pieces and place them in a sink or bowl full of cold water.",
        "Swirl the leaves around to clean them and drain the water.",
        "Fill the sink or bowl 1 more time to wash them.",
        "Drain the leaves.",
        "Add the escarole and cook it for 6 minutes.",
        "Stir the escarole pieces into the sautéed onions and cook them until they wilt.",
        "This should take about 6 minutes at medium-high heat.",
        "Pour in the chicken stock and bring it to a boil.",
        "Add 8 cups (1.89 liters) of chicken stock to the escarole and turn the heat up to high.",
        "Bring the chicken stock to a vigorous boil.",
        "Reduce the heat, add the meatballs, and simmer the soup for 20 minutes.",
        "Turn the heat down to medium-low and stir in the chilled meatballs.",
        "Let the soup bubble gently for 20 minutes so the meatballs cook completely.",
        "Stir the soup occasionally to keep it from sticking to the bottom of the pan.",
        "Season and serve the escarole and meatball soup.",
        "Taste the soup and add salt and pepper according to your preferences.",
        "Serve the soup immediately with cooked white rice.",
        "Consider garnishing the soup with more parmesan cheese.",
        "You can store the leftover escarole and meatball soup in an airtight container in the refrigerator.",
        "Use the soup within 3 to 4 days."
    ]
}