{
    "title": "How to Grow Scoby",
    "url": "https://www.wikihow.com/Grow-Scoby",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Tea",
        "Kombucha"
    ],
    "parts": [
        {
            "name": "Brewing Black Sweet Tea",
            "steps": [
                {
                    "headline": "Boil 2 cups (470 ml) of water in a pot.",
                    "description": "Measure 2 cups (470 ml) of water in a measuring cup and pour it into a large stainless steel pot. Place it on a burner and turn the burner on medium-high heat until it begins to boil."
                },
                {
                    "headline": "Add ⁄3 cup (79 ml) sugar to the pot and stir for 5 minutes.",
                    "description": "Once the water starts to boil, measure ⁄3 cup (79 ml) of white granulated sugar and add it to the pot. Stir the sugar into the water with a wooden spoon continuously to help the sugar dissolve. This should take about 5 minutes."
                },
                {
                    "headline": "Turn the burner off.",
                    "description": "Turn the burner off once the sugar has dissolved into the water. Keep the pot on the burner so that the sugar water stays warm but is no longer boiling."
                },
                {
                    "headline": "Add in 2 black tea bags and let them steep for 10-15 minutes.",
                    "description": "Drop in 2 black tea bags and use the wooden spoon to push them beneath the surface of the water. Stir the tea bags in the water a couple of times. Then, leave the pot alone for 10-15 minutes so that the tea bags can steep."
                },
                {
                    "headline": "Remove the tea bags and let the tea cool completely.",
                    "description": "After 10-15 minutes have passed, take the tea bags out of the pot and give the tea some time to cool down. Wait until the tea is at about room temperature (68 °F (20 °C)) before you do anything with it."
                }
            ]
        },
        {
            "name": "Creating an Environment for Growth",
            "steps": [
                {
                    "headline": "Pour the black tea into a sterile glass jar.",
                    "description": "Get a large wide-mouthed glass jar and be sure to clean it thoroughly so that no germs or bacteria grow in it. Then, pour in your room temperature tea. To easily and effectively clean your jar, wash it with hot water and vinegar."
                },
                {
                    "headline": "Add a bottle of store-bought kombucha tea.",
                    "description": "Get a bottle of raw organic kombucha tea and pour the entire contents of the bottle into your freshly brewed black tea. You can purchase a bottle of kombucha tea at a grocery store or online."
                },
                {
                    "headline": "Cover the jar with a paper towel and secure it with a rubber band.",
                    "description": "Lay a paper towel or cheesecloth over the  opening of your glass jar so that it’s completely covered. Then, secure the paper towel or cheesecloth by wrapping a rubber band around the top of the jar. Don’t cover the jar with a normal lid. The tea mixture has to have exposure to air through a breathable material in order for your scoby to grow. Without the rubber band, your tea mixture may attract fruit flies and other pests."
                },
                {
                    "headline": "Store scoby in a warm, dark place for 2-5 weeks.",
                    "description": "Place the jar in a dark place, such as a kitchen cabinet, and try to keep the temperature at 72–80 °F (22–27 °C). Wait about 2 weeks and then check on the tea mixture every day to see how developed the scoby has become. You can start using your scoby when it’s at least ⁄8 inch (0.32 cm) thick. If you store your tea mixture in an area that’s slightly cooler, it’ll take more time for your scoby to grow. If this is the case, consider placing a heating mat underneath the tea mixture to promote growth."
                }
            ]
        },
        {
            "name": "Using Your Scoby",
            "steps": [
                {
                    "headline": "Brew 5-7 bags of tea in 13–17 cups (3,100–4,000 ml) of water.",
                    "description": "Pour the water into a pot and set it on a burner. Turn the burner on to medium-high heat to bring the water to a boil. Then, turn the heat off, put the tea bags in, and let them steep for several minutes."
                },
                {
                    "headline": "Stir in 1 cup (240 ml) of sugar until it dissolves.",
                    "description": "Remove the tea bags. Then, measure 1 cup (240 ml) of sugar in a measuring cup and pour it into the freshly brewed tea. Stir the tea until the sugar has dissolved completely."
                },
                {
                    "headline": "Let the tea cool and transport it to a sterile glass jar.",
                    "description": "As you did before, let the tea cool down to about 68 °F (20 °C) before you transfer it to a new, clean glass jar that’s larger than the one you grew your scoby in. It’s extremely important that you let your tea cool completely, or else the heat may kill your scoby."
                },
                {
                    "headline": "Pour your scoby and starter tea into the new tea.",
                    "description": "After you’ve poured your freshly brewed tea into a clean jar, get out the jar of starter tea that your scoby is in. Simply pour the entire contents of the smaller jar into the larger jar. Then, cover the larger jar opening with a paper towel or cheesecloth and secure it with a rubber band. This is necessary because the scoby feeds on sugar and because your starter tea likely has an undesirable bitter taste at this point."
                },
                {
                    "headline": "Keep it at room temperature for 1-3 days to let it carbonate.",
                    "description": "Keep your freshly brewed kombucha tea out of direct sunlight and in a room temperature environment for a few days. This will make your tea sightly carbonated, as kombucha tea typically is."
                },
                {
                    "headline": "Store it in the refrigerator and drink it within a month.",
                    "description": "After a couple of days kept at room temperature, you’ll want to move it to the refrigerator, as refrigeration will stop fermentation and carbonation. Make sure to drink your kombucha tea within a month."
                }
            ]
        }
    ],
    "tyn": [
        "Measuring cup",
        "Water",
        "Stainless steel pot",
        "Granulated sugar",
        "Wooden spoon",
        "Black tea bags",
        "Sterile glass jars",
        "1 bottle of store-bought kombucha tea",
        "Paper towel or Cheesecloth",
        "Rubber band"
    ],
    "text": " Brewing Black Sweet Tea Boil 2 cups (470 ml) of water in a pot. Measure 2 cups (470 ml) of water in a measuring cup and pour it into a large stainless steel pot. Place it on a burner and turn the burner on medium-high heat until it begins to boil. Add ⁄3 cup (79 ml) sugar to the pot and stir for 5 minutes. Once the water starts to boil, measure ⁄3 cup (79 ml) of white granulated sugar and add it to the pot. Stir the sugar into the water with a wooden spoon continuously to help the sugar dissolve. This should take about 5 minutes. Turn the burner off. Turn the burner off once the sugar has dissolved into the water. Keep the pot on the burner so that the sugar water stays warm but is no longer boiling. Add in 2 black tea bags and let them steep for 10-15 minutes. Drop in 2 black tea bags and use the wooden spoon to push them beneath the surface of the water. Stir the tea bags in the water a couple of times. Then, leave the pot alone for 10-15 minutes so that the tea bags can steep. Remove the tea bags and let the tea cool completely. After 10-15 minutes have passed, take the tea bags out of the pot and give the tea some time to cool down. Wait until the tea is at about room temperature (68 °F (20 °C)) before you do anything with it. Creating an Environment for Growth Pour the black tea into a sterile glass jar. Get a large wide-mouthed glass jar and be sure to clean it thoroughly so that no germs or bacteria grow in it. Then, pour in your room temperature tea. To easily and effectively clean your jar, wash it with hot water and vinegar. Add a bottle of store-bought kombucha tea. Get a bottle of raw organic kombucha tea and pour the entire contents of the bottle into your freshly brewed black tea. You can purchase a bottle of kombucha tea at a grocery store or online. Cover the jar with a paper towel and secure it with a rubber band. Lay a paper towel or cheesecloth over the  opening of your glass jar so that it’s completely covered. Then, secure the paper towel or cheesecloth by wrapping a rubber band around the top of the jar. Don’t cover the jar with a normal lid. The tea mixture has to have exposure to air through a breathable material in order for your scoby to grow. Without the rubber band, your tea mixture may attract fruit flies and other pests. Store scoby in a warm, dark place for 2-5 weeks. Place the jar in a dark place, such as a kitchen cabinet, and try to keep the temperature at 72–80 °F (22–27 °C). Wait about 2 weeks and then check on the tea mixture every day to see how developed the scoby has become. You can start using your scoby when it’s at least ⁄8 inch (0.32 cm) thick. If you store your tea mixture in an area that’s slightly cooler, it’ll take more time for your scoby to grow. If this is the case, consider placing a heating mat underneath the tea mixture to promote growth. Using Your Scoby Brew 5-7 bags of tea in 13–17 cups (3,100–4,000 ml) of water. Pour the water into a pot and set it on a burner. Turn the burner on to medium-high heat to bring the water to a boil. Then, turn the heat off, put the tea bags in, and let them steep for several minutes. Stir in 1 cup (240 ml) of sugar until it dissolves. Remove the tea bags. Then, measure 1 cup (240 ml) of sugar in a measuring cup and pour it into the freshly brewed tea. Stir the tea until the sugar has dissolved completely. Let the tea cool and transport it to a sterile glass jar. As you did before, let the tea cool down to about 68 °F (20 °C) before you transfer it to a new, clean glass jar that’s larger than the one you grew your scoby in. It’s extremely important that you let your tea cool completely, or else the heat may kill your scoby. Pour your scoby and starter tea into the new tea. After you’ve poured your freshly brewed tea into a clean jar, get out the jar of starter tea that your scoby is in. Simply pour the entire contents of the smaller jar into the larger jar. Then, cover the larger jar opening with a paper towel or cheesecloth and secure it with a rubber band. This is necessary because the scoby feeds on sugar and because your starter tea likely has an undesirable bitter taste at this point. Keep it at room temperature for 1-3 days to let it carbonate. Keep your freshly brewed kombucha tea out of direct sunlight and in a room temperature environment for a few days. This will make your tea sightly carbonated, as kombucha tea typically is. Store it in the refrigerator and drink it within a month. After a couple of days kept at room temperature, you’ll want to move it to the refrigerator, as refrigeration will stop fermentation and carbonation. Make sure to drink your kombucha tea within a month.",
    "sentences": [
        " Brewing Black Sweet Tea Boil 2 cups (470 ml) of water in a pot.",
        "Measure 2 cups (470 ml) of water in a measuring cup and pour it into a large stainless steel pot.",
        "Place it on a burner and turn the burner on medium-high heat until it begins to boil.",
        "Add ⁄3 cup (79 ml) sugar to the pot and stir for 5 minutes.",
        "Once the water starts to boil, measure ⁄3 cup (79 ml) of white granulated sugar and add it to the pot.",
        "Stir the sugar into the water with a wooden spoon continuously to help the sugar dissolve.",
        "This should take about 5 minutes.",
        "Turn the burner off.",
        "Turn the burner off once the sugar has dissolved into the water.",
        "Keep the pot on the burner so that the sugar water stays warm but is no longer boiling.",
        "Add in 2 black tea bags and let them steep for 10-15 minutes.",
        "Drop in 2 black tea bags and use the wooden spoon to push them beneath the surface of the water.",
        "Stir the tea bags in the water a couple of times.",
        "Then, leave the pot alone for 10-15 minutes so that the tea bags can steep.",
        "Remove the tea bags and let the tea cool completely.",
        "After 10-15 minutes have passed, take the tea bags out of the pot and give the tea some time to cool down.",
        "Wait until the tea is at about room temperature (68 °F (20 °C)) before you do anything with it.",
        "Creating an Environment for Growth Pour the black tea into a sterile glass jar.",
        "Get a large wide-mouthed glass jar and be sure to clean it thoroughly so that no germs or bacteria grow in it.",
        "Then, pour in your room temperature tea.",
        "To easily and effectively clean your jar, wash it with hot water and vinegar.",
        "Add a bottle of store-bought kombucha tea.",
        "Get a bottle of raw organic kombucha tea and pour the entire contents of the bottle into your freshly brewed black tea.",
        "You can purchase a bottle of kombucha tea at a grocery store or online.",
        "Cover the jar with a paper towel and secure it with a rubber band.",
        "Lay a paper towel or cheesecloth over the  opening of your glass jar so that it’s completely covered.",
        "Then, secure the paper towel or cheesecloth by wrapping a rubber band around the top of the jar.",
        "Don’t cover the jar with a normal lid.",
        "The tea mixture has to have exposure to air through a breathable material in order for your scoby to grow.",
        "Without the rubber band, your tea mixture may attract fruit flies and other pests.",
        "Store scoby in a warm, dark place for 2-5 weeks.",
        "Place the jar in a dark place, such as a kitchen cabinet, and try to keep the temperature at 72–80 °F (22–27 °C).",
        "Wait about 2 weeks and then check on the tea mixture every day to see how developed the scoby has become.",
        "You can start using your scoby when it’s at least ⁄8 inch (0.32 cm) thick.",
        "If you store your tea mixture in an area that’s slightly cooler, it’ll take more time for your scoby to grow.",
        "If this is the case, consider placing a heating mat underneath the tea mixture to promote growth.",
        "Using Your Scoby Brew 5-7 bags of tea in 13–17 cups (3,100–4,000 ml) of water.",
        "Pour the water into a pot and set it on a burner.",
        "Turn the burner on to medium-high heat to bring the water to a boil.",
        "Then, turn the heat off, put the tea bags in, and let them steep for several minutes.",
        "Stir in 1 cup (240 ml) of sugar until it dissolves.",
        "Remove the tea bags.",
        "Then, measure 1 cup (240 ml) of sugar in a measuring cup and pour it into the freshly brewed tea.",
        "Stir the tea until the sugar has dissolved completely.",
        "Let the tea cool and transport it to a sterile glass jar.",
        "As you did before, let the tea cool down to about 68 °F (20 °C) before you transfer it to a new, clean glass jar that’s larger than the one you grew your scoby in.",
        "It’s extremely important that you let your tea cool completely, or else the heat may kill your scoby.",
        "Pour your scoby and starter tea into the new tea.",
        "After you’ve poured your freshly brewed tea into a clean jar, get out the jar of starter tea that your scoby is in.",
        "Simply pour the entire contents of the smaller jar into the larger jar.",
        "Then, cover the larger jar opening with a paper towel or cheesecloth and secure it with a rubber band.",
        "This is necessary because the scoby feeds on sugar and because your starter tea likely has an undesirable bitter taste at this point.",
        "Keep it at room temperature for 1-3 days to let it carbonate.",
        "Keep your freshly brewed kombucha tea out of direct sunlight and in a room temperature environment for a few days.",
        "This will make your tea sightly carbonated, as kombucha tea typically is.",
        "Store it in the refrigerator and drink it within a month.",
        "After a couple of days kept at room temperature, you’ll want to move it to the refrigerator, as refrigeration will stop fermentation and carbonation.",
        "Make sure to drink your kombucha tea within a month."
    ]
}