{
    "title": "How to Clean a Fuel Filter",
    "url": "https://www.wikihow.com/Clean-a-Fuel-Filter",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars",
        "Car Maintenance and Repair",
        "Exhaust and Fuel Parts"
    ],
    "parts": [
        {
            "name": "Removing the Filter",
            "steps": [
                {
                    "headline": "Relieve the pressure in your fuel system.",
                    "description": "Check your owner's manual to find the fuse for your fuel pump. Remove it, then start your engine and let it run for 1 to 2 minutes. It might sputter out before the time's up, which means the pressure is relieved. While the engine might sputter out, this isn't necessary to relieve the pressure. Running it for 1 to 2 minutes will do the trick. Make sure your car is parked in a level, well-ventilated area."
                },
                {
                    "headline": "Disconnect the negative terminal on your battery.",
                    "description": "Turn your car off, then open the hood. Find the negative terminal on your battery, and use a wrench to remove the cable. Tuck the cable on the side of the battery so it doesn't accidentally come into contact with its terminal. The negative terminal is marked with a minus sign (-), and the positive terminal with a plus sign (+). If your terminals are colored red and black, the negative terminal is the black one. If you don't disconnect the battery, sparks could ignite gas fumes and residue that drips from the fuel lines."
                },
                {
                    "headline": "Locate the fuel filter.",
                    "description": "Locations vary by make and model, so check your owner's manual. It'll be somewhere along the fuel line between the engine and gas tank. A common spot is under the car just past the fuel pump. In some models, it's housed in the engine bay."
                },
                {
                    "headline": "Jack up your car if necessary.",
                    "description": "Slide a jack under one of your vehicle's jack points, then pump or twist the handle to raise the car. Place jack stands beneath the car near the jack, then lower the jack until the car sits on the stands. Check your manual to identify your vehicle's jack points. Don't rely on a jack alone to hold your vehicle's weight. Never work under a vehicle that's not supported by jack stands."
                },
                {
                    "headline": "Place a bucket or jar under the filter to catch fuel.",
                    "description": "When you detach the fuel lines from the filter, any gas remaining in the lines will spill. A bucket or jar underneath the filter area will catch spilled gas."
                },
                {
                    "headline": "Detach the clips that fasten the fuel line to the filter.",
                    "description": "The exact design of the clips that hold the lines to the filter vary by model. Check your manual or look online for your vehicle's design. You'll either use a flathead screwdriver to pop them out or pull them out by hand."
                },
                {
                    "headline": "Remove the fuel lines.",
                    "description": "Use a wrench or hose clamps to slide the fuel lines off of the filter. Pop the lines off of the nozzles on either end of the filter. As you remove the lines, make sure to angle them toward the bucket or jar to catch any gas that drips. Wear gloves and protective eyewear when you detach the fuel lines."
                },
                {
                    "headline": "Remove the filter from its bracket.",
                    "description": "Depending on your vehicle, you'll either slide the filter out of a bracket or loosen bolts that hold it in place. Look around your filter for bolts or check your manual. Before you slide out the filter, note its position so you'll know how to correctly reinstall it."
                }
            ]
        },
        {
            "name": "Cleaning the Filter",
            "steps": [
                {
                    "headline": "Pour out any gas remaining in the filter.",
                    "description": "There might be residual gas in the filter. Gently tap both the fuel-in and fuel-out nozzles into the container you used to catch spilled gas from the fuel lines. The nozzles are located at each end of the filter."
                },
                {
                    "headline": "Spray the filter with a pressurized carburetor cleaner.",
                    "description": "Purchase a cleaner in a pressurized container that comes with a small application straw. Attach the straw to the container's spout, then spray inside each nozzle. You can find a pressurized cleaner at your local automotive store. Ask an employee to recommend a product that safe to use on fuel filters."
                },
                {
                    "headline": "Tap out loosened debris, then dry the filter for an hour.",
                    "description": "Carefully knock the filter against the side of the container you used to catch spilled gas. Let the spray and any loose debris fall out of each nozzle. Spray the nozzles one more time, tap out debris, and let the filter air dry for at least 1 hour."
                }
            ]
        },
        {
            "name": "Reinstalling the Filter",
            "steps": [
                {
                    "headline": "Slide the filter into its bracket.",
                    "description": "Be sure to slide the filter back into its bracket in the correct position. If necessary, replace any bolts you removed."
                },
                {
                    "headline": "Replace the fuel lines and clips.",
                    "description": "Slide the fuel lines back into each nozzle. Make sure you've reconnected the lines tightly to prevent leaks. Then pop the clips that fasten the lines to the nozzles back into place."
                },
                {
                    "headline": "Lower your car if necessary, then reconnect the battery and fuse.",
                    "description": "If you jacked up your car, jack it higher to remove the stands, then lower it to the ground. Use a wrench to reconnect the cable on the battery's negative terminal, and replace the fuel pump fuse."
                },
                {
                    "headline": "Start your engine and check for fuel leaks.",
                    "description": "After reconnecting the battery and fuse, run your engine for a few minutes. Since the fuel system's pressure needs to be reestablished, it might take a few tries before it starts. While it runs, check under your car for fuel leaks. If you spot leaks, you'll need to disconnect the battery, jack the car up (if necessary), and tighten the fuel lines. If your engine won't start after a few minutes, double check your fuses. If your dashboard and dome lights are dim or won't turn on, your battery might need to be jumped. If the fuses and battery are fine, make sure you reinstalled the filter correctly and that the fuel lines are tight. Contact your mechanic if none of these troubleshooting methods work."
                },
                {
                    "headline": "Dispose of the old gas.",
                    "description": "If the gasoline you've collected from your fuel lines and filter isn't badly contaminated with debris, you could use it in a lawn mower or other gas-fueled equipment. If it's loaded with debris and unusable, transfer it to a gasoline container and bring it to a disposal center. To find a disposal center, contact your city or county waste management authority or your local fire department. You could also call a nearby automotive shop and ask if they dispose of gas for free. It's illegal to throw away gas in the trash or to pour it down a drain, even in small amounts. Keep the container sealed during transport and never smoke or light a flame near gasoline."
                }
            ]
        }
    ],
    "tyn": [
        "Adjustable wrench",
        "Flathead screwdriver",
        "Protective gloves and eyewear",
        "Hose clamps",
        "Bucket or large jar",
        "Pressurized carburetor cleaner",
        "Jack and jack stands (if necessary)"
    ],
    "text": " Removing the Filter Relieve the pressure in your fuel system. Check your owner's manual to find the fuse for your fuel pump. Remove it, then start your engine and let it run for 1 to 2 minutes. It might sputter out before the time's up, which means the pressure is relieved. While the engine might sputter out, this isn't necessary to relieve the pressure. Running it for 1 to 2 minutes will do the trick. Make sure your car is parked in a level, well-ventilated area. Disconnect the negative terminal on your battery. Turn your car off, then open the hood. Find the negative terminal on your battery, and use a wrench to remove the cable. Tuck the cable on the side of the battery so it doesn't accidentally come into contact with its terminal. The negative terminal is marked with a minus sign (-), and the positive terminal with a plus sign (+). If your terminals are colored red and black, the negative terminal is the black one. If you don't disconnect the battery, sparks could ignite gas fumes and residue that drips from the fuel lines. Locate the fuel filter. Locations vary by make and model, so check your owner's manual. It'll be somewhere along the fuel line between the engine and gas tank. A common spot is under the car just past the fuel pump. In some models, it's housed in the engine bay. Jack up your car if necessary. Slide a jack under one of your vehicle's jack points, then pump or twist the handle to raise the car. Place jack stands beneath the car near the jack, then lower the jack until the car sits on the stands. Check your manual to identify your vehicle's jack points. Don't rely on a jack alone to hold your vehicle's weight. Never work under a vehicle that's not supported by jack stands. Place a bucket or jar under the filter to catch fuel. When you detach the fuel lines from the filter, any gas remaining in the lines will spill. A bucket or jar underneath the filter area will catch spilled gas. Detach the clips that fasten the fuel line to the filter. The exact design of the clips that hold the lines to the filter vary by model. Check your manual or look online for your vehicle's design. You'll either use a flathead screwdriver to pop them out or pull them out by hand. Remove the fuel lines. Use a wrench or hose clamps to slide the fuel lines off of the filter. Pop the lines off of the nozzles on either end of the filter. As you remove the lines, make sure to angle them toward the bucket or jar to catch any gas that drips. Wear gloves and protective eyewear when you detach the fuel lines. Remove the filter from its bracket. Depending on your vehicle, you'll either slide the filter out of a bracket or loosen bolts that hold it in place. Look around your filter for bolts or check your manual. Before you slide out the filter, note its position so you'll know how to correctly reinstall it. Cleaning the Filter Pour out any gas remaining in the filter. There might be residual gas in the filter. Gently tap both the fuel-in and fuel-out nozzles into the container you used to catch spilled gas from the fuel lines. The nozzles are located at each end of the filter. Spray the filter with a pressurized carburetor cleaner. Purchase a cleaner in a pressurized container that comes with a small application straw. Attach the straw to the container's spout, then spray inside each nozzle. You can find a pressurized cleaner at your local automotive store. Ask an employee to recommend a product that safe to use on fuel filters. Tap out loosened debris, then dry the filter for an hour. Carefully knock the filter against the side of the container you used to catch spilled gas. Let the spray and any loose debris fall out of each nozzle. Spray the nozzles one more time, tap out debris, and let the filter air dry for at least 1 hour. Reinstalling the Filter Slide the filter into its bracket. Be sure to slide the filter back into its bracket in the correct position. If necessary, replace any bolts you removed. Replace the fuel lines and clips. Slide the fuel lines back into each nozzle. Make sure you've reconnected the lines tightly to prevent leaks. Then pop the clips that fasten the lines to the nozzles back into place. Lower your car if necessary, then reconnect the battery and fuse. If you jacked up your car, jack it higher to remove the stands, then lower it to the ground. Use a wrench to reconnect the cable on the battery's negative terminal, and replace the fuel pump fuse. Start your engine and check for fuel leaks. After reconnecting the battery and fuse, run your engine for a few minutes. Since the fuel system's pressure needs to be reestablished, it might take a few tries before it starts. While it runs, check under your car for fuel leaks. If you spot leaks, you'll need to disconnect the battery, jack the car up (if necessary), and tighten the fuel lines. If your engine won't start after a few minutes, double check your fuses. If your dashboard and dome lights are dim or won't turn on, your battery might need to be jumped. If the fuses and battery are fine, make sure you reinstalled the filter correctly and that the fuel lines are tight. Contact your mechanic if none of these troubleshooting methods work. Dispose of the old gas. If the gasoline you've collected from your fuel lines and filter isn't badly contaminated with debris, you could use it in a lawn mower or other gas-fueled equipment. If it's loaded with debris and unusable, transfer it to a gasoline container and bring it to a disposal center. To find a disposal center, contact your city or county waste management authority or your local fire department. You could also call a nearby automotive shop and ask if they dispose of gas for free. It's illegal to throw away gas in the trash or to pour it down a drain, even in small amounts. Keep the container sealed during transport and never smoke or light a flame near gasoline.",
    "sentences": [
        " Removing the Filter Relieve the pressure in your fuel system.",
        "Check your owner's manual to find the fuse for your fuel pump.",
        "Remove it, then start your engine and let it run for 1 to 2 minutes.",
        "It might sputter out before the time's up, which means the pressure is relieved.",
        "While the engine might sputter out, this isn't necessary to relieve the pressure.",
        "Running it for 1 to 2 minutes will do the trick.",
        "Make sure your car is parked in a level, well-ventilated area.",
        "Disconnect the negative terminal on your battery.",
        "Turn your car off, then open the hood.",
        "Find the negative terminal on your battery, and use a wrench to remove the cable.",
        "Tuck the cable on the side of the battery so it doesn't accidentally come into contact with its terminal.",
        "The negative terminal is marked with a minus sign (-), and the positive terminal with a plus sign (+).",
        "If your terminals are colored red and black, the negative terminal is the black one.",
        "If you don't disconnect the battery, sparks could ignite gas fumes and residue that drips from the fuel lines.",
        "Locate the fuel filter.",
        "Locations vary by make and model, so check your owner's manual.",
        "It'll be somewhere along the fuel line between the engine and gas tank.",
        "A common spot is under the car just past the fuel pump.",
        "In some models, it's housed in the engine bay.",
        "Jack up your car if necessary.",
        "Slide a jack under one of your vehicle's jack points, then pump or twist the handle to raise the car.",
        "Place jack stands beneath the car near the jack, then lower the jack until the car sits on the stands.",
        "Check your manual to identify your vehicle's jack points.",
        "Don't rely on a jack alone to hold your vehicle's weight.",
        "Never work under a vehicle that's not supported by jack stands.",
        "Place a bucket or jar under the filter to catch fuel.",
        "When you detach the fuel lines from the filter, any gas remaining in the lines will spill.",
        "A bucket or jar underneath the filter area will catch spilled gas.",
        "Detach the clips that fasten the fuel line to the filter.",
        "The exact design of the clips that hold the lines to the filter vary by model.",
        "Check your manual or look online for your vehicle's design.",
        "You'll either use a flathead screwdriver to pop them out or pull them out by hand.",
        "Remove the fuel lines.",
        "Use a wrench or hose clamps to slide the fuel lines off of the filter.",
        "Pop the lines off of the nozzles on either end of the filter.",
        "As you remove the lines, make sure to angle them toward the bucket or jar to catch any gas that drips.",
        "Wear gloves and protective eyewear when you detach the fuel lines.",
        "Remove the filter from its bracket.",
        "Depending on your vehicle, you'll either slide the filter out of a bracket or loosen bolts that hold it in place.",
        "Look around your filter for bolts or check your manual.",
        "Before you slide out the filter, note its position so you'll know how to correctly reinstall it.",
        "Cleaning the Filter Pour out any gas remaining in the filter.",
        "There might be residual gas in the filter.",
        "Gently tap both the fuel-in and fuel-out nozzles into the container you used to catch spilled gas from the fuel lines.",
        "The nozzles are located at each end of the filter.",
        "Spray the filter with a pressurized carburetor cleaner.",
        "Purchase a cleaner in a pressurized container that comes with a small application straw.",
        "Attach the straw to the container's spout, then spray inside each nozzle.",
        "You can find a pressurized cleaner at your local automotive store.",
        "Ask an employee to recommend a product that safe to use on fuel filters.",
        "Tap out loosened debris, then dry the filter for an hour.",
        "Carefully knock the filter against the side of the container you used to catch spilled gas.",
        "Let the spray and any loose debris fall out of each nozzle.",
        "Spray the nozzles one more time, tap out debris, and let the filter air dry for at least 1 hour.",
        "Reinstalling the Filter Slide the filter into its bracket.",
        "Be sure to slide the filter back into its bracket in the correct position.",
        "If necessary, replace any bolts you removed.",
        "Replace the fuel lines and clips.",
        "Slide the fuel lines back into each nozzle.",
        "Make sure you've reconnected the lines tightly to prevent leaks.",
        "Then pop the clips that fasten the lines to the nozzles back into place.",
        "Lower your car if necessary, then reconnect the battery and fuse.",
        "If you jacked up your car, jack it higher to remove the stands, then lower it to the ground.",
        "Use a wrench to reconnect the cable on the battery's negative terminal, and replace the fuel pump fuse.",
        "Start your engine and check for fuel leaks.",
        "After reconnecting the battery and fuse, run your engine for a few minutes.",
        "Since the fuel system's pressure needs to be reestablished, it might take a few tries before it starts.",
        "While it runs, check under your car for fuel leaks.",
        "If you spot leaks, you'll need to disconnect the battery, jack the car up (if necessary), and tighten the fuel lines.",
        "If your engine won't start after a few minutes, double check your fuses.",
        "If your dashboard and dome lights are dim or won't turn on, your battery might need to be jumped.",
        "If the fuses and battery are fine, make sure you reinstalled the filter correctly and that the fuel lines are tight.",
        "Contact your mechanic if none of these troubleshooting methods work.",
        "Dispose of the old gas.",
        "If the gasoline you've collected from your fuel lines and filter isn't badly contaminated with debris, you could use it in a lawn mower or other gas-fueled equipment.",
        "If it's loaded with debris and unusable, transfer it to a gasoline container and bring it to a disposal center.",
        "To find a disposal center, contact your city or county waste management authority or your local fire department.",
        "You could also call a nearby automotive shop and ask if they dispose of gas for free.",
        "It's illegal to throw away gas in the trash or to pour it down a drain, even in small amounts.",
        "Keep the container sealed during transport and never smoke or light a flame near gasoline."
    ]
}