{
    "title": "How to Hang a Tapestry in a Dorm Room",
    "url": "https://www.wikihow.com/Hang-a-Tapestry-in-a-Dorm-Room",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "methods": [
        {
            "name": "Securing a Tapestry with Push Pins",
            "steps": [
                {
                    "headline": "Ask your RA or dorm advisor before using push pins.",
                    "description": "The easiest damage-free way to hang a tapestry is with push pins. Push pins leave much smaller holes in the wall than nails or screws and are often allowed when decorating a dorm. That being said, some dorms do not allow push pins—ask your dorm advisor before using them to make sure you don't damage the wall. Using push pins against your college's regulations can result in fees. Push pins work best with tapestries made of light fabrics."
                },
                {
                    "headline": "Use push pins if you have a drywall or wood wall in your dorm.",
                    "description": "Push pins stick into drywall and wood easily and hold up over time. Plaster walls, on the other hand, are thicker and do not usually work with push pins. If your dorm has plaster walls, try a different hanging method (like adhesive hooks or velcro). Cork also works well with push pins, though having a wall made entirely of cork is unlikely."
                },
                {
                    "headline": "Stick 4 push pins in each corner of the wall.",
                    "description": "Measure the height and length of your tapestry with measuring tape. Position the 4 push pins apart at the distance you recorded. Do not push the pins too tightly into the wall yet, as you'll need to remove or reposition them as you work."
                },
                {
                    "headline": "Remove 1 push pin at a time to secure the tapestry on the wall.",
                    "description": "Some tapestry will have tabs on each corner that you can hook on the pins, but others will need to be pinned to the wall. Remove a push pin from the wall and position the corresponding corner of the tapestry where the pin had been. Push the pin in the wall again to secure the tapestry corner, then repeat the process with the remaining 3 corners. Push down hard on the pin with your thumb to secure it in the wall. Reposition the push pins as you work if you miscalculated the distance of the tapestry."
                },
                {
                    "headline": "Add more push pins if your tapestry seems to droop.",
                    "description": "The larger your tapestry is, the more push pins it will probably need. If your tapestry bunches in the middle or the sides, use more push pins to secure the tapestry to the wall."
                }
            ]
        },
        {
            "name": "Hanging a Tapestry with Clothespins",
            "steps": [
                {
                    "headline": "Buy 2 adhesive wall strips and 2 clothespins from a craft store.",
                    "description": "Medium to large-sized clothespins work best for hanging tapestries. Choose adhesive wall strips that are approximately the same size as your clothespins. If no wall strips match the exact size of your clothespins, go a size larger—you can always trim them as needed later."
                },
                {
                    "headline": "Stick the wall adhesive strips to the clothespins.",
                    "description": "Attach the clothespin to one side of the wall adhesive strip. Press the strip and clothespin together tightly to keep either from detaching as you hang the tapestry. If you wall adhesive strips are not double-sided, a wood glue to glue the clothespins to the strips. If the wall adhesive strips are too large, cut them to size with scissors before gluing."
                },
                {
                    "headline": "Press the clothespins onto the wall.",
                    "description": "Measure the length of your tapestry and attach the clothespins so they can hold up both ends of the tapestry. Follow the wall adhesive strip directions carefully so the clothespins stay secure on the wall. If your tapestry is large, purchase and attach 3 clothespins to the wall—one on both ends and one in the middle."
                },
                {
                    "headline": "Attach the tapestry to the clothespins.",
                    "description": "When you've clamped the tapestry down with the clothespins, stand back and inspect it. If your tapestry appears to droop in the middle, you may not have spread your clothespins out enough. Re-apply the clothespins to the wall or add a third clothespin in the middle to prevent drooping. If you need to re-apply the clothespins, you may need to replace the wall adhesive strips. Some lose their sticking properties each time they are removed to the wall. The clothespin method is best for thin tapestries--thicker ones might not stay as tightly clamped."
                }
            ]
        },
        {
            "name": "Velcroing a Tapestry to the Wall",
            "steps": [
                {
                    "headline": "Use velcro on thicker fabric tapestries.",
                    "description": "If your tapestry is too thick for clothespins, velcro may keep it adhered to the wall better. Although this method can also be used on paper tapestries, it is not ideal. If you need to remove the velcro strips, you risk tearing the tapestry."
                },
                {
                    "headline": "Adhere 4-6 velcro strips to the wall.",
                    "description": "Apply 1 velcro strip for each corner of the tapestry. If your tapestry is larger, apply velcro strips to the sides as well. Adhere the rough side of the velcro strips to the wall to keep your tapestry securely attached to the wall. Measure your tapestry beforehand so you know how far apart to align the velcro strips."
                },
                {
                    "headline": "Adhere 4-6 velcro strips to the tapestry.",
                    "description": "Apply the soft side of the velcro strips to the tapestry on its 4 corners and its sides, if applicable. Align your tapestry with the wall as you attach the velcro strips to make sure they are evenly spaced."
                },
                {
                    "headline": "Hang your tapestry to the wall with the velcro strips.",
                    "description": "Press down on the velcro strips as you attach them to keep the tapestry from falling down later. If your velcro strips are not equally aligned, remove the side attached to the tapestry and re-align it with the wall."
                }
            ]
        },
        {
            "name": "Using Adhesive Wall Hooks",
            "steps": [
                {
                    "headline": "Buy a curtain rod approximately the same length as your tapestry.",
                    "description": "A curtain rod will keep your tapestry from bunching or bowing in the middle as you hang it. The rod should be long but thin, no thicker than ⁄2–1 inch (1.3–2.5 cm). Pick a simple curtain rod so it does not take attention away from the tapestry."
                },
                {
                    "headline": "Attach the curtain rod to the wall tapestry.",
                    "description": "Some tapestries made for curtain rods have built-in curtain rod pockets or holes for curtain loops. For those without built-in holes, use clamp binder clips along the top of the tapestry. Loop the clips through the curtain rod to keep your curtain rod and tapestry attached."
                },
                {
                    "headline": "Adhere 2 adhesive wall hooks to the wall.",
                    "description": "Buy 2 adhesive wall strips with hooks at as wide as and at least half as tall as your curtain rod. Follow the directions carefully to attach the hooks securely to the wall. Measure the length of the curtain rod so you know how far apart to space the wall hooks."
                },
                {
                    "headline": "Place the curtain rod and tapestry over the adhesive wall strips.",
                    "description": "Most adhesive wall hooks need at least an hour to cure. When they have finished curing, hang the curtain rod over the 2 adhesive wall strips."
                },
                {
                    "headline": "Hang the tapestry directly to the hooks for a more relaxed feel.",
                    "description": "If the tapestry is made of a thin fabric, a curtain rod may not be necessary. As long as you don't mind the fabric dipping in the middle, wall hooks can support the tapestry on their own. Hang your tapestry directly to the adhesive wall hooks."
                }
            ]
        }
    ],
    "tyn": [
        "Securing a Tapestry with Push Pins",
        "4-8 push pins",
        "Measuring tape",
        "Hanging a Tapestry with Clothespins",
        "Clothespins",
        "Adhesive wall strips",
        "Scissors",
        "Wood glue (optional)",
        "Velcroing a Tapestry to the Wall",
        "4-6 velcro strips",
        "Using Adhesive Wall Hooks",
        "2 adhesive wall hooks",
        "Curtain rod",
        "Binder clips"
    ],
    "text": " Securing a Tapestry with Push Pins Ask your RA or dorm advisor before using push pins. The easiest damage-free way to hang a tapestry is with push pins. Push pins leave much smaller holes in the wall than nails or screws and are often allowed when decorating a dorm. That being said, some dorms do not allow push pins—ask your dorm advisor before using them to make sure you don't damage the wall. Using push pins against your college's regulations can result in fees. Push pins work best with tapestries made of light fabrics. Use push pins if you have a drywall or wood wall in your dorm. Push pins stick into drywall and wood easily and hold up over time. Plaster walls, on the other hand, are thicker and do not usually work with push pins. If your dorm has plaster walls, try a different hanging method (like adhesive hooks or velcro). Cork also works well with push pins, though having a wall made entirely of cork is unlikely. Stick 4 push pins in each corner of the wall. Measure the height and length of your tapestry with measuring tape. Position the 4 push pins apart at the distance you recorded. Do not push the pins too tightly into the wall yet, as you'll need to remove or reposition them as you work. Remove 1 push pin at a time to secure the tapestry on the wall. Some tapestry will have tabs on each corner that you can hook on the pins, but others will need to be pinned to the wall. Remove a push pin from the wall and position the corresponding corner of the tapestry where the pin had been. Push the pin in the wall again to secure the tapestry corner, then repeat the process with the remaining 3 corners. Push down hard on the pin with your thumb to secure it in the wall. Reposition the push pins as you work if you miscalculated the distance of the tapestry. Add more push pins if your tapestry seems to droop. The larger your tapestry is, the more push pins it will probably need. If your tapestry bunches in the middle or the sides, use more push pins to secure the tapestry to the wall. Hanging a Tapestry with Clothespins Buy 2 adhesive wall strips and 2 clothespins from a craft store. Medium to large-sized clothespins work best for hanging tapestries. Choose adhesive wall strips that are approximately the same size as your clothespins. If no wall strips match the exact size of your clothespins, go a size larger—you can always trim them as needed later. Stick the wall adhesive strips to the clothespins. Attach the clothespin to one side of the wall adhesive strip. Press the strip and clothespin together tightly to keep either from detaching as you hang the tapestry. If you wall adhesive strips are not double-sided, a wood glue to glue the clothespins to the strips. If the wall adhesive strips are too large, cut them to size with scissors before gluing. Press the clothespins onto the wall. Measure the length of your tapestry and attach the clothespins so they can hold up both ends of the tapestry. Follow the wall adhesive strip directions carefully so the clothespins stay secure on the wall. If your tapestry is large, purchase and attach 3 clothespins to the wall—one on both ends and one in the middle. Attach the tapestry to the clothespins. When you've clamped the tapestry down with the clothespins, stand back and inspect it. If your tapestry appears to droop in the middle, you may not have spread your clothespins out enough. Re-apply the clothespins to the wall or add a third clothespin in the middle to prevent drooping. If you need to re-apply the clothespins, you may need to replace the wall adhesive strips. Some lose their sticking properties each time they are removed to the wall. The clothespin method is best for thin tapestries--thicker ones might not stay as tightly clamped. Velcroing a Tapestry to the Wall Use velcro on thicker fabric tapestries. If your tapestry is too thick for clothespins, velcro may keep it adhered to the wall better. Although this method can also be used on paper tapestries, it is not ideal. If you need to remove the velcro strips, you risk tearing the tapestry. Adhere 4-6 velcro strips to the wall. Apply 1 velcro strip for each corner of the tapestry. If your tapestry is larger, apply velcro strips to the sides as well. Adhere the rough side of the velcro strips to the wall to keep your tapestry securely attached to the wall. Measure your tapestry beforehand so you know how far apart to align the velcro strips. Adhere 4-6 velcro strips to the tapestry. Apply the soft side of the velcro strips to the tapestry on its 4 corners and its sides, if applicable. Align your tapestry with the wall as you attach the velcro strips to make sure they are evenly spaced. Hang your tapestry to the wall with the velcro strips. Press down on the velcro strips as you attach them to keep the tapestry from falling down later. If your velcro strips are not equally aligned, remove the side attached to the tapestry and re-align it with the wall. Using Adhesive Wall Hooks Buy a curtain rod approximately the same length as your tapestry. A curtain rod will keep your tapestry from bunching or bowing in the middle as you hang it. The rod should be long but thin, no thicker than ⁄2–1 inch (1.3–2.5 cm). Pick a simple curtain rod so it does not take attention away from the tapestry. Attach the curtain rod to the wall tapestry. Some tapestries made for curtain rods have built-in curtain rod pockets or holes for curtain loops. For those without built-in holes, use clamp binder clips along the top of the tapestry. Loop the clips through the curtain rod to keep your curtain rod and tapestry attached. Adhere 2 adhesive wall hooks to the wall. Buy 2 adhesive wall strips with hooks at as wide as and at least half as tall as your curtain rod. Follow the directions carefully to attach the hooks securely to the wall. Measure the length of the curtain rod so you know how far apart to space the wall hooks. Place the curtain rod and tapestry over the adhesive wall strips. Most adhesive wall hooks need at least an hour to cure. When they have finished curing, hang the curtain rod over the 2 adhesive wall strips. Hang the tapestry directly to the hooks for a more relaxed feel. If the tapestry is made of a thin fabric, a curtain rod may not be necessary. As long as you don't mind the fabric dipping in the middle, wall hooks can support the tapestry on their own. Hang your tapestry directly to the adhesive wall hooks.",
    "sentences": [
        " Securing a Tapestry with Push Pins Ask your RA or dorm advisor before using push pins.",
        "The easiest damage-free way to hang a tapestry is with push pins.",
        "Push pins leave much smaller holes in the wall than nails or screws and are often allowed when decorating a dorm.",
        "That being said, some dorms do not allow push pins—ask your dorm advisor before using them to make sure you don't damage the wall.",
        "Using push pins against your college's regulations can result in fees.",
        "Push pins work best with tapestries made of light fabrics.",
        "Use push pins if you have a drywall or wood wall in your dorm.",
        "Push pins stick into drywall and wood easily and hold up over time.",
        "Plaster walls, on the other hand, are thicker and do not usually work with push pins.",
        "If your dorm has plaster walls, try a different hanging method (like adhesive hooks or velcro).",
        "Cork also works well with push pins, though having a wall made entirely of cork is unlikely.",
        "Stick 4 push pins in each corner of the wall.",
        "Measure the height and length of your tapestry with measuring tape.",
        "Position the 4 push pins apart at the distance you recorded.",
        "Do not push the pins too tightly into the wall yet, as you'll need to remove or reposition them as you work.",
        "Remove 1 push pin at a time to secure the tapestry on the wall.",
        "Some tapestry will have tabs on each corner that you can hook on the pins, but others will need to be pinned to the wall.",
        "Remove a push pin from the wall and position the corresponding corner of the tapestry where the pin had been.",
        "Push the pin in the wall again to secure the tapestry corner, then repeat the process with the remaining 3 corners.",
        "Push down hard on the pin with your thumb to secure it in the wall.",
        "Reposition the push pins as you work if you miscalculated the distance of the tapestry.",
        "Add more push pins if your tapestry seems to droop.",
        "The larger your tapestry is, the more push pins it will probably need.",
        "If your tapestry bunches in the middle or the sides, use more push pins to secure the tapestry to the wall.",
        "Hanging a Tapestry with Clothespins Buy 2 adhesive wall strips and 2 clothespins from a craft store.",
        "Medium to large-sized clothespins work best for hanging tapestries.",
        "Choose adhesive wall strips that are approximately the same size as your clothespins.",
        "If no wall strips match the exact size of your clothespins, go a size larger—you can always trim them as needed later.",
        "Stick the wall adhesive strips to the clothespins.",
        "Attach the clothespin to one side of the wall adhesive strip.",
        "Press the strip and clothespin together tightly to keep either from detaching as you hang the tapestry.",
        "If you wall adhesive strips are not double-sided, a wood glue to glue the clothespins to the strips.",
        "If the wall adhesive strips are too large, cut them to size with scissors before gluing.",
        "Press the clothespins onto the wall.",
        "Measure the length of your tapestry and attach the clothespins so they can hold up both ends of the tapestry.",
        "Follow the wall adhesive strip directions carefully so the clothespins stay secure on the wall.",
        "If your tapestry is large, purchase and attach 3 clothespins to the wall—one on both ends and one in the middle.",
        "Attach the tapestry to the clothespins.",
        "When you've clamped the tapestry down with the clothespins, stand back and inspect it.",
        "If your tapestry appears to droop in the middle, you may not have spread your clothespins out enough.",
        "Re-apply the clothespins to the wall or add a third clothespin in the middle to prevent drooping.",
        "If you need to re-apply the clothespins, you may need to replace the wall adhesive strips.",
        "Some lose their sticking properties each time they are removed to the wall.",
        "The clothespin method is best for thin tapestries--thicker ones might not stay as tightly clamped.",
        "Velcroing a Tapestry to the Wall Use velcro on thicker fabric tapestries.",
        "If your tapestry is too thick for clothespins, velcro may keep it adhered to the wall better.",
        "Although this method can also be used on paper tapestries, it is not ideal.",
        "If you need to remove the velcro strips, you risk tearing the tapestry.",
        "Adhere 4-6 velcro strips to the wall.",
        "Apply 1 velcro strip for each corner of the tapestry.",
        "If your tapestry is larger, apply velcro strips to the sides as well.",
        "Adhere the rough side of the velcro strips to the wall to keep your tapestry securely attached to the wall.",
        "Measure your tapestry beforehand so you know how far apart to align the velcro strips.",
        "Adhere 4-6 velcro strips to the tapestry.",
        "Apply the soft side of the velcro strips to the tapestry on its 4 corners and its sides, if applicable.",
        "Align your tapestry with the wall as you attach the velcro strips to make sure they are evenly spaced.",
        "Hang your tapestry to the wall with the velcro strips.",
        "Press down on the velcro strips as you attach them to keep the tapestry from falling down later.",
        "If your velcro strips are not equally aligned, remove the side attached to the tapestry and re-align it with the wall.",
        "Using Adhesive Wall Hooks Buy a curtain rod approximately the same length as your tapestry.",
        "A curtain rod will keep your tapestry from bunching or bowing in the middle as you hang it.",
        "The rod should be long but thin, no thicker than ⁄2–1 inch (1.3–2.5 cm).",
        "Pick a simple curtain rod so it does not take attention away from the tapestry.",
        "Attach the curtain rod to the wall tapestry.",
        "Some tapestries made for curtain rods have built-in curtain rod pockets or holes for curtain loops.",
        "For those without built-in holes, use clamp binder clips along the top of the tapestry.",
        "Loop the clips through the curtain rod to keep your curtain rod and tapestry attached.",
        "Adhere 2 adhesive wall hooks to the wall.",
        "Buy 2 adhesive wall strips with hooks at as wide as and at least half as tall as your curtain rod.",
        "Follow the directions carefully to attach the hooks securely to the wall.",
        "Measure the length of the curtain rod so you know how far apart to space the wall hooks.",
        "Place the curtain rod and tapestry over the adhesive wall strips.",
        "Most adhesive wall hooks need at least an hour to cure.",
        "When they have finished curing, hang the curtain rod over the 2 adhesive wall strips.",
        "Hang the tapestry directly to the hooks for a more relaxed feel.",
        "If the tapestry is made of a thin fabric, a curtain rod may not be necessary.",
        "As long as you don't mind the fabric dipping in the middle, wall hooks can support the tapestry on their own.",
        "Hang your tapestry directly to the adhesive wall hooks."
    ]
}