{
    "title": "How to Sew Joggers",
    "url": "https://www.wikihow.com/Sew-Joggers",
    "category_hierarchy": [
        "Personal Care and Style",
        "Clothing",
        "Clothes by Type",
        "Pants and Shorts"
    ],
    "methods": [
        {
            "name": "Modifying Existing Pants",
            "steps": [
                {
                    "headline": "Get a pair of loose-fitting yoga pants.",
                    "description": "You can also use other types of pants as long as they are made from stretchy jersey fabric. The waistband should be elastic or drawstring. Make sure that the pants fit you well. Keep in mind that the pants will end up a little shorter than they are now."
                },
                {
                    "headline": "Cut the hem and 6 inches (15 cm) off of each leg.",
                    "description": "Spread the pants out on a flat surface and cut the hem off of each leg, just above the stitching. Discard the hem, then cut 6 inches (15 cm) off of each pant leg, starting from the raw, cut edge. Save these 6 in (15 cm) pieces; they will become cuffs for your joggers. Use a straight edge to make sure that the lines you are cutting are nice and straight."
                },
                {
                    "headline": "Make your 6 in (15 cm) cuffs narrower by 2 to 3 inches (5.1 to 7.6 cm).",
                    "description": "Turn the cuffs inside out first. Choose a side seam to cut, then cut 2 to 3 inches (5.1 to 7.6 cm) off to make the cuffs narrower. You only need to cut 1 side seam on each cuff. How much you cut off depends on how skinny your calf is and how wide the pant legs were to begin with."
                },
                {
                    "headline": "Sew the cuffs back together along the short ends.",
                    "description": "Fold the cuffs in half so that the short edges that you just cut match up. Make sure that the right sides are facing in, and the wrong sides are facing out. Sew along the raw, short edge using a zigzag stitch an a ⁄2 inch (1.3 cm) seam allowance. If you have access to a serger, you can use that instead. Use a thread color that matches the color of your pants. There is no seam allowance. Simply sew along the edge. The stitches will overlock the raw edge as well as hold them together."
                },
                {
                    "headline": "Fold the cuffs inwards to make them shorter.",
                    "description": "Take the top edge of your first cuff, and fold it down so that the matches the bottom edge. Work your way around the cuff so that you end up with a shorter cuff. Make sure that the right side of the fabric is facing out on the inside and outside of the cuff; the wrong sides should be sandwiched inside the cuff. Repeat this step for the other cuff. At this point, you can press the cuffs flat to make the folded edges nice and sharp."
                },
                {
                    "headline": "Turn the yoga pants inside out.",
                    "description": "At this point, it would be a good idea to try them on and see if you like the new length. Keep in mind that the joggers will end up 2 to 2 ⁄2 inches (5.1 to 6.4 cm) longer, depending on your seam allowances. If you feel that they are still too long, take them off and cut them shorter."
                },
                {
                    "headline": "Slip the cuffs into the pant legs so that the raw edges match up.",
                    "description": "Take each cuff and slip it over each pant leg. Make sure that the raw edges of the cuffs are aligned with the raw edges on the pant legs. Rotate the cuffs so that the side seams match up with the side seams on the pant legs."
                },
                {
                    "headline": "Pin the cuffs to the pant legs and distribute the gathers evenly.",
                    "description": "Place a sewing pin on each side seam, and another sewing pin in the front and back of each pant leg. Do not stretch the cuffs to fit the pant legs. If you need to, use more sewing pins to tack the excess pant fabric down. Slide the pins vertically into the pant legs, with the ballpoints facing the raw, cut edges."
                },
                {
                    "headline": "Sew the cuffs to the pant legs.",
                    "description": "Use a thread color that matches the fabric, a zigzag stitch, and a ⁄2 in (1.3 cm) seam allowance. Backstitch when you start and finish sewing to keep the thread from unraveling. Jersey fabric does not fray, but you can finish the seams with a zigzag stitch for a nicer finish."
                },
                {
                    "headline": "Turn the pants right-side-out.",
                    "description": "Pull the cuffs out of the pant legs, if needed. If you want to, you can press the seams flat with an iron; they can be point downward or upwards, whichever you feel is the most comfortable for you."
                }
            ]
        },
        {
            "name": "Sewing Joggers from Scratch",
            "steps": [
                {
                    "headline": "Wash, dry, and iron your desired fabric.",
                    "description": "Joggers are usually made from stretchy fabric, such as jersey or sweatpants, but you can also use lightweight denim, cotton, or linen. Wash, dry, and iron the fabric according to the instructions on the bolt. If you forgot to take down the washing instructions, wash the fabric using cold water on a gentle cycle. Allow the fabric to hang dry, or use a warm setting."
                },
                {
                    "headline": "Fold the fabric in half, and set a pair of pajama pants on top.",
                    "description": "Fold your fabric in half along the grain with the wrong side facing out. Fold your pajama pants in half lengthwise, and place them on top. Make sure that the top edge of the pants is 2 ⁄2 inches (6.4 cm) from the top edge of the fabric. The pajama pants should fit you well."
                },
                {
                    "headline": "Cut around the pajama pants, leaving room for the seam allowances.",
                    "description": "If you are worried about accidentally cutting through your pajama pants, trace around the pajama pants with a tailor's chalk or pen, then cut them out. Leave a ⁄2 in (1.3 cm) seam allow along the side edges. Add 1 ⁄2 inches (3.8 cm) to the bottom cuff, and 2 ⁄2 inches (6.4 cm) the top edge/waistband. If the pajama pants have an elastic waistband, be sure to stretch the waistband out before you cut, otherwise the joggers will end up too narrow."
                },
                {
                    "headline": "Repeat the process to cut the back half of the pants.",
                    "description": "If your pajama pants are symmetrical on the front and back, you can keep them folded and just trace and cut another set of pieces. If your pajama pants are larger in the back, however, you will need to refold them, then trace and cut a new set based on this new shape."
                },
                {
                    "headline": "Cut out 4 pocket pieces, if desired.",
                    "description": "Make 4 U-shaped pieces big enough to fit your hand into, from fingertips to thumb. Keep in mind that you will be sewing these, so make the pockets ⁄2 inch (1.3 cm) larger (including the top straight edge) than you want them to be. You can make the top edge straight or angled."
                },
                {
                    "headline": "Sew the pocket pieces to the pant pieces, if you made them.",
                    "description": "Pin 1 of the pocket pieces to the side edge of 1 of your pant leg pieces. Make sure that the right sides are touching, and the straight edges are aligned. Sew from the top edge of the pocket down to the bottom edge using a ⁄2 in (1.3 cm) seam allowance and a matching thread color. Do this step for each of the 4 pocket and pant leg pieces. Use a straight stitch for woven/non-stretchy fabrics, and a zigzag stitch for knitted/stretchy fabrics. The pockets should be at least 4 inches (10 cm) down from the top edge of the pant pieces. Make sure that they are all in the same position."
                },
                {
                    "headline": "Pin and sew the front and back pieces together at the crotch.",
                    "description": "Pin the 2 front pieces together at the curved crotch with the right sides facing in. Sew the crotch using a ⁄2 in (1.3 cm) seam allowance and a matching thread color. Repeat this step for the 2 back pieces. Cut V-shaped notches into the crotch seams, about 1 inch (2.5 cm) apart, then press the seams open for a nicer finish. Use a straight stitch for woven/non-stretchy fabrics, and a zigzag stitch for knitted/stretchy fabrics."
                },
                {
                    "headline": "Pin and sew the side seams and inseams.",
                    "description": "Pin the front and back pieces together with the right sides facing in. Sew straight down from the waistband to the cuff using a ⁄2 in (1.3 cm) seam allowance and a matching thread color. Repeat the process for the inseams, but start from the crotch and finish at the cuff. Press the seams open, if desired. Use a straight stitch for woven/non-stretchy fabrics, and a zigzag stitch for knitted/stretchy fabrics. If you added pockets, make sure that you sew around the pockets. Do not sew straight down across the pockets, or you won't be able to open them. Cut notches into the curved edges of the pockets. Keep them about 1 inch (2.5 cm) apart. Backstitch a few times at the crotch. You want the stitching here to be nice and strong."
                },
                {
                    "headline": "Fold and sew the cuffs and waistband.",
                    "description": "Fold the cuffs and waistband by ⁄2 inch (1.3 cm) first, then press them with an iron. Fold the cuffs by another 1 inch (2.5 cm), and the waistband by another 2 inches (5.1 cm). Press them with an iron again, then sew along the inside folded edges, as close to the edge as possible. Leave 2 in (5.1 cm) between your first and last stitch for the elastics. Use a straight stitch for woven/non-stretchy fabrics, and a zigzag stitch for knitted/stretchy fabrics. Match the thread color to the fabric. Folding the cuffs and waistband down by ⁄2 inch (1.3 cm) first will give you a nicer finish on the inside."
                },
                {
                    "headline": "Pull elastic through the cuffs and waistband, then sew the ends.",
                    "description": "Use safety pins to pull elastic through the cuffs waistband. Overlap the ends of your elastic by ⁄2 inch (1.3 cm), then sew them using a zigzag stitch. Tuck the sewn end of each elastic back through the gap when you are done. Cut the elastic to your calf/waist measurement, or to the inner circumference of your joggers' cuffs/waistband. Use 1 in (2.5 cm) elastic for the cuffs, and 2 in (5.1 cm) for the waistband."
                },
                {
                    "headline": "Sew the gaps on the cuffs and waistband shut.",
                    "description": "Sew as close to the folded edge of the cuff/waistband as you can. Use a matching thread color and a straight stitch (non-stitched fabric) or a zigzag stitch (stretchy fabric). Overlap your stitching by a little, and remember to backstitch. The elastic will cause the fabric to gather, so you will need to stretch the elastic while sewing it in order to get the fabric to lay flat."
                }
            ]
        }
    ],
    "tyn": [
        "Modifying Existing Pants",
        "Yoga pants",
        "Fabric scissors",
        "Sewing machine",
        "Sewing pins",
        "Thread",
        "Sewing Joggers from Scratch",
        "Fabric of choice",
        "Tailor's chalk or pen (optional)",
        "1 in (2.5 cm) elastic (cuffs)",
        "2 in (5.1 cm) elastic (waistband)"
    ],
    "text": " Modifying Existing Pants Get a pair of loose-fitting yoga pants. You can also use other types of pants as long as they are made from stretchy jersey fabric. The waistband should be elastic or drawstring. Make sure that the pants fit you well. Keep in mind that the pants will end up a little shorter than they are now. Cut the hem and 6 inches (15 cm) off of each leg. Spread the pants out on a flat surface and cut the hem off of each leg, just above the stitching. Discard the hem, then cut 6 inches (15 cm) off of each pant leg, starting from the raw, cut edge. Save these 6 in (15 cm) pieces; they will become cuffs for your joggers. Use a straight edge to make sure that the lines you are cutting are nice and straight. Make your 6 in (15 cm) cuffs narrower by 2 to 3 inches (5.1 to 7.6 cm). Turn the cuffs inside out first. Choose a side seam to cut, then cut 2 to 3 inches (5.1 to 7.6 cm) off to make the cuffs narrower. You only need to cut 1 side seam on each cuff. How much you cut off depends on how skinny your calf is and how wide the pant legs were to begin with. Sew the cuffs back together along the short ends. Fold the cuffs in half so that the short edges that you just cut match up. Make sure that the right sides are facing in, and the wrong sides are facing out. Sew along the raw, short edge using a zigzag stitch an a ⁄2 inch (1.3 cm) seam allowance. If you have access to a serger, you can use that instead. Use a thread color that matches the color of your pants. There is no seam allowance. Simply sew along the edge. The stitches will overlock the raw edge as well as hold them together. Fold the cuffs inwards to make them shorter. Take the top edge of your first cuff, and fold it down so that the matches the bottom edge. Work your way around the cuff so that you end up with a shorter cuff. Make sure that the right side of the fabric is facing out on the inside and outside of the cuff; the wrong sides should be sandwiched inside the cuff. Repeat this step for the other cuff. At this point, you can press the cuffs flat to make the folded edges nice and sharp. Turn the yoga pants inside out. At this point, it would be a good idea to try them on and see if you like the new length. Keep in mind that the joggers will end up 2 to 2 ⁄2 inches (5.1 to 6.4 cm) longer, depending on your seam allowances. If you feel that they are still too long, take them off and cut them shorter. Slip the cuffs into the pant legs so that the raw edges match up. Take each cuff and slip it over each pant leg. Make sure that the raw edges of the cuffs are aligned with the raw edges on the pant legs. Rotate the cuffs so that the side seams match up with the side seams on the pant legs. Pin the cuffs to the pant legs and distribute the gathers evenly. Place a sewing pin on each side seam, and another sewing pin in the front and back of each pant leg. Do not stretch the cuffs to fit the pant legs. If you need to, use more sewing pins to tack the excess pant fabric down. Slide the pins vertically into the pant legs, with the ballpoints facing the raw, cut edges. Sew the cuffs to the pant legs. Use a thread color that matches the fabric, a zigzag stitch, and a ⁄2 in (1.3 cm) seam allowance. Backstitch when you start and finish sewing to keep the thread from unraveling. Jersey fabric does not fray, but you can finish the seams with a zigzag stitch for a nicer finish. Turn the pants right-side-out. Pull the cuffs out of the pant legs, if needed. If you want to, you can press the seams flat with an iron; they can be point downward or upwards, whichever you feel is the most comfortable for you. Sewing Joggers from Scratch Wash, dry, and iron your desired fabric. Joggers are usually made from stretchy fabric, such as jersey or sweatpants, but you can also use lightweight denim, cotton, or linen. Wash, dry, and iron the fabric according to the instructions on the bolt. If you forgot to take down the washing instructions, wash the fabric using cold water on a gentle cycle. Allow the fabric to hang dry, or use a warm setting. Fold the fabric in half, and set a pair of pajama pants on top. Fold your fabric in half along the grain with the wrong side facing out. Fold your pajama pants in half lengthwise, and place them on top. Make sure that the top edge of the pants is 2 ⁄2 inches (6.4 cm) from the top edge of the fabric. The pajama pants should fit you well. Cut around the pajama pants, leaving room for the seam allowances. If you are worried about accidentally cutting through your pajama pants, trace around the pajama pants with a tailor's chalk or pen, then cut them out. Leave a ⁄2 in (1.3 cm) seam allow along the side edges. Add 1 ⁄2 inches (3.8 cm) to the bottom cuff, and 2 ⁄2 inches (6.4 cm) the top edge/waistband. If the pajama pants have an elastic waistband, be sure to stretch the waistband out before you cut, otherwise the joggers will end up too narrow. Repeat the process to cut the back half of the pants. If your pajama pants are symmetrical on the front and back, you can keep them folded and just trace and cut another set of pieces. If your pajama pants are larger in the back, however, you will need to refold them, then trace and cut a new set based on this new shape. Cut out 4 pocket pieces, if desired. Make 4 U-shaped pieces big enough to fit your hand into, from fingertips to thumb. Keep in mind that you will be sewing these, so make the pockets ⁄2 inch (1.3 cm) larger (including the top straight edge) than you want them to be. You can make the top edge straight or angled. Sew the pocket pieces to the pant pieces, if you made them. Pin 1 of the pocket pieces to the side edge of 1 of your pant leg pieces. Make sure that the right sides are touching, and the straight edges are aligned. Sew from the top edge of the pocket down to the bottom edge using a ⁄2 in (1.3 cm) seam allowance and a matching thread color. Do this step for each of the 4 pocket and pant leg pieces. Use a straight stitch for woven/non-stretchy fabrics, and a zigzag stitch for knitted/stretchy fabrics. The pockets should be at least 4 inches (10 cm) down from the top edge of the pant pieces. Make sure that they are all in the same position. Pin and sew the front and back pieces together at the crotch. Pin the 2 front pieces together at the curved crotch with the right sides facing in. Sew the crotch using a ⁄2 in (1.3 cm) seam allowance and a matching thread color. Repeat this step for the 2 back pieces. Cut V-shaped notches into the crotch seams, about 1 inch (2.5 cm) apart, then press the seams open for a nicer finish. Use a straight stitch for woven/non-stretchy fabrics, and a zigzag stitch for knitted/stretchy fabrics. Pin and sew the side seams and inseams. Pin the front and back pieces together with the right sides facing in. Sew straight down from the waistband to the cuff using a ⁄2 in (1.3 cm) seam allowance and a matching thread color. Repeat the process for the inseams, but start from the crotch and finish at the cuff. Press the seams open, if desired. Use a straight stitch for woven/non-stretchy fabrics, and a zigzag stitch for knitted/stretchy fabrics. If you added pockets, make sure that you sew around the pockets. Do not sew straight down across the pockets, or you won't be able to open them. Cut notches into the curved edges of the pockets. Keep them about 1 inch (2.5 cm) apart. Backstitch a few times at the crotch. You want the stitching here to be nice and strong. Fold and sew the cuffs and waistband. Fold the cuffs and waistband by ⁄2 inch (1.3 cm) first, then press them with an iron. Fold the cuffs by another 1 inch (2.5 cm), and the waistband by another 2 inches (5.1 cm). Press them with an iron again, then sew along the inside folded edges, as close to the edge as possible. Leave 2 in (5.1 cm) between your first and last stitch for the elastics. Use a straight stitch for woven/non-stretchy fabrics, and a zigzag stitch for knitted/stretchy fabrics. Match the thread color to the fabric. Folding the cuffs and waistband down by ⁄2 inch (1.3 cm) first will give you a nicer finish on the inside. Pull elastic through the cuffs and waistband, then sew the ends. Use safety pins to pull elastic through the cuffs waistband. Overlap the ends of your elastic by ⁄2 inch (1.3 cm), then sew them using a zigzag stitch. Tuck the sewn end of each elastic back through the gap when you are done. Cut the elastic to your calf/waist measurement, or to the inner circumference of your joggers' cuffs/waistband. Use 1 in (2.5 cm) elastic for the cuffs, and 2 in (5.1 cm) for the waistband. Sew the gaps on the cuffs and waistband shut. Sew as close to the folded edge of the cuff/waistband as you can. Use a matching thread color and a straight stitch (non-stitched fabric) or a zigzag stitch (stretchy fabric). Overlap your stitching by a little, and remember to backstitch. The elastic will cause the fabric to gather, so you will need to stretch the elastic while sewing it in order to get the fabric to lay flat.",
    "sentences": [
        " Modifying Existing Pants Get a pair of loose-fitting yoga pants.",
        "You can also use other types of pants as long as they are made from stretchy jersey fabric.",
        "The waistband should be elastic or drawstring.",
        "Make sure that the pants fit you well.",
        "Keep in mind that the pants will end up a little shorter than they are now.",
        "Cut the hem and 6 inches (15 cm) off of each leg.",
        "Spread the pants out on a flat surface and cut the hem off of each leg, just above the stitching.",
        "Discard the hem, then cut 6 inches (15 cm) off of each pant leg, starting from the raw, cut edge.",
        "Save these 6 in (15 cm) pieces; they will become cuffs for your joggers.",
        "Use a straight edge to make sure that the lines you are cutting are nice and straight.",
        "Make your 6 in (15 cm) cuffs narrower by 2 to 3 inches (5.1 to 7.6 cm).",
        "Turn the cuffs inside out first.",
        "Choose a side seam to cut, then cut 2 to 3 inches (5.1 to 7.6 cm) off to make the cuffs narrower.",
        "You only need to cut 1 side seam on each cuff.",
        "How much you cut off depends on how skinny your calf is and how wide the pant legs were to begin with.",
        "Sew the cuffs back together along the short ends.",
        "Fold the cuffs in half so that the short edges that you just cut match up.",
        "Make sure that the right sides are facing in, and the wrong sides are facing out.",
        "Sew along the raw, short edge using a zigzag stitch an a ⁄2 inch (1.3 cm) seam allowance.",
        "If you have access to a serger, you can use that instead.",
        "Use a thread color that matches the color of your pants.",
        "There is no seam allowance.",
        "Simply sew along the edge.",
        "The stitches will overlock the raw edge as well as hold them together.",
        "Fold the cuffs inwards to make them shorter.",
        "Take the top edge of your first cuff, and fold it down so that the matches the bottom edge.",
        "Work your way around the cuff so that you end up with a shorter cuff.",
        "Make sure that the right side of the fabric is facing out on the inside and outside of the cuff; the wrong sides should be sandwiched inside the cuff.",
        "Repeat this step for the other cuff.",
        "At this point, you can press the cuffs flat to make the folded edges nice and sharp.",
        "Turn the yoga pants inside out.",
        "At this point, it would be a good idea to try them on and see if you like the new length.",
        "Keep in mind that the joggers will end up 2 to 2 ⁄2 inches (5.1 to 6.4 cm) longer, depending on your seam allowances.",
        "If you feel that they are still too long, take them off and cut them shorter.",
        "Slip the cuffs into the pant legs so that the raw edges match up.",
        "Take each cuff and slip it over each pant leg.",
        "Make sure that the raw edges of the cuffs are aligned with the raw edges on the pant legs.",
        "Rotate the cuffs so that the side seams match up with the side seams on the pant legs.",
        "Pin the cuffs to the pant legs and distribute the gathers evenly.",
        "Place a sewing pin on each side seam, and another sewing pin in the front and back of each pant leg.",
        "Do not stretch the cuffs to fit the pant legs.",
        "If you need to, use more sewing pins to tack the excess pant fabric down.",
        "Slide the pins vertically into the pant legs, with the ballpoints facing the raw, cut edges.",
        "Sew the cuffs to the pant legs.",
        "Use a thread color that matches the fabric, a zigzag stitch, and a ⁄2 in (1.3 cm) seam allowance.",
        "Backstitch when you start and finish sewing to keep the thread from unraveling.",
        "Jersey fabric does not fray, but you can finish the seams with a zigzag stitch for a nicer finish.",
        "Turn the pants right-side-out.",
        "Pull the cuffs out of the pant legs, if needed.",
        "If you want to, you can press the seams flat with an iron; they can be point downward or upwards, whichever you feel is the most comfortable for you.",
        "Sewing Joggers from Scratch Wash, dry, and iron your desired fabric.",
        "Joggers are usually made from stretchy fabric, such as jersey or sweatpants, but you can also use lightweight denim, cotton, or linen.",
        "Wash, dry, and iron the fabric according to the instructions on the bolt.",
        "If you forgot to take down the washing instructions, wash the fabric using cold water on a gentle cycle.",
        "Allow the fabric to hang dry, or use a warm setting.",
        "Fold the fabric in half, and set a pair of pajama pants on top.",
        "Fold your fabric in half along the grain with the wrong side facing out.",
        "Fold your pajama pants in half lengthwise, and place them on top.",
        "Make sure that the top edge of the pants is 2 ⁄2 inches (6.4 cm) from the top edge of the fabric.",
        "The pajama pants should fit you well.",
        "Cut around the pajama pants, leaving room for the seam allowances.",
        "If you are worried about accidentally cutting through your pajama pants, trace around the pajama pants with a tailor's chalk or pen, then cut them out.",
        "Leave a ⁄2 in (1.3 cm) seam allow along the side edges.",
        "Add 1 ⁄2 inches (3.8 cm) to the bottom cuff, and 2 ⁄2 inches (6.4 cm) the top edge/waistband.",
        "If the pajama pants have an elastic waistband, be sure to stretch the waistband out before you cut, otherwise the joggers will end up too narrow.",
        "Repeat the process to cut the back half of the pants.",
        "If your pajama pants are symmetrical on the front and back, you can keep them folded and just trace and cut another set of pieces.",
        "If your pajama pants are larger in the back, however, you will need to refold them, then trace and cut a new set based on this new shape.",
        "Cut out 4 pocket pieces, if desired.",
        "Make 4 U-shaped pieces big enough to fit your hand into, from fingertips to thumb.",
        "Keep in mind that you will be sewing these, so make the pockets ⁄2 inch (1.3 cm) larger (including the top straight edge) than you want them to be.",
        "You can make the top edge straight or angled.",
        "Sew the pocket pieces to the pant pieces, if you made them.",
        "Pin 1 of the pocket pieces to the side edge of 1 of your pant leg pieces.",
        "Make sure that the right sides are touching, and the straight edges are aligned.",
        "Sew from the top edge of the pocket down to the bottom edge using a ⁄2 in (1.3 cm) seam allowance and a matching thread color.",
        "Do this step for each of the 4 pocket and pant leg pieces.",
        "Use a straight stitch for woven/non-stretchy fabrics, and a zigzag stitch for knitted/stretchy fabrics.",
        "The pockets should be at least 4 inches (10 cm) down from the top edge of the pant pieces.",
        "Make sure that they are all in the same position.",
        "Pin and sew the front and back pieces together at the crotch.",
        "Pin the 2 front pieces together at the curved crotch with the right sides facing in.",
        "Sew the crotch using a ⁄2 in (1.3 cm) seam allowance and a matching thread color.",
        "Repeat this step for the 2 back pieces.",
        "Cut V-shaped notches into the crotch seams, about 1 inch (2.5 cm) apart, then press the seams open for a nicer finish.",
        "Use a straight stitch for woven/non-stretchy fabrics, and a zigzag stitch for knitted/stretchy fabrics.",
        "Pin and sew the side seams and inseams.",
        "Pin the front and back pieces together with the right sides facing in.",
        "Sew straight down from the waistband to the cuff using a ⁄2 in (1.3 cm) seam allowance and a matching thread color.",
        "Repeat the process for the inseams, but start from the crotch and finish at the cuff.",
        "Press the seams open, if desired.",
        "Use a straight stitch for woven/non-stretchy fabrics, and a zigzag stitch for knitted/stretchy fabrics.",
        "If you added pockets, make sure that you sew around the pockets.",
        "Do not sew straight down across the pockets, or you won't be able to open them.",
        "Cut notches into the curved edges of the pockets.",
        "Keep them about 1 inch (2.5 cm) apart.",
        "Backstitch a few times at the crotch.",
        "You want the stitching here to be nice and strong.",
        "Fold and sew the cuffs and waistband.",
        "Fold the cuffs and waistband by ⁄2 inch (1.3 cm) first, then press them with an iron.",
        "Fold the cuffs by another 1 inch (2.5 cm), and the waistband by another 2 inches (5.1 cm).",
        "Press them with an iron again, then sew along the inside folded edges, as close to the edge as possible.",
        "Leave 2 in (5.1 cm) between your first and last stitch for the elastics.",
        "Use a straight stitch for woven/non-stretchy fabrics, and a zigzag stitch for knitted/stretchy fabrics.",
        "Match the thread color to the fabric.",
        "Folding the cuffs and waistband down by ⁄2 inch (1.3 cm) first will give you a nicer finish on the inside.",
        "Pull elastic through the cuffs and waistband, then sew the ends.",
        "Use safety pins to pull elastic through the cuffs waistband.",
        "Overlap the ends of your elastic by ⁄2 inch (1.3 cm), then sew them using a zigzag stitch.",
        "Tuck the sewn end of each elastic back through the gap when you are done.",
        "Cut the elastic to your calf/waist measurement, or to the inner circumference of your joggers' cuffs/waistband.",
        "Use 1 in (2.5 cm) elastic for the cuffs, and 2 in (5.1 cm) for the waistband.",
        "Sew the gaps on the cuffs and waistband shut.",
        "Sew as close to the folded edge of the cuff/waistband as you can.",
        "Use a matching thread color and a straight stitch (non-stitched fabric) or a zigzag stitch (stretchy fabric).",
        "Overlap your stitching by a little, and remember to backstitch.",
        "The elastic will cause the fabric to gather, so you will need to stretch the elastic while sewing it in order to get the fabric to lay flat."
    ]
}