{
    "title": "How to Grill Thick Steak",
    "url": "https://www.wikihow.com/Grill-Thick-Steak",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Beef and Lamb",
        "Steak Dishes"
    ],
    "parts": [
        {
            "name": "Salting the Steaks and Heating the Grill",
            "steps": [
                {
                    "headline": "Choose your steaks.",
                    "description": "Buy 2 large steaks that are 1.5 to 2-inches (3.8 to 5-cm) thick and weigh about 2 pounds (907 g) total. You can choose boneless or bone-in steaks, depending on your preference. These cuts are great thick steaks:\nRibeye\nCowboy chops\nNew York strip\nPorterhouse\nT-bone\nTenderloin"
                },
                {
                    "headline": "Salt the steak 40 minutes before you grill it.",
                    "description": "Take the steaks out of the fridge 40 minutes before you plan to grill them and set them on a plate. Sprinkle both sides of the steaks with a few generous pinches of salt and let the steaks rest at room temperature for up to 40 minutes. If you want to salt the steaks several hours before grilling them, refrigerate the uncovered salted steaks until you're ready to cook them."
                },
                {
                    "headline": "Set up your grill for indirect heat.",
                    "description": "If you're using a gas grill, turn on the outside burners to medium or medium-low. Turn the inside burners off to create an indirect heat source. If you're using a charcoal grill, fill a chimney full of charcoal briquettes and heat them until they're ashy. Dump the hot coals on 1 side of the grate."
                },
                {
                    "headline": "Cover and heat the grill for 5 minutes.",
                    "description": "Put the cooking grate over the coals or burners and put the lid on the grill. Let the grill heat for 5 minutes before you put the thick steaks on it."
                }
            ]
        },
        {
            "name": "Grilling Your Steaks",
            "steps": [
                {
                    "headline": "Sprinkle pepper over the steaks and arrange them on the grill.",
                    "description": "Sprinkle both sides of each steak with a few pinches of freshly ground pepper. Remove the lid from the grill and lay both thick steaks on the grill grate. If you're using a gas grill, set them in the center so they're not directly over the hot burners. If you're using a charcoal grill, lay them on the half of the grill that doesn't have the hot coals under it. Ensure that the steaks are at least 1 inch (2.5 cm) apart from each other on the grill."
                },
                {
                    "headline": "Grill the steaks for 15 minutes and flip them every 5 minutes.",
                    "description": "Put the lid on the grill and open the vents. Cook the steaks for 5 minutes and then use long-handled tongs to flip the steaks. Grill the steaks for a total of 15 minutes, flipping them every 5 minutes so they cook evenly. Since the steaks are so thick, flipping them frequently will help them heat up faster."
                },
                {
                    "headline": "Check if the temperature of the steaks is between 105 °F (41 °C) and 115 °F (46 °C).",
                    "description": "Insert an instant-read thermometer into the thickest part of the steak and cook them until they reach medium-rare or medium. For medium-rare, the steak should reach 105 °F (41 °C). For medium, it should reach 115 °F (46 °C). If you want medium-well done steaks, cook them for 5 more minutes."
                },
                {
                    "headline": "Move the steaks to the hot area of the grill and cook them for 2 to 5 minutes.",
                    "description": "Use long-handled tongs to move the steaks directly over the hot coals or burners. Keep the lid off of the grill and flip the steaks about every 30 seconds as the steaks sear. Grill the steaks for 2 to 5 minutes so they become dark and charred on the outside."
                }
            ]
        },
        {
            "name": "Resting and Serving the Steaks",
            "steps": [
                {
                    "headline": "Check the temperature of the steaks again.",
                    "description": "Insert an instant-read thermometer into the thickest part of one of the steaks. For a medium-rare steak, use tongs to remove it from the grill once it reaches 125 °F (52 °C). For a medium steak, take it off when it reaches 135 °F (57 °C). If you'd like well done steak, remove it once it's at 145 °F (63 °C)."
                },
                {
                    "headline": "Rest the steaks for 5 to 10 minutes.",
                    "description": "Transfer the steaks to a cutting board and cover them loosely with a piece of aluminum foil. Leave the steaks to rest so the juices redistribute within the thick steaks and they finish cooking."
                },
                {
                    "headline": "Slice and serve the thick steaks immediately.",
                    "description": "Remove the aluminum foil and use a sharp knife to cut the steaks into strips that are about 1/2-inch (1.3 cm) thick. Serve the thick steaks with baked potatoes, green salad, grilled vegetables, or crusty bread. Store leftover grilled steak in an airtight container in the refrigerator for 3 to 4 days."
                }
            ]
        }
    ],
    "tyn": [
        "Plate",
        "Gas or charcoal grill",
        "Chimney and briquettes",
        "Long-handled tongs",
        "Instant-read thermometer",
        "Cutting board",
        "Knife",
        "Aluminum foil"
    ],
    "text": " Salting the Steaks and Heating the Grill Choose your steaks. Buy 2 large steaks that are 1.5 to 2-inches (3.8 to 5-cm) thick and weigh about 2 pounds (907 g) total. You can choose boneless or bone-in steaks, depending on your preference. These cuts are great thick steaks:\nRibeye\nCowboy chops\nNew York strip\nPorterhouse\nT-bone\nTenderloin Salt the steak 40 minutes before you grill it. Take the steaks out of the fridge 40 minutes before you plan to grill them and set them on a plate. Sprinkle both sides of the steaks with a few generous pinches of salt and let the steaks rest at room temperature for up to 40 minutes. If you want to salt the steaks several hours before grilling them, refrigerate the uncovered salted steaks until you're ready to cook them. Set up your grill for indirect heat. If you're using a gas grill, turn on the outside burners to medium or medium-low. Turn the inside burners off to create an indirect heat source. If you're using a charcoal grill, fill a chimney full of charcoal briquettes and heat them until they're ashy. Dump the hot coals on 1 side of the grate. Cover and heat the grill for 5 minutes. Put the cooking grate over the coals or burners and put the lid on the grill. Let the grill heat for 5 minutes before you put the thick steaks on it. Grilling Your Steaks Sprinkle pepper over the steaks and arrange them on the grill. Sprinkle both sides of each steak with a few pinches of freshly ground pepper. Remove the lid from the grill and lay both thick steaks on the grill grate. If you're using a gas grill, set them in the center so they're not directly over the hot burners. If you're using a charcoal grill, lay them on the half of the grill that doesn't have the hot coals under it. Ensure that the steaks are at least 1 inch (2.5 cm) apart from each other on the grill. Grill the steaks for 15 minutes and flip them every 5 minutes. Put the lid on the grill and open the vents. Cook the steaks for 5 minutes and then use long-handled tongs to flip the steaks. Grill the steaks for a total of 15 minutes, flipping them every 5 minutes so they cook evenly. Since the steaks are so thick, flipping them frequently will help them heat up faster. Check if the temperature of the steaks is between 105 °F (41 °C) and 115 °F (46 °C). Insert an instant-read thermometer into the thickest part of the steak and cook them until they reach medium-rare or medium. For medium-rare, the steak should reach 105 °F (41 °C). For medium, it should reach 115 °F (46 °C). If you want medium-well done steaks, cook them for 5 more minutes. Move the steaks to the hot area of the grill and cook them for 2 to 5 minutes. Use long-handled tongs to move the steaks directly over the hot coals or burners. Keep the lid off of the grill and flip the steaks about every 30 seconds as the steaks sear. Grill the steaks for 2 to 5 minutes so they become dark and charred on the outside. Resting and Serving the Steaks Check the temperature of the steaks again. Insert an instant-read thermometer into the thickest part of one of the steaks. For a medium-rare steak, use tongs to remove it from the grill once it reaches 125 °F (52 °C). For a medium steak, take it off when it reaches 135 °F (57 °C). If you'd like well done steak, remove it once it's at 145 °F (63 °C). Rest the steaks for 5 to 10 minutes. Transfer the steaks to a cutting board and cover them loosely with a piece of aluminum foil. Leave the steaks to rest so the juices redistribute within the thick steaks and they finish cooking. Slice and serve the thick steaks immediately. Remove the aluminum foil and use a sharp knife to cut the steaks into strips that are about 1/2-inch (1.3 cm) thick. Serve the thick steaks with baked potatoes, green salad, grilled vegetables, or crusty bread. Store leftover grilled steak in an airtight container in the refrigerator for 3 to 4 days.",
    "sentences": [
        " Salting the Steaks and Heating the Grill Choose your steaks.",
        "Buy 2 large steaks that are 1.5 to 2-inches (3.8 to 5-cm) thick and weigh about 2 pounds (907 g) total.",
        "You can choose boneless or bone-in steaks, depending on your preference.",
        "These cuts are great thick steaks:\nRibeye\nCowboy chops\nNew York strip\nPorterhouse\nT-bone\nTenderloin Salt the steak 40 minutes before you grill it.",
        "Take the steaks out of the fridge 40 minutes before you plan to grill them and set them on a plate.",
        "Sprinkle both sides of the steaks with a few generous pinches of salt and let the steaks rest at room temperature for up to 40 minutes.",
        "If you want to salt the steaks several hours before grilling them, refrigerate the uncovered salted steaks until you're ready to cook them.",
        "Set up your grill for indirect heat.",
        "If you're using a gas grill, turn on the outside burners to medium or medium-low.",
        "Turn the inside burners off to create an indirect heat source.",
        "If you're using a charcoal grill, fill a chimney full of charcoal briquettes and heat them until they're ashy.",
        "Dump the hot coals on 1 side of the grate.",
        "Cover and heat the grill for 5 minutes.",
        "Put the cooking grate over the coals or burners and put the lid on the grill.",
        "Let the grill heat for 5 minutes before you put the thick steaks on it.",
        "Grilling Your Steaks Sprinkle pepper over the steaks and arrange them on the grill.",
        "Sprinkle both sides of each steak with a few pinches of freshly ground pepper.",
        "Remove the lid from the grill and lay both thick steaks on the grill grate.",
        "If you're using a gas grill, set them in the center so they're not directly over the hot burners.",
        "If you're using a charcoal grill, lay them on the half of the grill that doesn't have the hot coals under it.",
        "Ensure that the steaks are at least 1 inch (2.5 cm) apart from each other on the grill.",
        "Grill the steaks for 15 minutes and flip them every 5 minutes.",
        "Put the lid on the grill and open the vents.",
        "Cook the steaks for 5 minutes and then use long-handled tongs to flip the steaks.",
        "Grill the steaks for a total of 15 minutes, flipping them every 5 minutes so they cook evenly.",
        "Since the steaks are so thick, flipping them frequently will help them heat up faster.",
        "Check if the temperature of the steaks is between 105 °F (41 °C) and 115 °F (46 °C).",
        "Insert an instant-read thermometer into the thickest part of the steak and cook them until they reach medium-rare or medium.",
        "For medium-rare, the steak should reach 105 °F (41 °C).",
        "For medium, it should reach 115 °F (46 °C).",
        "If you want medium-well done steaks, cook them for 5 more minutes.",
        "Move the steaks to the hot area of the grill and cook them for 2 to 5 minutes.",
        "Use long-handled tongs to move the steaks directly over the hot coals or burners.",
        "Keep the lid off of the grill and flip the steaks about every 30 seconds as the steaks sear.",
        "Grill the steaks for 2 to 5 minutes so they become dark and charred on the outside.",
        "Resting and Serving the Steaks Check the temperature of the steaks again.",
        "Insert an instant-read thermometer into the thickest part of one of the steaks.",
        "For a medium-rare steak, use tongs to remove it from the grill once it reaches 125 °F (52 °C).",
        "For a medium steak, take it off when it reaches 135 °F (57 °C).",
        "If you'd like well done steak, remove it once it's at 145 °F (63 °C).",
        "Rest the steaks for 5 to 10 minutes.",
        "Transfer the steaks to a cutting board and cover them loosely with a piece of aluminum foil.",
        "Leave the steaks to rest so the juices redistribute within the thick steaks and they finish cooking.",
        "Slice and serve the thick steaks immediately.",
        "Remove the aluminum foil and use a sharp knife to cut the steaks into strips that are about 1/2-inch (1.3 cm) thick.",
        "Serve the thick steaks with baked potatoes, green salad, grilled vegetables, or crusty bread.",
        "Store leftover grilled steak in an airtight container in the refrigerator for 3 to 4 days."
    ]
}