{
    "title": "How to Do a Cut Crease",
    "url": "https://www.wikihow.com/Do-a-Cut-Crease",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Makeup",
        "Eye Makeup",
        "Eye Makeup Styles",
        "Smokey Eye Makeup"
    ],
    "parts": [
        {
            "name": "Priming Your Eyelids",
            "steps": [
                {
                    "headline": "Start with a bare face.",
                    "description": "This way, you won’t have to re-apply foundation if you make a mistake, and you’ll avoid smudging your foundation as you work on your eyes. Start by washing your face with your usual cleanser and applying moisturizer."
                },
                {
                    "headline": "Cover your eyelids with a light layer of eyeshadow primer.",
                    "description": "This will help the color last and blend more naturally. Most eyeshadow primers come in liquid form, and can be applied with a soft makeup brush. If you want a subtle, less dramatic cut crease, use concealer instead of primer."
                },
                {
                    "headline": "Apply a neutral eyeshadow to your brow bone and inner corners of your eyes.",
                    "description": "Using a fine-tipped makeup brush, carefully apply a neutral eyeshadow slightly lighter than your skin tone along the underside of your brow and in the inner corners of your eyes. This will make your eyes and brows look more defined. You can also keep the eyeshadow on hand to clean up any small mistakes or unwanted blurring when you apply the rest of your makeup."
                }
            ]
        },
        {
            "name": "Outlining Your Crease",
            "steps": [
                {
                    "headline": "Apply a medium-toned eyeshadow to your eyelid creases.",
                    "description": "Tilt your head back and use your eyeshadow brush to draw a slightly curved arch just above your natural eyelid crease. The curve should be less steep than your natural curve in order to open up your eyes and make them look bigger. Matte, natural-looking shades will generally work best for this layer, although once you’ve got the hang of it you may want to experiment with bolder colors. A fluffy eyeshadow brush is ideal for applying this outline."
                },
                {
                    "headline": "Trace your eyelid creases again with a darker eyeshadow.",
                    "description": "Choose a color that is similar to your first layer, but darker. For instance, if you used a champagne-colored shadow for the first layer, try a dark brown. If you want a more dramatic look, go for black. This should be a thinner line than the first layer of eyeshadow, accenting only the deepest part of your crease. Use an angled eyeshadow brush. If you have hooded eyes, you may want to trace slightly above your creases with the darker eyeshadow so that the outline isn’t lost in the fold of your eyelid."
                },
                {
                    "headline": "Blend the darker eyeshadow up towards your eyebrows.",
                    "description": "Use a fluffy eyeshadow brush to gently blend the darkest part of your crease up into the first layer of eyeshadow. Use soft strokes and make sure the darker color is blending evenly."
                }
            ]
        },
        {
            "name": "Adding Final Touches",
            "steps": [
                {
                    "headline": "Use a brighter eyeshadow below the cut crease.",
                    "description": "Bronze or gold can be a good choice for a dramatic look, or you can highlight your natural eye color by choosing something on the opposite side of the color wheel. For instance, warm tones like copper go well with blue, and a pink or purple hue will bring green eyes out nicely. Be careful not to blend this layer of eyeshadow with the cut crease."
                },
                {
                    "headline": "Add a thin line of concealer above your eyelashes.",
                    "description": "This will clean up the bottom edge of your eyeshadow and make the colors look more dramatic. Use a thin brush or applicator and be careful not to smudge your eyeshadow. This line should be about as thick as eyeliner, and applied along the full width of your lower lashes."
                },
                {
                    "headline": "Apply liquid black eyeliner in a wing shape to create a  cat-eye effect.",
                    "description": "Choose a marker-tip or liquid black eyeliner and extend your lines past the corners of your eyes and slightly upward, like a little wing. The eyeliner should become slightly thicker towards the outer corners of your eyelids, then come to a point at the end."
                }
            ]
        },
        {
            "name": "Accenting Your Look",
            "steps": [
                {
                    "headline": "Add some glitter to your cut crease for a little sparkle.",
                    "description": "To create an even more glamorous look, you can trace over your cut crease with glitter eyeliner. If you want to add glitter to your lids instead, apply a thin coat of glitter base, then wait about 10 minutes for the primer to get sticky. You can then apply loose glitter using a dry brush."
                },
                {
                    "headline": "Highlight your dramatic eyes by minimizing the rest of your makeup.",
                    "description": "Using light makeup and muted, natural tones for the rest of your look will make your cut creases look smokey and striking but not overdone. Choose a natural-looking foundation, minimal or no blush, and a muted lipstick or gloss."
                },
                {
                    "headline": "Add  false eyelashes if you want to intensify your look.",
                    "description": "For a dramatic, retro-pin-up effect, you can add thick black false eyelashes after applying your makeup. This can be a fun touch when you’re going out clubbing or dressing up for a festival."
                }
            ]
        }
    ],
    "tyn": [
        "Eyeshadow primer",
        "White eyeshadow",
        "Medium-tone eyeshadow (matte, natural color)",
        "Dark eyeshadow (dark brown or black)",
        "Light, shiny eyeshadow (warm, metallic color)",
        "Soft, fluffy eyeshadow brush",
        "Fine-tipped eyeshadow brush",
        "Liquid black eyeliner",
        "Concealer",
        "Glitter eyeliner OR glitter base and loose glitter",
        "False eyelashes"
    ],
    "text": " Priming Your Eyelids Start with a bare face. This way, you won’t have to re-apply foundation if you make a mistake, and you’ll avoid smudging your foundation as you work on your eyes. Start by washing your face with your usual cleanser and applying moisturizer. Cover your eyelids with a light layer of eyeshadow primer. This will help the color last and blend more naturally. Most eyeshadow primers come in liquid form, and can be applied with a soft makeup brush. If you want a subtle, less dramatic cut crease, use concealer instead of primer. Apply a neutral eyeshadow to your brow bone and inner corners of your eyes. Using a fine-tipped makeup brush, carefully apply a neutral eyeshadow slightly lighter than your skin tone along the underside of your brow and in the inner corners of your eyes. This will make your eyes and brows look more defined. You can also keep the eyeshadow on hand to clean up any small mistakes or unwanted blurring when you apply the rest of your makeup. Outlining Your Crease Apply a medium-toned eyeshadow to your eyelid creases. Tilt your head back and use your eyeshadow brush to draw a slightly curved arch just above your natural eyelid crease. The curve should be less steep than your natural curve in order to open up your eyes and make them look bigger. Matte, natural-looking shades will generally work best for this layer, although once you’ve got the hang of it you may want to experiment with bolder colors. A fluffy eyeshadow brush is ideal for applying this outline. Trace your eyelid creases again with a darker eyeshadow. Choose a color that is similar to your first layer, but darker. For instance, if you used a champagne-colored shadow for the first layer, try a dark brown. If you want a more dramatic look, go for black. This should be a thinner line than the first layer of eyeshadow, accenting only the deepest part of your crease. Use an angled eyeshadow brush. If you have hooded eyes, you may want to trace slightly above your creases with the darker eyeshadow so that the outline isn’t lost in the fold of your eyelid. Blend the darker eyeshadow up towards your eyebrows. Use a fluffy eyeshadow brush to gently blend the darkest part of your crease up into the first layer of eyeshadow. Use soft strokes and make sure the darker color is blending evenly. Adding Final Touches Use a brighter eyeshadow below the cut crease. Bronze or gold can be a good choice for a dramatic look, or you can highlight your natural eye color by choosing something on the opposite side of the color wheel. For instance, warm tones like copper go well with blue, and a pink or purple hue will bring green eyes out nicely. Be careful not to blend this layer of eyeshadow with the cut crease. Add a thin line of concealer above your eyelashes. This will clean up the bottom edge of your eyeshadow and make the colors look more dramatic. Use a thin brush or applicator and be careful not to smudge your eyeshadow. This line should be about as thick as eyeliner, and applied along the full width of your lower lashes. Apply liquid black eyeliner in a wing shape to create a  cat-eye effect. Choose a marker-tip or liquid black eyeliner and extend your lines past the corners of your eyes and slightly upward, like a little wing. The eyeliner should become slightly thicker towards the outer corners of your eyelids, then come to a point at the end. Accenting Your Look Add some glitter to your cut crease for a little sparkle. To create an even more glamorous look, you can trace over your cut crease with glitter eyeliner. If you want to add glitter to your lids instead, apply a thin coat of glitter base, then wait about 10 minutes for the primer to get sticky. You can then apply loose glitter using a dry brush. Highlight your dramatic eyes by minimizing the rest of your makeup. Using light makeup and muted, natural tones for the rest of your look will make your cut creases look smokey and striking but not overdone. Choose a natural-looking foundation, minimal or no blush, and a muted lipstick or gloss. Add  false eyelashes if you want to intensify your look. For a dramatic, retro-pin-up effect, you can add thick black false eyelashes after applying your makeup. This can be a fun touch when you’re going out clubbing or dressing up for a festival.",
    "sentences": [
        " Priming Your Eyelids Start with a bare face.",
        "This way, you won’t have to re-apply foundation if you make a mistake, and you’ll avoid smudging your foundation as you work on your eyes.",
        "Start by washing your face with your usual cleanser and applying moisturizer.",
        "Cover your eyelids with a light layer of eyeshadow primer.",
        "This will help the color last and blend more naturally.",
        "Most eyeshadow primers come in liquid form, and can be applied with a soft makeup brush.",
        "If you want a subtle, less dramatic cut crease, use concealer instead of primer.",
        "Apply a neutral eyeshadow to your brow bone and inner corners of your eyes.",
        "Using a fine-tipped makeup brush, carefully apply a neutral eyeshadow slightly lighter than your skin tone along the underside of your brow and in the inner corners of your eyes.",
        "This will make your eyes and brows look more defined.",
        "You can also keep the eyeshadow on hand to clean up any small mistakes or unwanted blurring when you apply the rest of your makeup.",
        "Outlining Your Crease Apply a medium-toned eyeshadow to your eyelid creases.",
        "Tilt your head back and use your eyeshadow brush to draw a slightly curved arch just above your natural eyelid crease.",
        "The curve should be less steep than your natural curve in order to open up your eyes and make them look bigger.",
        "Matte, natural-looking shades will generally work best for this layer, although once you’ve got the hang of it you may want to experiment with bolder colors.",
        "A fluffy eyeshadow brush is ideal for applying this outline.",
        "Trace your eyelid creases again with a darker eyeshadow.",
        "Choose a color that is similar to your first layer, but darker.",
        "For instance, if you used a champagne-colored shadow for the first layer, try a dark brown.",
        "If you want a more dramatic look, go for black.",
        "This should be a thinner line than the first layer of eyeshadow, accenting only the deepest part of your crease.",
        "Use an angled eyeshadow brush.",
        "If you have hooded eyes, you may want to trace slightly above your creases with the darker eyeshadow so that the outline isn’t lost in the fold of your eyelid.",
        "Blend the darker eyeshadow up towards your eyebrows.",
        "Use a fluffy eyeshadow brush to gently blend the darkest part of your crease up into the first layer of eyeshadow.",
        "Use soft strokes and make sure the darker color is blending evenly.",
        "Adding Final Touches Use a brighter eyeshadow below the cut crease.",
        "Bronze or gold can be a good choice for a dramatic look, or you can highlight your natural eye color by choosing something on the opposite side of the color wheel.",
        "For instance, warm tones like copper go well with blue, and a pink or purple hue will bring green eyes out nicely.",
        "Be careful not to blend this layer of eyeshadow with the cut crease.",
        "Add a thin line of concealer above your eyelashes.",
        "This will clean up the bottom edge of your eyeshadow and make the colors look more dramatic.",
        "Use a thin brush or applicator and be careful not to smudge your eyeshadow.",
        "This line should be about as thick as eyeliner, and applied along the full width of your lower lashes.",
        "Apply liquid black eyeliner in a wing shape to create a  cat-eye effect.",
        "Choose a marker-tip or liquid black eyeliner and extend your lines past the corners of your eyes and slightly upward, like a little wing.",
        "The eyeliner should become slightly thicker towards the outer corners of your eyelids, then come to a point at the end.",
        "Accenting Your Look Add some glitter to your cut crease for a little sparkle.",
        "To create an even more glamorous look, you can trace over your cut crease with glitter eyeliner.",
        "If you want to add glitter to your lids instead, apply a thin coat of glitter base, then wait about 10 minutes for the primer to get sticky.",
        "You can then apply loose glitter using a dry brush.",
        "Highlight your dramatic eyes by minimizing the rest of your makeup.",
        "Using light makeup and muted, natural tones for the rest of your look will make your cut creases look smokey and striking but not overdone.",
        "Choose a natural-looking foundation, minimal or no blush, and a muted lipstick or gloss.",
        "Add  false eyelashes if you want to intensify your look.",
        "For a dramatic, retro-pin-up effect, you can add thick black false eyelashes after applying your makeup.",
        "This can be a fun touch when you’re going out clubbing or dressing up for a festival."
    ]
}