{
    "title": "How to Decorate Pillows",
    "url": "https://www.wikihow.com/Decorate-Pillows",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Bedrooms",
        "Bed Linen",
        "Pillows"
    ],
    "methods": [
        {
            "name": "Using Fabric Paint, Markers, and Transfers",
            "steps": [
                {
                    "headline": "Draw designs onto a pillow with fabric markers for something simple.",
                    "description": "Take the pillowcase off of the pillow, then slide a piece of cardboard into it. Sketch out your desired design using a pencil, then trace over it using fabric markers or fabric pens. Let the ink dry, then remove the cardboard and insert the pillow. Fabric markers are translucent, like regular markers. They work best on white pillowcases. Fabric pens are opaque, like paint pens. They work on all types of colors, including white and black. Some types of fabric pens need to be heat-set with an iron. Read the instructions on the pen to make sure."
                },
                {
                    "headline": "Paint designs onto a pillow with fabric paint for something fancier.",
                    "description": "Remove the pillowcase from the pillow, then tuck a piece of cardboard inside it. Sketch out your design with a pencil, then color it in using fabric paints. Use pointed paintbrushes for lines and small areas, and flat paintbrushes for large areas. Let the paint dry completely, then remove the cardboard and insert the pillow. If you can't remove the pillowcase, then just paint directly onto the pillow. Slide your finger between the fabric and the cardboard as the paint dries to prevent sticking. Some types of fabric paints need to be heat-set with an iron. Check the label on the bottle."
                },
                {
                    "headline": "Use stencils if you don't want to free-hand the designs.",
                    "description": "Remove the pillowcase and insert a piece of cardboard. Place an adhesive fabric stencil over the pillowcase, then color it in using fabric paint. Let the paint dry, then peel off the stencil. Heat-set the fabric paint, if needed, then remove the cardboard and insert the pillow. Apply liquid fabric paint with a paintbrush or a foam pouncer. Work your way from the edges of the stencil inward. Apply fabric spray paint from 8 to 10 inches (20 to 25 cm) away. Remember to shake the can prior to using it. You can use regular stencils, but you will need to tape down the edges with painter's tape or masking tape. Create your own stencils using freezer paper (not parchment or wax). Iron the paper shiny-side down to the fabric."
                },
                {
                    "headline": "Use iron-on transfers for intricate designs.",
                    "description": "Remove the pillowcase and set it on top of an ironing board. Cut your desired image out of iron-on transfer paper, then place it face-down on the pillow. Iron the paper according to the instructions on the package, then peel it away. You can buy pre-printed paper or blank paper. If you choose blank paper, you will need to find an image online, then print it on that paper. If you are printing a word or number, reverse it first using an image editing program, such as Paint or Photoshop. If your pillow is colored, choose iron-on transfer paper made for black or colored fabric, otherwise the image won't show."
                },
                {
                    "headline": "Work with your pillow's existing designs.",
                    "description": "If your pillow is already decorated, you can still color it with fabric paint or pens. For example, you could fill in embroidered or quilted outlines with fabric paint or fabric pens. If your pillow has a print on it, you can change the color of the print by going over it with fabric paint or fabric pens."
                }
            ]
        },
        {
            "name": "Playing with Overlays and Appliques",
            "steps": [
                {
                    "headline": "Glue a die-cut felt placemat over a plain pillowcase for a quick option.",
                    "description": "Find a die-cut felt placemat that is the same size (or larger) as your pillow. Cut the placemat down to the right size, if needed, then glue it to the front of your pillow using hot glue or fabric glue. Choose a color that coordinates with your pillow. For example, orange and yellow go well together, as do red and green. You can find die-cut placemats in the craft store. They are typically seasonal, so expects lots of red and hearts around Valentine's day."
                },
                {
                    "headline": "Give a pillow a fresh look by covering the front with new fabric.",
                    "description": "Remove the pillow from the pillowcase. Cut a sheet of fabric to the same size as the pillowcase. Secure it to the front of the pillowcase with fusible web interfacing. Glue coordinating ribbon or decorative cord along the seams to hide the raw edges of the fabric. Insert the pillow when you are done. You can use hot glue or fabric glue for the ribbon or trim."
                },
                {
                    "headline": "Glue felt shapes to the pillowcase if you want 3D designs.",
                    "description": "Remove the pillowcase first. Cut leaf or 5-petal flower shapes out of colored felt. Place a drop of hot glue in the center of the flowers, then press them onto the pillowcase. Draw a line of hot glue down the center of each leaf, and press them onto the pillowcase too. Put the pillowcase back on once the glue dries. The petals of the flowers and the edges of the leaves will stick out realistically. Hot glue buttons or yellow felt circles to the center of each flower for a nicer touch. If you don't want to use hot glue, you can use fabric glue instead."
                },
                {
                    "headline": "Create simple appliques using fabric and fusible web interfacing.",
                    "description": "Iron the fusible web interfacing to the back of your desired fabric. Trace the shapes you want onto the interfacing, then cut them out. Remove the pillowcase, then pin the shapes interfacing-side-down to the pillowcase. Iron the shapes, remove the pins, then reinsert the pillow. If you are doing letters or numbers, be sure to reverse them first. Each brand of fusible web interfacing is different, so follow the instructions carefully. Embroider the edges of the appliques with embroidery thread and a running stitch before you apply them for a more detailed look."
                },
                {
                    "headline": "Sew appliques if you don't have an iron and fusible web interfacing.",
                    "description": "Cut your desired shape out of fabric. Baste it to your pillow with a running stitch. Fold the raw edges under the applique, then sew them down using a whipstitch, ladder stitch, or blanket stitch. Remove the basting stitches when you are done. Remove the pillowcase first, if needed. Alternatively, cut the appliques out of felt, then glue them on with hot glue or fabric glue."
                },
                {
                    "headline": "Fill in embroidered outlines with appliques.",
                    "description": "Remove the pillowcase, then place a sheet of tracing paper over it. Trace inside the embroidered outlines of the designs, then cut the tracings out. Use these to create your appliques, then secure the appliques inside the embroidered shapes. The embroidery will make a nice outline around your appliques. This does not work with solid embroidery, only outlined or quilted embroidery."
                }
            ]
        },
        {
            "name": "Adding Ribbons, Notions, and Trims",
            "steps": [
                {
                    "headline": "Add tassel fringes to pillow edges for a quick and simple design.",
                    "description": "Choose a trim that coordinates with your pillow, and a piece that is long enough to wrap around the edge of your pillow. Glue or sew the trim to the edge of the pillow. If there is a seam, use the seam as a guide. Choose a trim that coordinates with your pillow. Fabric glue will work the best, but you can use hot glue as well. If you choose to sew the trim on, use a whipstitch and a thread color that matches the trim."
                },
                {
                    "headline": "Give plain pillows instant glam by adding lace to the front.",
                    "description": "Choose a wide, flat (not ruffled) lace trim. Cut a piece that is long enough to wrap around the front of your pillow, from seam-to-seam. Sew or glue the lace to the front of the pillow. Use fabric glue, not hot glue. If you choose to sew the lace on, match the thread color to the lace. Use a similar shade for a subtle effect (i.e. ivory lace on a burlap pillow), and contrasting shades for a dramatic effect (i.e. black lace on a white pillow)."
                },
                {
                    "headline": "Glue ribbons across the front of the pillow for a simple look.",
                    "description": "Cut strips of ribbon that are the same length as the pillow. Secure them to the front of the pillow with hot glue or fabric glue. You can use iron-on adhesive too, but you'll have to remove the pillowcase first. For a simple design, glue wide, embroidered ribbon along each of the 4 edges. For an intricate design, glue thin satin or grosgrain ribbon in a lattice or gridded design. Seal the ends of the ribbons with a flame before you glue them. This will keep them from fraying."
                },
                {
                    "headline": "Fill designs on your pillow with buttons for a rustic-chic look.",
                    "description": "Get a pillow with a large, simple design, such as a heart, then remove the insert. Get a bunch of flat buttons that are the same color. Sew them onto the pillow using the design as a guide. Do the outline first, then the inside. Put the pillow back inside the case when you are done. Use different shades of the same color (i.e. light pink, medium pink, and dark pink) for more contrast. Use buttons that are different sizes for a more varied look. If you don't know how to sew, or if you can't remove the pillowcase, glue the buttons on with hot glue or fabric glue."
                },
                {
                    "headline": "Embroider your pillow with beads for a fancier touch.",
                    "description": "Get a pillow with a simple design, such as a heart. String 10 to 12 seed beads onto thread, then stitch them to the outline of the design. Keep going until the outline is done, then do the inside of the design. You don't absolutely have to remove the pillowcase first, but you can if it makes things easier for you. The beads don't all have to be the same color. Try different shades of the same color, such as: pink, red, and burgundy. Use some larger, fancier beads for accent areas."
                },
                {
                    "headline": "Sew shank buttons to a pillow for a tufted look.",
                    "description": "Secure upholstery thread to a shank button with a slip knot, then thread a needle. Push the needle through a pillow and out the back. Remove the needle, then slide each thread through opposing sides of the second button. Pull on the threads to tighten the tuft, then tie them in a double-knot. Buy matching fabric-covered shank buttons or create your own using a cover button kit."
                }
            ]
        }
    ],
    "tyn": [
        "Using Fabric Paint, Markers, and Transfers",
        "Pillow",
        "Cardboard",
        "Pencil",
        "Fabric paint, markers, or pens",
        "Stencils (optional)",
        "Iron (if needed, for heat-setting)",
        "Playing with Overlays and Appliques",
        "Extra fabric",
        "Fusible web interfacing",
        "Iron",
        "Adding Ribbons, Notions, and Trims",
        "Hot glue, fabric glue, or needle and thread",
        "Ribbon, laces, beads, or buttons"
    ],
    "text": " Using Fabric Paint, Markers, and Transfers Draw designs onto a pillow with fabric markers for something simple. Take the pillowcase off of the pillow, then slide a piece of cardboard into it. Sketch out your desired design using a pencil, then trace over it using fabric markers or fabric pens. Let the ink dry, then remove the cardboard and insert the pillow. Fabric markers are translucent, like regular markers. They work best on white pillowcases. Fabric pens are opaque, like paint pens. They work on all types of colors, including white and black. Some types of fabric pens need to be heat-set with an iron. Read the instructions on the pen to make sure. Paint designs onto a pillow with fabric paint for something fancier. Remove the pillowcase from the pillow, then tuck a piece of cardboard inside it. Sketch out your design with a pencil, then color it in using fabric paints. Use pointed paintbrushes for lines and small areas, and flat paintbrushes for large areas. Let the paint dry completely, then remove the cardboard and insert the pillow. If you can't remove the pillowcase, then just paint directly onto the pillow. Slide your finger between the fabric and the cardboard as the paint dries to prevent sticking. Some types of fabric paints need to be heat-set with an iron. Check the label on the bottle. Use stencils if you don't want to free-hand the designs. Remove the pillowcase and insert a piece of cardboard. Place an adhesive fabric stencil over the pillowcase, then color it in using fabric paint. Let the paint dry, then peel off the stencil. Heat-set the fabric paint, if needed, then remove the cardboard and insert the pillow. Apply liquid fabric paint with a paintbrush or a foam pouncer. Work your way from the edges of the stencil inward. Apply fabric spray paint from 8 to 10 inches (20 to 25 cm) away. Remember to shake the can prior to using it. You can use regular stencils, but you will need to tape down the edges with painter's tape or masking tape. Create your own stencils using freezer paper (not parchment or wax). Iron the paper shiny-side down to the fabric. Use iron-on transfers for intricate designs. Remove the pillowcase and set it on top of an ironing board. Cut your desired image out of iron-on transfer paper, then place it face-down on the pillow. Iron the paper according to the instructions on the package, then peel it away. You can buy pre-printed paper or blank paper. If you choose blank paper, you will need to find an image online, then print it on that paper. If you are printing a word or number, reverse it first using an image editing program, such as Paint or Photoshop. If your pillow is colored, choose iron-on transfer paper made for black or colored fabric, otherwise the image won't show. Work with your pillow's existing designs. If your pillow is already decorated, you can still color it with fabric paint or pens. For example, you could fill in embroidered or quilted outlines with fabric paint or fabric pens. If your pillow has a print on it, you can change the color of the print by going over it with fabric paint or fabric pens. Playing with Overlays and Appliques Glue a die-cut felt placemat over a plain pillowcase for a quick option. Find a die-cut felt placemat that is the same size (or larger) as your pillow. Cut the placemat down to the right size, if needed, then glue it to the front of your pillow using hot glue or fabric glue. Choose a color that coordinates with your pillow. For example, orange and yellow go well together, as do red and green. You can find die-cut placemats in the craft store. They are typically seasonal, so expects lots of red and hearts around Valentine's day. Give a pillow a fresh look by covering the front with new fabric. Remove the pillow from the pillowcase. Cut a sheet of fabric to the same size as the pillowcase. Secure it to the front of the pillowcase with fusible web interfacing. Glue coordinating ribbon or decorative cord along the seams to hide the raw edges of the fabric. Insert the pillow when you are done. You can use hot glue or fabric glue for the ribbon or trim. Glue felt shapes to the pillowcase if you want 3D designs. Remove the pillowcase first. Cut leaf or 5-petal flower shapes out of colored felt. Place a drop of hot glue in the center of the flowers, then press them onto the pillowcase. Draw a line of hot glue down the center of each leaf, and press them onto the pillowcase too. Put the pillowcase back on once the glue dries. The petals of the flowers and the edges of the leaves will stick out realistically. Hot glue buttons or yellow felt circles to the center of each flower for a nicer touch. If you don't want to use hot glue, you can use fabric glue instead. Create simple appliques using fabric and fusible web interfacing. Iron the fusible web interfacing to the back of your desired fabric. Trace the shapes you want onto the interfacing, then cut them out. Remove the pillowcase, then pin the shapes interfacing-side-down to the pillowcase. Iron the shapes, remove the pins, then reinsert the pillow. If you are doing letters or numbers, be sure to reverse them first. Each brand of fusible web interfacing is different, so follow the instructions carefully. Embroider the edges of the appliques with embroidery thread and a running stitch before you apply them for a more detailed look. Sew appliques if you don't have an iron and fusible web interfacing. Cut your desired shape out of fabric. Baste it to your pillow with a running stitch. Fold the raw edges under the applique, then sew them down using a whipstitch, ladder stitch, or blanket stitch. Remove the basting stitches when you are done. Remove the pillowcase first, if needed. Alternatively, cut the appliques out of felt, then glue them on with hot glue or fabric glue. Fill in embroidered outlines with appliques. Remove the pillowcase, then place a sheet of tracing paper over it. Trace inside the embroidered outlines of the designs, then cut the tracings out. Use these to create your appliques, then secure the appliques inside the embroidered shapes. The embroidery will make a nice outline around your appliques. This does not work with solid embroidery, only outlined or quilted embroidery. Adding Ribbons, Notions, and Trims Add tassel fringes to pillow edges for a quick and simple design. Choose a trim that coordinates with your pillow, and a piece that is long enough to wrap around the edge of your pillow. Glue or sew the trim to the edge of the pillow. If there is a seam, use the seam as a guide. Choose a trim that coordinates with your pillow. Fabric glue will work the best, but you can use hot glue as well. If you choose to sew the trim on, use a whipstitch and a thread color that matches the trim. Give plain pillows instant glam by adding lace to the front. Choose a wide, flat (not ruffled) lace trim. Cut a piece that is long enough to wrap around the front of your pillow, from seam-to-seam. Sew or glue the lace to the front of the pillow. Use fabric glue, not hot glue. If you choose to sew the lace on, match the thread color to the lace. Use a similar shade for a subtle effect (i.e. ivory lace on a burlap pillow), and contrasting shades for a dramatic effect (i.e. black lace on a white pillow). Glue ribbons across the front of the pillow for a simple look. Cut strips of ribbon that are the same length as the pillow. Secure them to the front of the pillow with hot glue or fabric glue. You can use iron-on adhesive too, but you'll have to remove the pillowcase first. For a simple design, glue wide, embroidered ribbon along each of the 4 edges. For an intricate design, glue thin satin or grosgrain ribbon in a lattice or gridded design. Seal the ends of the ribbons with a flame before you glue them. This will keep them from fraying. Fill designs on your pillow with buttons for a rustic-chic look. Get a pillow with a large, simple design, such as a heart, then remove the insert. Get a bunch of flat buttons that are the same color. Sew them onto the pillow using the design as a guide. Do the outline first, then the inside. Put the pillow back inside the case when you are done. Use different shades of the same color (i.e. light pink, medium pink, and dark pink) for more contrast. Use buttons that are different sizes for a more varied look. If you don't know how to sew, or if you can't remove the pillowcase, glue the buttons on with hot glue or fabric glue. Embroider your pillow with beads for a fancier touch. Get a pillow with a simple design, such as a heart. String 10 to 12 seed beads onto thread, then stitch them to the outline of the design. Keep going until the outline is done, then do the inside of the design. You don't absolutely have to remove the pillowcase first, but you can if it makes things easier for you. The beads don't all have to be the same color. Try different shades of the same color, such as: pink, red, and burgundy. Use some larger, fancier beads for accent areas. Sew shank buttons to a pillow for a tufted look. Secure upholstery thread to a shank button with a slip knot, then thread a needle. Push the needle through a pillow and out the back. Remove the needle, then slide each thread through opposing sides of the second button. Pull on the threads to tighten the tuft, then tie them in a double-knot. Buy matching fabric-covered shank buttons or create your own using a cover button kit.",
    "sentences": [
        " Using Fabric Paint, Markers, and Transfers Draw designs onto a pillow with fabric markers for something simple.",
        "Take the pillowcase off of the pillow, then slide a piece of cardboard into it.",
        "Sketch out your desired design using a pencil, then trace over it using fabric markers or fabric pens.",
        "Let the ink dry, then remove the cardboard and insert the pillow.",
        "Fabric markers are translucent, like regular markers.",
        "They work best on white pillowcases.",
        "Fabric pens are opaque, like paint pens.",
        "They work on all types of colors, including white and black.",
        "Some types of fabric pens need to be heat-set with an iron.",
        "Read the instructions on the pen to make sure.",
        "Paint designs onto a pillow with fabric paint for something fancier.",
        "Remove the pillowcase from the pillow, then tuck a piece of cardboard inside it.",
        "Sketch out your design with a pencil, then color it in using fabric paints.",
        "Use pointed paintbrushes for lines and small areas, and flat paintbrushes for large areas.",
        "Let the paint dry completely, then remove the cardboard and insert the pillow.",
        "If you can't remove the pillowcase, then just paint directly onto the pillow.",
        "Slide your finger between the fabric and the cardboard as the paint dries to prevent sticking.",
        "Some types of fabric paints need to be heat-set with an iron.",
        "Check the label on the bottle.",
        "Use stencils if you don't want to free-hand the designs.",
        "Remove the pillowcase and insert a piece of cardboard.",
        "Place an adhesive fabric stencil over the pillowcase, then color it in using fabric paint.",
        "Let the paint dry, then peel off the stencil.",
        "Heat-set the fabric paint, if needed, then remove the cardboard and insert the pillow.",
        "Apply liquid fabric paint with a paintbrush or a foam pouncer.",
        "Work your way from the edges of the stencil inward.",
        "Apply fabric spray paint from 8 to 10 inches (20 to 25 cm) away.",
        "Remember to shake the can prior to using it.",
        "You can use regular stencils, but you will need to tape down the edges with painter's tape or masking tape.",
        "Create your own stencils using freezer paper (not parchment or wax).",
        "Iron the paper shiny-side down to the fabric.",
        "Use iron-on transfers for intricate designs.",
        "Remove the pillowcase and set it on top of an ironing board.",
        "Cut your desired image out of iron-on transfer paper, then place it face-down on the pillow.",
        "Iron the paper according to the instructions on the package, then peel it away.",
        "You can buy pre-printed paper or blank paper.",
        "If you choose blank paper, you will need to find an image online, then print it on that paper.",
        "If you are printing a word or number, reverse it first using an image editing program, such as Paint or Photoshop.",
        "If your pillow is colored, choose iron-on transfer paper made for black or colored fabric, otherwise the image won't show.",
        "Work with your pillow's existing designs.",
        "If your pillow is already decorated, you can still color it with fabric paint or pens.",
        "For example, you could fill in embroidered or quilted outlines with fabric paint or fabric pens.",
        "If your pillow has a print on it, you can change the color of the print by going over it with fabric paint or fabric pens.",
        "Playing with Overlays and Appliques Glue a die-cut felt placemat over a plain pillowcase for a quick option.",
        "Find a die-cut felt placemat that is the same size (or larger) as your pillow.",
        "Cut the placemat down to the right size, if needed, then glue it to the front of your pillow using hot glue or fabric glue.",
        "Choose a color that coordinates with your pillow.",
        "For example, orange and yellow go well together, as do red and green.",
        "You can find die-cut placemats in the craft store.",
        "They are typically seasonal, so expects lots of red and hearts around Valentine's day.",
        "Give a pillow a fresh look by covering the front with new fabric.",
        "Remove the pillow from the pillowcase.",
        "Cut a sheet of fabric to the same size as the pillowcase.",
        "Secure it to the front of the pillowcase with fusible web interfacing.",
        "Glue coordinating ribbon or decorative cord along the seams to hide the raw edges of the fabric.",
        "Insert the pillow when you are done.",
        "You can use hot glue or fabric glue for the ribbon or trim.",
        "Glue felt shapes to the pillowcase if you want 3D designs.",
        "Remove the pillowcase first.",
        "Cut leaf or 5-petal flower shapes out of colored felt.",
        "Place a drop of hot glue in the center of the flowers, then press them onto the pillowcase.",
        "Draw a line of hot glue down the center of each leaf, and press them onto the pillowcase too.",
        "Put the pillowcase back on once the glue dries.",
        "The petals of the flowers and the edges of the leaves will stick out realistically.",
        "Hot glue buttons or yellow felt circles to the center of each flower for a nicer touch.",
        "If you don't want to use hot glue, you can use fabric glue instead.",
        "Create simple appliques using fabric and fusible web interfacing.",
        "Iron the fusible web interfacing to the back of your desired fabric.",
        "Trace the shapes you want onto the interfacing, then cut them out.",
        "Remove the pillowcase, then pin the shapes interfacing-side-down to the pillowcase.",
        "Iron the shapes, remove the pins, then reinsert the pillow.",
        "If you are doing letters or numbers, be sure to reverse them first.",
        "Each brand of fusible web interfacing is different, so follow the instructions carefully.",
        "Embroider the edges of the appliques with embroidery thread and a running stitch before you apply them for a more detailed look.",
        "Sew appliques if you don't have an iron and fusible web interfacing.",
        "Cut your desired shape out of fabric.",
        "Baste it to your pillow with a running stitch.",
        "Fold the raw edges under the applique, then sew them down using a whipstitch, ladder stitch, or blanket stitch.",
        "Remove the basting stitches when you are done.",
        "Remove the pillowcase first, if needed.",
        "Alternatively, cut the appliques out of felt, then glue them on with hot glue or fabric glue.",
        "Fill in embroidered outlines with appliques.",
        "Remove the pillowcase, then place a sheet of tracing paper over it.",
        "Trace inside the embroidered outlines of the designs, then cut the tracings out.",
        "Use these to create your appliques, then secure the appliques inside the embroidered shapes.",
        "The embroidery will make a nice outline around your appliques.",
        "This does not work with solid embroidery, only outlined or quilted embroidery.",
        "Adding Ribbons, Notions, and Trims Add tassel fringes to pillow edges for a quick and simple design.",
        "Choose a trim that coordinates with your pillow, and a piece that is long enough to wrap around the edge of your pillow.",
        "Glue or sew the trim to the edge of the pillow.",
        "If there is a seam, use the seam as a guide.",
        "Choose a trim that coordinates with your pillow.",
        "Fabric glue will work the best, but you can use hot glue as well.",
        "If you choose to sew the trim on, use a whipstitch and a thread color that matches the trim.",
        "Give plain pillows instant glam by adding lace to the front.",
        "Choose a wide, flat (not ruffled) lace trim.",
        "Cut a piece that is long enough to wrap around the front of your pillow, from seam-to-seam.",
        "Sew or glue the lace to the front of the pillow.",
        "Use fabric glue, not hot glue.",
        "If you choose to sew the lace on, match the thread color to the lace.",
        "Use a similar shade for a subtle effect (i.e.",
        "ivory lace on a burlap pillow), and contrasting shades for a dramatic effect (i.e.",
        "black lace on a white pillow).",
        "Glue ribbons across the front of the pillow for a simple look.",
        "Cut strips of ribbon that are the same length as the pillow.",
        "Secure them to the front of the pillow with hot glue or fabric glue.",
        "You can use iron-on adhesive too, but you'll have to remove the pillowcase first.",
        "For a simple design, glue wide, embroidered ribbon along each of the 4 edges.",
        "For an intricate design, glue thin satin or grosgrain ribbon in a lattice or gridded design.",
        "Seal the ends of the ribbons with a flame before you glue them.",
        "This will keep them from fraying.",
        "Fill designs on your pillow with buttons for a rustic-chic look.",
        "Get a pillow with a large, simple design, such as a heart, then remove the insert.",
        "Get a bunch of flat buttons that are the same color.",
        "Sew them onto the pillow using the design as a guide.",
        "Do the outline first, then the inside.",
        "Put the pillow back inside the case when you are done.",
        "Use different shades of the same color (i.e.",
        "light pink, medium pink, and dark pink) for more contrast.",
        "Use buttons that are different sizes for a more varied look.",
        "If you don't know how to sew, or if you can't remove the pillowcase, glue the buttons on with hot glue or fabric glue.",
        "Embroider your pillow with beads for a fancier touch.",
        "Get a pillow with a simple design, such as a heart.",
        "String 10 to 12 seed beads onto thread, then stitch them to the outline of the design.",
        "Keep going until the outline is done, then do the inside of the design.",
        "You don't absolutely have to remove the pillowcase first, but you can if it makes things easier for you.",
        "The beads don't all have to be the same color.",
        "Try different shades of the same color, such as: pink, red, and burgundy.",
        "Use some larger, fancier beads for accent areas.",
        "Sew shank buttons to a pillow for a tufted look.",
        "Secure upholstery thread to a shank button with a slip knot, then thread a needle.",
        "Push the needle through a pillow and out the back.",
        "Remove the needle, then slide each thread through opposing sides of the second button.",
        "Pull on the threads to tighten the tuft, then tie them in a double-knot.",
        "Buy matching fabric-covered shank buttons or create your own using a cover button kit."
    ]
}