{
    "title": "How to Read pH Strips",
    "url": "https://www.wikihow.com/Read-pH-Strips",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Science",
        "Chemistry"
    ],
    "parts": [
        {
            "name": "Using the pH Strips",
            "steps": [
                {
                    "headline": "Make sure your strips test the range you need.",
                    "description": "The pH scale covers a range of 14 numbers, where 7 is neutral. Lower numbers are more acidic, while higher numbers are more alkaline. Some strips only test a portion of that spectrum, so make sure the strips you buy cover the pH levels you want to test for."
                },
                {
                    "headline": "Read the box to determine how long to leave the strips in.",
                    "description": "Some test strips only need to be left in the test liquid for about a second, while others need about 20 seconds to produce a reading. Be sure to read the instructions to ensure that your reading will be accurate."
                },
                {
                    "headline": "Dip one end of the test strip in the substance you want to test.",
                    "description": "You don’t need to submerge the whole strip in the test substance. Hold the strip at one end and dip the other end in the liquid, then remove it after the appropriate length of time. You can use pH strips to test the pH level of any liquid."
                },
                {
                    "headline": "Compare the color of the strip to the chart provided.",
                    "description": "Your pH strips should come with a pH color chart. When your test strip has finished reacting, hold it up to the chart and compare the color of the strip to the color chart. When you find the number associated with the color on the strip, you’ll have your pH reading. Acids are represented by warm colors, such as red and orange, while alkalines are associated with cooler colors, like blue and green."
                },
                {
                    "headline": "Look for a universal chart online if you don't have one.",
                    "description": "If you lose the chart that comes with your strips, or if your strips didn't come with a chart, you can look online for a universal chart. Even if you can't match your color exactly, you should get a close approximation of the pH level."
                }
            ]
        },
        {
            "name": "Knowing What to Test",
            "steps": [
                {
                    "headline": "Test your tap water to make sure it’s acid neutral.",
                    "description": "Water is neutral, meaning it should have a pH balance of 7. Most drinking water falls in the range of 6.5-8.5. Test your drinking water to see if it falls within this range. If it isn't, there may be a contaminant in your water supply."
                },
                {
                    "headline": "Keep your swimming pool balanced by testing the pH levels.",
                    "description": "A swimming pool should stay at a pH balance of between 7.4 and 7.6. Add a product made with soda ash if the pool is below 7.4 and muriatic acid if it’s above 7.6."
                },
                {
                    "headline": "Test the pH levels in your aquarium if you have one.",
                    "description": "The pH balance in your aquarium is critical to keeping your fish healthy. Since the pH levels of natural waters vary, it makes sense that different fish would have different pH requirements. Make sure you know the best pH range for your fish and test your water to make sure it falls within that range. There are a number of products available at pet supply stores to raise or lower the pH level of your fish tank."
                },
                {
                    "headline": "Measure the pH of your saliva to test your oral health.",
                    "description": "The average pH of saliva is around 6.7, but a normal range is anywhere from 6.2-7.6. If you measure your saliva and it is drastically different, your teeth are at a higher risk for cavities or gingivitis. Make sure you don’t eat or drink anything for about 30 minutes prior to testing your saliva, as this can throw off the reading."
                }
            ]
        }
    ],
    "tyn": [
        "Universal pH strip",
        "pH chart on box",
        "Something to test"
    ],
    "text": " Using the pH Strips Make sure your strips test the range you need. The pH scale covers a range of 14 numbers, where 7 is neutral. Lower numbers are more acidic, while higher numbers are more alkaline. Some strips only test a portion of that spectrum, so make sure the strips you buy cover the pH levels you want to test for. Read the box to determine how long to leave the strips in. Some test strips only need to be left in the test liquid for about a second, while others need about 20 seconds to produce a reading. Be sure to read the instructions to ensure that your reading will be accurate. Dip one end of the test strip in the substance you want to test. You don’t need to submerge the whole strip in the test substance. Hold the strip at one end and dip the other end in the liquid, then remove it after the appropriate length of time. You can use pH strips to test the pH level of any liquid. Compare the color of the strip to the chart provided. Your pH strips should come with a pH color chart. When your test strip has finished reacting, hold it up to the chart and compare the color of the strip to the color chart. When you find the number associated with the color on the strip, you’ll have your pH reading. Acids are represented by warm colors, such as red and orange, while alkalines are associated with cooler colors, like blue and green. Look for a universal chart online if you don't have one. If you lose the chart that comes with your strips, or if your strips didn't come with a chart, you can look online for a universal chart. Even if you can't match your color exactly, you should get a close approximation of the pH level. Knowing What to Test Test your tap water to make sure it’s acid neutral. Water is neutral, meaning it should have a pH balance of 7. Most drinking water falls in the range of 6.5-8.5. Test your drinking water to see if it falls within this range. If it isn't, there may be a contaminant in your water supply. Keep your swimming pool balanced by testing the pH levels. A swimming pool should stay at a pH balance of between 7.4 and 7.6. Add a product made with soda ash if the pool is below 7.4 and muriatic acid if it’s above 7.6. Test the pH levels in your aquarium if you have one. The pH balance in your aquarium is critical to keeping your fish healthy. Since the pH levels of natural waters vary, it makes sense that different fish would have different pH requirements. Make sure you know the best pH range for your fish and test your water to make sure it falls within that range. There are a number of products available at pet supply stores to raise or lower the pH level of your fish tank. Measure the pH of your saliva to test your oral health. The average pH of saliva is around 6.7, but a normal range is anywhere from 6.2-7.6. If you measure your saliva and it is drastically different, your teeth are at a higher risk for cavities or gingivitis. Make sure you don’t eat or drink anything for about 30 minutes prior to testing your saliva, as this can throw off the reading.",
    "sentences": [
        " Using the pH Strips Make sure your strips test the range you need.",
        "The pH scale covers a range of 14 numbers, where 7 is neutral.",
        "Lower numbers are more acidic, while higher numbers are more alkaline.",
        "Some strips only test a portion of that spectrum, so make sure the strips you buy cover the pH levels you want to test for.",
        "Read the box to determine how long to leave the strips in.",
        "Some test strips only need to be left in the test liquid for about a second, while others need about 20 seconds to produce a reading.",
        "Be sure to read the instructions to ensure that your reading will be accurate.",
        "Dip one end of the test strip in the substance you want to test.",
        "You don’t need to submerge the whole strip in the test substance.",
        "Hold the strip at one end and dip the other end in the liquid, then remove it after the appropriate length of time.",
        "You can use pH strips to test the pH level of any liquid.",
        "Compare the color of the strip to the chart provided.",
        "Your pH strips should come with a pH color chart.",
        "When your test strip has finished reacting, hold it up to the chart and compare the color of the strip to the color chart.",
        "When you find the number associated with the color on the strip, you’ll have your pH reading.",
        "Acids are represented by warm colors, such as red and orange, while alkalines are associated with cooler colors, like blue and green.",
        "Look for a universal chart online if you don't have one.",
        "If you lose the chart that comes with your strips, or if your strips didn't come with a chart, you can look online for a universal chart.",
        "Even if you can't match your color exactly, you should get a close approximation of the pH level.",
        "Knowing What to Test Test your tap water to make sure it’s acid neutral.",
        "Water is neutral, meaning it should have a pH balance of 7.",
        "Most drinking water falls in the range of 6.5-8.5.",
        "Test your drinking water to see if it falls within this range.",
        "If it isn't, there may be a contaminant in your water supply.",
        "Keep your swimming pool balanced by testing the pH levels.",
        "A swimming pool should stay at a pH balance of between 7.4 and 7.6.",
        "Add a product made with soda ash if the pool is below 7.4 and muriatic acid if it’s above 7.6.",
        "Test the pH levels in your aquarium if you have one.",
        "The pH balance in your aquarium is critical to keeping your fish healthy.",
        "Since the pH levels of natural waters vary, it makes sense that different fish would have different pH requirements.",
        "Make sure you know the best pH range for your fish and test your water to make sure it falls within that range.",
        "There are a number of products available at pet supply stores to raise or lower the pH level of your fish tank.",
        "Measure the pH of your saliva to test your oral health.",
        "The average pH of saliva is around 6.7, but a normal range is anywhere from 6.2-7.6.",
        "If you measure your saliva and it is drastically different, your teeth are at a higher risk for cavities or gingivitis.",
        "Make sure you don’t eat or drink anything for about 30 minutes prior to testing your saliva, as this can throw off the reading."
    ]
}