{
    "title": "How to Raise Meat Chickens",
    "url": "https://www.wikihow.com/Raise-Meat-Chickens",
    "category_hierarchy": [
        "Pets and Animals",
        "Birds",
        "Bird Breeds"
    ],
    "parts": [
        {
            "name": "Building the Coop",
            "steps": [
                {
                    "headline": "Check your laws and regulations.",
                    "description": "Keeping chickens may not be an option in your area, or there might be some strict rules to abide by. If you live rural, you're more likely to have less laws. Regulations should be available to view online. Before you make the option of buying and raising broiler chicks, remember that it is very time-consuming and demanding. Ensure your schedule is close to empty on most days."
                },
                {
                    "headline": "Build or buy a coop and/or run.",
                    "description": "Chicken coops can be bought from a warehouse store or online. Although building your own coop is more time-consuming, it's considerably cheaper and you can add your own dimensions to the design. Basic blueprints can be acquired online. The coop must have 2-3 square feet per chicken and 8-10 square feet in the run."
                },
                {
                    "headline": "Consider a run or free-range option.",
                    "description": "Weigh out the pros and cons. If you have many predators in the area, free-range may be the less likely alternative. Investing in a run will ensure your chickens will have a safer place to roam. Keeping your chickens cooped up in a large enough housing system is also an option, but free-roaming outdoors has always been considered the healthiest for your flock."
                },
                {
                    "headline": "Install nesting boxes.",
                    "description": "Meat chickens still lay eggs, and consequently require nesting boxes. These are great to invest in as they are cleaner and safer for the eggs to be kept, since most bacteria gathers on the flooring of the coop and there is a less chance of the eggs breaking. You can buy nest boxes from a pet shop, or ranch supply store. Having said that, it's very easy to make these boxes out of scrap wood too. You will need 1 nest box for every 4 hens."
                },
                {
                    "headline": "Install roosts.",
                    "description": "Chickens don't naturally sleep on the floor, and like to rest high above  ground. A roost will provide your hens with this sense of security and comfort that the floor won't. Ensure that the roosts aren't installed too high up, as broiler breeds are quite heavy."
                },
                {
                    "headline": "Choose a quality bedding material.",
                    "description": "Ensure you are financing for a high-quality and absorbent materiel. There are many options to choose, including that of below. Sand is absorbent, but may need more frequent cleaning. Wood shavings are the most common, but avoid cedar and/or pine. Hay is also a good option, but it's absorbency isn't as good as wood shavings, and can be expensive depending on where you source it from."
                },
                {
                    "headline": "Add necessary equipment to the coop.",
                    "description": "Your chickens will need a feeder for their pellets, a drinker with fresh water, and a scrap bowl if you would like to feed your chickens unwanted leftovers. Depending on the amount of chicks/pullets you buy, you will probably need a large feeder/drinker to hold plenty of pellets and fresh water."
                },
                {
                    "headline": "Set up the brooder for chicks.",
                    "description": "Young chicks cannot go straight into the coop. They need a warm and secure (smaller) environment to make up for the absent of a mother hen. You will need a heat lamp, drinker and feeder with chick crumbs. A brooder is a simple box that is well-insulated yet ventilated as well."
                }
            ]
        },
        {
            "name": "Buying Your Chickens",
            "steps": [
                {
                    "headline": "Decide if you'd like chicks or pullets.",
                    "description": "Chicks are cheaper, whilst pullets are more expensive but will be closer to their butchering date. Chicks will also need a brooder whilst pullets can go straight into their coop at over 6 weeks of age. Another option would be fertile eggs, which will require you to invest into an incubator."
                },
                {
                    "headline": "Consider the breed.",
                    "description": "You specifically want a reliable broiler breed that is designed for meat purposes. If you also want eggs, there are some great dual breeds that have a high egg production rate whilst being large, sturdy breeds ready to be butchered. That being said, not all dual-breeds grow as quick as broiler chickens. Plymouth rocks and orpington make great dual breeds. Cornish, leghorns and brahmas make fast-growing meat breeds."
                },
                {
                    "headline": "Find a reputable breeder.",
                    "description": "If you would like a trustworthy place to find your chicks, that ensures you'll get a genetically healthy flock, breeders are the way to go. You may have to ask around or look online to find one that specifically breeds broiler chickens."
                },
                {
                    "headline": "Visit a farming store.",
                    "description": "These general stores tend to sell day old chicks that have been sexed, or at least take orders down. You can also find day old chicks at pet stores, but they might not specifically be meat chickens. You're after hens, not roosters, since hens hold more meat. Make sure your chicks are sexed properly."
                },
                {
                    "headline": "Buy online.",
                    "description": "Most hatcheries are now online, and it's an easy way to get the breed you are after. Although be aware of the consequences of mail-delivery chicks, as they're prone to death on the way over. The main reason why it's suggested to buy more than needed."
                }
            ]
        },
        {
            "name": "Feeding Your Chickens",
            "steps": [
                {
                    "headline": "Start with chick crumbs.",
                    "description": "For meat chickens it is important to start them off with a meat starter, which contains a very high 20-24% of protein. You have the option to feed them medicated or non-medicated feed. Medicated feed prevents chicks from getting coccidiosis. Feed chicks this up until 6 weeks. Broiler breeds grow rapidly. You will need 30 to 50 lbs. (14 to 23 kg) of broiler starter for 10 chicks."
                },
                {
                    "headline": "Purchase finisher pellets.",
                    "description": "Feed these to your chicks after they have grown to 6 weeks of age. These pellets should be fed up until slaughter date with a protein content of 16-20%\n16 to 20 lbs. (7 to 9 kg) will feed 10 birds."
                },
                {
                    "headline": "Feed them scraps.",
                    "description": "It's time to take advantage of your living compost system! Chickens will eat almost anything and everything. Just remember that they cannot digest avocado, tomato stems, salt or sugary sweets."
                }
            ]
        },
        {
            "name": "Caring for Your Chickens",
            "steps": [
                {
                    "headline": "Refill the water daily.",
                    "description": "You'll be looking at refilling the drinker, or water dish, two or three times a day. Living conditions get messy really fast, and chicks have a tendency to spill contents into their water dish."
                },
                {
                    "headline": "Refill the pellets daily.",
                    "description": "Growing chickens eat their way through a lot, so it is important to provide them with pellets and check in on them time by time. Remember, you don't want to over-feed them at a young age, but you also want to avoid under-feeding them."
                },
                {
                    "headline": "Move your chicks to the coop.",
                    "description": "At about 4-5 weeks you can begin to transfer your chicks to a fully set-up coop. Depending on the temperature, you might want to wait a few more weeks or set a heat lamp inside the coop. Broiler breeds grow fast, so will require more space as they grow. A lack of space can lead to aggressive behavioral habits."
                },
                {
                    "headline": "Consider installing artificial light.",
                    "description": "Chickens roost at dawn, or at any time when it starts to get dark. This is a natural instinct, so if you want your chickens to stay up more to eat, artificial lights will solve this issue."
                }
            ]
        },
        {
            "name": "Butchering Your Chickens",
            "steps": [
                {
                    "headline": "Determine the weight of your hens.",
                    "description": "Typically, it's time to butcher at about 8 weeks of age if you have a fast-growing broiler breed. It's best to butcher when the hens reach about 5-7 pounds."
                },
                {
                    "headline": "Contact a poultry processor.",
                    "description": "Such places will process chickens for you, or you can contact a small business that process chickens. Although there is a fee to process your chickens, it can come up a lot cheaper then investing into your own equipment, especially if this is a one-time thing. This is a fantastic idea if you want someone to do the dirty work for you, and understandable too."
                },
                {
                    "headline": "Invest into slaughter equipment.",
                    "description": "You will need to invest in a killing cone, two sharp knives, a large pot, heavy-duty gloves, a plucking machine, pinning knife,"
                },
                {
                    "headline": "Prepare the scalding station.",
                    "description": "You will need to heat a large enough pot to 135​ F to 140​ ​F for a proper scalding temperature. It is critical that it isn't too hot that it boils the skin off, but not too cold that the feathers cannot be plucked properly."
                },
                {
                    "headline": "Know how to hold your chickens.",
                    "description": "You want to hold your chickens firmly by both legs with one hand, this gives you full control of the chicken and avoids any harm to them. This way you can easily maneuver them to the cone without any struggle."
                },
                {
                    "headline": "Place the chicken in the cone.",
                    "description": "Pull the head firmly through the opening of the cone and using a sharp knife cut behind the tendon which attaches to the beak and tongue. Cut two deep slices on each side of the neck. You should feel a hard cartilage behind the jaw attachment."
                },
                {
                    "headline": "Allow the blood to drain.",
                    "description": "Firmly pull the head down and allow the blood to drain properly. This may take a few moments for the blood to properly drain. Definitely make sure an old bucket is underneath before this point."
                },
                {
                    "headline": "Scald the chicken.",
                    "description": "After drainer properly, you will need to scald your chicken at an appropriate temperature so that the feathers become loose and ready to be plucked. With gloves, hold the body by the legs and dunk the chicken in the water head-first. Swirl the body (including leg feathers) around until it is scalded enough. Check to see if it's at the right temperature by plucking at the feathers by hand. If they do not come off as easy as you'd like then the temperature may be too low. You can do so by rubbing you fingers on the leg, or plucking a tail/wing feather."
                },
                {
                    "headline": "Pluck your chicken.",
                    "description": "There are a number of methods to choose, depending which is right for you. The easiest would be to invest in a plucking machine, which can take seconds to pluck your chicken. However, you can always hand-pluck a chicken by rubbing the feathers off and using a pinning knife. Even after going through a plucking machine the chicken may need to get a few pins off with a knife."
                },
                {
                    "headline": "Store your chicken.",
                    "description": "Uncooked poultry can be held in the freezer for 1 year or 9 months for cut pieces of chicken and refrigerated for 1-2 days. With a large enough freezer and good storage conditions, this leaves you with plenty of time."
                }
            ]
        }
    ],
    "tyn": [
        "Chicken coop and/or run.",
        "Nesting box.",
        "Roost.",
        "Feeder.",
        "Drinker.",
        "Spare scrap dish.",
        "Brooder.",
        "Heat lamp.",
        "Incubator (optional).",
        "Broiler starter crumbs.",
        "Finisher pellets.",
        "Killing cone.",
        "Sharp knife.",
        "Pinning knife.",
        "Plucking machine.",
        "Heavy-duty gloves.",
        "Scalding pot.",
        "Freezer."
    ],
    "text": " Building the Coop Check your laws and regulations. Keeping chickens may not be an option in your area, or there might be some strict rules to abide by. If you live rural, you're more likely to have less laws. Regulations should be available to view online. Before you make the option of buying and raising broiler chicks, remember that it is very time-consuming and demanding. Ensure your schedule is close to empty on most days. Build or buy a coop and/or run. Chicken coops can be bought from a warehouse store or online. Although building your own coop is more time-consuming, it's considerably cheaper and you can add your own dimensions to the design. Basic blueprints can be acquired online. The coop must have 2-3 square feet per chicken and 8-10 square feet in the run. Consider a run or free-range option. Weigh out the pros and cons. If you have many predators in the area, free-range may be the less likely alternative. Investing in a run will ensure your chickens will have a safer place to roam. Keeping your chickens cooped up in a large enough housing system is also an option, but free-roaming outdoors has always been considered the healthiest for your flock. Install nesting boxes. Meat chickens still lay eggs, and consequently require nesting boxes. These are great to invest in as they are cleaner and safer for the eggs to be kept, since most bacteria gathers on the flooring of the coop and there is a less chance of the eggs breaking. You can buy nest boxes from a pet shop, or ranch supply store. Having said that, it's very easy to make these boxes out of scrap wood too. You will need 1 nest box for every 4 hens. Install roosts. Chickens don't naturally sleep on the floor, and like to rest high above  ground. A roost will provide your hens with this sense of security and comfort that the floor won't. Ensure that the roosts aren't installed too high up, as broiler breeds are quite heavy. Choose a quality bedding material. Ensure you are financing for a high-quality and absorbent materiel. There are many options to choose, including that of below. Sand is absorbent, but may need more frequent cleaning. Wood shavings are the most common, but avoid cedar and/or pine. Hay is also a good option, but it's absorbency isn't as good as wood shavings, and can be expensive depending on where you source it from. Add necessary equipment to the coop. Your chickens will need a feeder for their pellets, a drinker with fresh water, and a scrap bowl if you would like to feed your chickens unwanted leftovers. Depending on the amount of chicks/pullets you buy, you will probably need a large feeder/drinker to hold plenty of pellets and fresh water. Set up the brooder for chicks. Young chicks cannot go straight into the coop. They need a warm and secure (smaller) environment to make up for the absent of a mother hen. You will need a heat lamp, drinker and feeder with chick crumbs. A brooder is a simple box that is well-insulated yet ventilated as well. Buying Your Chickens Decide if you'd like chicks or pullets. Chicks are cheaper, whilst pullets are more expensive but will be closer to their butchering date. Chicks will also need a brooder whilst pullets can go straight into their coop at over 6 weeks of age. Another option would be fertile eggs, which will require you to invest into an incubator. Consider the breed. You specifically want a reliable broiler breed that is designed for meat purposes. If you also want eggs, there are some great dual breeds that have a high egg production rate whilst being large, sturdy breeds ready to be butchered. That being said, not all dual-breeds grow as quick as broiler chickens. Plymouth rocks and orpington make great dual breeds. Cornish, leghorns and brahmas make fast-growing meat breeds. Find a reputable breeder. If you would like a trustworthy place to find your chicks, that ensures you'll get a genetically healthy flock, breeders are the way to go. You may have to ask around or look online to find one that specifically breeds broiler chickens. Visit a farming store. These general stores tend to sell day old chicks that have been sexed, or at least take orders down. You can also find day old chicks at pet stores, but they might not specifically be meat chickens. You're after hens, not roosters, since hens hold more meat. Make sure your chicks are sexed properly. Buy online. Most hatcheries are now online, and it's an easy way to get the breed you are after. Although be aware of the consequences of mail-delivery chicks, as they're prone to death on the way over. The main reason why it's suggested to buy more than needed. Feeding Your Chickens Start with chick crumbs. For meat chickens it is important to start them off with a meat starter, which contains a very high 20-24% of protein. You have the option to feed them medicated or non-medicated feed. Medicated feed prevents chicks from getting coccidiosis. Feed chicks this up until 6 weeks. Broiler breeds grow rapidly. You will need 30 to 50 lbs. (14 to 23 kg) of broiler starter for 10 chicks. Purchase finisher pellets. Feed these to your chicks after they have grown to 6 weeks of age. These pellets should be fed up until slaughter date with a protein content of 16-20%\n16 to 20 lbs. (7 to 9 kg) will feed 10 birds. Feed them scraps. It's time to take advantage of your living compost system! Chickens will eat almost anything and everything. Just remember that they cannot digest avocado, tomato stems, salt or sugary sweets. Caring for Your Chickens Refill the water daily. You'll be looking at refilling the drinker, or water dish, two or three times a day. Living conditions get messy really fast, and chicks have a tendency to spill contents into their water dish. Refill the pellets daily. Growing chickens eat their way through a lot, so it is important to provide them with pellets and check in on them time by time. Remember, you don't want to over-feed them at a young age, but you also want to avoid under-feeding them. Move your chicks to the coop. At about 4-5 weeks you can begin to transfer your chicks to a fully set-up coop. Depending on the temperature, you might want to wait a few more weeks or set a heat lamp inside the coop. Broiler breeds grow fast, so will require more space as they grow. A lack of space can lead to aggressive behavioral habits. Consider installing artificial light. Chickens roost at dawn, or at any time when it starts to get dark. This is a natural instinct, so if you want your chickens to stay up more to eat, artificial lights will solve this issue. Butchering Your Chickens Determine the weight of your hens. Typically, it's time to butcher at about 8 weeks of age if you have a fast-growing broiler breed. It's best to butcher when the hens reach about 5-7 pounds. Contact a poultry processor. Such places will process chickens for you, or you can contact a small business that process chickens. Although there is a fee to process your chickens, it can come up a lot cheaper then investing into your own equipment, especially if this is a one-time thing. This is a fantastic idea if you want someone to do the dirty work for you, and understandable too. Invest into slaughter equipment. You will need to invest in a killing cone, two sharp knives, a large pot, heavy-duty gloves, a plucking machine, pinning knife, Prepare the scalding station. You will need to heat a large enough pot to 135​ F to 140​ ​F for a proper scalding temperature. It is critical that it isn't too hot that it boils the skin off, but not too cold that the feathers cannot be plucked properly. Know how to hold your chickens. You want to hold your chickens firmly by both legs with one hand, this gives you full control of the chicken and avoids any harm to them. This way you can easily maneuver them to the cone without any struggle. Place the chicken in the cone. Pull the head firmly through the opening of the cone and using a sharp knife cut behind the tendon which attaches to the beak and tongue. Cut two deep slices on each side of the neck. You should feel a hard cartilage behind the jaw attachment. Allow the blood to drain. Firmly pull the head down and allow the blood to drain properly. This may take a few moments for the blood to properly drain. Definitely make sure an old bucket is underneath before this point. Scald the chicken. After drainer properly, you will need to scald your chicken at an appropriate temperature so that the feathers become loose and ready to be plucked. With gloves, hold the body by the legs and dunk the chicken in the water head-first. Swirl the body (including leg feathers) around until it is scalded enough. Check to see if it's at the right temperature by plucking at the feathers by hand. If they do not come off as easy as you'd like then the temperature may be too low. You can do so by rubbing you fingers on the leg, or plucking a tail/wing feather. Pluck your chicken. There are a number of methods to choose, depending which is right for you. The easiest would be to invest in a plucking machine, which can take seconds to pluck your chicken. However, you can always hand-pluck a chicken by rubbing the feathers off and using a pinning knife. Even after going through a plucking machine the chicken may need to get a few pins off with a knife. Store your chicken. Uncooked poultry can be held in the freezer for 1 year or 9 months for cut pieces of chicken and refrigerated for 1-2 days. With a large enough freezer and good storage conditions, this leaves you with plenty of time.",
    "sentences": [
        " Building the Coop Check your laws and regulations.",
        "Keeping chickens may not be an option in your area, or there might be some strict rules to abide by.",
        "If you live rural, you're more likely to have less laws.",
        "Regulations should be available to view online.",
        "Before you make the option of buying and raising broiler chicks, remember that it is very time-consuming and demanding.",
        "Ensure your schedule is close to empty on most days.",
        "Build or buy a coop and/or run.",
        "Chicken coops can be bought from a warehouse store or online.",
        "Although building your own coop is more time-consuming, it's considerably cheaper and you can add your own dimensions to the design.",
        "Basic blueprints can be acquired online.",
        "The coop must have 2-3 square feet per chicken and 8-10 square feet in the run.",
        "Consider a run or free-range option.",
        "Weigh out the pros and cons.",
        "If you have many predators in the area, free-range may be the less likely alternative.",
        "Investing in a run will ensure your chickens will have a safer place to roam.",
        "Keeping your chickens cooped up in a large enough housing system is also an option, but free-roaming outdoors has always been considered the healthiest for your flock.",
        "Install nesting boxes.",
        "Meat chickens still lay eggs, and consequently require nesting boxes.",
        "These are great to invest in as they are cleaner and safer for the eggs to be kept, since most bacteria gathers on the flooring of the coop and there is a less chance of the eggs breaking.",
        "You can buy nest boxes from a pet shop, or ranch supply store.",
        "Having said that, it's very easy to make these boxes out of scrap wood too.",
        "You will need 1 nest box for every 4 hens.",
        "Install roosts.",
        "Chickens don't naturally sleep on the floor, and like to rest high above  ground.",
        "A roost will provide your hens with this sense of security and comfort that the floor won't.",
        "Ensure that the roosts aren't installed too high up, as broiler breeds are quite heavy.",
        "Choose a quality bedding material.",
        "Ensure you are financing for a high-quality and absorbent materiel.",
        "There are many options to choose, including that of below.",
        "Sand is absorbent, but may need more frequent cleaning.",
        "Wood shavings are the most common, but avoid cedar and/or pine.",
        "Hay is also a good option, but it's absorbency isn't as good as wood shavings, and can be expensive depending on where you source it from.",
        "Add necessary equipment to the coop.",
        "Your chickens will need a feeder for their pellets, a drinker with fresh water, and a scrap bowl if you would like to feed your chickens unwanted leftovers.",
        "Depending on the amount of chicks/pullets you buy, you will probably need a large feeder/drinker to hold plenty of pellets and fresh water.",
        "Set up the brooder for chicks.",
        "Young chicks cannot go straight into the coop.",
        "They need a warm and secure (smaller) environment to make up for the absent of a mother hen.",
        "You will need a heat lamp, drinker and feeder with chick crumbs.",
        "A brooder is a simple box that is well-insulated yet ventilated as well.",
        "Buying Your Chickens Decide if you'd like chicks or pullets.",
        "Chicks are cheaper, whilst pullets are more expensive but will be closer to their butchering date.",
        "Chicks will also need a brooder whilst pullets can go straight into their coop at over 6 weeks of age.",
        "Another option would be fertile eggs, which will require you to invest into an incubator.",
        "Consider the breed.",
        "You specifically want a reliable broiler breed that is designed for meat purposes.",
        "If you also want eggs, there are some great dual breeds that have a high egg production rate whilst being large, sturdy breeds ready to be butchered.",
        "That being said, not all dual-breeds grow as quick as broiler chickens.",
        "Plymouth rocks and orpington make great dual breeds.",
        "Cornish, leghorns and brahmas make fast-growing meat breeds.",
        "Find a reputable breeder.",
        "If you would like a trustworthy place to find your chicks, that ensures you'll get a genetically healthy flock, breeders are the way to go.",
        "You may have to ask around or look online to find one that specifically breeds broiler chickens.",
        "Visit a farming store.",
        "These general stores tend to sell day old chicks that have been sexed, or at least take orders down.",
        "You can also find day old chicks at pet stores, but they might not specifically be meat chickens.",
        "You're after hens, not roosters, since hens hold more meat.",
        "Make sure your chicks are sexed properly.",
        "Buy online.",
        "Most hatcheries are now online, and it's an easy way to get the breed you are after.",
        "Although be aware of the consequences of mail-delivery chicks, as they're prone to death on the way over.",
        "The main reason why it's suggested to buy more than needed.",
        "Feeding Your Chickens Start with chick crumbs.",
        "For meat chickens it is important to start them off with a meat starter, which contains a very high 20-24% of protein.",
        "You have the option to feed them medicated or non-medicated feed.",
        "Medicated feed prevents chicks from getting coccidiosis.",
        "Feed chicks this up until 6 weeks.",
        "Broiler breeds grow rapidly.",
        "You will need 30 to 50 lbs.",
        "(14 to 23 kg) of broiler starter for 10 chicks.",
        "Purchase finisher pellets.",
        "Feed these to your chicks after they have grown to 6 weeks of age.",
        "These pellets should be fed up until slaughter date with a protein content of 16-20%\n16 to 20 lbs.",
        "(7 to 9 kg) will feed 10 birds.",
        "Feed them scraps.",
        "It's time to take advantage of your living compost system!",
        "Chickens will eat almost anything and everything.",
        "Just remember that they cannot digest avocado, tomato stems, salt or sugary sweets.",
        "Caring for Your Chickens Refill the water daily.",
        "You'll be looking at refilling the drinker, or water dish, two or three times a day.",
        "Living conditions get messy really fast, and chicks have a tendency to spill contents into their water dish.",
        "Refill the pellets daily.",
        "Growing chickens eat their way through a lot, so it is important to provide them with pellets and check in on them time by time.",
        "Remember, you don't want to over-feed them at a young age, but you also want to avoid under-feeding them.",
        "Move your chicks to the coop.",
        "At about 4-5 weeks you can begin to transfer your chicks to a fully set-up coop.",
        "Depending on the temperature, you might want to wait a few more weeks or set a heat lamp inside the coop.",
        "Broiler breeds grow fast, so will require more space as they grow.",
        "A lack of space can lead to aggressive behavioral habits.",
        "Consider installing artificial light.",
        "Chickens roost at dawn, or at any time when it starts to get dark.",
        "This is a natural instinct, so if you want your chickens to stay up more to eat, artificial lights will solve this issue.",
        "Butchering Your Chickens Determine the weight of your hens.",
        "Typically, it's time to butcher at about 8 weeks of age if you have a fast-growing broiler breed.",
        "It's best to butcher when the hens reach about 5-7 pounds.",
        "Contact a poultry processor.",
        "Such places will process chickens for you, or you can contact a small business that process chickens.",
        "Although there is a fee to process your chickens, it can come up a lot cheaper then investing into your own equipment, especially if this is a one-time thing.",
        "This is a fantastic idea if you want someone to do the dirty work for you, and understandable too.",
        "Invest into slaughter equipment.",
        "You will need to invest in a killing cone, two sharp knives, a large pot, heavy-duty gloves, a plucking machine, pinning knife, Prepare the scalding station.",
        "You will need to heat a large enough pot to 135​ F to 140​ ​F for a proper scalding temperature.",
        "It is critical that it isn't too hot that it boils the skin off, but not too cold that the feathers cannot be plucked properly.",
        "Know how to hold your chickens.",
        "You want to hold your chickens firmly by both legs with one hand, this gives you full control of the chicken and avoids any harm to them.",
        "This way you can easily maneuver them to the cone without any struggle.",
        "Place the chicken in the cone.",
        "Pull the head firmly through the opening of the cone and using a sharp knife cut behind the tendon which attaches to the beak and tongue.",
        "Cut two deep slices on each side of the neck.",
        "You should feel a hard cartilage behind the jaw attachment.",
        "Allow the blood to drain.",
        "Firmly pull the head down and allow the blood to drain properly.",
        "This may take a few moments for the blood to properly drain.",
        "Definitely make sure an old bucket is underneath before this point.",
        "Scald the chicken.",
        "After drainer properly, you will need to scald your chicken at an appropriate temperature so that the feathers become loose and ready to be plucked.",
        "With gloves, hold the body by the legs and dunk the chicken in the water head-first.",
        "Swirl the body (including leg feathers) around until it is scalded enough.",
        "Check to see if it's at the right temperature by plucking at the feathers by hand.",
        "If they do not come off as easy as you'd like then the temperature may be too low.",
        "You can do so by rubbing you fingers on the leg, or plucking a tail/wing feather.",
        "Pluck your chicken.",
        "There are a number of methods to choose, depending which is right for you.",
        "The easiest would be to invest in a plucking machine, which can take seconds to pluck your chicken.",
        "However, you can always hand-pluck a chicken by rubbing the feathers off and using a pinning knife.",
        "Even after going through a plucking machine the chicken may need to get a few pins off with a knife.",
        "Store your chicken.",
        "Uncooked poultry can be held in the freezer for 1 year or 9 months for cut pieces of chicken and refrigerated for 1-2 days.",
        "With a large enough freezer and good storage conditions, this leaves you with plenty of time."
    ]
}