{
    "title": "How to Freeze Brussels Sprouts",
    "url": "https://www.wikihow.com/Freeze-Brussels-Sprouts",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Food Preservation Techniques",
        "Freezing Food"
    ],
    "methods": [
        {
            "name": "Freezing without Blanching",
            "steps": [
                {
                    "headline": "Take the Brussels sprouts off the stalk.",
                    "description": "If they're already off of the stalk, you can skip this step. Otherwise, grab the individual sprouts and pull them away from the stalk until they snap off. Once all the sprouts are off, dispose of the stalk."
                },
                {
                    "headline": "Soak the Brussels sprouts in warm water for 10 minutes.",
                    "description": "Soaking the Brussels sprouts in warm water is an easy way to clean them before storing them in the freezer. The water will wash out any dirt or particles underneath the leaves on the sprouts."
                },
                {
                    "headline": "Rinse the Brussels sprouts with fresh water and then pat them dry.",
                    "description": "Use a dishcloth to carefully dry each of the sprouts. It's important that they're completely dry before you store them in the freezer or ice crystals could form on them."
                },
                {
                    "headline": "Place the Brussels sprouts in resealable plastic freezer bags.",
                    "description": "Depending on how many Brussels sprouts you have, you may need to use several bags. Once the bags are full, press out any excess air with your hands and seal the bags. You can also make it so each freezer bag has one serving of Brussels sprouts in it. Then, when you're ready to cook, you can grab a bag and not have to worry about doing any measuring."
                },
                {
                    "headline": "Write the date on each bag with permanent marker.",
                    "description": "Writing the date on the bags will save you the trouble of having to remember how long the Brussels sprouts have been in the freezer. You can also write the future expiration date on the bag so you don't have to count out the months every time you want some Brussels sprouts."
                },
                {
                    "headline": "Store the bags of Brussels sprouts in the freezer for up to 12 months.",
                    "description": "After 12 months, the Brussels sprouts may start to lose their flavor and texture. If the Brussels sprouts are dry or discolored when you take them out of the freezer, it could be a sign that they’ve developed freezer burn. They’re still safe to eat, but they may not taste as good. If you want the Brussels sprouts to maintain their color, flavor, and nutritional value for longer in the freezer, it’s a good idea to blanch them before you freeze them."
                }
            ]
        },
        {
            "name": "Blanching and Freezing",
            "steps": [
                {
                    "headline": "Boil a pot of water and separate the Brussels sprouts by size.",
                    "description": "Divide your Brussels sprouts into 3 piles: a small Brussels sprouts pile, a medium pile, and a large pile. Each pile needs to be blanched for a different amount of time. If all of the Brussels sprouts are the same size, just make one big pile."
                },
                {
                    "headline": "Prepare a large bowl of ice water.",
                    "description": "You’ll transfer the Brussels sprouts to the ice water right after you boil them to complete the blanching process. Fill the bowl three-quarters of the way full and put in about one ice cube tray of ice."
                },
                {
                    "headline": "Boil your small Brussels sprouts for 3 minutes.",
                    "description": "Once the pot of water you put on the stovetop is boiling, carefully drop the pile of small Brussels sprouts into it. Leave the pot uncovered and set a timer for 3 minutes."
                },
                {
                    "headline": "Transfer the small Brussels sprouts from the boiling water to the bowl of ice.",
                    "description": "Use a ladle to carefully scoop the Brussels sprouts out of the boiling water. Immediately dunk them in the bowl of ice water and leave them in there to chill for 3 minutes."
                },
                {
                    "headline": "Take the Brussels sprouts out of the ice water and pat them dry with a dishcloth.",
                    "description": "You want the Brussels sprouts to be completely dry before you freeze them. Once the Brussels sprouts are dry, they’re blanched and ready to be frozen."
                },
                {
                    "headline": "Repeat with the other Brussels sprouts, but use longer boiling times.",
                    "description": "Boil the medium Brussels sprouts for 4 minutes, and the large Brussels sprouts for 5 minutes. Immediately submerge them in ice water when they’re done boiling, and let them chill for the same amount of time they boiled for. Remove them from the ice water and pat them dry with a dishcloth."
                },
                {
                    "headline": "Place the blanched Brussels sprouts in resealable plastic freezer bags.",
                    "description": "No need to keep them separated by size anymore. Once they’re in the bags, press out the excess air with your hands and seal the bags shut."
                },
                {
                    "headline": "Write the date on the bags in permanent marker.",
                    "description": "That way you'll know how long the Brussels sprouts have been in the freezer for. You can also write the expiration date for the Brussels sprouts on the bags so it's easier to tell if they're still fresh."
                },
                {
                    "headline": "Keep the Brussels sprouts in the freezer for up to 12 months.",
                    "description": "The Brussels sprouts should hold their flavor and texture for 12 months in the freezer. After that, they may develop freezer burn and no longer taste good. If you notice that the Brussels sprouts are dry or discolored when you take them out of the freezer, it could be a sign that they’re freezer burnt."
                }
            ]
        }
    ],
    "tyn": [
        "Freezing without Blanching",
        "Bowl",
        "Plastic freezer bags.",
        "Dishcloth",
        "Permanent marker",
        "Blanching and Freezing",
        "Pot",
        "Ice",
        "Plastic freezer bags"
    ],
    "text": " Freezing without Blanching Take the Brussels sprouts off the stalk. If they're already off of the stalk, you can skip this step. Otherwise, grab the individual sprouts and pull them away from the stalk until they snap off. Once all the sprouts are off, dispose of the stalk. Soak the Brussels sprouts in warm water for 10 minutes. Soaking the Brussels sprouts in warm water is an easy way to clean them before storing them in the freezer. The water will wash out any dirt or particles underneath the leaves on the sprouts. Rinse the Brussels sprouts with fresh water and then pat them dry. Use a dishcloth to carefully dry each of the sprouts. It's important that they're completely dry before you store them in the freezer or ice crystals could form on them. Place the Brussels sprouts in resealable plastic freezer bags. Depending on how many Brussels sprouts you have, you may need to use several bags. Once the bags are full, press out any excess air with your hands and seal the bags. You can also make it so each freezer bag has one serving of Brussels sprouts in it. Then, when you're ready to cook, you can grab a bag and not have to worry about doing any measuring. Write the date on each bag with permanent marker. Writing the date on the bags will save you the trouble of having to remember how long the Brussels sprouts have been in the freezer. You can also write the future expiration date on the bag so you don't have to count out the months every time you want some Brussels sprouts. Store the bags of Brussels sprouts in the freezer for up to 12 months. After 12 months, the Brussels sprouts may start to lose their flavor and texture. If the Brussels sprouts are dry or discolored when you take them out of the freezer, it could be a sign that they’ve developed freezer burn. They’re still safe to eat, but they may not taste as good. If you want the Brussels sprouts to maintain their color, flavor, and nutritional value for longer in the freezer, it’s a good idea to blanch them before you freeze them. Blanching and Freezing Boil a pot of water and separate the Brussels sprouts by size. Divide your Brussels sprouts into 3 piles: a small Brussels sprouts pile, a medium pile, and a large pile. Each pile needs to be blanched for a different amount of time. If all of the Brussels sprouts are the same size, just make one big pile. Prepare a large bowl of ice water. You’ll transfer the Brussels sprouts to the ice water right after you boil them to complete the blanching process. Fill the bowl three-quarters of the way full and put in about one ice cube tray of ice. Boil your small Brussels sprouts for 3 minutes. Once the pot of water you put on the stovetop is boiling, carefully drop the pile of small Brussels sprouts into it. Leave the pot uncovered and set a timer for 3 minutes. Transfer the small Brussels sprouts from the boiling water to the bowl of ice. Use a ladle to carefully scoop the Brussels sprouts out of the boiling water. Immediately dunk them in the bowl of ice water and leave them in there to chill for 3 minutes. Take the Brussels sprouts out of the ice water and pat them dry with a dishcloth. You want the Brussels sprouts to be completely dry before you freeze them. Once the Brussels sprouts are dry, they’re blanched and ready to be frozen. Repeat with the other Brussels sprouts, but use longer boiling times. Boil the medium Brussels sprouts for 4 minutes, and the large Brussels sprouts for 5 minutes. Immediately submerge them in ice water when they’re done boiling, and let them chill for the same amount of time they boiled for. Remove them from the ice water and pat them dry with a dishcloth. Place the blanched Brussels sprouts in resealable plastic freezer bags. No need to keep them separated by size anymore. Once they’re in the bags, press out the excess air with your hands and seal the bags shut. Write the date on the bags in permanent marker. That way you'll know how long the Brussels sprouts have been in the freezer for. You can also write the expiration date for the Brussels sprouts on the bags so it's easier to tell if they're still fresh. Keep the Brussels sprouts in the freezer for up to 12 months. The Brussels sprouts should hold their flavor and texture for 12 months in the freezer. After that, they may develop freezer burn and no longer taste good. If you notice that the Brussels sprouts are dry or discolored when you take them out of the freezer, it could be a sign that they’re freezer burnt.",
    "sentences": [
        " Freezing without Blanching Take the Brussels sprouts off the stalk.",
        "If they're already off of the stalk, you can skip this step.",
        "Otherwise, grab the individual sprouts and pull them away from the stalk until they snap off.",
        "Once all the sprouts are off, dispose of the stalk.",
        "Soak the Brussels sprouts in warm water for 10 minutes.",
        "Soaking the Brussels sprouts in warm water is an easy way to clean them before storing them in the freezer.",
        "The water will wash out any dirt or particles underneath the leaves on the sprouts.",
        "Rinse the Brussels sprouts with fresh water and then pat them dry.",
        "Use a dishcloth to carefully dry each of the sprouts.",
        "It's important that they're completely dry before you store them in the freezer or ice crystals could form on them.",
        "Place the Brussels sprouts in resealable plastic freezer bags.",
        "Depending on how many Brussels sprouts you have, you may need to use several bags.",
        "Once the bags are full, press out any excess air with your hands and seal the bags.",
        "You can also make it so each freezer bag has one serving of Brussels sprouts in it.",
        "Then, when you're ready to cook, you can grab a bag and not have to worry about doing any measuring.",
        "Write the date on each bag with permanent marker.",
        "Writing the date on the bags will save you the trouble of having to remember how long the Brussels sprouts have been in the freezer.",
        "You can also write the future expiration date on the bag so you don't have to count out the months every time you want some Brussels sprouts.",
        "Store the bags of Brussels sprouts in the freezer for up to 12 months.",
        "After 12 months, the Brussels sprouts may start to lose their flavor and texture.",
        "If the Brussels sprouts are dry or discolored when you take them out of the freezer, it could be a sign that they’ve developed freezer burn.",
        "They’re still safe to eat, but they may not taste as good.",
        "If you want the Brussels sprouts to maintain their color, flavor, and nutritional value for longer in the freezer, it’s a good idea to blanch them before you freeze them.",
        "Blanching and Freezing Boil a pot of water and separate the Brussels sprouts by size.",
        "Divide your Brussels sprouts into 3 piles: a small Brussels sprouts pile, a medium pile, and a large pile.",
        "Each pile needs to be blanched for a different amount of time.",
        "If all of the Brussels sprouts are the same size, just make one big pile.",
        "Prepare a large bowl of ice water.",
        "You’ll transfer the Brussels sprouts to the ice water right after you boil them to complete the blanching process.",
        "Fill the bowl three-quarters of the way full and put in about one ice cube tray of ice.",
        "Boil your small Brussels sprouts for 3 minutes.",
        "Once the pot of water you put on the stovetop is boiling, carefully drop the pile of small Brussels sprouts into it.",
        "Leave the pot uncovered and set a timer for 3 minutes.",
        "Transfer the small Brussels sprouts from the boiling water to the bowl of ice.",
        "Use a ladle to carefully scoop the Brussels sprouts out of the boiling water.",
        "Immediately dunk them in the bowl of ice water and leave them in there to chill for 3 minutes.",
        "Take the Brussels sprouts out of the ice water and pat them dry with a dishcloth.",
        "You want the Brussels sprouts to be completely dry before you freeze them.",
        "Once the Brussels sprouts are dry, they’re blanched and ready to be frozen.",
        "Repeat with the other Brussels sprouts, but use longer boiling times.",
        "Boil the medium Brussels sprouts for 4 minutes, and the large Brussels sprouts for 5 minutes.",
        "Immediately submerge them in ice water when they’re done boiling, and let them chill for the same amount of time they boiled for.",
        "Remove them from the ice water and pat them dry with a dishcloth.",
        "Place the blanched Brussels sprouts in resealable plastic freezer bags.",
        "No need to keep them separated by size anymore.",
        "Once they’re in the bags, press out the excess air with your hands and seal the bags shut.",
        "Write the date on the bags in permanent marker.",
        "That way you'll know how long the Brussels sprouts have been in the freezer for.",
        "You can also write the expiration date for the Brussels sprouts on the bags so it's easier to tell if they're still fresh.",
        "Keep the Brussels sprouts in the freezer for up to 12 months.",
        "The Brussels sprouts should hold their flavor and texture for 12 months in the freezer.",
        "After that, they may develop freezer burn and no longer taste good.",
        "If you notice that the Brussels sprouts are dry or discolored when you take them out of the freezer, it could be a sign that they’re freezer burnt."
    ]
}