{
    "title": "How to Paint Rocks with Acrylic Paint",
    "url": "https://www.wikihow.mom/Paint-Rocks-with-Acrylic-Paint",
    "category_hierarchy": "",
    "methods": [
        {
            "name": "Choosing and Cleaning Your Rocks",
            "steps": [
                {
                    "headline": "Look for smooth rocks.",
                    "description": "A rock that has too many cracks or divots will be hard to paint. Look instead for rocks that have a smooth surface. You can find smooth rocks perfect for painting at home improvement stores with garden centers, landscaping supply stores, and craft stores. You can also take a walk in your neighborhood — you'll be surprised by what you can find! If you're purchasing your rocks, make sure they have a natural finish. Some rocks will have a waxy finish on them, which makes it difficult for the paint to adhere. Rocks with a waxy finish will feel smooth and almost plastic-like."
                },
                {
                    "headline": "Choose rocks that are round.",
                    "description": "The rounder the rock, the prettier! It's also easier to draw out a complete design on a round rock with even edges."
                },
                {
                    "headline": "Look for rocks that are gray in color.",
                    "description": "Gray rocks will show your acrylic paint the best. They aren't so light that the paint colors will wash out, and they're not so dark that outlining your design is impossible."
                },
                {
                    "headline": "Wash dirt off of your rocks.",
                    "description": "This step is especially important if you found your rocks outside. Run your rocks under clear water until they look clean. You can wash them in your sink inside or outside with a garden hose. If there is stubborn dirt on your rocks, it might not come off just with water. Hold the rock under water and use either your hand or an old toothbrush to rub the dirt off. Don't use soaps or solvents on your rocks — they can break down the structure of your rock."
                },
                {
                    "headline": "Let your rocks completely air dry.",
                    "description": "If your rocks aren't dry when you begin painting, the paint can run or lose some of its brightness. Once your rocks are clean, let them dry. If you can leave them outside in the sun, it should only take a few hours. Otherwise, let them dry overnight."
                }
            ]
        },
        {
            "name": "Creating a Design",
            "steps": [
                {
                    "headline": "Choose simple designs.",
                    "description": "There isn't much room for detail when you're panting on a rock, so keep your design simple. Simple shapes, silhouettes, and patterns are best, especially when you're beginning. As you get more experienced, you can try more complicated designs. For example, simple geometric shapes like hearts, stars, squares, circles, or triangles work well. You can also combine simple shapes into a larger pattern. For example, you could begin with a ring along the edge of the rock, and move toward the center of the rock, creating a ring of circles, followed by a ring of hearts, and then another solid ring."
                },
                {
                    "headline": "Practice your design on paper.",
                    "description": "Draw a circle with the same circumference of your rock and then draw your design within that circle. This gives you the chance to perfect your design. Once you have the design down, decide which colors you'll paint the different parts of the design. The colors you choose are up to you, but complementary colors often look best together. A complementary color is the one that appears on the opposite side of the color wheel from the first color you chose. You can also choose to go with all very bright, neon colors."
                },
                {
                    "headline": "Outline your design in chalk or pencil if you're using one.",
                    "description": "If you're working on a dark rock, use chalk for your outline. If you're working on a lighter rock, pencil will let you create more detail. Your design is totally up to you — you can create something abstract or an actual drawing."
                }
            ]
        },
        {
            "name": "Painting Your Design",
            "steps": [
                {
                    "headline": "Select brightly colored acrylic paints.",
                    "description": "Acrylic paints are long-lasting and thick, making them perfect for using on rocks. Make sure you choose bright colors. That way, even if you find or buy dark rocks, the paint will be easy to see."
                },
                {
                    "headline": "Choose acrylic or watercolor brushes in a variety of shapes and sizes.",
                    "description": "Although you might find some variation in rock size, most will be pretty small. In order to get detail in your painting, you'll need small brushes. Look for brushes in a variety of shapes, too, especially round, rigger, and liner. The exact sizes will vary depending on the type of brush. For round brushes, look for sizes smaller than a seven. For rigger brushes, look for sizes smaller than a 2/0. For liner brushes, look for sizes smaller than 3/0."
                },
                {
                    "headline": "Pour your paint into a palette or onto a plate.",
                    "description": "If you have a paint palette, squeeze out a quarter-sized amount of each paint color into its own section. If you're using a plate, make sure you leave about 2 in (5.1 cm) between each color so the colors don't bleed into each other. If you do want to combine colors, make sure they're next to each other. Then use separate brush to scoop up each color and put one on top of the other on another plate or in the mixing section of your palette. Then use a third brush to mix the colors."
                },
                {
                    "headline": "Use one paintbrush per color.",
                    "description": "If you use just one paintbrush for the whole project, the brightness of the colors will be muted and you'll end up with mixed colors. Before you begin painting, look at your design and which colors you're using where. Use small, thin brushes for small detail work and larger brushes for larger areas. Assign your brushes by color."
                },
                {
                    "headline": "Paint in your design.",
                    "description": "Exactly how you paint in your design is up to you. You can paint by color — painting everything that's the same color before moving on to the next color. You can also paint by design — beginning at the top (or the side) and changing your brush and paint color as you move through the design. If you're using a lot of one color, let that color dry before you continue. That way you avoid smearing any paint."
                }
            ]
        },
        {
            "name": "Signing and Sealing Your Rocks",
            "steps": [
                {
                    "headline": "Let your rocks dry.",
                    "description": "Once you're done painting your rocks, let them dry completely. Depending on how much paint you've used and how intricate your design is, this can take anywhere from a few hours to overnight. To test your paint, use the tip of your finger to gently touch the paint. If paint comes away on your finger, it's not dry yet."
                },
                {
                    "headline": "Sign your rocks.",
                    "description": "Once your rocks are dry, you'll want to sign them, particularly if you're selling them. Use a thin brush and black paint to sign the bottom of your rock. You can also add the date and/or a hashtag that you can then use on your social media accounts. If you're selling your rocks or participating in the hiding-and-finding rock painting community, consider adding a label to your rock. Print out labels with contact information for your rock painting community and instructions for the finder. Then apply a layer of Mod Podge to the rock, stick on the label, and cover with Mod Podge."
                },
                {
                    "headline": "Seal your rocks in a well-ventilated area.",
                    "description": "Once all of the paint is dry, spray your rocks with sealant. Make sure you spray them in a well-ventilated area since the sealant can irritate your nose and lungs. Then let them dry according to the instructions on the can of sealant. You can choose shiny or matte finishes. If you're planning on leaving your rocks outdoors, look for a sealant made specifically for use outside. Depending on the size of your rocks, the sealant will take an hour up to overnight to dry."
                },
                {
                    "headline": "Display your rocks.",
                    "description": "Once your rocks are finished, there are plenty of places you can display them. Indoors on shelves or tables or outdoors in your garden or potted plants are great places to display your rocks. If you're part of the rock painting community in your area, you can also hide your rocks in nearby parks and public places so other people can find them! You can also post pictures of your rocks on your social media accounts."
                }
            ]
        },
        {
            "name": "Choosing and Cleaning Your Rocks",
            "steps": []
        },
        {
            "name": "Creating a Design",
            "steps": []
        },
        {
            "name": "Painting Your Design",
            "steps": []
        },
        {
            "name": "Signing and Sealing Your Rocks",
            "steps": []
        }
    ],
    "tyn": [
        "Smooth rocks",
        "Acrylic paint",
        "Variety of paint brushes",
        "Pencil or chalk for outlining",
        "Black pens for detail outlining",
        "Sealant"
    ],
    "text": " Choosing and Cleaning Your Rocks Look for smooth rocks. A rock that has too many cracks or divots will be hard to paint. Look instead for rocks that have a smooth surface. You can find smooth rocks perfect for painting at home improvement stores with garden centers, landscaping supply stores, and craft stores. You can also take a walk in your neighborhood — you'll be surprised by what you can find! If you're purchasing your rocks, make sure they have a natural finish. Some rocks will have a waxy finish on them, which makes it difficult for the paint to adhere. Rocks with a waxy finish will feel smooth and almost plastic-like. Choose rocks that are round. The rounder the rock, the prettier! It's also easier to draw out a complete design on a round rock with even edges. Look for rocks that are gray in color. Gray rocks will show your acrylic paint the best. They aren't so light that the paint colors will wash out, and they're not so dark that outlining your design is impossible. Wash dirt off of your rocks. This step is especially important if you found your rocks outside. Run your rocks under clear water until they look clean. You can wash them in your sink inside or outside with a garden hose. If there is stubborn dirt on your rocks, it might not come off just with water. Hold the rock under water and use either your hand or an old toothbrush to rub the dirt off. Don't use soaps or solvents on your rocks — they can break down the structure of your rock. Let your rocks completely air dry. If your rocks aren't dry when you begin painting, the paint can run or lose some of its brightness. Once your rocks are clean, let them dry. If you can leave them outside in the sun, it should only take a few hours. Otherwise, let them dry overnight. Creating a Design Choose simple designs. There isn't much room for detail when you're panting on a rock, so keep your design simple. Simple shapes, silhouettes, and patterns are best, especially when you're beginning. As you get more experienced, you can try more complicated designs. For example, simple geometric shapes like hearts, stars, squares, circles, or triangles work well. You can also combine simple shapes into a larger pattern. For example, you could begin with a ring along the edge of the rock, and move toward the center of the rock, creating a ring of circles, followed by a ring of hearts, and then another solid ring. Practice your design on paper. Draw a circle with the same circumference of your rock and then draw your design within that circle. This gives you the chance to perfect your design. Once you have the design down, decide which colors you'll paint the different parts of the design. The colors you choose are up to you, but complementary colors often look best together. A complementary color is the one that appears on the opposite side of the color wheel from the first color you chose. You can also choose to go with all very bright, neon colors. Outline your design in chalk or pencil if you're using one. If you're working on a dark rock, use chalk for your outline. If you're working on a lighter rock, pencil will let you create more detail. Your design is totally up to you — you can create something abstract or an actual drawing. Painting Your Design Select brightly colored acrylic paints. Acrylic paints are long-lasting and thick, making them perfect for using on rocks. Make sure you choose bright colors. That way, even if you find or buy dark rocks, the paint will be easy to see. Choose acrylic or watercolor brushes in a variety of shapes and sizes. Although you might find some variation in rock size, most will be pretty small. In order to get detail in your painting, you'll need small brushes. Look for brushes in a variety of shapes, too, especially round, rigger, and liner. The exact sizes will vary depending on the type of brush. For round brushes, look for sizes smaller than a seven. For rigger brushes, look for sizes smaller than a 2/0. For liner brushes, look for sizes smaller than 3/0. Pour your paint into a palette or onto a plate. If you have a paint palette, squeeze out a quarter-sized amount of each paint color into its own section. If you're using a plate, make sure you leave about 2 in (5.1 cm) between each color so the colors don't bleed into each other. If you do want to combine colors, make sure they're next to each other. Then use separate brush to scoop up each color and put one on top of the other on another plate or in the mixing section of your palette. Then use a third brush to mix the colors. Use one paintbrush per color. If you use just one paintbrush for the whole project, the brightness of the colors will be muted and you'll end up with mixed colors. Before you begin painting, look at your design and which colors you're using where. Use small, thin brushes for small detail work and larger brushes for larger areas. Assign your brushes by color. Paint in your design. Exactly how you paint in your design is up to you. You can paint by color — painting everything that's the same color before moving on to the next color. You can also paint by design — beginning at the top (or the side) and changing your brush and paint color as you move through the design. If you're using a lot of one color, let that color dry before you continue. That way you avoid smearing any paint. Signing and Sealing Your Rocks Let your rocks dry. Once you're done painting your rocks, let them dry completely. Depending on how much paint you've used and how intricate your design is, this can take anywhere from a few hours to overnight. To test your paint, use the tip of your finger to gently touch the paint. If paint comes away on your finger, it's not dry yet. Sign your rocks. Once your rocks are dry, you'll want to sign them, particularly if you're selling them. Use a thin brush and black paint to sign the bottom of your rock. You can also add the date and/or a hashtag that you can then use on your social media accounts. If you're selling your rocks or participating in the hiding-and-finding rock painting community, consider adding a label to your rock. Print out labels with contact information for your rock painting community and instructions for the finder. Then apply a layer of Mod Podge to the rock, stick on the label, and cover with Mod Podge. Seal your rocks in a well-ventilated area. Once all of the paint is dry, spray your rocks with sealant. Make sure you spray them in a well-ventilated area since the sealant can irritate your nose and lungs. Then let them dry according to the instructions on the can of sealant. You can choose shiny or matte finishes. If you're planning on leaving your rocks outdoors, look for a sealant made specifically for use outside. Depending on the size of your rocks, the sealant will take an hour up to overnight to dry. Display your rocks. Once your rocks are finished, there are plenty of places you can display them. Indoors on shelves or tables or outdoors in your garden or potted plants are great places to display your rocks. If you're part of the rock painting community in your area, you can also hide your rocks in nearby parks and public places so other people can find them! You can also post pictures of your rocks on your social media accounts. Choosing and Cleaning Your Rocks Creating a Design Painting Your Design Signing and Sealing Your Rocks",
    "sentences": [
        " Choosing and Cleaning Your Rocks Look for smooth rocks.",
        "A rock that has too many cracks or divots will be hard to paint.",
        "Look instead for rocks that have a smooth surface.",
        "You can find smooth rocks perfect for painting at home improvement stores with garden centers, landscaping supply stores, and craft stores.",
        "You can also take a walk in your neighborhood — you'll be surprised by what you can find!",
        "If you're purchasing your rocks, make sure they have a natural finish.",
        "Some rocks will have a waxy finish on them, which makes it difficult for the paint to adhere.",
        "Rocks with a waxy finish will feel smooth and almost plastic-like.",
        "Choose rocks that are round.",
        "The rounder the rock, the prettier!",
        "It's also easier to draw out a complete design on a round rock with even edges.",
        "Look for rocks that are gray in color.",
        "Gray rocks will show your acrylic paint the best.",
        "They aren't so light that the paint colors will wash out, and they're not so dark that outlining your design is impossible.",
        "Wash dirt off of your rocks.",
        "This step is especially important if you found your rocks outside.",
        "Run your rocks under clear water until they look clean.",
        "You can wash them in your sink inside or outside with a garden hose.",
        "If there is stubborn dirt on your rocks, it might not come off just with water.",
        "Hold the rock under water and use either your hand or an old toothbrush to rub the dirt off.",
        "Don't use soaps or solvents on your rocks — they can break down the structure of your rock.",
        "Let your rocks completely air dry.",
        "If your rocks aren't dry when you begin painting, the paint can run or lose some of its brightness.",
        "Once your rocks are clean, let them dry.",
        "If you can leave them outside in the sun, it should only take a few hours.",
        "Otherwise, let them dry overnight.",
        "Creating a Design Choose simple designs.",
        "There isn't much room for detail when you're panting on a rock, so keep your design simple.",
        "Simple shapes, silhouettes, and patterns are best, especially when you're beginning.",
        "As you get more experienced, you can try more complicated designs.",
        "For example, simple geometric shapes like hearts, stars, squares, circles, or triangles work well.",
        "You can also combine simple shapes into a larger pattern.",
        "For example, you could begin with a ring along the edge of the rock, and move toward the center of the rock, creating a ring of circles, followed by a ring of hearts, and then another solid ring.",
        "Practice your design on paper.",
        "Draw a circle with the same circumference of your rock and then draw your design within that circle.",
        "This gives you the chance to perfect your design.",
        "Once you have the design down, decide which colors you'll paint the different parts of the design.",
        "The colors you choose are up to you, but complementary colors often look best together.",
        "A complementary color is the one that appears on the opposite side of the color wheel from the first color you chose.",
        "You can also choose to go with all very bright, neon colors.",
        "Outline your design in chalk or pencil if you're using one.",
        "If you're working on a dark rock, use chalk for your outline.",
        "If you're working on a lighter rock, pencil will let you create more detail.",
        "Your design is totally up to you — you can create something abstract or an actual drawing.",
        "Painting Your Design Select brightly colored acrylic paints.",
        "Acrylic paints are long-lasting and thick, making them perfect for using on rocks.",
        "Make sure you choose bright colors.",
        "That way, even if you find or buy dark rocks, the paint will be easy to see.",
        "Choose acrylic or watercolor brushes in a variety of shapes and sizes.",
        "Although you might find some variation in rock size, most will be pretty small.",
        "In order to get detail in your painting, you'll need small brushes.",
        "Look for brushes in a variety of shapes, too, especially round, rigger, and liner.",
        "The exact sizes will vary depending on the type of brush.",
        "For round brushes, look for sizes smaller than a seven.",
        "For rigger brushes, look for sizes smaller than a 2/0.",
        "For liner brushes, look for sizes smaller than 3/0.",
        "Pour your paint into a palette or onto a plate.",
        "If you have a paint palette, squeeze out a quarter-sized amount of each paint color into its own section.",
        "If you're using a plate, make sure you leave about 2 in (5.1 cm) between each color so the colors don't bleed into each other.",
        "If you do want to combine colors, make sure they're next to each other.",
        "Then use separate brush to scoop up each color and put one on top of the other on another plate or in the mixing section of your palette.",
        "Then use a third brush to mix the colors.",
        "Use one paintbrush per color.",
        "If you use just one paintbrush for the whole project, the brightness of the colors will be muted and you'll end up with mixed colors.",
        "Before you begin painting, look at your design and which colors you're using where.",
        "Use small, thin brushes for small detail work and larger brushes for larger areas.",
        "Assign your brushes by color.",
        "Paint in your design.",
        "Exactly how you paint in your design is up to you.",
        "You can paint by color — painting everything that's the same color before moving on to the next color.",
        "You can also paint by design — beginning at the top (or the side) and changing your brush and paint color as you move through the design.",
        "If you're using a lot of one color, let that color dry before you continue.",
        "That way you avoid smearing any paint.",
        "Signing and Sealing Your Rocks Let your rocks dry.",
        "Once you're done painting your rocks, let them dry completely.",
        "Depending on how much paint you've used and how intricate your design is, this can take anywhere from a few hours to overnight.",
        "To test your paint, use the tip of your finger to gently touch the paint.",
        "If paint comes away on your finger, it's not dry yet.",
        "Sign your rocks.",
        "Once your rocks are dry, you'll want to sign them, particularly if you're selling them.",
        "Use a thin brush and black paint to sign the bottom of your rock.",
        "You can also add the date and/or a hashtag that you can then use on your social media accounts.",
        "If you're selling your rocks or participating in the hiding-and-finding rock painting community, consider adding a label to your rock.",
        "Print out labels with contact information for your rock painting community and instructions for the finder.",
        "Then apply a layer of Mod Podge to the rock, stick on the label, and cover with Mod Podge.",
        "Seal your rocks in a well-ventilated area.",
        "Once all of the paint is dry, spray your rocks with sealant.",
        "Make sure you spray them in a well-ventilated area since the sealant can irritate your nose and lungs.",
        "Then let them dry according to the instructions on the can of sealant.",
        "You can choose shiny or matte finishes.",
        "If you're planning on leaving your rocks outdoors, look for a sealant made specifically for use outside.",
        "Depending on the size of your rocks, the sealant will take an hour up to overnight to dry.",
        "Display your rocks.",
        "Once your rocks are finished, there are plenty of places you can display them.",
        "Indoors on shelves or tables or outdoors in your garden or potted plants are great places to display your rocks.",
        "If you're part of the rock painting community in your area, you can also hide your rocks in nearby parks and public places so other people can find them!",
        "You can also post pictures of your rocks on your social media accounts.",
        "Choosing and Cleaning Your Rocks Creating a Design Painting Your Design Signing and Sealing Your Rocks"
    ]
}