{
    "title": "How to Freeze Zucchini Noodles",
    "url": "https://www.wikihow.com/Freeze-Zucchini-Noodles",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Pasta and Noodles"
    ],
    "parts": [
        {
            "name": "Drying Zucchini Noodles",
            "steps": [
                {
                    "headline": "Set your zucchini noodles in a large bowl.",
                    "description": "Before freezing your zucchini noodles, it’s important to dry them out as much as possible. Moist zoodles will lose their shape and texture when stored for a long period of time, leading to a soggy, unappealing mess when you thaw them out. You can make zucchini noodles at home or purchase them from select health food stores. Thin zoodles tend to preserve better than thick or wide zoodles."
                },
                {
                    "headline": "Sprinkle kosher salt over your zoodles.",
                    "description": "Measure out approximately 1 US tbsp (15 ml) of kosher salt for every 2 cups (17 imp fl oz) of zoodles you have. Then, pinch the salt between your fingers and sprinkle it over the zucchini noodles, covering as much area as possible. The salt will help preserve your zoodle’s texture while in storage."
                },
                {
                    "headline": "Knead your zoodles thoroughly, adding more salt as necessary.",
                    "description": "Using your hands, squeeze the zucchini noodles and turn them over in the bowl. Do this repeatedly to make sure the zoodles and salt mix together. As you knead, add more salt to cover any bare zucchini noodles. By the end, you should see salt grains on every single zoodle."
                },
                {
                    "headline": "Turn your zoodles over until they bubble up and become firm.",
                    "description": "As you knead your zucchini noodles, expect a lot of moisture to seep out. As it does, your zoodles will firm up slightly and a bubbly mixture will begin to form on top of them, making the whole bowl appear soapy. Keep turning your zucchini over until all the zoodles feel fairly tough, a process that normally takes between 2 and 3 minutes."
                },
                {
                    "headline": "Line a colander with a fresh cloth or towel.",
                    "description": "Grab a colander that is large enough to hold all your zucchini noodles. Line the inside of the colander with a fresh cloth, towel, or other thin fabric, then place it over a sink or large bowl. Put your colander in a secure place since you’ll be letting it sit there for a while. Avoid thick pieces of fabric as you’ll have a harder time draining them."
                },
                {
                    "headline": "Wrap your zoodles in the cloth.",
                    "description": "Carefully move your zucchini noodles into the colander. Make sure the zoodles sit completely inside the piece of fabric, then wrap the edges up around them to create a makeshift bag. Before moving on, check to make sure that every zoodle ended up inside the bag. If necessary, hold the cloth bag shut using pins or clamps."
                },
                {
                    "headline": "Squeeze the cloth to remove excess moisture.",
                    "description": "Grab the top of the cloth bag with 1 of your hands and squeeze the bottom of the bag with the other, forcing lots of moisture out of the zoodles. Keep doing this for about 2 minutes or until the liquid stops running."
                },
                {
                    "headline": "Let your zoodles dry for at least 1 hour.",
                    "description": "Leave your zucchini noodles in the piece of fabric and let them sit for as long as possible, at least 1 hour. This will give any remaining liquid a chance to drain out. The less moisture your zoodles contain when frozen, the tastier they’ll be after you thaw them."
                }
            ]
        },
        {
            "name": "Storing Zoodles in a Freezer",
            "steps": [
                {
                    "headline": "Place your zoodles in small, freezer-safe bags.",
                    "description": "Carefully remove your zucchini noodles from the piece of fabric and lay them out on a clean table. If your zoodles seem dry enough, place them inside a number of small, freezer-safe bags. Though you can keep your zoodles in a single, large bag, smaller storage portions are more likely to keep their form and texture once thawed. It’s important to keep your zucchini noodles compressed, so do not store them in firm containers like mason jars. If your zoodles feel soft and flimsy, repeat the drying process."
                },
                {
                    "headline": "Press the air out of your bags and seal them shut.",
                    "description": "After packaging your zucchini noodles, push down on each bag with your hands to remove any excess air. Then, close the bags tightly so that no more air can get in."
                },
                {
                    "headline": "Put a label on each bag.",
                    "description": "To make sure you store your zucchini noodles for an appropriate amount of time, put a label on each bag and write the initial freeze date on it. If you created different portion sizes for each bag, consider listing the amount of zucchini noodles as well."
                },
                {
                    "headline": "Store your zoodles in a freezer for up to 1 year.",
                    "description": "Like most forms of summer squash, you can keep zucchini noodles in your freezer for up to 12 months. However, they may become less flavorful over time, so try to eat them as soon as possible."
                },
                {
                    "headline": "Boil your zoodles to thaw them.",
                    "description": "When you’re ready to reheat your zoodles, fill a pot with water and bring it to a boil. Place your zucchini noodles in a strainer basket and set it in the water for approximately 1 minute. This will heat and rehydrate the zoodles. Try using your thawed zucchini noodles in cooked dishes like:\nStir-fry dishes\nAlfredo-based dishes\nShrimp scampi\nPho\nPad thai"
                }
            ]
        }
    ],
    "tyn": [
        "Zucchini noodles",
        "Kosher salt",
        "Large bowl",
        "Colander",
        "Clean towel or cloth",
        "Freezer-safe bags",
        "Labels"
    ],
    "text": " Drying Zucchini Noodles Set your zucchini noodles in a large bowl. Before freezing your zucchini noodles, it’s important to dry them out as much as possible. Moist zoodles will lose their shape and texture when stored for a long period of time, leading to a soggy, unappealing mess when you thaw them out. You can make zucchini noodles at home or purchase them from select health food stores. Thin zoodles tend to preserve better than thick or wide zoodles. Sprinkle kosher salt over your zoodles. Measure out approximately 1 US tbsp (15 ml) of kosher salt for every 2 cups (17 imp fl oz) of zoodles you have. Then, pinch the salt between your fingers and sprinkle it over the zucchini noodles, covering as much area as possible. The salt will help preserve your zoodle’s texture while in storage. Knead your zoodles thoroughly, adding more salt as necessary. Using your hands, squeeze the zucchini noodles and turn them over in the bowl. Do this repeatedly to make sure the zoodles and salt mix together. As you knead, add more salt to cover any bare zucchini noodles. By the end, you should see salt grains on every single zoodle. Turn your zoodles over until they bubble up and become firm. As you knead your zucchini noodles, expect a lot of moisture to seep out. As it does, your zoodles will firm up slightly and a bubbly mixture will begin to form on top of them, making the whole bowl appear soapy. Keep turning your zucchini over until all the zoodles feel fairly tough, a process that normally takes between 2 and 3 minutes. Line a colander with a fresh cloth or towel. Grab a colander that is large enough to hold all your zucchini noodles. Line the inside of the colander with a fresh cloth, towel, or other thin fabric, then place it over a sink or large bowl. Put your colander in a secure place since you’ll be letting it sit there for a while. Avoid thick pieces of fabric as you’ll have a harder time draining them. Wrap your zoodles in the cloth. Carefully move your zucchini noodles into the colander. Make sure the zoodles sit completely inside the piece of fabric, then wrap the edges up around them to create a makeshift bag. Before moving on, check to make sure that every zoodle ended up inside the bag. If necessary, hold the cloth bag shut using pins or clamps. Squeeze the cloth to remove excess moisture. Grab the top of the cloth bag with 1 of your hands and squeeze the bottom of the bag with the other, forcing lots of moisture out of the zoodles. Keep doing this for about 2 minutes or until the liquid stops running. Let your zoodles dry for at least 1 hour. Leave your zucchini noodles in the piece of fabric and let them sit for as long as possible, at least 1 hour. This will give any remaining liquid a chance to drain out. The less moisture your zoodles contain when frozen, the tastier they’ll be after you thaw them. Storing Zoodles in a Freezer Place your zoodles in small, freezer-safe bags. Carefully remove your zucchini noodles from the piece of fabric and lay them out on a clean table. If your zoodles seem dry enough, place them inside a number of small, freezer-safe bags. Though you can keep your zoodles in a single, large bag, smaller storage portions are more likely to keep their form and texture once thawed. It’s important to keep your zucchini noodles compressed, so do not store them in firm containers like mason jars. If your zoodles feel soft and flimsy, repeat the drying process. Press the air out of your bags and seal them shut. After packaging your zucchini noodles, push down on each bag with your hands to remove any excess air. Then, close the bags tightly so that no more air can get in. Put a label on each bag. To make sure you store your zucchini noodles for an appropriate amount of time, put a label on each bag and write the initial freeze date on it. If you created different portion sizes for each bag, consider listing the amount of zucchini noodles as well. Store your zoodles in a freezer for up to 1 year. Like most forms of summer squash, you can keep zucchini noodles in your freezer for up to 12 months. However, they may become less flavorful over time, so try to eat them as soon as possible. Boil your zoodles to thaw them. When you’re ready to reheat your zoodles, fill a pot with water and bring it to a boil. Place your zucchini noodles in a strainer basket and set it in the water for approximately 1 minute. This will heat and rehydrate the zoodles. Try using your thawed zucchini noodles in cooked dishes like:\nStir-fry dishes\nAlfredo-based dishes\nShrimp scampi\nPho\nPad thai",
    "sentences": [
        " Drying Zucchini Noodles Set your zucchini noodles in a large bowl.",
        "Before freezing your zucchini noodles, it’s important to dry them out as much as possible.",
        "Moist zoodles will lose their shape and texture when stored for a long period of time, leading to a soggy, unappealing mess when you thaw them out.",
        "You can make zucchini noodles at home or purchase them from select health food stores.",
        "Thin zoodles tend to preserve better than thick or wide zoodles.",
        "Sprinkle kosher salt over your zoodles.",
        "Measure out approximately 1 US tbsp (15 ml) of kosher salt for every 2 cups (17 imp fl oz) of zoodles you have.",
        "Then, pinch the salt between your fingers and sprinkle it over the zucchini noodles, covering as much area as possible.",
        "The salt will help preserve your zoodle’s texture while in storage.",
        "Knead your zoodles thoroughly, adding more salt as necessary.",
        "Using your hands, squeeze the zucchini noodles and turn them over in the bowl.",
        "Do this repeatedly to make sure the zoodles and salt mix together.",
        "As you knead, add more salt to cover any bare zucchini noodles.",
        "By the end, you should see salt grains on every single zoodle.",
        "Turn your zoodles over until they bubble up and become firm.",
        "As you knead your zucchini noodles, expect a lot of moisture to seep out.",
        "As it does, your zoodles will firm up slightly and a bubbly mixture will begin to form on top of them, making the whole bowl appear soapy.",
        "Keep turning your zucchini over until all the zoodles feel fairly tough, a process that normally takes between 2 and 3 minutes.",
        "Line a colander with a fresh cloth or towel.",
        "Grab a colander that is large enough to hold all your zucchini noodles.",
        "Line the inside of the colander with a fresh cloth, towel, or other thin fabric, then place it over a sink or large bowl.",
        "Put your colander in a secure place since you’ll be letting it sit there for a while.",
        "Avoid thick pieces of fabric as you’ll have a harder time draining them.",
        "Wrap your zoodles in the cloth.",
        "Carefully move your zucchini noodles into the colander.",
        "Make sure the zoodles sit completely inside the piece of fabric, then wrap the edges up around them to create a makeshift bag.",
        "Before moving on, check to make sure that every zoodle ended up inside the bag.",
        "If necessary, hold the cloth bag shut using pins or clamps.",
        "Squeeze the cloth to remove excess moisture.",
        "Grab the top of the cloth bag with 1 of your hands and squeeze the bottom of the bag with the other, forcing lots of moisture out of the zoodles.",
        "Keep doing this for about 2 minutes or until the liquid stops running.",
        "Let your zoodles dry for at least 1 hour.",
        "Leave your zucchini noodles in the piece of fabric and let them sit for as long as possible, at least 1 hour.",
        "This will give any remaining liquid a chance to drain out.",
        "The less moisture your zoodles contain when frozen, the tastier they’ll be after you thaw them.",
        "Storing Zoodles in a Freezer Place your zoodles in small, freezer-safe bags.",
        "Carefully remove your zucchini noodles from the piece of fabric and lay them out on a clean table.",
        "If your zoodles seem dry enough, place them inside a number of small, freezer-safe bags.",
        "Though you can keep your zoodles in a single, large bag, smaller storage portions are more likely to keep their form and texture once thawed.",
        "It’s important to keep your zucchini noodles compressed, so do not store them in firm containers like mason jars.",
        "If your zoodles feel soft and flimsy, repeat the drying process.",
        "Press the air out of your bags and seal them shut.",
        "After packaging your zucchini noodles, push down on each bag with your hands to remove any excess air.",
        "Then, close the bags tightly so that no more air can get in.",
        "Put a label on each bag.",
        "To make sure you store your zucchini noodles for an appropriate amount of time, put a label on each bag and write the initial freeze date on it.",
        "If you created different portion sizes for each bag, consider listing the amount of zucchini noodles as well.",
        "Store your zoodles in a freezer for up to 1 year.",
        "Like most forms of summer squash, you can keep zucchini noodles in your freezer for up to 12 months.",
        "However, they may become less flavorful over time, so try to eat them as soon as possible.",
        "Boil your zoodles to thaw them.",
        "When you’re ready to reheat your zoodles, fill a pot with water and bring it to a boil.",
        "Place your zucchini noodles in a strainer basket and set it in the water for approximately 1 minute.",
        "This will heat and rehydrate the zoodles.",
        "Try using your thawed zucchini noodles in cooked dishes like:\nStir-fry dishes\nAlfredo-based dishes\nShrimp scampi\nPho\nPad thai"
    ]
}