{
    "title": "How to Hang Aluminum Prints",
    "url": "https://www.wikihow.com/Hang-Aluminum-Prints",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "parts": [
        {
            "name": "Selecting Your Mount or Frame Type",
            "steps": [
                {
                    "headline": "Use a metal frame for your larger aluminum print.",
                    "description": "Metal frames are a great way to hang any metal prints sizes 20 in × 20 in (510 mm × 510 mm) and larger. The frame is typically 1.3 in (33 mm) deep. You can hang the frame to the wall using its wire hanger and a nail."
                },
                {
                    "headline": "Purchase stand-out mounts to make your print a statement piece.",
                    "description": "Stand-outs are ⁄4 inch (19 mm) thick, edge-banded foam board. They are mounting devices that make your print ready to hang. Stand-outs come in two sizes, either Reveal or Flush Cut. Both options come with metal hanging brackets and can be used with all sized prints. Reveal style stand-outs have rounded corners and are ⁄8 inch (3.2 mm) smaller than your print. Use if your print has rounded corners. Flush cut stand-outs have sharp, square corners. You can select black edge banding for all sizes. White, silver, or maple edge banding is available for certain sizes. Purchase these stand-outs from a craft store, home supply store, or camera supply store."
                },
                {
                    "headline": "Go with stainless steel posts to give your prints a modern look.",
                    "description": "Stainless steel posts are ⁄4 in (19 mm) in diameter and hold your aluminum print ⁄4 in (19 mm) off the wall. Attach the posts through 4 holes in the 4 corners of the metal print. To attach your print to the wall, screw the barrels of the posts to the walls, and then attach the threaded caps into the stainless steel barrels. You will have to select this mounting option when ordering your metal print so that your print will come with 4 holes pre-drilled for easy assembly. Posts are available for mostly all sizing options, though they work best for sizes between 8 in × 8 in (200 mm × 200 mm) and 30 in × 40 in (760 mm × 1,020 mm)."
                },
                {
                    "headline": "Hang your print with acrylic and metal posts for a gallery-quality look.",
                    "description": "Acrylic coverings with metal posts create a professional and finished frame, often used in art galleries. You can select plastic acrylic in ⁄4 in (6.4 mm) or ⁄2 in (13 mm) to protect the surface of your print. The acrylic will arrive with pre-drilled holes for easy assembly, so be sure to select this mounting style when ordering your aluminum print. Acrylic and metal posts work great for metal prints 16 in × 16 in (410 mm × 410 mm) and larger, as well as panoramic sizes."
                }
            ]
        },
        {
            "name": "Creating a “Floating” Appearance",
            "steps": [
                {
                    "headline": "Select float mounts to give your print a “floating” appearance.",
                    "description": "A float mount is a 5 in (130 mm) metal plate that has a hole for hanging purposes. Attach this to the back of your metal print. Your print will hang about ⁄2 in (13 mm) away from the wall, appearing to be “floating” from it. Choose this if your aluminum print is 16 in × 16 in (410 mm × 410 mm) or smaller."
                },
                {
                    "headline": "Choose shadow mounts to create a “floating” look for large prints.",
                    "description": "Shadow mounts are larger wooden blocks that attach to the back of your aluminum print. These hold the prints flat and securely because of their larger surface. Your print will be mounted about ⁄2 in (13 mm) from the wall to give it a “floating” effect. These mounts offer a finished black back, which is nice if you are viewing the print from the side. You can find shadow mounts at most craft stores, home supply stores, or camera supply stores."
                },
                {
                    "headline": "Use metal brackets or Gatorboard Block for a floating appearance.",
                    "description": "Like the float and shadow mounts, metal brackets can be used to get a “floating” look. Metal brackets are small, flat pieces of metal used to install your print to the wall. You can use Gatorboard Block as well, which is a lightweight, black piece of foam core. Metal brackets are recommended for prints between 12 in × 18 in (300 mm × 460 mm) and 16 in × 24 in (410 mm × 610 mm) in size, because they can support more weight. Gatorboard works best for metal prints between 8 in × 8 in (200 mm × 200 mm) and  20 in × 30 in (510 mm × 760 mm), though they are ideal for prints sized 12 in × 12 in (300 mm × 300 mm) and smaller. Foam core is lighter than metal, and as a result supports less weight than metal brackets. Purchase either metal brackets or Gatorboard at a camera supply or home supply store. Install the metal bracket or Gatorboard to the back of your print, then secure it to the wall with a nail or screw."
                }
            ]
        },
        {
            "name": "Positioning Your Aluminum Print",
            "steps": [
                {
                    "headline": "Ensure your hanger selection is right for your print and your wall.",
                    "description": "Always make sure the mounting style you choose is appropriate for the size and weight of your aluminum print. Some mounting supplies only work for smaller, lighter prints. Choosing the wrong mounting supplies can cause injuries to yourself, your walls, and your aluminum print\nYour metal print will often come with a hanger, which you will select when ordering your print. If your aluminum print does not come with a hanger, use picture wire or a metal bracket."
                },
                {
                    "headline": "Use a stud finder to locate a stud.",
                    "description": "Your aluminum print will weigh more than a canvas or paper print, so it is important to make sure your walls can support the weight. Slide the stud finder across your wall horizontally, and look for the blinking light. When the light flashes, the stud finder has located a stud. Hang your print from a stud in a flattering location. Position it a few inches above furniture and a few inches from the top of the wall. This will make your print look centered with your furniture."
                },
                {
                    "headline": "Mark the wall with a pencil after you locate a stud.",
                    "description": "This will help you easily find the stud when you are ready to install your nail. Select a spot as close to the stud’s location as possible, and make a small, light mark with a pencil. This mark indicates where you will be hanging your aluminum print. Make sure you can clearly see the mark."
                },
                {
                    "headline": "Mount the hanger of your choice to the wall.",
                    "description": "Use either a drill or a screwdriver and secure your hanging hardware to the wall. Secure the screw in the wall so it has enough room to reach the stud deeply but also has enough room left over to hang your print. Most hangers will use regular wall screws. If your hanger came with separate instructions, double check them to be certain of what hardware to use. If you are hanging your print using metal posts, follow the installation instructions that came with your metal posts."
                },
                {
                    "headline": "Secure multiple screws, depending on your print.",
                    "description": "An extra screw will offer extra security to your print. You can put the screws immediately next to each other or spaced out across the location of your print. You can also use drywall screws or anchors for extra support. These provide a more stable hold, and you can purchase them at most hardware stores."
                },
                {
                    "headline": "Install your aluminum print onto the hanger.",
                    "description": "Hold the aluminum print in your hands, and slide your print either onto the nail or into the hanger you selected. Release the piece after you are sure it will fit on the hanger comfortably and securely. If you chose the metal posts, screw your print into the posts installed on the walls. Use your hands and twist the posts into place. If you used a metal bracket or Gatorboard, slide the nails into the designated hanging spots."
                },
                {
                    "headline": "Verify that your print is straight with a level.",
                    "description": "Place the level at the top of the print, and look at the bubble. If the bubble is in the central position between both vertical lines, it is centered. Make adjustments as needed to your hanging location if your print is not level."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Mounting supplies to fit your print",
        "Screwdriver or drill",
        "Hammer",
        "Wood screws or nails",
        "Level",
        "Stud finder",
        "Pencil"
    ],
    "text": " Selecting Your Mount or Frame Type Use a metal frame for your larger aluminum print. Metal frames are a great way to hang any metal prints sizes 20 in × 20 in (510 mm × 510 mm) and larger. The frame is typically 1.3 in (33 mm) deep. You can hang the frame to the wall using its wire hanger and a nail. Purchase stand-out mounts to make your print a statement piece. Stand-outs are ⁄4 inch (19 mm) thick, edge-banded foam board. They are mounting devices that make your print ready to hang. Stand-outs come in two sizes, either Reveal or Flush Cut. Both options come with metal hanging brackets and can be used with all sized prints. Reveal style stand-outs have rounded corners and are ⁄8 inch (3.2 mm) smaller than your print. Use if your print has rounded corners. Flush cut stand-outs have sharp, square corners. You can select black edge banding for all sizes. White, silver, or maple edge banding is available for certain sizes. Purchase these stand-outs from a craft store, home supply store, or camera supply store. Go with stainless steel posts to give your prints a modern look. Stainless steel posts are ⁄4 in (19 mm) in diameter and hold your aluminum print ⁄4 in (19 mm) off the wall. Attach the posts through 4 holes in the 4 corners of the metal print. To attach your print to the wall, screw the barrels of the posts to the walls, and then attach the threaded caps into the stainless steel barrels. You will have to select this mounting option when ordering your metal print so that your print will come with 4 holes pre-drilled for easy assembly. Posts are available for mostly all sizing options, though they work best for sizes between 8 in × 8 in (200 mm × 200 mm) and 30 in × 40 in (760 mm × 1,020 mm). Hang your print with acrylic and metal posts for a gallery-quality look. Acrylic coverings with metal posts create a professional and finished frame, often used in art galleries. You can select plastic acrylic in ⁄4 in (6.4 mm) or ⁄2 in (13 mm) to protect the surface of your print. The acrylic will arrive with pre-drilled holes for easy assembly, so be sure to select this mounting style when ordering your aluminum print. Acrylic and metal posts work great for metal prints 16 in × 16 in (410 mm × 410 mm) and larger, as well as panoramic sizes. Creating a “Floating” Appearance Select float mounts to give your print a “floating” appearance. A float mount is a 5 in (130 mm) metal plate that has a hole for hanging purposes. Attach this to the back of your metal print. Your print will hang about ⁄2 in (13 mm) away from the wall, appearing to be “floating” from it. Choose this if your aluminum print is 16 in × 16 in (410 mm × 410 mm) or smaller. Choose shadow mounts to create a “floating” look for large prints. Shadow mounts are larger wooden blocks that attach to the back of your aluminum print. These hold the prints flat and securely because of their larger surface. Your print will be mounted about ⁄2 in (13 mm) from the wall to give it a “floating” effect. These mounts offer a finished black back, which is nice if you are viewing the print from the side. You can find shadow mounts at most craft stores, home supply stores, or camera supply stores. Use metal brackets or Gatorboard Block for a floating appearance. Like the float and shadow mounts, metal brackets can be used to get a “floating” look. Metal brackets are small, flat pieces of metal used to install your print to the wall. You can use Gatorboard Block as well, which is a lightweight, black piece of foam core. Metal brackets are recommended for prints between 12 in × 18 in (300 mm × 460 mm) and 16 in × 24 in (410 mm × 610 mm) in size, because they can support more weight. Gatorboard works best for metal prints between 8 in × 8 in (200 mm × 200 mm) and  20 in × 30 in (510 mm × 760 mm), though they are ideal for prints sized 12 in × 12 in (300 mm × 300 mm) and smaller. Foam core is lighter than metal, and as a result supports less weight than metal brackets. Purchase either metal brackets or Gatorboard at a camera supply or home supply store. Install the metal bracket or Gatorboard to the back of your print, then secure it to the wall with a nail or screw. Positioning Your Aluminum Print Ensure your hanger selection is right for your print and your wall. Always make sure the mounting style you choose is appropriate for the size and weight of your aluminum print. Some mounting supplies only work for smaller, lighter prints. Choosing the wrong mounting supplies can cause injuries to yourself, your walls, and your aluminum print\nYour metal print will often come with a hanger, which you will select when ordering your print. If your aluminum print does not come with a hanger, use picture wire or a metal bracket. Use a stud finder to locate a stud. Your aluminum print will weigh more than a canvas or paper print, so it is important to make sure your walls can support the weight. Slide the stud finder across your wall horizontally, and look for the blinking light. When the light flashes, the stud finder has located a stud. Hang your print from a stud in a flattering location. Position it a few inches above furniture and a few inches from the top of the wall. This will make your print look centered with your furniture. Mark the wall with a pencil after you locate a stud. This will help you easily find the stud when you are ready to install your nail. Select a spot as close to the stud’s location as possible, and make a small, light mark with a pencil. This mark indicates where you will be hanging your aluminum print. Make sure you can clearly see the mark. Mount the hanger of your choice to the wall. Use either a drill or a screwdriver and secure your hanging hardware to the wall. Secure the screw in the wall so it has enough room to reach the stud deeply but also has enough room left over to hang your print. Most hangers will use regular wall screws. If your hanger came with separate instructions, double check them to be certain of what hardware to use. If you are hanging your print using metal posts, follow the installation instructions that came with your metal posts. Secure multiple screws, depending on your print. An extra screw will offer extra security to your print. You can put the screws immediately next to each other or spaced out across the location of your print. You can also use drywall screws or anchors for extra support. These provide a more stable hold, and you can purchase them at most hardware stores. Install your aluminum print onto the hanger. Hold the aluminum print in your hands, and slide your print either onto the nail or into the hanger you selected. Release the piece after you are sure it will fit on the hanger comfortably and securely. If you chose the metal posts, screw your print into the posts installed on the walls. Use your hands and twist the posts into place. If you used a metal bracket or Gatorboard, slide the nails into the designated hanging spots. Verify that your print is straight with a level. Place the level at the top of the print, and look at the bubble. If the bubble is in the central position between both vertical lines, it is centered. Make adjustments as needed to your hanging location if your print is not level. Finished. ",
    "sentences": [
        " Selecting Your Mount or Frame Type Use a metal frame for your larger aluminum print.",
        "Metal frames are a great way to hang any metal prints sizes 20 in × 20 in (510 mm × 510 mm) and larger.",
        "The frame is typically 1.3 in (33 mm) deep.",
        "You can hang the frame to the wall using its wire hanger and a nail.",
        "Purchase stand-out mounts to make your print a statement piece.",
        "Stand-outs are ⁄4 inch (19 mm) thick, edge-banded foam board.",
        "They are mounting devices that make your print ready to hang.",
        "Stand-outs come in two sizes, either Reveal or Flush Cut.",
        "Both options come with metal hanging brackets and can be used with all sized prints.",
        "Reveal style stand-outs have rounded corners and are ⁄8 inch (3.2 mm) smaller than your print.",
        "Use if your print has rounded corners.",
        "Flush cut stand-outs have sharp, square corners.",
        "You can select black edge banding for all sizes.",
        "White, silver, or maple edge banding is available for certain sizes.",
        "Purchase these stand-outs from a craft store, home supply store, or camera supply store.",
        "Go with stainless steel posts to give your prints a modern look.",
        "Stainless steel posts are ⁄4 in (19 mm) in diameter and hold your aluminum print ⁄4 in (19 mm) off the wall.",
        "Attach the posts through 4 holes in the 4 corners of the metal print.",
        "To attach your print to the wall, screw the barrels of the posts to the walls, and then attach the threaded caps into the stainless steel barrels.",
        "You will have to select this mounting option when ordering your metal print so that your print will come with 4 holes pre-drilled for easy assembly.",
        "Posts are available for mostly all sizing options, though they work best for sizes between 8 in × 8 in (200 mm × 200 mm) and 30 in × 40 in (760 mm × 1,020 mm).",
        "Hang your print with acrylic and metal posts for a gallery-quality look.",
        "Acrylic coverings with metal posts create a professional and finished frame, often used in art galleries.",
        "You can select plastic acrylic in ⁄4 in (6.4 mm) or ⁄2 in (13 mm) to protect the surface of your print.",
        "The acrylic will arrive with pre-drilled holes for easy assembly, so be sure to select this mounting style when ordering your aluminum print.",
        "Acrylic and metal posts work great for metal prints 16 in × 16 in (410 mm × 410 mm) and larger, as well as panoramic sizes.",
        "Creating a “Floating” Appearance Select float mounts to give your print a “floating” appearance.",
        "A float mount is a 5 in (130 mm) metal plate that has a hole for hanging purposes.",
        "Attach this to the back of your metal print.",
        "Your print will hang about ⁄2 in (13 mm) away from the wall, appearing to be “floating” from it.",
        "Choose this if your aluminum print is 16 in × 16 in (410 mm × 410 mm) or smaller.",
        "Choose shadow mounts to create a “floating” look for large prints.",
        "Shadow mounts are larger wooden blocks that attach to the back of your aluminum print.",
        "These hold the prints flat and securely because of their larger surface.",
        "Your print will be mounted about ⁄2 in (13 mm) from the wall to give it a “floating” effect.",
        "These mounts offer a finished black back, which is nice if you are viewing the print from the side.",
        "You can find shadow mounts at most craft stores, home supply stores, or camera supply stores.",
        "Use metal brackets or Gatorboard Block for a floating appearance.",
        "Like the float and shadow mounts, metal brackets can be used to get a “floating” look.",
        "Metal brackets are small, flat pieces of metal used to install your print to the wall.",
        "You can use Gatorboard Block as well, which is a lightweight, black piece of foam core.",
        "Metal brackets are recommended for prints between 12 in × 18 in (300 mm × 460 mm) and 16 in × 24 in (410 mm × 610 mm) in size, because they can support more weight.",
        "Gatorboard works best for metal prints between 8 in × 8 in (200 mm × 200 mm) and  20 in × 30 in (510 mm × 760 mm), though they are ideal for prints sized 12 in × 12 in (300 mm × 300 mm) and smaller.",
        "Foam core is lighter than metal, and as a result supports less weight than metal brackets.",
        "Purchase either metal brackets or Gatorboard at a camera supply or home supply store.",
        "Install the metal bracket or Gatorboard to the back of your print, then secure it to the wall with a nail or screw.",
        "Positioning Your Aluminum Print Ensure your hanger selection is right for your print and your wall.",
        "Always make sure the mounting style you choose is appropriate for the size and weight of your aluminum print.",
        "Some mounting supplies only work for smaller, lighter prints.",
        "Choosing the wrong mounting supplies can cause injuries to yourself, your walls, and your aluminum print\nYour metal print will often come with a hanger, which you will select when ordering your print.",
        "If your aluminum print does not come with a hanger, use picture wire or a metal bracket.",
        "Use a stud finder to locate a stud.",
        "Your aluminum print will weigh more than a canvas or paper print, so it is important to make sure your walls can support the weight.",
        "Slide the stud finder across your wall horizontally, and look for the blinking light.",
        "When the light flashes, the stud finder has located a stud.",
        "Hang your print from a stud in a flattering location.",
        "Position it a few inches above furniture and a few inches from the top of the wall.",
        "This will make your print look centered with your furniture.",
        "Mark the wall with a pencil after you locate a stud.",
        "This will help you easily find the stud when you are ready to install your nail.",
        "Select a spot as close to the stud’s location as possible, and make a small, light mark with a pencil.",
        "This mark indicates where you will be hanging your aluminum print.",
        "Make sure you can clearly see the mark.",
        "Mount the hanger of your choice to the wall.",
        "Use either a drill or a screwdriver and secure your hanging hardware to the wall.",
        "Secure the screw in the wall so it has enough room to reach the stud deeply but also has enough room left over to hang your print.",
        "Most hangers will use regular wall screws.",
        "If your hanger came with separate instructions, double check them to be certain of what hardware to use.",
        "If you are hanging your print using metal posts, follow the installation instructions that came with your metal posts.",
        "Secure multiple screws, depending on your print.",
        "An extra screw will offer extra security to your print.",
        "You can put the screws immediately next to each other or spaced out across the location of your print.",
        "You can also use drywall screws or anchors for extra support.",
        "These provide a more stable hold, and you can purchase them at most hardware stores.",
        "Install your aluminum print onto the hanger.",
        "Hold the aluminum print in your hands, and slide your print either onto the nail or into the hanger you selected.",
        "Release the piece after you are sure it will fit on the hanger comfortably and securely.",
        "If you chose the metal posts, screw your print into the posts installed on the walls.",
        "Use your hands and twist the posts into place.",
        "If you used a metal bracket or Gatorboard, slide the nails into the designated hanging spots.",
        "Verify that your print is straight with a level.",
        "Place the level at the top of the print, and look at the bubble.",
        "If the bubble is in the central position between both vertical lines, it is centered.",
        "Make adjustments as needed to your hanging location if your print is not level.",
        "Finished."
    ]
}