{
    "title": "How to Finish Pine Stair Treads",
    "url": "https://www.wikihow.com/Finish-Pine-Stair-Treads",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Floors and Stairs"
    ],
    "parts": [
        {
            "name": "Sanding and Filling the Holes",
            "steps": [
                {
                    "headline": "Use a power sander and a medium-grade disc to sand the treads.",
                    "description": "Attach a medium-grade sanding disc to a power sander, plug it in, and turn it on. Go over the entire surface of each tread to start smoothing out the roughness of the wood. It's necessary to sand the surface of your treads before doing anything else. This should remove the unsightly orange tint of the pine, buff out scratches, and also allow the pine to better accept the stain. If you don't already have a power sander, purchase or rent one from your local home improvement store."
                },
                {
                    "headline": "Turn off the sander and switch to a fine-grade disc.",
                    "description": "Once you've gone over all of the treads, turn the sander off and unplug it. Remove the medium-grade sanding disc and attach a fine-grade sanding disc to the sander."
                },
                {
                    "headline": "Go over the treads again with the sander.",
                    "description": "Plug the power sander back in and turn it back on. Sand all of the treads again so that they achieve an even smoother texture."
                },
                {
                    "headline": "Hand sand the corners and edges with sandpaper.",
                    "description": "You likely won't be able to reach the entire surface of the tread with a power sander. Get a few pieces of fine-grain sandpaper from a home improvement store. Roll a pencil up into a piece of the sandpaper and hand sand all of the corners, edges, and crevices that the power sander missed."
                },
                {
                    "headline": "Fill all holes and cracks in the treads with wood filler.",
                    "description": "Get some wood filler from a home improvement store and squirt it into any little holes or cracks you notice in your treads. These can occur naturally in the grain, or as a result of staples and/or tacks that have held carpet to the stairs in the past."
                },
                {
                    "headline": "Wait 24 hours for the wood filler to dry.",
                    "description": "Stay off of the stairs for at least 1 day after filling the holes and cracks so that the filler can dry all the way. Once you think the filler may be dry, touch a couple of the holes or cracks and see if the filler feels wet or sticky at all. If not, the filler has dried completely."
                },
                {
                    "headline": "Sand the treads again.",
                    "description": "Sand the treads again with all of the holes filled in. Go over the treads with the power sander until they're smooth to the touch and then hand sand the tight spots again. This should ensure that the filler is flush with the tread  surface."
                }
            ]
        },
        {
            "name": "Cleaning the Treads",
            "steps": [
                {
                    "headline": "Vacuum up excess sanding dust.",
                    "description": "After you're done sanding, go over the treads with a hand-held vacuum or use an attachment on your upright vacuum. Go over the entire surface area of the treads to ensure that no sanding dust is left behind."
                },
                {
                    "headline": "Wipe down the treads with a tack cloth.",
                    "description": "Go to a paint store or a home center and buy a tack cloth. This is a special cloth that is sticky enough to pick up sanding dust, but doesn't leave moisture behind. Go over the surface of each tread with the cloth to remove all dirt, dust, and sanding dust. If you'd rather make your own tack cloth, soak a piece of cotton fabric in water, wring it out, and then wet it lightly with turpentine. Drip some varnish onto the cloth and then wring it out to distribute the varnish evenly throughout the cloth."
                },
                {
                    "headline": "Fill in and buff out left behind holes and scratches.",
                    "description": "Wiping the treads with a tack cloth should give the treads a shiny quality, which will highlight any scratches or holes that you may have missed while sanding. If you find that you did miss some scratches, buff them out with sandpaper. If you notice any holes that you didn't see before, fill them with wood filler. If you end up having to sand and fill in left behind scratches and holes, wait 24 hours before you vacuum each tread and wipe them down with a tack cloth as you did before."
                }
            ]
        },
        {
            "name": "Staining and Sealing the Treads",
            "steps": [
                {
                    "headline": "Apply a coat of wood conditioner and wipe it away after 15 minutes.",
                    "description": "It can be challenging to stain pine uniformly, but wood conditioner allows for a more even application. Read over the product's instructions, and then wipe the conditioner onto each tread with a foam brush. Then, wait about 15 minutes for the conditioner to soak into the wood. When the time has passed, wipe away any excess with a rag. You can get wood conditioner from a home improvement store. For best results, apply the conditioner in horizontal strokes."
                },
                {
                    "headline": "Brush a coat of wood stain onto each tread.",
                    "description": "Get a wood stain from a home improvement store and brush it onto the stair treads with a bristle brush. Follow the directions on the can of wood stain, and make sure that you cover the entire surface of each stair by moving in long strokes and going with the grain as you apply. If you need to get up and down the stairs, only stain every other tread for now. Once they're completely dry, stain the remaining treads."
                },
                {
                    "headline": "Wait a few minutes and then wipe off the stain.",
                    "description": "It's best to wipe it off with a rag right away if you want a light stain and to wait about 10 minutes if you want a dark stain. If you wait 10 minutes before you wipe off the excess and it's still not dark enough, apply a second stain and wait another 10 minutes or so before you wipe it off."
                },
                {
                    "headline": "Let the treads dry for 24 hours.",
                    "description": "After you're done staining, the treads need a full day to dry. Be sure to stay off of the stairs during this time so that the stain isn't smudged or accidentally wiped away."
                },
                {
                    "headline": "Seal the stain with a coat of polyurethane for protection.",
                    "description": "Polyurethane is what seals your tread and keeps it from getting scratched or damaged. Use a large fine paintbrush to apply an oil-based or water-based polyurethane all over each tread. Apply the polyurethane in long, horizontal strokes. You can find polyurethane at a home improvement store. For best results, follow the directions on the polyurethane and stir it right before you dip the brush into the can each time."
                },
                {
                    "headline": "Wait 24 hours and then apply a second coat of polyurethane.",
                    "description": "Give the treads at least a day to dry. Then, apply another coat of polyurethane just as you did before. Add a third coat of polyurethane for a more protected seal. Return to using the stairs as usual 24 hours after the final coat."
                }
            ]
        }
    ],
    "tyn": [
        "Power sander",
        "Medium-grade sanding disc",
        "Fine-grade sanding disc",
        "Sandpaper",
        "Pencil",
        "Wood filler",
        "Vacuum cleaner",
        "Tack cloth",
        "Wood conditioner",
        "Foam brush",
        "Wood stain",
        "Bristle brush",
        "Rags",
        "Polyurethane",
        "Paintbrush"
    ],
    "text": " Sanding and Filling the Holes Use a power sander and a medium-grade disc to sand the treads. Attach a medium-grade sanding disc to a power sander, plug it in, and turn it on. Go over the entire surface of each tread to start smoothing out the roughness of the wood. It's necessary to sand the surface of your treads before doing anything else. This should remove the unsightly orange tint of the pine, buff out scratches, and also allow the pine to better accept the stain. If you don't already have a power sander, purchase or rent one from your local home improvement store. Turn off the sander and switch to a fine-grade disc. Once you've gone over all of the treads, turn the sander off and unplug it. Remove the medium-grade sanding disc and attach a fine-grade sanding disc to the sander. Go over the treads again with the sander. Plug the power sander back in and turn it back on. Sand all of the treads again so that they achieve an even smoother texture. Hand sand the corners and edges with sandpaper. You likely won't be able to reach the entire surface of the tread with a power sander. Get a few pieces of fine-grain sandpaper from a home improvement store. Roll a pencil up into a piece of the sandpaper and hand sand all of the corners, edges, and crevices that the power sander missed. Fill all holes and cracks in the treads with wood filler. Get some wood filler from a home improvement store and squirt it into any little holes or cracks you notice in your treads. These can occur naturally in the grain, or as a result of staples and/or tacks that have held carpet to the stairs in the past. Wait 24 hours for the wood filler to dry. Stay off of the stairs for at least 1 day after filling the holes and cracks so that the filler can dry all the way. Once you think the filler may be dry, touch a couple of the holes or cracks and see if the filler feels wet or sticky at all. If not, the filler has dried completely. Sand the treads again. Sand the treads again with all of the holes filled in. Go over the treads with the power sander until they're smooth to the touch and then hand sand the tight spots again. This should ensure that the filler is flush with the tread  surface. Cleaning the Treads Vacuum up excess sanding dust. After you're done sanding, go over the treads with a hand-held vacuum or use an attachment on your upright vacuum. Go over the entire surface area of the treads to ensure that no sanding dust is left behind. Wipe down the treads with a tack cloth. Go to a paint store or a home center and buy a tack cloth. This is a special cloth that is sticky enough to pick up sanding dust, but doesn't leave moisture behind. Go over the surface of each tread with the cloth to remove all dirt, dust, and sanding dust. If you'd rather make your own tack cloth, soak a piece of cotton fabric in water, wring it out, and then wet it lightly with turpentine. Drip some varnish onto the cloth and then wring it out to distribute the varnish evenly throughout the cloth. Fill in and buff out left behind holes and scratches. Wiping the treads with a tack cloth should give the treads a shiny quality, which will highlight any scratches or holes that you may have missed while sanding. If you find that you did miss some scratches, buff them out with sandpaper. If you notice any holes that you didn't see before, fill them with wood filler. If you end up having to sand and fill in left behind scratches and holes, wait 24 hours before you vacuum each tread and wipe them down with a tack cloth as you did before. Staining and Sealing the Treads Apply a coat of wood conditioner and wipe it away after 15 minutes. It can be challenging to stain pine uniformly, but wood conditioner allows for a more even application. Read over the product's instructions, and then wipe the conditioner onto each tread with a foam brush. Then, wait about 15 minutes for the conditioner to soak into the wood. When the time has passed, wipe away any excess with a rag. You can get wood conditioner from a home improvement store. For best results, apply the conditioner in horizontal strokes. Brush a coat of wood stain onto each tread. Get a wood stain from a home improvement store and brush it onto the stair treads with a bristle brush. Follow the directions on the can of wood stain, and make sure that you cover the entire surface of each stair by moving in long strokes and going with the grain as you apply. If you need to get up and down the stairs, only stain every other tread for now. Once they're completely dry, stain the remaining treads. Wait a few minutes and then wipe off the stain. It's best to wipe it off with a rag right away if you want a light stain and to wait about 10 minutes if you want a dark stain. If you wait 10 minutes before you wipe off the excess and it's still not dark enough, apply a second stain and wait another 10 minutes or so before you wipe it off. Let the treads dry for 24 hours. After you're done staining, the treads need a full day to dry. Be sure to stay off of the stairs during this time so that the stain isn't smudged or accidentally wiped away. Seal the stain with a coat of polyurethane for protection. Polyurethane is what seals your tread and keeps it from getting scratched or damaged. Use a large fine paintbrush to apply an oil-based or water-based polyurethane all over each tread. Apply the polyurethane in long, horizontal strokes. You can find polyurethane at a home improvement store. For best results, follow the directions on the polyurethane and stir it right before you dip the brush into the can each time. Wait 24 hours and then apply a second coat of polyurethane. Give the treads at least a day to dry. Then, apply another coat of polyurethane just as you did before. Add a third coat of polyurethane for a more protected seal. Return to using the stairs as usual 24 hours after the final coat.",
    "sentences": [
        " Sanding and Filling the Holes Use a power sander and a medium-grade disc to sand the treads.",
        "Attach a medium-grade sanding disc to a power sander, plug it in, and turn it on.",
        "Go over the entire surface of each tread to start smoothing out the roughness of the wood.",
        "It's necessary to sand the surface of your treads before doing anything else.",
        "This should remove the unsightly orange tint of the pine, buff out scratches, and also allow the pine to better accept the stain.",
        "If you don't already have a power sander, purchase or rent one from your local home improvement store.",
        "Turn off the sander and switch to a fine-grade disc.",
        "Once you've gone over all of the treads, turn the sander off and unplug it.",
        "Remove the medium-grade sanding disc and attach a fine-grade sanding disc to the sander.",
        "Go over the treads again with the sander.",
        "Plug the power sander back in and turn it back on.",
        "Sand all of the treads again so that they achieve an even smoother texture.",
        "Hand sand the corners and edges with sandpaper.",
        "You likely won't be able to reach the entire surface of the tread with a power sander.",
        "Get a few pieces of fine-grain sandpaper from a home improvement store.",
        "Roll a pencil up into a piece of the sandpaper and hand sand all of the corners, edges, and crevices that the power sander missed.",
        "Fill all holes and cracks in the treads with wood filler.",
        "Get some wood filler from a home improvement store and squirt it into any little holes or cracks you notice in your treads.",
        "These can occur naturally in the grain, or as a result of staples and/or tacks that have held carpet to the stairs in the past.",
        "Wait 24 hours for the wood filler to dry.",
        "Stay off of the stairs for at least 1 day after filling the holes and cracks so that the filler can dry all the way.",
        "Once you think the filler may be dry, touch a couple of the holes or cracks and see if the filler feels wet or sticky at all.",
        "If not, the filler has dried completely.",
        "Sand the treads again.",
        "Sand the treads again with all of the holes filled in.",
        "Go over the treads with the power sander until they're smooth to the touch and then hand sand the tight spots again.",
        "This should ensure that the filler is flush with the tread  surface.",
        "Cleaning the Treads Vacuum up excess sanding dust.",
        "After you're done sanding, go over the treads with a hand-held vacuum or use an attachment on your upright vacuum.",
        "Go over the entire surface area of the treads to ensure that no sanding dust is left behind.",
        "Wipe down the treads with a tack cloth.",
        "Go to a paint store or a home center and buy a tack cloth.",
        "This is a special cloth that is sticky enough to pick up sanding dust, but doesn't leave moisture behind.",
        "Go over the surface of each tread with the cloth to remove all dirt, dust, and sanding dust.",
        "If you'd rather make your own tack cloth, soak a piece of cotton fabric in water, wring it out, and then wet it lightly with turpentine.",
        "Drip some varnish onto the cloth and then wring it out to distribute the varnish evenly throughout the cloth.",
        "Fill in and buff out left behind holes and scratches.",
        "Wiping the treads with a tack cloth should give the treads a shiny quality, which will highlight any scratches or holes that you may have missed while sanding.",
        "If you find that you did miss some scratches, buff them out with sandpaper.",
        "If you notice any holes that you didn't see before, fill them with wood filler.",
        "If you end up having to sand and fill in left behind scratches and holes, wait 24 hours before you vacuum each tread and wipe them down with a tack cloth as you did before.",
        "Staining and Sealing the Treads Apply a coat of wood conditioner and wipe it away after 15 minutes.",
        "It can be challenging to stain pine uniformly, but wood conditioner allows for a more even application.",
        "Read over the product's instructions, and then wipe the conditioner onto each tread with a foam brush.",
        "Then, wait about 15 minutes for the conditioner to soak into the wood.",
        "When the time has passed, wipe away any excess with a rag.",
        "You can get wood conditioner from a home improvement store.",
        "For best results, apply the conditioner in horizontal strokes.",
        "Brush a coat of wood stain onto each tread.",
        "Get a wood stain from a home improvement store and brush it onto the stair treads with a bristle brush.",
        "Follow the directions on the can of wood stain, and make sure that you cover the entire surface of each stair by moving in long strokes and going with the grain as you apply.",
        "If you need to get up and down the stairs, only stain every other tread for now.",
        "Once they're completely dry, stain the remaining treads.",
        "Wait a few minutes and then wipe off the stain.",
        "It's best to wipe it off with a rag right away if you want a light stain and to wait about 10 minutes if you want a dark stain.",
        "If you wait 10 minutes before you wipe off the excess and it's still not dark enough, apply a second stain and wait another 10 minutes or so before you wipe it off.",
        "Let the treads dry for 24 hours.",
        "After you're done staining, the treads need a full day to dry.",
        "Be sure to stay off of the stairs during this time so that the stain isn't smudged or accidentally wiped away.",
        "Seal the stain with a coat of polyurethane for protection.",
        "Polyurethane is what seals your tread and keeps it from getting scratched or damaged.",
        "Use a large fine paintbrush to apply an oil-based or water-based polyurethane all over each tread.",
        "Apply the polyurethane in long, horizontal strokes.",
        "You can find polyurethane at a home improvement store.",
        "For best results, follow the directions on the polyurethane and stir it right before you dip the brush into the can each time.",
        "Wait 24 hours and then apply a second coat of polyurethane.",
        "Give the treads at least a day to dry.",
        "Then, apply another coat of polyurethane just as you did before.",
        "Add a third coat of polyurethane for a more protected seal.",
        "Return to using the stairs as usual 24 hours after the final coat."
    ]
}