{
    "title": "How to Apply for an ABN Number",
    "url": "https://www.wikihow.com/Apply-for-an-ABN-Number",
    "category_hierarchy": [
        "Finance and Business",
        "Business"
    ],
    "methods": [
        {
            "name": "Applying Online",
            "steps": [
                {
                    "headline": "Visit abr.gov.au to apply online.",
                    "description": "This is the site you will use to begin your ABN application online. On the home page, click on “Apply for an ABN” on the left side of the screen."
                },
                {
                    "headline": "Read over the information and instructions on the website.",
                    "description": "This page explains eligibility information. Some of the requirements include running your own business, paying your own income tax, and securing your clients by advertising. Be sure to review this information to make sure you can apply. For example, if you do not have invoices for your work or if you don't have a separate business bank account, you will not be eligible to apply."
                },
                {
                    "headline": "Gather any business or tax documentation, like your tax file number.",
                    "description": "Getting together any business documents, especially your tax file number and employee biographic details, will make completing your application quicker and easier. If you don't have your documents ready in advance, that's okay. You can fill in this information as you move through the application."
                },
                {
                    "headline": "Click on the yellow “Apply for ABN” button to get started.",
                    "description": "If you have already started on your ABN application, you can click the “Return to saved ABN Application” button instead. Either button will bring you to the application portal."
                },
                {
                    "headline": "Read over and agree to the obligations.",
                    "description": "Before you start your application, you will need to acknowledge that you understand your eligibility to receive an ABN. Review this information, check the correct boxes, and click “Next” in the lower right side of your screen. This information includes your business structure and employee details. Check through the boxes indicating that these are relevant for you and that you agree to the obligations."
                },
                {
                    "headline": "Fill out the application with the requested information for your business.",
                    "description": "Make sure you fill out this information accurately and honestly. Answer the questions and select “Next” when complete. This will move you to the next section of the application. Complete your responses for all sections of the application. For example, you will answer questions like “For taxation purposes which type of entity is the applicant?” and “Will your activities be carried out in Australia?” Include information about the nature of your business. You will need to supply information like: name and contact details of the applicant, address and contact details of the business or organization, details of each person or organization associated with the business (partner, director, secretary, or shareholder), ABN reference number (for unfinished applications), details of business activities, tax file number (optional), and proof of identity information such as name, address and birth details, business structure."
                },
                {
                    "headline": "Declare by law that you agree to the terms and conditions.",
                    "description": "This is the last step in the application process. Sign your name and list your position to declare that the information submitted is true and correct. List the date of your application as well. It is recommended to print the form for your records. After you submit the application, you cannot go back and print a copy."
                },
                {
                    "headline": "Click on the “Submit” button to finish your application.",
                    "description": "You have now applied for your ABN Number! Typically, your number will be assigned within an hour. Once you have your ABN Number assigned, you can continue to apply for other business registrations like GST. Your details will now be added to the Australian Business Register. You should receive a confirmation letter within 14 days showing your ABR details."
                },
                {
                    "headline": "Call the Australian Business Register to discuss your refusal.",
                    "description": "The ABR will work to resolve the issue with you and explain their decision in more detail. The ABR can also give you instructions for next steps, like lodging an objection. Have your refusal number and proof of identification handy. Call 13 92 36 Monday through Friday from 8:00am to 6:00pm. If your application is not successful, you will receive a refusal number and a letter detailing why you have been refused. The letter will also explain the options available to you at this point."
                }
            ]
        },
        {
            "name": "Registering Through the Mail",
            "steps": [
                {
                    "headline": "Call the Australian Taxation Office to order the form.",
                    "description": "If you prefer the traditional way of applying, you can request the ABN forms for free. PDFs for the ABN application form are no longer available, though you can call to order the ABN form. For individuals, your application name is “ABN Registration for Individuals” and the reference number of the form is NAT 2938. When ordering the form, mention the reference number. Call 13 72 26 Monday through Friday from 8:00am to 6:00pm. You can also request forms to change your ABN details (NAT 2943) or to cancel your registration (NAT 2955)."
                },
                {
                    "headline": "Wait about 10 days to receive the form.",
                    "description": "After you have made your request, your form will ship from the Australian Taxation Office. It typically takes about 10 days to receive this form in the mail."
                },
                {
                    "headline": "Complete the information requested on the form.",
                    "description": "This information will be the same as on the online form but on a hard copy. Make sure you complete all boxes with accurate, true information. If you fill out the form incorrectly, it will take longer to process."
                },
                {
                    "headline": "Mail back the form to the Australian Taxation Office.",
                    "description": "After you complete the form, put it in an envelope and mail it back to the Australian Taxation Office. Once they receive it, they will process your application. You will receive notice in the mail with your ABN status in about 28 days. Your notice will either grant your ABN number or provide a refusal number."
                },
                {
                    "headline": "Review your refusal notice to determine your next steps.",
                    "description": "If you receive a refusal number in the mail, you will also receive detailed information about why you were refused and what you can do next."
                },
                {
                    "headline": "Contact the Australian Business Register if you have questions.",
                    "description": "Have your refusal number and proof of identification handy. Call 13 92 36 Monday through Friday from 8:00am to 6:00pm."
                }
            ]
        }
    ],
    "tyn": [
        "Tax File Number",
        "Previous ABN, if issued",
        "Australian Company Number or Australian Registered Body Number",
        "Date your ABN is required"
    ],
    "text": " Applying Online Visit abr.gov.au to apply online. This is the site you will use to begin your ABN application online. On the home page, click on “Apply for an ABN” on the left side of the screen. Read over the information and instructions on the website. This page explains eligibility information. Some of the requirements include running your own business, paying your own income tax, and securing your clients by advertising. Be sure to review this information to make sure you can apply. For example, if you do not have invoices for your work or if you don't have a separate business bank account, you will not be eligible to apply. Gather any business or tax documentation, like your tax file number. Getting together any business documents, especially your tax file number and employee biographic details, will make completing your application quicker and easier. If you don't have your documents ready in advance, that's okay. You can fill in this information as you move through the application. Click on the yellow “Apply for ABN” button to get started. If you have already started on your ABN application, you can click the “Return to saved ABN Application” button instead. Either button will bring you to the application portal. Read over and agree to the obligations. Before you start your application, you will need to acknowledge that you understand your eligibility to receive an ABN. Review this information, check the correct boxes, and click “Next” in the lower right side of your screen. This information includes your business structure and employee details. Check through the boxes indicating that these are relevant for you and that you agree to the obligations. Fill out the application with the requested information for your business. Make sure you fill out this information accurately and honestly. Answer the questions and select “Next” when complete. This will move you to the next section of the application. Complete your responses for all sections of the application. For example, you will answer questions like “For taxation purposes which type of entity is the applicant?” and “Will your activities be carried out in Australia?” Include information about the nature of your business. You will need to supply information like: name and contact details of the applicant, address and contact details of the business or organization, details of each person or organization associated with the business (partner, director, secretary, or shareholder), ABN reference number (for unfinished applications), details of business activities, tax file number (optional), and proof of identity information such as name, address and birth details, business structure. Declare by law that you agree to the terms and conditions. This is the last step in the application process. Sign your name and list your position to declare that the information submitted is true and correct. List the date of your application as well. It is recommended to print the form for your records. After you submit the application, you cannot go back and print a copy. Click on the “Submit” button to finish your application. You have now applied for your ABN Number! Typically, your number will be assigned within an hour. Once you have your ABN Number assigned, you can continue to apply for other business registrations like GST. Your details will now be added to the Australian Business Register. You should receive a confirmation letter within 14 days showing your ABR details. Call the Australian Business Register to discuss your refusal. The ABR will work to resolve the issue with you and explain their decision in more detail. The ABR can also give you instructions for next steps, like lodging an objection. Have your refusal number and proof of identification handy. Call 13 92 36 Monday through Friday from 8:00am to 6:00pm. If your application is not successful, you will receive a refusal number and a letter detailing why you have been refused. The letter will also explain the options available to you at this point. Registering Through the Mail Call the Australian Taxation Office to order the form. If you prefer the traditional way of applying, you can request the ABN forms for free. PDFs for the ABN application form are no longer available, though you can call to order the ABN form. For individuals, your application name is “ABN Registration for Individuals” and the reference number of the form is NAT 2938. When ordering the form, mention the reference number. Call 13 72 26 Monday through Friday from 8:00am to 6:00pm. You can also request forms to change your ABN details (NAT 2943) or to cancel your registration (NAT 2955). Wait about 10 days to receive the form. After you have made your request, your form will ship from the Australian Taxation Office. It typically takes about 10 days to receive this form in the mail. Complete the information requested on the form. This information will be the same as on the online form but on a hard copy. Make sure you complete all boxes with accurate, true information. If you fill out the form incorrectly, it will take longer to process. Mail back the form to the Australian Taxation Office. After you complete the form, put it in an envelope and mail it back to the Australian Taxation Office. Once they receive it, they will process your application. You will receive notice in the mail with your ABN status in about 28 days. Your notice will either grant your ABN number or provide a refusal number. Review your refusal notice to determine your next steps. If you receive a refusal number in the mail, you will also receive detailed information about why you were refused and what you can do next. Contact the Australian Business Register if you have questions. Have your refusal number and proof of identification handy. Call 13 92 36 Monday through Friday from 8:00am to 6:00pm.",
    "sentences": [
        " Applying Online Visit abr.gov.au to apply online.",
        "This is the site you will use to begin your ABN application online.",
        "On the home page, click on “Apply for an ABN” on the left side of the screen.",
        "Read over the information and instructions on the website.",
        "This page explains eligibility information.",
        "Some of the requirements include running your own business, paying your own income tax, and securing your clients by advertising.",
        "Be sure to review this information to make sure you can apply.",
        "For example, if you do not have invoices for your work or if you don't have a separate business bank account, you will not be eligible to apply.",
        "Gather any business or tax documentation, like your tax file number.",
        "Getting together any business documents, especially your tax file number and employee biographic details, will make completing your application quicker and easier.",
        "If you don't have your documents ready in advance, that's okay.",
        "You can fill in this information as you move through the application.",
        "Click on the yellow “Apply for ABN” button to get started.",
        "If you have already started on your ABN application, you can click the “Return to saved ABN Application” button instead.",
        "Either button will bring you to the application portal.",
        "Read over and agree to the obligations.",
        "Before you start your application, you will need to acknowledge that you understand your eligibility to receive an ABN.",
        "Review this information, check the correct boxes, and click “Next” in the lower right side of your screen.",
        "This information includes your business structure and employee details.",
        "Check through the boxes indicating that these are relevant for you and that you agree to the obligations.",
        "Fill out the application with the requested information for your business.",
        "Make sure you fill out this information accurately and honestly.",
        "Answer the questions and select “Next” when complete.",
        "This will move you to the next section of the application.",
        "Complete your responses for all sections of the application.",
        "For example, you will answer questions like “For taxation purposes which type of entity is the applicant?” and “Will your activities be carried out in Australia?” Include information about the nature of your business.",
        "You will need to supply information like: name and contact details of the applicant, address and contact details of the business or organization, details of each person or organization associated with the business (partner, director, secretary, or shareholder), ABN reference number (for unfinished applications), details of business activities, tax file number (optional), and proof of identity information such as name, address and birth details, business structure.",
        "Declare by law that you agree to the terms and conditions.",
        "This is the last step in the application process.",
        "Sign your name and list your position to declare that the information submitted is true and correct.",
        "List the date of your application as well.",
        "It is recommended to print the form for your records.",
        "After you submit the application, you cannot go back and print a copy.",
        "Click on the “Submit” button to finish your application.",
        "You have now applied for your ABN Number!",
        "Typically, your number will be assigned within an hour.",
        "Once you have your ABN Number assigned, you can continue to apply for other business registrations like GST.",
        "Your details will now be added to the Australian Business Register.",
        "You should receive a confirmation letter within 14 days showing your ABR details.",
        "Call the Australian Business Register to discuss your refusal.",
        "The ABR will work to resolve the issue with you and explain their decision in more detail.",
        "The ABR can also give you instructions for next steps, like lodging an objection.",
        "Have your refusal number and proof of identification handy.",
        "Call 13 92 36 Monday through Friday from 8:00am to 6:00pm.",
        "If your application is not successful, you will receive a refusal number and a letter detailing why you have been refused.",
        "The letter will also explain the options available to you at this point.",
        "Registering Through the Mail Call the Australian Taxation Office to order the form.",
        "If you prefer the traditional way of applying, you can request the ABN forms for free.",
        "PDFs for the ABN application form are no longer available, though you can call to order the ABN form.",
        "For individuals, your application name is “ABN Registration for Individuals” and the reference number of the form is NAT 2938.",
        "When ordering the form, mention the reference number.",
        "Call 13 72 26 Monday through Friday from 8:00am to 6:00pm.",
        "You can also request forms to change your ABN details (NAT 2943) or to cancel your registration (NAT 2955).",
        "Wait about 10 days to receive the form.",
        "After you have made your request, your form will ship from the Australian Taxation Office.",
        "It typically takes about 10 days to receive this form in the mail.",
        "Complete the information requested on the form.",
        "This information will be the same as on the online form but on a hard copy.",
        "Make sure you complete all boxes with accurate, true information.",
        "If you fill out the form incorrectly, it will take longer to process.",
        "Mail back the form to the Australian Taxation Office.",
        "After you complete the form, put it in an envelope and mail it back to the Australian Taxation Office.",
        "Once they receive it, they will process your application.",
        "You will receive notice in the mail with your ABN status in about 28 days.",
        "Your notice will either grant your ABN number or provide a refusal number.",
        "Review your refusal notice to determine your next steps.",
        "If you receive a refusal number in the mail, you will also receive detailed information about why you were refused and what you can do next.",
        "Contact the Australian Business Register if you have questions.",
        "Have your refusal number and proof of identification handy.",
        "Call 13 92 36 Monday through Friday from 8:00am to 6:00pm."
    ]
}