{
    "title": "How to Go Scalloping",
    "url": "https://www.wikihow.com/Go-Scalloping",
    "category_hierarchy": [
        "Sports and Fitness",
        "Outdoor Recreation",
        "Fishing"
    ],
    "parts": [
        {
            "name": "Preparing for a Scalloping Trip",
            "steps": [
                {
                    "headline": "Look up when the scallop season starts where you're heading.",
                    "description": "Different parts of the season offer different benefits; it's up to you to decide what type of experience you prefer. One benefit to going late in the scalloping season is that the scallops get bigger as the season goes on. Going hunting earlier in the season can mean a more plentiful scallop bed that hasn't been picked over by crowds of people."
                },
                {
                    "headline": "Choose a sunny day for your scalloping trip.",
                    "description": "Sunny conditions are best for spotting the scallops in the water and can also make for a more enjoyable overall experience."
                },
                {
                    "headline": "Learn the local scalloping regulations.",
                    "description": "Depending on your location, you may need a permit, fishing license, and to stay within a daily catch limits. The local Fishing and Wildlife Commission's website can be a great resource for learning the local rules."
                },
                {
                    "headline": "Gather your supplies.",
                    "description": "If this is your first time going scalloping, there are a few essential items you may need to pick up from your local dive or tackle shop:\nDive flag. It is always recommended, and often required by law, to post a dive flag on your boat while snorkelers are underwater so that other boats can steer clear. Drawstring mesh bag to collect scallops as you go. Small paring knife for opening and cleaning the scallops."
                }
            ]
        },
        {
            "name": "Hunting for Scallops",
            "steps": [
                {
                    "headline": "Identify an area moderately deep with a mix of sand and grass along the bottom.",
                    "description": "Scallops tend to reside in clear water 4 feet (1.2 m) - 10 feet (3.0 m) deep with a mix of sea vegetation. Scallops are usually in clusters, so if you look for a while and don't see any, your time is best spent moving to another spot. Stay away from crowds of people. Highly trafficked areas can be picked-over and have a skimpy selection of scallops to collect."
                },
                {
                    "headline": "Look for scallops between the sand and the seagrass.",
                    "description": "Snorkel along the surface of the water looking carefully where the sea vegetation meet's the body of water's floor for the ribbed seashell of the scallop. Scallops typically have a dark, marbled top shell and a white bottom shell. #* While most scallops will be hard to spot by their dark top shells, it can be easier to pick out a few that have flipped over and have their white bottom shells showing. If it's a very sunny day, the scallops will be drawn to the top of the grass, making them easier to spot."
                },
                {
                    "headline": "Grab the scallops with your hand or a small net.",
                    "description": "Scoop the into your mesh bag and keep going until you tire out, run out of scallops in that area, or reach your daily catch limit. Don't let the scallops clamp down their shells and pinch your fingers! Prevent this by picking up the scallop from the back. Scallops move around by opening and closing their shells in an undulating fashion. While they do not move very quickly, they may see your hand or net approaching and try to swim away."
                },
                {
                    "headline": "Chill the scallops in a cooler immediately after catching them.",
                    "description": "The cold temperature causes the scallops to die with their shells open, making the cleaning process much easier and faster. It also ensures the scallops stay fresh after leaving the water. Once you've put the scallops in the cooler, you can wait until getting back to the dock or home before cleaning them."
                }
            ]
        },
        {
            "name": "Cleaning the Scallops",
            "steps": [
                {
                    "headline": "Use your knife to open the scallop shell.",
                    "description": "Hold  the scallop with your left hand (left-handed people, use your right hand) and use the tip of the knife to pry the top and bottom halves of the scallop's shell open. If the valve is completely shut, penetrate the shell near its hinge for an easier entry."
                },
                {
                    "headline": "Use the tip of your knife to scrape off the dark membrane.",
                    "description": "Remove any dark material from the white muscle while it is still attached to the shell, scraping from the back hinge of the shell to the front. You can also use your knife to clean off any other stringy material that remains."
                },
                {
                    "headline": "Gently scrape your knife into the top (dark) part of the shell.",
                    "description": "This will release the scallop muscle.You will be left with a clean, white scallop that's ready to be cooked or stored!"
                },
                {
                    "headline": "Store fresh, cleaned scallops in the refrigerator for up to 2 days.",
                    "description": "If you are not able to use the scallops almost immediately, freeze them immediately and use within 3 months."
                }
            ]
        }
    ],
    "tyn": [
        "Boat",
        "Extra fuel",
        "Dive flag",
        "Snorkel",
        "Swim mask",
        "Drawstring mesh bag",
        "Cooler full of ice",
        "Small paring knife",
        "Underwater camera (optional)"
    ],
    "text": " Preparing for a Scalloping Trip Look up when the scallop season starts where you're heading. Different parts of the season offer different benefits; it's up to you to decide what type of experience you prefer. One benefit to going late in the scalloping season is that the scallops get bigger as the season goes on. Going hunting earlier in the season can mean a more plentiful scallop bed that hasn't been picked over by crowds of people. Choose a sunny day for your scalloping trip. Sunny conditions are best for spotting the scallops in the water and can also make for a more enjoyable overall experience. Learn the local scalloping regulations. Depending on your location, you may need a permit, fishing license, and to stay within a daily catch limits. The local Fishing and Wildlife Commission's website can be a great resource for learning the local rules. Gather your supplies. If this is your first time going scalloping, there are a few essential items you may need to pick up from your local dive or tackle shop:\nDive flag. It is always recommended, and often required by law, to post a dive flag on your boat while snorkelers are underwater so that other boats can steer clear. Drawstring mesh bag to collect scallops as you go. Small paring knife for opening and cleaning the scallops. Hunting for Scallops Identify an area moderately deep with a mix of sand and grass along the bottom. Scallops tend to reside in clear water 4 feet (1.2 m) - 10 feet (3.0 m) deep with a mix of sea vegetation. Scallops are usually in clusters, so if you look for a while and don't see any, your time is best spent moving to another spot. Stay away from crowds of people. Highly trafficked areas can be picked-over and have a skimpy selection of scallops to collect. Look for scallops between the sand and the seagrass. Snorkel along the surface of the water looking carefully where the sea vegetation meet's the body of water's floor for the ribbed seashell of the scallop. Scallops typically have a dark, marbled top shell and a white bottom shell. #* While most scallops will be hard to spot by their dark top shells, it can be easier to pick out a few that have flipped over and have their white bottom shells showing. If it's a very sunny day, the scallops will be drawn to the top of the grass, making them easier to spot. Grab the scallops with your hand or a small net. Scoop the into your mesh bag and keep going until you tire out, run out of scallops in that area, or reach your daily catch limit. Don't let the scallops clamp down their shells and pinch your fingers! Prevent this by picking up the scallop from the back. Scallops move around by opening and closing their shells in an undulating fashion. While they do not move very quickly, they may see your hand or net approaching and try to swim away. Chill the scallops in a cooler immediately after catching them. The cold temperature causes the scallops to die with their shells open, making the cleaning process much easier and faster. It also ensures the scallops stay fresh after leaving the water. Once you've put the scallops in the cooler, you can wait until getting back to the dock or home before cleaning them. Cleaning the Scallops Use your knife to open the scallop shell. Hold  the scallop with your left hand (left-handed people, use your right hand) and use the tip of the knife to pry the top and bottom halves of the scallop's shell open. If the valve is completely shut, penetrate the shell near its hinge for an easier entry. Use the tip of your knife to scrape off the dark membrane. Remove any dark material from the white muscle while it is still attached to the shell, scraping from the back hinge of the shell to the front. You can also use your knife to clean off any other stringy material that remains. Gently scrape your knife into the top (dark) part of the shell. This will release the scallop muscle.You will be left with a clean, white scallop that's ready to be cooked or stored! Store fresh, cleaned scallops in the refrigerator for up to 2 days. If you are not able to use the scallops almost immediately, freeze them immediately and use within 3 months.",
    "sentences": [
        " Preparing for a Scalloping Trip Look up when the scallop season starts where you're heading.",
        "Different parts of the season offer different benefits; it's up to you to decide what type of experience you prefer.",
        "One benefit to going late in the scalloping season is that the scallops get bigger as the season goes on.",
        "Going hunting earlier in the season can mean a more plentiful scallop bed that hasn't been picked over by crowds of people.",
        "Choose a sunny day for your scalloping trip.",
        "Sunny conditions are best for spotting the scallops in the water and can also make for a more enjoyable overall experience.",
        "Learn the local scalloping regulations.",
        "Depending on your location, you may need a permit, fishing license, and to stay within a daily catch limits.",
        "The local Fishing and Wildlife Commission's website can be a great resource for learning the local rules.",
        "Gather your supplies.",
        "If this is your first time going scalloping, there are a few essential items you may need to pick up from your local dive or tackle shop:\nDive flag.",
        "It is always recommended, and often required by law, to post a dive flag on your boat while snorkelers are underwater so that other boats can steer clear.",
        "Drawstring mesh bag to collect scallops as you go.",
        "Small paring knife for opening and cleaning the scallops.",
        "Hunting for Scallops Identify an area moderately deep with a mix of sand and grass along the bottom.",
        "Scallops tend to reside in clear water 4 feet (1.2 m) - 10 feet (3.0 m) deep with a mix of sea vegetation.",
        "Scallops are usually in clusters, so if you look for a while and don't see any, your time is best spent moving to another spot.",
        "Stay away from crowds of people.",
        "Highly trafficked areas can be picked-over and have a skimpy selection of scallops to collect.",
        "Look for scallops between the sand and the seagrass.",
        "Snorkel along the surface of the water looking carefully where the sea vegetation meet's the body of water's floor for the ribbed seashell of the scallop.",
        "Scallops typically have a dark, marbled top shell and a white bottom shell.",
        "#* While most scallops will be hard to spot by their dark top shells, it can be easier to pick out a few that have flipped over and have their white bottom shells showing.",
        "If it's a very sunny day, the scallops will be drawn to the top of the grass, making them easier to spot.",
        "Grab the scallops with your hand or a small net.",
        "Scoop the into your mesh bag and keep going until you tire out, run out of scallops in that area, or reach your daily catch limit.",
        "Don't let the scallops clamp down their shells and pinch your fingers!",
        "Prevent this by picking up the scallop from the back.",
        "Scallops move around by opening and closing their shells in an undulating fashion.",
        "While they do not move very quickly, they may see your hand or net approaching and try to swim away.",
        "Chill the scallops in a cooler immediately after catching them.",
        "The cold temperature causes the scallops to die with their shells open, making the cleaning process much easier and faster.",
        "It also ensures the scallops stay fresh after leaving the water.",
        "Once you've put the scallops in the cooler, you can wait until getting back to the dock or home before cleaning them.",
        "Cleaning the Scallops Use your knife to open the scallop shell.",
        "Hold  the scallop with your left hand (left-handed people, use your right hand) and use the tip of the knife to pry the top and bottom halves of the scallop's shell open.",
        "If the valve is completely shut, penetrate the shell near its hinge for an easier entry.",
        "Use the tip of your knife to scrape off the dark membrane.",
        "Remove any dark material from the white muscle while it is still attached to the shell, scraping from the back hinge of the shell to the front.",
        "You can also use your knife to clean off any other stringy material that remains.",
        "Gently scrape your knife into the top (dark) part of the shell.",
        "This will release the scallop muscle.You will be left with a clean, white scallop that's ready to be cooked or stored!",
        "Store fresh, cleaned scallops in the refrigerator for up to 2 days.",
        "If you are not able to use the scallops almost immediately, freeze them immediately and use within 3 months."
    ]
}