{
    "title": "How to Make a Plastic Bottle Wormery",
    "url": "https://www.wikihow.com/Make-a-Plastic-Bottle-Wormery",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Compost Mulch and Soil Preparation",
        "Worm Farms and Compost"
    ],
    "parts": [
        {
            "name": "Washing and Cutting the Bottle",
            "steps": [
                {
                    "headline": "Rinse out an empty 2 L (68  fl oz) clear, plastic soda bottle.",
                    "description": "Fill the bottle with warm water and swirl it around. Then, pour out the water. Repeat this 2 more times to ensure that there is no more soda residue in the bottle. Don’t worry about drying out the inside of the bottle. The soil layers will need to be damp, so a little water left inside the bottle is fine."
                },
                {
                    "headline": "Remove the label and adhesive so you will be able to see the worms.",
                    "description": "Find the edge of the label and peel it away from the bottle. If there is any adhesive that won’t come off, apply about 1 tbsp (15 mL) of vegetable oil to the bottle and work it around with your fingers. Then, wash the outside of the bottle with dish soap and warm water to remove the excess oil. Canola, olive, sunflower, or any other type of oil you have on hand will work for this. You may need to let the oil soak in for a 3 to 5 minutes if there is a lot of adhesive stuck on the bottle."
                },
                {
                    "headline": "Cut off the top of the plastic bottle.",
                    "description": "Use a sharp pair of scissors to cut the top off of the bottle. Start cutting where the bottle begins to taper into the neck. Cut all the way around the bottle to remove the bottle top. Cut straight, clean edges. Don’t create any jagged edges.Tip: Try drawing a line around the bottle with a marker and cutting along this line to ensure that you get an even edge."
                },
                {
                    "headline": "Create a lid for your wormery using the top of the bottle, if desired.",
                    "description": "Ensure that the top of the bottle is also clean. Cut a 2 in (5.1 cm) slit in the bottom (widest part) of the bottle top. Then, when your wormery is ready, place it back onto the top of the bottle so that the edges overlap. Leave the cap off to allow air flow."
                }
            ]
        },
        {
            "name": "Layering the Soil",
            "steps": [
                {
                    "headline": "Place 2 cups (870 g) of sand in the bottom of the bottle and spritz it with water.",
                    "description": "The bottom layer of your wormery is sand. Pour in enough to fill the water bottle about 1/5th of the way, which should be about 2 cups (870 g). Then, use a spray bottle filled with plain water to moisten the sand. Spray enough so that the sand feels damp to the touch. Leave this layer and the other layers loose. Don’t pack it with your hands. You can purchase sand at a hardware or garden supply store."
                },
                {
                    "headline": "Add 2 cups (260 g) of garden soil next and spray it.",
                    "description": "Pour enough garden soil into the bottle for fill the bottle 2/5ths full, which should be about 2 cups (870 g). Then, spray the soil with water until it feels damp. Soil from your yard or garden is fine. However, you can purchase garden soil at a hardware or garden supply store if you don’t have some you can dig up."
                },
                {
                    "headline": "Pour in another 2 cups (870 g) of sand and spray water on it.",
                    "description": "Repeat the sand layer with the same amount as before, so that now the bottle should be 3/5th of the way full. Spray the sand with water to make it damp."
                },
                {
                    "headline": "Include 2 cups (260 g) of mulch and water it.",
                    "description": "Finish off the soil layers with a mulch layer on the very top. The bottle should be 4/5ths of the way full now. Spritz it with water to make the mulch damp. You can purchase mulch at a hardware or garden supply store. Tip: Make sure to keep the spray bottle near your wormery after you finish setting it up. You will need to use it to keep the wormery moist."
                }
            ]
        },
        {
            "name": "Transferring  Worms to the Wormery",
            "steps": [
                {
                    "headline": "Find 4-6 worms and place them in the wormery.",
                    "description": "Gently place the worms on the top layer of the wormery, which should be mulch. They should start to burrow into the soil right away. Worms like to hide in dark, moist places in the dirt and under rocks. You may also buy worms from a bait shop if you don’t want to look for them. You can attract worms to a bare patch of dirt by watering it and placing a piece of carpet or cardboard over it. Check the patch the next day and you should have some worms. Collect worms while doing yardwork or digging in your garden. Bring your wormery outside with you and place worms into it as you find them during routine yardwork and gardening chores. Check damp spots in your yard or check the sidewalk after it rains. Worms will sometimes emerge from the dirt and crawl onto a nearby sidewalk after it rains. If this happens, pick up the worms and put them in your wormery."
                },
                {
                    "headline": "Add food to the top layer of your wormery.",
                    "description": "Once the worms have started burrowing down into the soil, place a layer of fruit and vegetable peels on top of the mulch. This will be the worms’ food, which they will compost into the soil. Add more food in a few days if the worms consume the scraps you left them. If you made a lid for your wormery, you may want to put it on now to ensure the worms don’t try to crawl out of the bottle. Tip: Be careful about what you add to the wormery! Some foods will attract other insects and possibly even some animals, like rats. Don’t add meat, cheese, baked goods, or any other cooked human foods."
                },
                {
                    "headline": "Cover the bottle with a bag, box, or paper and keep it somewhere cool.",
                    "description": "Get a box or bag that is large enough to cover the bottle completely. You may also tape a piece of black construction paper around the bottle to make it dark. Place the bottle somewhere warm and dark in your home or classroom. However, keep it away from hot places, such as sunny windows and other bright, hot spots. If you remove the cover to check on your worms, be sure to replace it when you are done. They prefer the dark."
                },
                {
                    "headline": "Check on the worms daily to ensure the soil is damp.",
                    "description": "The soil needs to always be damp so that the worms can move freely in the wormery. Check it daily to ensure that the top layer of mulch feels damp and the other layers look damp. Spritz the mulch layer with water to moisten it if needed. Don’t soak the soil layers with water. If they look dry, spritz the top layer until it is moist and let the worms work this moisture around. If the layers still seem dry the next day, spritz the mulch layer again."
                },
                {
                    "headline": "Release the worms in your garden or yard when the dirt is mixed.",
                    "description": "The wormery is not meant as a permanent home for the worms. Once your experiment is done, take the bottle out to a bare patch of earth in your yard or garden and gently empty the content of the worm farm and the worms onto the earth. They will crawl away and burrow into the ground on their own and the soil they have enriched will be good for your yard or garden. You may keep and reuse the bottle if desired, or recycle it if you are finished."
                }
            ]
        }
    ],
    "tyn": [
        "1 empty 2 L (68  fl oz) clear, plastic soda bottle",
        "Dish soap",
        "Warm water",
        "1 tbsp (15 mL) of vegetable oil (optional)",
        "Scissors",
        "Spray bottle filled with water",
        "Sand",
        "Garden soil",
        "Mulch",
        "4 to 6 worms",
        "Fruit and vegetable peels"
    ],
    "text": " Washing and Cutting the Bottle Rinse out an empty 2 L (68  fl oz) clear, plastic soda bottle. Fill the bottle with warm water and swirl it around. Then, pour out the water. Repeat this 2 more times to ensure that there is no more soda residue in the bottle. Don’t worry about drying out the inside of the bottle. The soil layers will need to be damp, so a little water left inside the bottle is fine. Remove the label and adhesive so you will be able to see the worms. Find the edge of the label and peel it away from the bottle. If there is any adhesive that won’t come off, apply about 1 tbsp (15 mL) of vegetable oil to the bottle and work it around with your fingers. Then, wash the outside of the bottle with dish soap and warm water to remove the excess oil. Canola, olive, sunflower, or any other type of oil you have on hand will work for this. You may need to let the oil soak in for a 3 to 5 minutes if there is a lot of adhesive stuck on the bottle. Cut off the top of the plastic bottle. Use a sharp pair of scissors to cut the top off of the bottle. Start cutting where the bottle begins to taper into the neck. Cut all the way around the bottle to remove the bottle top. Cut straight, clean edges. Don’t create any jagged edges.Tip: Try drawing a line around the bottle with a marker and cutting along this line to ensure that you get an even edge. Create a lid for your wormery using the top of the bottle, if desired. Ensure that the top of the bottle is also clean. Cut a 2 in (5.1 cm) slit in the bottom (widest part) of the bottle top. Then, when your wormery is ready, place it back onto the top of the bottle so that the edges overlap. Leave the cap off to allow air flow. Layering the Soil Place 2 cups (870 g) of sand in the bottom of the bottle and spritz it with water. The bottom layer of your wormery is sand. Pour in enough to fill the water bottle about 1/5th of the way, which should be about 2 cups (870 g). Then, use a spray bottle filled with plain water to moisten the sand. Spray enough so that the sand feels damp to the touch. Leave this layer and the other layers loose. Don’t pack it with your hands. You can purchase sand at a hardware or garden supply store. Add 2 cups (260 g) of garden soil next and spray it. Pour enough garden soil into the bottle for fill the bottle 2/5ths full, which should be about 2 cups (870 g). Then, spray the soil with water until it feels damp. Soil from your yard or garden is fine. However, you can purchase garden soil at a hardware or garden supply store if you don’t have some you can dig up. Pour in another 2 cups (870 g) of sand and spray water on it. Repeat the sand layer with the same amount as before, so that now the bottle should be 3/5th of the way full. Spray the sand with water to make it damp. Include 2 cups (260 g) of mulch and water it. Finish off the soil layers with a mulch layer on the very top. The bottle should be 4/5ths of the way full now. Spritz it with water to make the mulch damp. You can purchase mulch at a hardware or garden supply store. Tip: Make sure to keep the spray bottle near your wormery after you finish setting it up. You will need to use it to keep the wormery moist. Transferring  Worms to the Wormery Find 4-6 worms and place them in the wormery. Gently place the worms on the top layer of the wormery, which should be mulch. They should start to burrow into the soil right away. Worms like to hide in dark, moist places in the dirt and under rocks. You may also buy worms from a bait shop if you don’t want to look for them. You can attract worms to a bare patch of dirt by watering it and placing a piece of carpet or cardboard over it. Check the patch the next day and you should have some worms. Collect worms while doing yardwork or digging in your garden. Bring your wormery outside with you and place worms into it as you find them during routine yardwork and gardening chores. Check damp spots in your yard or check the sidewalk after it rains. Worms will sometimes emerge from the dirt and crawl onto a nearby sidewalk after it rains. If this happens, pick up the worms and put them in your wormery. Add food to the top layer of your wormery. Once the worms have started burrowing down into the soil, place a layer of fruit and vegetable peels on top of the mulch. This will be the worms’ food, which they will compost into the soil. Add more food in a few days if the worms consume the scraps you left them. If you made a lid for your wormery, you may want to put it on now to ensure the worms don’t try to crawl out of the bottle. Tip: Be careful about what you add to the wormery! Some foods will attract other insects and possibly even some animals, like rats. Don’t add meat, cheese, baked goods, or any other cooked human foods. Cover the bottle with a bag, box, or paper and keep it somewhere cool. Get a box or bag that is large enough to cover the bottle completely. You may also tape a piece of black construction paper around the bottle to make it dark. Place the bottle somewhere warm and dark in your home or classroom. However, keep it away from hot places, such as sunny windows and other bright, hot spots. If you remove the cover to check on your worms, be sure to replace it when you are done. They prefer the dark. Check on the worms daily to ensure the soil is damp. The soil needs to always be damp so that the worms can move freely in the wormery. Check it daily to ensure that the top layer of mulch feels damp and the other layers look damp. Spritz the mulch layer with water to moisten it if needed. Don’t soak the soil layers with water. If they look dry, spritz the top layer until it is moist and let the worms work this moisture around. If the layers still seem dry the next day, spritz the mulch layer again. Release the worms in your garden or yard when the dirt is mixed. The wormery is not meant as a permanent home for the worms. Once your experiment is done, take the bottle out to a bare patch of earth in your yard or garden and gently empty the content of the worm farm and the worms onto the earth. They will crawl away and burrow into the ground on their own and the soil they have enriched will be good for your yard or garden. You may keep and reuse the bottle if desired, or recycle it if you are finished.",
    "sentences": [
        " Washing and Cutting the Bottle Rinse out an empty 2 L (68  fl oz) clear, plastic soda bottle.",
        "Fill the bottle with warm water and swirl it around.",
        "Then, pour out the water.",
        "Repeat this 2 more times to ensure that there is no more soda residue in the bottle.",
        "Don’t worry about drying out the inside of the bottle.",
        "The soil layers will need to be damp, so a little water left inside the bottle is fine.",
        "Remove the label and adhesive so you will be able to see the worms.",
        "Find the edge of the label and peel it away from the bottle.",
        "If there is any adhesive that won’t come off, apply about 1 tbsp (15 mL) of vegetable oil to the bottle and work it around with your fingers.",
        "Then, wash the outside of the bottle with dish soap and warm water to remove the excess oil.",
        "Canola, olive, sunflower, or any other type of oil you have on hand will work for this.",
        "You may need to let the oil soak in for a 3 to 5 minutes if there is a lot of adhesive stuck on the bottle.",
        "Cut off the top of the plastic bottle.",
        "Use a sharp pair of scissors to cut the top off of the bottle.",
        "Start cutting where the bottle begins to taper into the neck.",
        "Cut all the way around the bottle to remove the bottle top.",
        "Cut straight, clean edges.",
        "Don’t create any jagged edges.Tip: Try drawing a line around the bottle with a marker and cutting along this line to ensure that you get an even edge.",
        "Create a lid for your wormery using the top of the bottle, if desired.",
        "Ensure that the top of the bottle is also clean.",
        "Cut a 2 in (5.1 cm) slit in the bottom (widest part) of the bottle top.",
        "Then, when your wormery is ready, place it back onto the top of the bottle so that the edges overlap.",
        "Leave the cap off to allow air flow.",
        "Layering the Soil Place 2 cups (870 g) of sand in the bottom of the bottle and spritz it with water.",
        "The bottom layer of your wormery is sand.",
        "Pour in enough to fill the water bottle about 1/5th of the way, which should be about 2 cups (870 g).",
        "Then, use a spray bottle filled with plain water to moisten the sand.",
        "Spray enough so that the sand feels damp to the touch.",
        "Leave this layer and the other layers loose.",
        "Don’t pack it with your hands.",
        "You can purchase sand at a hardware or garden supply store.",
        "Add 2 cups (260 g) of garden soil next and spray it.",
        "Pour enough garden soil into the bottle for fill the bottle 2/5ths full, which should be about 2 cups (870 g).",
        "Then, spray the soil with water until it feels damp.",
        "Soil from your yard or garden is fine.",
        "However, you can purchase garden soil at a hardware or garden supply store if you don’t have some you can dig up.",
        "Pour in another 2 cups (870 g) of sand and spray water on it.",
        "Repeat the sand layer with the same amount as before, so that now the bottle should be 3/5th of the way full.",
        "Spray the sand with water to make it damp.",
        "Include 2 cups (260 g) of mulch and water it.",
        "Finish off the soil layers with a mulch layer on the very top.",
        "The bottle should be 4/5ths of the way full now.",
        "Spritz it with water to make the mulch damp.",
        "You can purchase mulch at a hardware or garden supply store.",
        "Tip: Make sure to keep the spray bottle near your wormery after you finish setting it up.",
        "You will need to use it to keep the wormery moist.",
        "Transferring  Worms to the Wormery Find 4-6 worms and place them in the wormery.",
        "Gently place the worms on the top layer of the wormery, which should be mulch.",
        "They should start to burrow into the soil right away.",
        "Worms like to hide in dark, moist places in the dirt and under rocks.",
        "You may also buy worms from a bait shop if you don’t want to look for them.",
        "You can attract worms to a bare patch of dirt by watering it and placing a piece of carpet or cardboard over it.",
        "Check the patch the next day and you should have some worms.",
        "Collect worms while doing yardwork or digging in your garden.",
        "Bring your wormery outside with you and place worms into it as you find them during routine yardwork and gardening chores.",
        "Check damp spots in your yard or check the sidewalk after it rains.",
        "Worms will sometimes emerge from the dirt and crawl onto a nearby sidewalk after it rains.",
        "If this happens, pick up the worms and put them in your wormery.",
        "Add food to the top layer of your wormery.",
        "Once the worms have started burrowing down into the soil, place a layer of fruit and vegetable peels on top of the mulch.",
        "This will be the worms’ food, which they will compost into the soil.",
        "Add more food in a few days if the worms consume the scraps you left them.",
        "If you made a lid for your wormery, you may want to put it on now to ensure the worms don’t try to crawl out of the bottle.",
        "Tip: Be careful about what you add to the wormery!",
        "Some foods will attract other insects and possibly even some animals, like rats.",
        "Don’t add meat, cheese, baked goods, or any other cooked human foods.",
        "Cover the bottle with a bag, box, or paper and keep it somewhere cool.",
        "Get a box or bag that is large enough to cover the bottle completely.",
        "You may also tape a piece of black construction paper around the bottle to make it dark.",
        "Place the bottle somewhere warm and dark in your home or classroom.",
        "However, keep it away from hot places, such as sunny windows and other bright, hot spots.",
        "If you remove the cover to check on your worms, be sure to replace it when you are done.",
        "They prefer the dark.",
        "Check on the worms daily to ensure the soil is damp.",
        "The soil needs to always be damp so that the worms can move freely in the wormery.",
        "Check it daily to ensure that the top layer of mulch feels damp and the other layers look damp.",
        "Spritz the mulch layer with water to moisten it if needed.",
        "Don’t soak the soil layers with water.",
        "If they look dry, spritz the top layer until it is moist and let the worms work this moisture around.",
        "If the layers still seem dry the next day, spritz the mulch layer again.",
        "Release the worms in your garden or yard when the dirt is mixed.",
        "The wormery is not meant as a permanent home for the worms.",
        "Once your experiment is done, take the bottle out to a bare patch of earth in your yard or garden and gently empty the content of the worm farm and the worms onto the earth.",
        "They will crawl away and burrow into the ground on their own and the soil they have enriched will be good for your yard or garden.",
        "You may keep and reuse the bottle if desired, or recycle it if you are finished."
    ]
}