{
    "title": "How to Fold an Origami Squirrel",
    "url": "https://www.wikihow.com/Fold-an-Origami-Squirrel",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "parts": [
        {
            "name": "Making the Squirrel's Head",
            "steps": [
                {
                    "headline": "Find a square piece of paper.",
                    "description": "A larger piece of paper usually makes this project easier. A recommended size is 8 inches by 8 inches. When making folds for origami, it helps to slide your thumb nail along the fold to make a really crisp fold. It also helps to have paper that is different colors on both sides to allow better differentiation between sides. The color of the paper is up to you as long as the shade of the color is different on each side."
                },
                {
                    "headline": "Cut the square piece of paper exactly in half.",
                    "description": "You will only need one of the halves for this squirrel. An easy way to achieve this is to fold the paper in half and cut along the fold. You can set one of the pieces to the side."
                },
                {
                    "headline": "Fold the half of paper in half the long way.",
                    "description": ""
                },
                {
                    "headline": "Unfold the paper and fold each edge of the paper in until the edges meet along the crease created in the center of the paper.",
                    "description": "Essentially, you are folding the paper into fourths."
                },
                {
                    "headline": "Fold the bottom corner of one side inward until the top edge lies against the middle crease.",
                    "description": "Repeat the fold on the adjacent corner. You should now have two small right triangles on one side that meet in the center of the paper, creating one point."
                },
                {
                    "headline": "Fold the point you just created towards the opposite end of the paper.",
                    "description": "The point created by the triangles should now be centered along the middle crease."
                },
                {
                    "headline": "Unfold all of the work done in the last two steps.",
                    "description": ""
                },
                {
                    "headline": "Fold along the creases created in previous steps to create a small square at the end of the paper.",
                    "description": "This square will become the head of the squirrel."
                },
                {
                    "headline": "Pivot the small square you made in the previous step to the other side of the paper.",
                    "description": ""
                },
                {
                    "headline": "Fold the bottom corner of the other end of the paper (opposite the square you just made) inward until the top edge lies against the middle crease.",
                    "description": "Repeat the fold on the adjacent corner, making two right triangles."
                },
                {
                    "headline": "Pivot the small square back to the original side it was on.",
                    "description": "Then, fold the entire paper in half along the center line."
                },
                {
                    "headline": "Push the front of the small square down, folding it on both sides until the center of the square points back along the folded center line of the paper.",
                    "description": "You just made the head of the squirrel."
                }
            ]
        },
        {
            "name": "Making the Squirrel's Body",
            "steps": [
                {
                    "headline": "Hold the paper by the end you just made the triangle on.",
                    "description": "Fold the longer straight part of the paper over in a right angle until the center line meets the edge of the fold created in the previous step."
                },
                {
                    "headline": "Fold the longer straight part of the paper under and up behind the shorter part of the paper.",
                    "description": ""
                },
                {
                    "headline": "Unfold the work done in the previous two steps.",
                    "description": ""
                },
                {
                    "headline": "Fold the longer straight part of the paper down to meet the vertical crease created earlier.",
                    "description": ""
                },
                {
                    "headline": "Fold the longer straight part of the paper around and behind the fold created in the previous step.",
                    "description": ""
                },
                {
                    "headline": "Unfold the work done in the previous two steps.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Making the Squirrel's Tail",
            "steps": [
                {
                    "headline": "Pinch the paper at the middle vertical crease and open the right side of the paper, folding it inward and downward until it is at a right angle to the other part of the paper.",
                    "description": ""
                },
                {
                    "headline": "Unfold the long end of the paper and rotate the end until it’s perpendicular to the body.",
                    "description": "This is the squirrel's tail. Fold the tail up to the crease created earlier. Next fold the triangle in on the tail as shown in the photos."
                },
                {
                    "headline": "Unfold the tail from the bottom so it folds towards the body, creating a kite shape with the tail.",
                    "description": ""
                },
                {
                    "headline": "Flip the squirrel over and repeat the previous step on that side, folding the tail of the squirrel toward the body.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Making the Squirrel's Feet",
            "steps": [
                {
                    "headline": "Take the bottom corner and fold it up.",
                    "description": ""
                },
                {
                    "headline": "Take the top corner of the triangle you just folded and fold it down.",
                    "description": ""
                },
                {
                    "headline": "Repeat the previous two steps with the other side to create the right leg of the squirrel.",
                    "description": "Now your squirrel has legs!"
                }
            ]
        },
        {
            "name": "Making the Squirrel's Ears, Nose, and Neck",
            "steps": [
                {
                    "headline": "Take one side of the top of the head of the squirrel (the triangle on the left) and fold it down.",
                    "description": "Then fold up the corner of that piece. This will be the ear of the squirrel."
                },
                {
                    "headline": "Repeat the previous step with the other side of the squirrel's head to create the right ear.",
                    "description": ""
                },
                {
                    "headline": "Fold over the tip of the squirrel's nose.",
                    "description": ""
                },
                {
                    "headline": "Unfold the end of the squirrel’s nose and push the tip back, folding it in between the two sides of the squirrel’s head.",
                    "description": ""
                },
                {
                    "headline": "Fold the back edge of the squirrel’s neck inward, folding the point at the base of the head underneath.",
                    "description": ""
                },
                {
                    "headline": "Repeat the previous step with the other side of the squirrel.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Making the Squirrel's Arms",
            "steps": [
                {
                    "headline": "Fold the head of the squirrel down along its neck.",
                    "description": "The squirrel’s ears should point back toward the base of its tail. These creases are the beginning of the squirrel’s arms."
                },
                {
                    "headline": "Unfold what you just did.",
                    "description": ""
                },
                {
                    "headline": "Fold the squirrel’s head back so that its ears point toward the tip of its tail.",
                    "description": ""
                },
                {
                    "headline": "Unfold what you just did.",
                    "description": ""
                },
                {
                    "headline": "Open up the front of the squirrel, pinch the top of its head and pinch below the two creases you just made.",
                    "description": "Push the head of the squirrel down gently. You should end up with one fold on each side of the squirrel. These form the arms of the squirrel."
                },
                {
                    "headline": "Create a crease right at the point where the squirrel’s back has a point.",
                    "description": "This is one of the more difficult steps. It will take some time to fold the edges crisply. It helps to open up the front of the squirrel with your finger, which will leave a small gap as shown in the fourth picture, while pushing in on the point of the back."
                },
                {
                    "headline": "Fold the left front edge of the squirrel’s midsection inward.",
                    "description": ""
                },
                {
                    "headline": "Fold the right front edge of the squirrel’s midsection inward.",
                    "description": "Now your squirrel has well-defined arms!"
                }
            ]
        },
        {
            "name": "Finishing Up",
            "steps": [
                {
                    "headline": "Press down and open up both of your squirrel’s ears.",
                    "description": ""
                },
                {
                    "headline": "Enjoy your completed origami squirrel!",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Square piece of paper (preferably with different colors on each side)"
    ],
    "text": " Making the Squirrel's Head Find a square piece of paper. A larger piece of paper usually makes this project easier. A recommended size is 8 inches by 8 inches. When making folds for origami, it helps to slide your thumb nail along the fold to make a really crisp fold. It also helps to have paper that is different colors on both sides to allow better differentiation between sides. The color of the paper is up to you as long as the shade of the color is different on each side. Cut the square piece of paper exactly in half. You will only need one of the halves for this squirrel. An easy way to achieve this is to fold the paper in half and cut along the fold. You can set one of the pieces to the side. Fold the half of paper in half the long way.  Unfold the paper and fold each edge of the paper in until the edges meet along the crease created in the center of the paper. Essentially, you are folding the paper into fourths. Fold the bottom corner of one side inward until the top edge lies against the middle crease. Repeat the fold on the adjacent corner. You should now have two small right triangles on one side that meet in the center of the paper, creating one point. Fold the point you just created towards the opposite end of the paper. The point created by the triangles should now be centered along the middle crease. Unfold all of the work done in the last two steps.  Fold along the creases created in previous steps to create a small square at the end of the paper. This square will become the head of the squirrel. Pivot the small square you made in the previous step to the other side of the paper.  Fold the bottom corner of the other end of the paper (opposite the square you just made) inward until the top edge lies against the middle crease. Repeat the fold on the adjacent corner, making two right triangles. Pivot the small square back to the original side it was on. Then, fold the entire paper in half along the center line. Push the front of the small square down, folding it on both sides until the center of the square points back along the folded center line of the paper. You just made the head of the squirrel. Making the Squirrel's Body Hold the paper by the end you just made the triangle on. Fold the longer straight part of the paper over in a right angle until the center line meets the edge of the fold created in the previous step. Fold the longer straight part of the paper under and up behind the shorter part of the paper.  Unfold the work done in the previous two steps.  Fold the longer straight part of the paper down to meet the vertical crease created earlier.  Fold the longer straight part of the paper around and behind the fold created in the previous step.  Unfold the work done in the previous two steps.  Making the Squirrel's Tail Pinch the paper at the middle vertical crease and open the right side of the paper, folding it inward and downward until it is at a right angle to the other part of the paper.  Unfold the long end of the paper and rotate the end until it’s perpendicular to the body. This is the squirrel's tail. Fold the tail up to the crease created earlier. Next fold the triangle in on the tail as shown in the photos. Unfold the tail from the bottom so it folds towards the body, creating a kite shape with the tail.  Flip the squirrel over and repeat the previous step on that side, folding the tail of the squirrel toward the body.  Making the Squirrel's Feet Take the bottom corner and fold it up.  Take the top corner of the triangle you just folded and fold it down.  Repeat the previous two steps with the other side to create the right leg of the squirrel. Now your squirrel has legs! Making the Squirrel's Ears, Nose, and Neck Take one side of the top of the head of the squirrel (the triangle on the left) and fold it down. Then fold up the corner of that piece. This will be the ear of the squirrel. Repeat the previous step with the other side of the squirrel's head to create the right ear.  Fold over the tip of the squirrel's nose.  Unfold the end of the squirrel’s nose and push the tip back, folding it in between the two sides of the squirrel’s head.  Fold the back edge of the squirrel’s neck inward, folding the point at the base of the head underneath.  Repeat the previous step with the other side of the squirrel.  Making the Squirrel's Arms Fold the head of the squirrel down along its neck. The squirrel’s ears should point back toward the base of its tail. These creases are the beginning of the squirrel’s arms. Unfold what you just did.  Fold the squirrel’s head back so that its ears point toward the tip of its tail.  Unfold what you just did.  Open up the front of the squirrel, pinch the top of its head and pinch below the two creases you just made. Push the head of the squirrel down gently. You should end up with one fold on each side of the squirrel. These form the arms of the squirrel. Create a crease right at the point where the squirrel’s back has a point. This is one of the more difficult steps. It will take some time to fold the edges crisply. It helps to open up the front of the squirrel with your finger, which will leave a small gap as shown in the fourth picture, while pushing in on the point of the back. Fold the left front edge of the squirrel’s midsection inward.  Fold the right front edge of the squirrel’s midsection inward. Now your squirrel has well-defined arms! Finishing Up Press down and open up both of your squirrel’s ears.  Enjoy your completed origami squirrel! ",
    "sentences": [
        " Making the Squirrel's Head Find a square piece of paper.",
        "A larger piece of paper usually makes this project easier.",
        "A recommended size is 8 inches by 8 inches.",
        "When making folds for origami, it helps to slide your thumb nail along the fold to make a really crisp fold.",
        "It also helps to have paper that is different colors on both sides to allow better differentiation between sides.",
        "The color of the paper is up to you as long as the shade of the color is different on each side.",
        "Cut the square piece of paper exactly in half.",
        "You will only need one of the halves for this squirrel.",
        "An easy way to achieve this is to fold the paper in half and cut along the fold.",
        "You can set one of the pieces to the side.",
        "Fold the half of paper in half the long way.",
        "Unfold the paper and fold each edge of the paper in until the edges meet along the crease created in the center of the paper.",
        "Essentially, you are folding the paper into fourths.",
        "Fold the bottom corner of one side inward until the top edge lies against the middle crease.",
        "Repeat the fold on the adjacent corner.",
        "You should now have two small right triangles on one side that meet in the center of the paper, creating one point.",
        "Fold the point you just created towards the opposite end of the paper.",
        "The point created by the triangles should now be centered along the middle crease.",
        "Unfold all of the work done in the last two steps.",
        "Fold along the creases created in previous steps to create a small square at the end of the paper.",
        "This square will become the head of the squirrel.",
        "Pivot the small square you made in the previous step to the other side of the paper.",
        "Fold the bottom corner of the other end of the paper (opposite the square you just made) inward until the top edge lies against the middle crease.",
        "Repeat the fold on the adjacent corner, making two right triangles.",
        "Pivot the small square back to the original side it was on.",
        "Then, fold the entire paper in half along the center line.",
        "Push the front of the small square down, folding it on both sides until the center of the square points back along the folded center line of the paper.",
        "You just made the head of the squirrel.",
        "Making the Squirrel's Body Hold the paper by the end you just made the triangle on.",
        "Fold the longer straight part of the paper over in a right angle until the center line meets the edge of the fold created in the previous step.",
        "Fold the longer straight part of the paper under and up behind the shorter part of the paper.",
        "Unfold the work done in the previous two steps.",
        "Fold the longer straight part of the paper down to meet the vertical crease created earlier.",
        "Fold the longer straight part of the paper around and behind the fold created in the previous step.",
        "Unfold the work done in the previous two steps.",
        "Making the Squirrel's Tail Pinch the paper at the middle vertical crease and open the right side of the paper, folding it inward and downward until it is at a right angle to the other part of the paper.",
        "Unfold the long end of the paper and rotate the end until it’s perpendicular to the body.",
        "This is the squirrel's tail.",
        "Fold the tail up to the crease created earlier.",
        "Next fold the triangle in on the tail as shown in the photos.",
        "Unfold the tail from the bottom so it folds towards the body, creating a kite shape with the tail.",
        "Flip the squirrel over and repeat the previous step on that side, folding the tail of the squirrel toward the body.",
        "Making the Squirrel's Feet Take the bottom corner and fold it up.",
        "Take the top corner of the triangle you just folded and fold it down.",
        "Repeat the previous two steps with the other side to create the right leg of the squirrel.",
        "Now your squirrel has legs!",
        "Making the Squirrel's Ears, Nose, and Neck Take one side of the top of the head of the squirrel (the triangle on the left) and fold it down.",
        "Then fold up the corner of that piece.",
        "This will be the ear of the squirrel.",
        "Repeat the previous step with the other side of the squirrel's head to create the right ear.",
        "Fold over the tip of the squirrel's nose.",
        "Unfold the end of the squirrel’s nose and push the tip back, folding it in between the two sides of the squirrel’s head.",
        "Fold the back edge of the squirrel’s neck inward, folding the point at the base of the head underneath.",
        "Repeat the previous step with the other side of the squirrel.",
        "Making the Squirrel's Arms Fold the head of the squirrel down along its neck.",
        "The squirrel’s ears should point back toward the base of its tail.",
        "These creases are the beginning of the squirrel’s arms.",
        "Unfold what you just did.",
        "Fold the squirrel’s head back so that its ears point toward the tip of its tail.",
        "Unfold what you just did.",
        "Open up the front of the squirrel, pinch the top of its head and pinch below the two creases you just made.",
        "Push the head of the squirrel down gently.",
        "You should end up with one fold on each side of the squirrel.",
        "These form the arms of the squirrel.",
        "Create a crease right at the point where the squirrel’s back has a point.",
        "This is one of the more difficult steps.",
        "It will take some time to fold the edges crisply.",
        "It helps to open up the front of the squirrel with your finger, which will leave a small gap as shown in the fourth picture, while pushing in on the point of the back.",
        "Fold the left front edge of the squirrel’s midsection inward.",
        "Fold the right front edge of the squirrel’s midsection inward.",
        "Now your squirrel has well-defined arms!",
        "Finishing Up Press down and open up both of your squirrel’s ears.",
        "Enjoy your completed origami squirrel!"
    ]
}