{
    "title": "How to Eliminate Monsters Under the Bed",
    "url": "https://www.wikihow.com/Eliminate-Monsters-Under-the-Bed",
    "category_hierarchy": [
        "Health"
    ],
    "methods": [
        {
            "name": "Monster spray",
            "steps": [
                {
                    "headline": "Comfort your child with encouraging words.",
                    "description": ""
                },
                {
                    "headline": "Obtain a general description of the monster.",
                    "description": "Ask your child why he/she thinks there is a monster in the room. What is the monster doing? What does this monster look like? Is it a male or a female monster? This will help ease the fear as your child is describing it as a story."
                },
                {
                    "headline": "Believe what your child tells you.",
                    "description": "Of course, there's no monster in the room, but its presence is very real to your child."
                },
                {
                    "headline": "Take your child out of the room with you; into the kitchen is probably best.",
                    "description": "The kitchen is the most comforting room in your home. (Taking your child into bed with you is not a good solution. This can get to be a habit hard to break.)"
                },
                {
                    "headline": "Prepare a small snack for your child (such as an orange or banana).",
                    "description": "Instruct your child to enjoy the snack while you go into the bedroom and eliminate the \"monster\". (See \"Warnings\".)"
                },
                {
                    "headline": "Take down the \"Monster Spray\" and explain that your mother/father always kept a bottle or can of \"Monster Spray\" in the house when you were little and had monsters in your room, too.",
                    "description": "Let your child know that \"Monster Spray\" always works. (See \"Things you will need\")."
                },
                {
                    "headline": "Go into the \"scary place\" and squirt \"Monster Spray\" under the bed, in the floor area of the closet, and around the windows.",
                    "description": "The room will have a fresh, comforting fragrance. (And monsters hate it!)"
                },
                {
                    "headline": "Bring your child back into the room where you can perform a final inspection together.",
                    "description": "Check all areas where monsters had been hiding."
                },
                {
                    "headline": "Encourage your child back into bed and remain with him/her for a few minutes.",
                    "description": "Maybe tell a quick story or sing the child's favorite song. If necessary, briefly lie down with your child until he/she is secure that all monsters, alligators and other scary things have vanished. (Or until he/she nods off to sleep.)"
                },
                {
                    "headline": "If you are a busy Mom/Dad with other children or are unable to do the story, song, etc.",
                    "description": "Try putting on your child's favorite cartoon movie (as long as it's not a scary one, and it's age appropriate.) A happy cartoon will give them happy thoughts,(thus erasing the scary ones) helping them to relax and fall asleep. Let them watch until they fall asleep."
                },
                {
                    "headline": "If all else fails then you can simply invest in a bed which doesn't have any space underneath, or cut the legs off the current bed.",
                    "description": "This essentially nips the problem in the bud."
                }
            ]
        },
        {
            "name": "The pillowcase hunt",
            "steps": [
                {
                    "headline": "Grab an empty pillowcase.",
                    "description": ""
                },
                {
                    "headline": "Tell the child(ren) to leave the room.",
                    "description": ""
                },
                {
                    "headline": "Tell the child to not enter, and get ready to open the front door.",
                    "description": ""
                },
                {
                    "headline": "Enter the room and close the door.",
                    "description": ""
                },
                {
                    "headline": "Pretend to \"hunt\" around the bedroom for the monster.",
                    "description": "Pretend to fight with the monster."
                },
                {
                    "headline": "After a few minutes of \"struggling\", you can add a little drama by messing up your hair and/or clothing.",
                    "description": ""
                },
                {
                    "headline": "Stick one arm inside the pillowcase and make dramatic movements inside the pillowcase (your arm is a now the upset monster).",
                    "description": ""
                },
                {
                    "headline": "Exit the room proudly from the bedroom in front your child's/children's astonished eyes as you carry the monster from their bedroom to be taken out the front door and kicked out of the house.",
                    "description": ""
                },
                {
                    "headline": "Tell your child you warned the monster it will get it worse if it ever attempts to come back.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "There is now an iPhone app called Monster Meter that can prove to your child that there are no monsters in the room.",
        "An inexpensive spray can of air freshener does a very good job of eliminating monsters, ghosts, and other scary things. Select a fragrance that is uncommon to your household. (If you frequently use a scented spray to refresh your living areas, your child will catch on very quickly if he/she recognizes the fragrance.) Conceal the can with a sheet of colorful construction paper bearing the name of the product \"MONSTER SPRAY\". Or,",
        "Mix up your own recipe using nothing more than plain water and enough vanilla (or any essential oil that has a soft, comforting scent). Mix the recipe and pour it into a household squirt bottle with a fine mist squirt nozzle. Apply your own label \"MONSTER SPRAY\", and store it out of the reach of children.",
        "A DVD of happy, age-appropriate cartoons."
    ],
    "text": " Monster spray Comfort your child with encouraging words.  Obtain a general description of the monster. Ask your child why he/she thinks there is a monster in the room. What is the monster doing? What does this monster look like? Is it a male or a female monster? This will help ease the fear as your child is describing it as a story. Believe what your child tells you. Of course, there's no monster in the room, but its presence is very real to your child. Take your child out of the room with you; into the kitchen is probably best. The kitchen is the most comforting room in your home. (Taking your child into bed with you is not a good solution. This can get to be a habit hard to break.) Prepare a small snack for your child (such as an orange or banana). Instruct your child to enjoy the snack while you go into the bedroom and eliminate the \"monster\". (See \"Warnings\".) Take down the \"Monster Spray\" and explain that your mother/father always kept a bottle or can of \"Monster Spray\" in the house when you were little and had monsters in your room, too. Let your child know that \"Monster Spray\" always works. (See \"Things you will need\"). Go into the \"scary place\" and squirt \"Monster Spray\" under the bed, in the floor area of the closet, and around the windows. The room will have a fresh, comforting fragrance. (And monsters hate it!) Bring your child back into the room where you can perform a final inspection together. Check all areas where monsters had been hiding. Encourage your child back into bed and remain with him/her for a few minutes. Maybe tell a quick story or sing the child's favorite song. If necessary, briefly lie down with your child until he/she is secure that all monsters, alligators and other scary things have vanished. (Or until he/she nods off to sleep.) If you are a busy Mom/Dad with other children or are unable to do the story, song, etc. Try putting on your child's favorite cartoon movie (as long as it's not a scary one, and it's age appropriate.) A happy cartoon will give them happy thoughts,(thus erasing the scary ones) helping them to relax and fall asleep. Let them watch until they fall asleep. If all else fails then you can simply invest in a bed which doesn't have any space underneath, or cut the legs off the current bed. This essentially nips the problem in the bud. The pillowcase hunt Grab an empty pillowcase.  Tell the child(ren) to leave the room.  Tell the child to not enter, and get ready to open the front door.  Enter the room and close the door.  Pretend to \"hunt\" around the bedroom for the monster. Pretend to fight with the monster. After a few minutes of \"struggling\", you can add a little drama by messing up your hair and/or clothing.  Stick one arm inside the pillowcase and make dramatic movements inside the pillowcase (your arm is a now the upset monster).  Exit the room proudly from the bedroom in front your child's/children's astonished eyes as you carry the monster from their bedroom to be taken out the front door and kicked out of the house.  Tell your child you warned the monster it will get it worse if it ever attempts to come back. ",
    "sentences": [
        " Monster spray Comfort your child with encouraging words.",
        "Obtain a general description of the monster.",
        "Ask your child why he/she thinks there is a monster in the room.",
        "What is the monster doing?",
        "What does this monster look like?",
        "Is it a male or a female monster?",
        "This will help ease the fear as your child is describing it as a story.",
        "Believe what your child tells you.",
        "Of course, there's no monster in the room, but its presence is very real to your child.",
        "Take your child out of the room with you; into the kitchen is probably best.",
        "The kitchen is the most comforting room in your home.",
        "(Taking your child into bed with you is not a good solution.",
        "This can get to be a habit hard to break.)",
        "Prepare a small snack for your child (such as an orange or banana).",
        "Instruct your child to enjoy the snack while you go into the bedroom and eliminate the \"monster\".",
        "(See \"Warnings\".)",
        "Take down the \"Monster Spray\" and explain that your mother/father always kept a bottle or can of \"Monster Spray\" in the house when you were little and had monsters in your room, too.",
        "Let your child know that \"Monster Spray\" always works.",
        "(See \"Things you will need\").",
        "Go into the \"scary place\" and squirt \"Monster Spray\" under the bed, in the floor area of the closet, and around the windows.",
        "The room will have a fresh, comforting fragrance.",
        "(And monsters hate it!)",
        "Bring your child back into the room where you can perform a final inspection together.",
        "Check all areas where monsters had been hiding.",
        "Encourage your child back into bed and remain with him/her for a few minutes.",
        "Maybe tell a quick story or sing the child's favorite song.",
        "If necessary, briefly lie down with your child until he/she is secure that all monsters, alligators and other scary things have vanished.",
        "(Or until he/she nods off to sleep.)",
        "If you are a busy Mom/Dad with other children or are unable to do the story, song, etc.",
        "Try putting on your child's favorite cartoon movie (as long as it's not a scary one, and it's age appropriate.)",
        "A happy cartoon will give them happy thoughts,(thus erasing the scary ones) helping them to relax and fall asleep.",
        "Let them watch until they fall asleep.",
        "If all else fails then you can simply invest in a bed which doesn't have any space underneath, or cut the legs off the current bed.",
        "This essentially nips the problem in the bud.",
        "The pillowcase hunt Grab an empty pillowcase.",
        "Tell the child(ren) to leave the room.",
        "Tell the child to not enter, and get ready to open the front door.",
        "Enter the room and close the door.",
        "Pretend to \"hunt\" around the bedroom for the monster.",
        "Pretend to fight with the monster.",
        "After a few minutes of \"struggling\", you can add a little drama by messing up your hair and/or clothing.",
        "Stick one arm inside the pillowcase and make dramatic movements inside the pillowcase (your arm is a now the upset monster).",
        "Exit the room proudly from the bedroom in front your child's/children's astonished eyes as you carry the monster from their bedroom to be taken out the front door and kicked out of the house.",
        "Tell your child you warned the monster it will get it worse if it ever attempts to come back."
    ]
}