{
    "title": "How to Attract Mason Bees",
    "url": "https://www.wikihow.com/Attract-Mason-Bees",
    "category_hierarchy": [
        "Work World",
        "Occupations",
        "Farming"
    ],
    "parts": [
        {
            "name": "Building a Nest",
            "steps": [
                {
                    "headline": "Create a nest by drilling holes into a block of non-treated wood.",
                    "description": "Find a natural block of wood—about 5–6 inches (13–15 cm) in width and height, and 7 inches (18 cm) in depth—and use a drill to create holes that are 0.3 inches (0.76 cm) in diameter, the perfect size for bees. Drill the holes roughly 6 inches (15 cm) deep, being careful not to drill all the way through the block of wood. It doesn't matter how many holes you drill, as long as each hole is fully-enclosed and isn't blended with another one. Make sure the holes don’t have splinters in them. Replace the nest blocks after a couple years to keep the bees safe and healthy. You can do this in the spring when the bees emerge from the nest."
                },
                {
                    "headline": "Make a nest out of clean drinking straws for a quick fix.",
                    "description": "Find empty, clean containers, such as a food can or milk carton, to put the straws in. Stack the straws on top of one another to create as many tubes as possible. Try to use paper straws if possible, gluing them to the bottom of the container with a non-toxic glue. Make the straws at least 1 centimetre (0.39 in) shorter than the container to help protect them. Choose a container that is sturdy and will protect the straws from inclement weather. Using paper straws instead of plastic ones will help prevent mold, but you should still change out the nest every year in the spring when the bees leave the nest. If you're using a milk carton, cut off the top part so that you can easily stack lots of straws. Situate the straws so that some stick out farther than others—this will help the bees locate their own hole. A depth of at least 6 inches (15 cm) is ideal."
                },
                {
                    "headline": "Purchase a pre-made bee house for a long-lasting, more durable nest.",
                    "description": "You can buy nests for bees at gardening centers or online that will be easier to clean and longer lasting. Choose from homes such as stackable wood nesting trays, paper tubes, or bundles of reeds. These pre-made nests are often the size of a birdhouse. Check the instructions or guidelines that come with the pre-made house to find out how often to switch them out."
                },
                {
                    "headline": "Mount the nest in a secure, warm spot 4–7 feet (1.2–2.1 m) off the ground.",
                    "description": "The nest should be facing the warmth of the morning sun, and it needs to be protected from rain and wind. Mount the nest on the side of a building, tree, or fence where it will get the proper warmth and protection. Make sure the nest is placed close to plants and trees so that the bees can easily reach the pollen—200–300 feet (61–91 m) away is ideal. Use nails or screws to attach the nest to the structure. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDavid Williams\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBeekeeper & Bee Removal Specialist\t\t\t\t\t\t\t\tDavid Williams is a Professional Beekeeper and Bee Removal Specialist with over 28 years of beekeeping experience. He is the Owner of Bzz Bee Removal, a bee removal company based in the San Francisco Bay Area. Bzz Bee Removal locates, captures, and transports bees to local beekeepers to prevent colony collapse disorder. David Williams\t\t\tBeekeeper & Bee Removal Specialist\t\t\t\tExpert Trick: If you've already had a successful colony, use the old hive to attract new bees. After you extract honey from the frames in your nest, put the hive box outside around March or April when the bees are swarming. It's hit or miss, but if you're lucky, you may attract a new swarm."
                }
            ]
        },
        {
            "name": "Growing Beneficial Flowers",
            "steps": [
                {
                    "headline": "Include plants that bloom at different times throughout the year.",
                    "description": "By planting a wide variety of plants that don’t all bloom at the same time, the bees will have a constant source of pollen. You could consider planting things like asters, poppies, black-eyed Susans, or alyssum. Asters will bloom in the late summer and early fall, and poppies bloom in the late spring and early summer. Black-eyed Susans peak during the summer, while alyssum is best for the fall. Consider growing hyacinth in the spring, bee balm in the summer, and zinnias in the fall. Include native species when deciding which plants to grow—ask a local nursery or go online to find out which plants are natives in your area."
                },
                {
                    "headline": "Opt for composite flowers with open petals.",
                    "description": "These flowers only have 1 ring of petals, making it much easier for the mason bees to get to the pollen. Deeper flowers with lots of rings of petals make it difficult for the bees to reach the pollen. Bees like flowers such as alyssum, wildflowers, or Madrid Purple lavender. Lilacs are an example of flowers that have multiple rings of petals, providing more difficulty for the bees."
                },
                {
                    "headline": "Create large sections of flowers to encourage foraging.",
                    "description": "If you only plant a couple flowers to attract the mason bees, you’re less likely to satisfy their curiosity and food needs. Plant large groups of 1 type of flower, or many types, together so that the bees are able to easily see and smell the flowers, while also giving them lots of pollen options. A patch of 12-20 flowers of one species is a good size. Plant as many patches as you'd like, making sure that each type of flower has enough room to grow and thrive."
                },
                {
                    "headline": "Grow blue, purple, and yellow flowers to attract the bees.",
                    "description": "While bees love lots of types of colorful plants, they’re attracted to these colors, along with white, the most. Choose bright blues, purples, and yellows to plant in your garden, if possible. Lavender, crocus, and salvia are perfect purple flowers. Sunflowers and black-eyed Susans are great yellow flowers. Butterfly bush, catmint, and common heliotrope are options for blue flowers. Pear blossoms and daisies are white flowers that attract mason bees."
                },
                {
                    "headline": "Avoid using pesticides on your flowers.",
                    "description": "It’s best to avoid using pesticides on your garden in general, but this is especially important if you’re trying to attract bees that will be eating the pollen. If you have to use pesticides, use them when there aren’t open blossoms, which is when the bees will be pollinating."
                }
            ]
        },
        {
            "name": "Creating a Mud Source",
            "steps": [
                {
                    "headline": "Create a clay-mud source within 50 feet (15 m) of the nest.",
                    "description": "The mason bees need mud nearby to use it when they divide the chambers of their nest. They’ll need to make many trips back and forth, so provide a mud source close to the nest for them, either by making your own mud source or buying a mud mix. Unless you have super sandy soil and no access to other types of soil, you can easily make your own mud source."
                },
                {
                    "headline": "Dig a shallow hole and line it with plastic.",
                    "description": "Use a shovel to dig a shallow hole in the ground. The hole doesn't need to be wider than 1 foot (30 cm), and a depth of about 10–12 inches (25–30 cm) should be perfect. You can also use a shallow metal or plastic tray to hold the mud instead of digging a hole in the ground."
                },
                {
                    "headline": "Fill the hole with soil.",
                    "description": "You don't have to fill the hole all the way up with soil, but it should be at least four-fifths full. Adding water to the soil will likely cause it to flatten a bit, so don't worry about adding too much. You want the soil to be more clay-filled than sandy—sandy soil won’t work well. If you have sandy soil, you can buy more clay-rich soils at a garden store, nursery, or online."
                },
                {
                    "headline": "Keep the mud source moist throughout the season.",
                    "description": "It’s important that the mud source not dry up so that the bees can easily use it. Monitor the mud source to ensure that it’s still wet, either allowing rainfall to keep it moist, or adding water to the soil yourself. You can fill the hole using a hose, watering can, or simple glass of water, all depending on how big the mud source is. Make the mud a medium-consistency—you don't want it to be super thick and difficult to move around, but it also shouldn't be dripping wet. Add additional soil to the mud source as the bees use it, if necessary."
                },
                {
                    "headline": "Buy a mason bee mud mix for an easy mud source.",
                    "description": "If you go online, you can find several different kinds of mud mixes specifically designed for bees. This option is good if you don’t have access to soil, or just want an easy mud fix. Follow the directions on the box, most likely adding the mix to your soil to provide more clay. You'll need to add water to the soil and mud mix to make it the right consistency."
                }
            ]
        }
    ],
    "tyn": [
        "Block of non-treated wood (optional)",
        "Drill (optional)",
        "Paper straws (optional)",
        "Sturdy container (optional)",
        "Glue (optional)",
        "Scissors (optional)",
        "Pre-made bee house (optional)",
        "Nails/hanging materials",
        "Hammer",
        "Variety of flowers (composite, colorful, etc.)",
        "Nutrient-rich soil",
        "Shovel/spade",
        "Piece of plastic",
        "Soil",
        "Water source",
        "Metal or plastic tray (optional)",
        "Mason bee mud mix (optional)"
    ],
    "text": " Building a Nest Create a nest by drilling holes into a block of non-treated wood. Find a natural block of wood—about 5–6 inches (13–15 cm) in width and height, and 7 inches (18 cm) in depth—and use a drill to create holes that are 0.3 inches (0.76 cm) in diameter, the perfect size for bees. Drill the holes roughly 6 inches (15 cm) deep, being careful not to drill all the way through the block of wood. It doesn't matter how many holes you drill, as long as each hole is fully-enclosed and isn't blended with another one. Make sure the holes don’t have splinters in them. Replace the nest blocks after a couple years to keep the bees safe and healthy. You can do this in the spring when the bees emerge from the nest. Make a nest out of clean drinking straws for a quick fix. Find empty, clean containers, such as a food can or milk carton, to put the straws in. Stack the straws on top of one another to create as many tubes as possible. Try to use paper straws if possible, gluing them to the bottom of the container with a non-toxic glue. Make the straws at least 1 centimetre (0.39 in) shorter than the container to help protect them. Choose a container that is sturdy and will protect the straws from inclement weather. Using paper straws instead of plastic ones will help prevent mold, but you should still change out the nest every year in the spring when the bees leave the nest. If you're using a milk carton, cut off the top part so that you can easily stack lots of straws. Situate the straws so that some stick out farther than others—this will help the bees locate their own hole. A depth of at least 6 inches (15 cm) is ideal. Purchase a pre-made bee house for a long-lasting, more durable nest. You can buy nests for bees at gardening centers or online that will be easier to clean and longer lasting. Choose from homes such as stackable wood nesting trays, paper tubes, or bundles of reeds. These pre-made nests are often the size of a birdhouse. Check the instructions or guidelines that come with the pre-made house to find out how often to switch them out. Mount the nest in a secure, warm spot 4–7 feet (1.2–2.1 m) off the ground. The nest should be facing the warmth of the morning sun, and it needs to be protected from rain and wind. Mount the nest on the side of a building, tree, or fence where it will get the proper warmth and protection. Make sure the nest is placed close to plants and trees so that the bees can easily reach the pollen—200–300 feet (61–91 m) away is ideal. Use nails or screws to attach the nest to the structure. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDavid Williams\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBeekeeper & Bee Removal Specialist\t\t\t\t\t\t\t\tDavid Williams is a Professional Beekeeper and Bee Removal Specialist with over 28 years of beekeeping experience. He is the Owner of Bzz Bee Removal, a bee removal company based in the San Francisco Bay Area. Bzz Bee Removal locates, captures, and transports bees to local beekeepers to prevent colony collapse disorder. David Williams\t\t\tBeekeeper & Bee Removal Specialist\t\t\t\tExpert Trick: If you've already had a successful colony, use the old hive to attract new bees. After you extract honey from the frames in your nest, put the hive box outside around March or April when the bees are swarming. It's hit or miss, but if you're lucky, you may attract a new swarm. Growing Beneficial Flowers Include plants that bloom at different times throughout the year. By planting a wide variety of plants that don’t all bloom at the same time, the bees will have a constant source of pollen. You could consider planting things like asters, poppies, black-eyed Susans, or alyssum. Asters will bloom in the late summer and early fall, and poppies bloom in the late spring and early summer. Black-eyed Susans peak during the summer, while alyssum is best for the fall. Consider growing hyacinth in the spring, bee balm in the summer, and zinnias in the fall. Include native species when deciding which plants to grow—ask a local nursery or go online to find out which plants are natives in your area. Opt for composite flowers with open petals. These flowers only have 1 ring of petals, making it much easier for the mason bees to get to the pollen. Deeper flowers with lots of rings of petals make it difficult for the bees to reach the pollen. Bees like flowers such as alyssum, wildflowers, or Madrid Purple lavender. Lilacs are an example of flowers that have multiple rings of petals, providing more difficulty for the bees. Create large sections of flowers to encourage foraging. If you only plant a couple flowers to attract the mason bees, you’re less likely to satisfy their curiosity and food needs. Plant large groups of 1 type of flower, or many types, together so that the bees are able to easily see and smell the flowers, while also giving them lots of pollen options. A patch of 12-20 flowers of one species is a good size. Plant as many patches as you'd like, making sure that each type of flower has enough room to grow and thrive. Grow blue, purple, and yellow flowers to attract the bees. While bees love lots of types of colorful plants, they’re attracted to these colors, along with white, the most. Choose bright blues, purples, and yellows to plant in your garden, if possible. Lavender, crocus, and salvia are perfect purple flowers. Sunflowers and black-eyed Susans are great yellow flowers. Butterfly bush, catmint, and common heliotrope are options for blue flowers. Pear blossoms and daisies are white flowers that attract mason bees. Avoid using pesticides on your flowers. It’s best to avoid using pesticides on your garden in general, but this is especially important if you’re trying to attract bees that will be eating the pollen. If you have to use pesticides, use them when there aren’t open blossoms, which is when the bees will be pollinating. Creating a Mud Source Create a clay-mud source within 50 feet (15 m) of the nest. The mason bees need mud nearby to use it when they divide the chambers of their nest. They’ll need to make many trips back and forth, so provide a mud source close to the nest for them, either by making your own mud source or buying a mud mix. Unless you have super sandy soil and no access to other types of soil, you can easily make your own mud source. Dig a shallow hole and line it with plastic. Use a shovel to dig a shallow hole in the ground. The hole doesn't need to be wider than 1 foot (30 cm), and a depth of about 10–12 inches (25–30 cm) should be perfect. You can also use a shallow metal or plastic tray to hold the mud instead of digging a hole in the ground. Fill the hole with soil. You don't have to fill the hole all the way up with soil, but it should be at least four-fifths full. Adding water to the soil will likely cause it to flatten a bit, so don't worry about adding too much. You want the soil to be more clay-filled than sandy—sandy soil won’t work well. If you have sandy soil, you can buy more clay-rich soils at a garden store, nursery, or online. Keep the mud source moist throughout the season. It’s important that the mud source not dry up so that the bees can easily use it. Monitor the mud source to ensure that it’s still wet, either allowing rainfall to keep it moist, or adding water to the soil yourself. You can fill the hole using a hose, watering can, or simple glass of water, all depending on how big the mud source is. Make the mud a medium-consistency—you don't want it to be super thick and difficult to move around, but it also shouldn't be dripping wet. Add additional soil to the mud source as the bees use it, if necessary. Buy a mason bee mud mix for an easy mud source. If you go online, you can find several different kinds of mud mixes specifically designed for bees. This option is good if you don’t have access to soil, or just want an easy mud fix. Follow the directions on the box, most likely adding the mix to your soil to provide more clay. You'll need to add water to the soil and mud mix to make it the right consistency.",
    "sentences": [
        " Building a Nest Create a nest by drilling holes into a block of non-treated wood.",
        "Find a natural block of wood—about 5–6 inches (13–15 cm) in width and height, and 7 inches (18 cm) in depth—and use a drill to create holes that are 0.3 inches (0.76 cm) in diameter, the perfect size for bees.",
        "Drill the holes roughly 6 inches (15 cm) deep, being careful not to drill all the way through the block of wood.",
        "It doesn't matter how many holes you drill, as long as each hole is fully-enclosed and isn't blended with another one.",
        "Make sure the holes don’t have splinters in them.",
        "Replace the nest blocks after a couple years to keep the bees safe and healthy.",
        "You can do this in the spring when the bees emerge from the nest.",
        "Make a nest out of clean drinking straws for a quick fix.",
        "Find empty, clean containers, such as a food can or milk carton, to put the straws in.",
        "Stack the straws on top of one another to create as many tubes as possible.",
        "Try to use paper straws if possible, gluing them to the bottom of the container with a non-toxic glue.",
        "Make the straws at least 1 centimetre (0.39 in) shorter than the container to help protect them.",
        "Choose a container that is sturdy and will protect the straws from inclement weather.",
        "Using paper straws instead of plastic ones will help prevent mold, but you should still change out the nest every year in the spring when the bees leave the nest.",
        "If you're using a milk carton, cut off the top part so that you can easily stack lots of straws.",
        "Situate the straws so that some stick out farther than others—this will help the bees locate their own hole.",
        "A depth of at least 6 inches (15 cm) is ideal.",
        "Purchase a pre-made bee house for a long-lasting, more durable nest.",
        "You can buy nests for bees at gardening centers or online that will be easier to clean and longer lasting.",
        "Choose from homes such as stackable wood nesting trays, paper tubes, or bundles of reeds.",
        "These pre-made nests are often the size of a birdhouse.",
        "Check the instructions or guidelines that come with the pre-made house to find out how often to switch them out.",
        "Mount the nest in a secure, warm spot 4–7 feet (1.2–2.1 m) off the ground.",
        "The nest should be facing the warmth of the morning sun, and it needs to be protected from rain and wind.",
        "Mount the nest on the side of a building, tree, or fence where it will get the proper warmth and protection.",
        "Make sure the nest is placed close to plants and trees so that the bees can easily reach the pollen—200–300 feet (61–91 m) away is ideal.",
        "Use nails or screws to attach the nest to the structure.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDavid Williams\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBeekeeper & Bee Removal Specialist\t\t\t\t\t\t\t\tDavid Williams is a Professional Beekeeper and Bee Removal Specialist with over 28 years of beekeeping experience.",
        "He is the Owner of Bzz Bee Removal, a bee removal company based in the San Francisco Bay Area.",
        "Bzz Bee Removal locates, captures, and transports bees to local beekeepers to prevent colony collapse disorder.",
        "David Williams\t\t\tBeekeeper & Bee Removal Specialist\t\t\t\tExpert Trick: If you've already had a successful colony, use the old hive to attract new bees.",
        "After you extract honey from the frames in your nest, put the hive box outside around March or April when the bees are swarming.",
        "It's hit or miss, but if you're lucky, you may attract a new swarm.",
        "Growing Beneficial Flowers Include plants that bloom at different times throughout the year.",
        "By planting a wide variety of plants that don’t all bloom at the same time, the bees will have a constant source of pollen.",
        "You could consider planting things like asters, poppies, black-eyed Susans, or alyssum.",
        "Asters will bloom in the late summer and early fall, and poppies bloom in the late spring and early summer.",
        "Black-eyed Susans peak during the summer, while alyssum is best for the fall.",
        "Consider growing hyacinth in the spring, bee balm in the summer, and zinnias in the fall.",
        "Include native species when deciding which plants to grow—ask a local nursery or go online to find out which plants are natives in your area.",
        "Opt for composite flowers with open petals.",
        "These flowers only have 1 ring of petals, making it much easier for the mason bees to get to the pollen.",
        "Deeper flowers with lots of rings of petals make it difficult for the bees to reach the pollen.",
        "Bees like flowers such as alyssum, wildflowers, or Madrid Purple lavender.",
        "Lilacs are an example of flowers that have multiple rings of petals, providing more difficulty for the bees.",
        "Create large sections of flowers to encourage foraging.",
        "If you only plant a couple flowers to attract the mason bees, you’re less likely to satisfy their curiosity and food needs.",
        "Plant large groups of 1 type of flower, or many types, together so that the bees are able to easily see and smell the flowers, while also giving them lots of pollen options.",
        "A patch of 12-20 flowers of one species is a good size.",
        "Plant as many patches as you'd like, making sure that each type of flower has enough room to grow and thrive.",
        "Grow blue, purple, and yellow flowers to attract the bees.",
        "While bees love lots of types of colorful plants, they’re attracted to these colors, along with white, the most.",
        "Choose bright blues, purples, and yellows to plant in your garden, if possible.",
        "Lavender, crocus, and salvia are perfect purple flowers.",
        "Sunflowers and black-eyed Susans are great yellow flowers.",
        "Butterfly bush, catmint, and common heliotrope are options for blue flowers.",
        "Pear blossoms and daisies are white flowers that attract mason bees.",
        "Avoid using pesticides on your flowers.",
        "It’s best to avoid using pesticides on your garden in general, but this is especially important if you’re trying to attract bees that will be eating the pollen.",
        "If you have to use pesticides, use them when there aren’t open blossoms, which is when the bees will be pollinating.",
        "Creating a Mud Source Create a clay-mud source within 50 feet (15 m) of the nest.",
        "The mason bees need mud nearby to use it when they divide the chambers of their nest.",
        "They’ll need to make many trips back and forth, so provide a mud source close to the nest for them, either by making your own mud source or buying a mud mix.",
        "Unless you have super sandy soil and no access to other types of soil, you can easily make your own mud source.",
        "Dig a shallow hole and line it with plastic.",
        "Use a shovel to dig a shallow hole in the ground.",
        "The hole doesn't need to be wider than 1 foot (30 cm), and a depth of about 10–12 inches (25–30 cm) should be perfect.",
        "You can also use a shallow metal or plastic tray to hold the mud instead of digging a hole in the ground.",
        "Fill the hole with soil.",
        "You don't have to fill the hole all the way up with soil, but it should be at least four-fifths full.",
        "Adding water to the soil will likely cause it to flatten a bit, so don't worry about adding too much.",
        "You want the soil to be more clay-filled than sandy—sandy soil won’t work well.",
        "If you have sandy soil, you can buy more clay-rich soils at a garden store, nursery, or online.",
        "Keep the mud source moist throughout the season.",
        "It’s important that the mud source not dry up so that the bees can easily use it.",
        "Monitor the mud source to ensure that it’s still wet, either allowing rainfall to keep it moist, or adding water to the soil yourself.",
        "You can fill the hole using a hose, watering can, or simple glass of water, all depending on how big the mud source is.",
        "Make the mud a medium-consistency—you don't want it to be super thick and difficult to move around, but it also shouldn't be dripping wet.",
        "Add additional soil to the mud source as the bees use it, if necessary.",
        "Buy a mason bee mud mix for an easy mud source.",
        "If you go online, you can find several different kinds of mud mixes specifically designed for bees.",
        "This option is good if you don’t have access to soil, or just want an easy mud fix.",
        "Follow the directions on the box, most likely adding the mix to your soil to provide more clay.",
        "You'll need to add water to the soil and mud mix to make it the right consistency."
    ]
}