{
    "title": "How to Save On School Supplies",
    "url": "https://www.wikihow.com/Save-On-School-Supplies",
    "category_hierarchy": [
        "Youth",
        "School Stuff"
    ],
    "methods": [
        {
            "name": "School Supply Shopping Tactics",
            "steps": [
                {
                    "headline": "If your school has a list of school supplies, stick to it.",
                    "description": "Schools in some areas put out school supply lists, and typically they offer a guide to what is important to purchase. It is often a good guide, and sticking to it avoids getting sidetracked into buying unnecessary things, and possibly not even get the right things at all. Schools which offer school supply lists will typically mail out school supply lists, but these are also easy to misplace. If so, try to contact the school (school staff will usually be onsite the week before school starts) or look at their official website. Many schools now provide a downloadable list straight from their website. Some schools actually prefer that students do not bring in outside school supplies. For example, your child's kindergarten teacher may not want just one child to have access to sparkly crayons. Consider whether this is a list of requirements or just suggestions. Some schools make suggestions on school supplies, but it is not actually required. Other schools or classes really do require students to bring in certain items. If you are unsure, contact the school. Consult retail store school supply lists with skepticism. Retail stores are there to sell you things, and sometime offer lists suggesting what students at different ages need. While not necessarily a bad guide, they are also not trying to save you money, either. Sometimes there is a general list, and sometimes a list specific to your particular child's teacher or class. For instance, the school may suggest binders, but your child's teacher requests a set of yellow, red, and blue folders. An art class may suggest buying a certain set of art supplies. For example, a digital photography class may suggest a type of digital camera plus a certain a type of software package for a computer at home. Decide in advance how you will respond to requests for extra items from your children. Back-to-school shopping is a prime time for whining and begging. You could allow one extra item only, or tell your child that any items outside the required list are to be paid for out of your child's own money. Can you shop solo? Some children are very particular about back-to-school shopping, and love the ritual. However, many others could care less. If your student is happy to let you do the decision-making, consider doing the shopping by yourself; you may be able to avoid impulse buying--bringing children along tends to increase impulse buys. You may also be able to shop quicker, or more slowly and thoughtfully, or at more stores to take advantage of sales."
                },
                {
                    "headline": "Set a budget for school shopping.",
                    "description": "Knowing in advance how much you can afford on supplies will keep everyone's minds focused on the limits to spending. Try withdrawing only that amount of cash budgeting for back-to-school shopping. This often helps adults and children alike be more aware of how much is being spent--credit or debit purchases tend to be harder to keep track of. Have your children involved in this process so that they can understand the process of budgeting. Another possibility is giving your student a \"mini budget\" for a particular item or type of item. How much will depend on the child's age and ability. For instance, giving your 1st grade student $3 to choose washable markers. This can help kids learn about how to work within a budget, make decisions, and responsibility."
                },
                {
                    "headline": "Check the weekly store sale advertisements.",
                    "description": "Have your child help you find the best prices in catalogs and online. This can be a source of responsible fun for each child to find the best coupon or deal on their needed items, as well as serve as an unstructured lesson in financial responsibility. Things to keep in mind include:\nSome stores have a \"loss leader\" category. These are items are sold at a loss in order to lure you into the store, hoping you will shop further there. Of course, you are not under any obligation to buy anything else, so you can take advantage of the store in this way. If you shop for the items on special on a weekly basis, over a period of several weeks, you can accumulate many of the items on the list at a sale price. You may end up repeatedly going to the store, however. Note that specialist stationery stores can sometimes be the most expensive place to source your supplies. If you need something specific and/or high quality, that may well be the place to go. However, for most school supplies you do not need the highest quality. Shop around to compare prices and ask for discounts if you have seen items cheaper at another store. Many stores offer price matching; however, don't expect full-service stores to match discounter prices, and don't expect discount store employees to offer personalized service. To save money, you should expect to provide your own \"customer service.\" Look for upcoming tax-free shopping days to add to your discount. Tax free sales days or weekends can provide big discounts where offered. (This is more common in the United States and Canada.) As well as cutting out catalog coupons, print out downloadable coupons or deals that you can only get online. The effort to search through relevant sites is well worth it, as you will find coupons that can be printed, cut out and taken along to the store for discounts."
                },
                {
                    "headline": "Browse through a variety of dollar stores, department stores, stationery stores, and large stores, for the best deals on pencils, pens, notebooks, and other items.",
                    "description": "This sounds like a lot of work (and it can be) but this can often be done while shopping for other items throughout the summer. Avoid paying for name-brand things when you do not need to. Generics and store brands are usually for many items, such as pens, pencils, erasers, and the like. But skimping on certain items will cost more in the long run. For example, a cheaply made backpack will likely fall apart by winter break. Investing in a high quality brand may save a lot of money in the long run. For items such as these, make sure that what you get is good enough to use and sturdy enough to last."
                },
                {
                    "headline": "Team up with other local parents.",
                    "description": "Use your group buying power to purchase school supplies in bulk at reduced cost. Split the supplies up between you. This is extremely helpful if the children are in the same class. It may also eliminate the whine, \"But all my friends get this or that (expensive) thing.\" when the reality, everyone will have the same brand thing. This is especially helpful if a parent has a membership at a store like Costco, where buying in bulk can save a lot of money. In rural or remote areas, this may also be a wise approach. It may save money for all the parents to go in on one large order, and have it shipped to your location."
                },
                {
                    "headline": "Speak up if costs are out of control.",
                    "description": "Parents are generally expected to buy school supplies such as backpacks, sneakers, lunch boxes, and binders. But sometimes, too much may be passed off as expenses for parents to foot the bill. Sometimes, this can put parents in an awkward position, especially low-income ones. This could be a concern to bring up with with the principal, the teachers, the school board, the PTA, or perhaps other parents in your child's classroom or school. Note that for outside activities the school does not have to provide equipment and materials. For example, your daughter may need to purchase her own lacrosse equipment. Your twins may have to rent or buy tubas to join marching band. The senior trip to the national capitol will be unlikely to be free. Teachers may not appreciate how the well-meaning lesson or field trip affects parents financially. Other parents may also be silently suffering trying to figure out how to pay for an expensive field trip, outing, or materials for a lesson. But be polite, honest, and try to assume the best. Being confrontational and angry is likely to sour the relationship between you and the teacher. Talk to your student's teacher about field trip costs. Teachers try very hard to make sure no child cannot go to a field trip due to a family's income. Brainstorm ways to bring costs down. For instance, perhaps a bake sale, car wash, or other  school fundraiser to defray costs for the class trip."
                },
                {
                    "headline": "Look at reconditioned or last season's options for more expensive items such as laptops or sports gear.",
                    "description": "If a laptop is required, this is a big expense item. You can reduce the purchase costs by purchasing a reconditioned laptop from a reliable supplier, looking at older models on special, or using a hand-me-down model from another family member who no longer needs it. Try to avoid borrowing a laptop in case it gets damaged or lost, and consider insuring it. Make use of the tax-free sales days when purchasing laptops, desktops, flash drives, and other electronic items for school. You can save thousands. Think about trading in old equipment for new or reconditioned. This can be really useful for sports or music gear. Ask your local sports or music store if they have such a system in place, or if they know of a club or other place that can help. Or check out trading bulletins or online sites for other options."
                },
                {
                    "headline": "Try some less obvious places.",
                    "description": "There are some other supply sources that you might not have considered that are worth checking out:\nTry your local thrift store or charity shop. Rummage through the supplies that they do have. Backpacks are a commonly donated item in many thrift stores. Many stores will also have rulers, pencils, pens, calculators, organizers, alarm clocks, and other common household items. These stores also might have furniture such as desks and office chairs. If you let them know you are looking for school supplies, and are a regular customer they might be able to keep some back for you. Look through online auctions. This includes sites like eBay. People sell all sort of items,  from glue sticks, to gym shoes, to computers. Do not forget to check the craft section for things like scissors, glue, and bulk items being cleared out. As with all online auctions, be sure to factor in any shipping."
                },
                {
                    "headline": "Wait until school starts, if you want.",
                    "description": "The first week or so of school usually does not actually need that much equipment. By waiting, you may be able to buy these ones until the stores start to move their back-to-school stock into the clearance bins at discounted prices. Very often, the first week students do not need most of the supplies requested. If you can find out which supplies will not be needed until later in the school year, you can put off buying until then. Many stores will start reducing stock as early as a week after school has gone back, so you might not have long to wait. However, by waiting, you risk stores selling out of product or simply not having the style or type you want. Also, you child might be unhappy to have to put off getting supplies. Some students really love the thrill of getting back to school items. For some kids, not having new school supplies might make him or her feel left out, marginalized, or to look like \"the poor kid\"."
                }
            ]
        },
        {
            "name": "Finding Free School Supplies",
            "steps": [
                {
                    "headline": "Ask other friends and family members what they have that they do not need anymore.",
                    "description": "Start at home with older brothers and sisters, then ask grandparents, aunts and uncles, cousins, friends, and so forth. Specific requests, asked nicely, can sometimes yield great results. You may be doing them a favor--sometimes people have quite a stash of items that are too good to get rid of, but also do not want to just throw out. Also consider people who have access to get items inexpensively. Maybe your cousin who works at a store has a 20% employee discount, and would be happy to help you get a great price on items there."
                },
                {
                    "headline": "Try websites that post free items.",
                    "description": "Check your local Freecycle.org website for items people are giving away for free. You can also make requests, if necessary. Craigslist.org is also a site in which people in a local area sell items (typically inexpensively) or even for free. Also check websites which are community-based. For instance, in Vermont, USA there is frontporchforum.com, which has bulletin postings based on one's town."
                },
                {
                    "headline": "If you work somewhere that is getting rid of its stationery supplies (such as for a change in logo or address), ask your boss if the spare, unwanted items can be donated to the school.",
                    "description": "Paper, envelopes, 3-ring binders, folders, and more can be re-used without having to buy new. Warning: never take stationery or other office supplies from work without asking, though, or you could lose your job for stealing. Usually offices are happy to no have to throw away office supplies, and may even qualify for a tax write-off."
                },
                {
                    "headline": "Ask for free promotional giveaway items.",
                    "description": "Businesses will often have free notepads, pens, pencils, sticky notes, and water bottles at various events or in-store. Although you are unlikely to get \"big ticket\" items this way, these items are free!"
                }
            ]
        },
        {
            "name": "Handling Getting School Supplies When You Are Low-Income",
            "steps": [
                {
                    "headline": "Inquire about help with school supplies if you're low income.",
                    "description": "Ask your child's school for information on any community programs that are distributing free school supplies. Typically this is requires a family to already be identified as low-income. However, even if you do not qualify for some reason, school staff may be able to point you to resources for the community in general."
                },
                {
                    "headline": "Try talking to the teacher.",
                    "description": "Teachers are usually aware that for some families, school supplies are a real financial hardship. He or she can often help you out--but only if you speak up. For example, faculty in schools often have \"lost and found\" items put aside from last year for those in need. Or even donations from different organizations. Teachers will often have an extra supply of items for students. A savvy middle school math teacher will have multiple calculators squirreled away for kids who do not have access to one. Many teachers in the United States pay for school supplies from their own pockets, often because they know some families simply cannot afford to."
                },
                {
                    "headline": "Talk to your school principal about the school joining the National Association for the Exchange of Industrial Resources (USA) or a similar organization in your country.",
                    "description": "These organizations collect overstocked donations from businesses and redistribute them to nonprofit organizations, like schools."
                }
            ]
        },
        {
            "name": "Recycling and \"Upcyling\" School Supplies",
            "steps": [
                {
                    "headline": "Consider reusing your child's supplies.",
                    "description": "Check the backpack and supplies to see if they are in good shape. If they are, they can be reused instead of being replaced. If you think that you/your child's binder is in good shape, check the rings, the pockets, how well it opens and closes and durability. Skim through the notebooks, if they haven't written a lot then if you can, rip out the pages you/your child have written on. Glue sticks will probably last a good few years so check all glue sticks and see how much glue is in them and if they function well (if you can twist them up and down easily). Scissors are probably still good but the finger holes might be too small. If you/your child has a good pencil box/case, then you can always reuse it. If there is a good amount of \"clean\" sticky notes (not stained by dust and/or pencil markings), then they can also be reused."
                },
                {
                    "headline": "Recycle and reuse where possible.",
                    "description": "Before you even consider shopping, see what you already have. Consider reusing and recycling where possible:\nGo through last year's supplies and salvage what is still good to use. Clean, mend, and redecorate as necessary.What do you have on hand already? Does your child really need a new backpack if he is fine with the one he has already? Cover all books in recycled paper. Brown paper bags are free in many stores, and still the \"old school\" choice. Wash, clean, and stitch up any tears or holes in backpacks, lunch bags, etc. to give them another year's use. Fun patches may be a way to make a backpack look customized, rather than just mended. Note however, that trying to reuse old reusable lunch bags from last school year may not be a good idea. Fabric, plastic, and cooler-type lunch containers can harbor mold and bacteria, so reuse them only as long as they can be cleaned thoroughly. Make sure your child's backpack is still suitable. A backpack used since fourth grade may no longer be appropriate for a child going into the 6th or 7th grade. Starting in middle school, students typically have a lot more stuff to carry with them, and the backpack will need to be big and sturdy enough."
                },
                {
                    "headline": "Make your own pencil cases, laptop cases, backpacks, etc., using materials already available at home.",
                    "description": "Many of these items will be as sturdy as the commercial equivalents, and sometimes better."
                },
                {
                    "headline": "Decorate plain (but less expensive) supplies for a personalized touch.",
                    "description": "Make boring binders, folders, and notebooks more exciting by adding embellishments using markers, stickers, scrap fabric and paper, etc. This can be a big part of the fun of getting the supplies ready to go. Middle school and high school students should label binders and notebooks clearly with class names (History, German, Algebra, etc.) as well as one's personal name--if the notebook is lost on the bus it is more likely to get to your student if there is a name on it."
                },
                {
                    "headline": "If uniforms are required, use the school's used uniform distribution system.",
                    "description": "Most schools with uniforms will have a uniform reuse system in place, and the clothing will be in good condition."
                },
                {
                    "headline": "Textbooks can be very expensive, so search for second-hand.",
                    "description": "If you have to purchase a textbook, or a copy of a certain book, costs can rise rapidly. New textbooks and books are typically the most expensive, but used books cost a lot less. Check Amazon.com for used books. This is a worldwide market for textbooks, books, and more of all kids, and you can save a lot of money. Pay attention to the edition. If your professor asks for the 6th edition, often the 5th edition is almost identical, and a fraction of the price. Sometimes editions really are different, but more often or not changes are minor. Sometimes books are available through your local library. Even if it is not available in your town, inter-library loan may be able to get the work to you for free. The one problem is if someone mid-semester puts a hold on your book. See if your school's library has a copy of the textbook required. Many schools actually have the textbooks available. However, they may sometimes not be allowed out of the library or have other restrictions."
                }
            ]
        }
    ],
    "tyn": [
        "Budget",
        "School supplies list",
        "Internet access",
        "Catalogs",
        "Transport"
    ],
    "text": " School Supply Shopping Tactics If your school has a list of school supplies, stick to it. Schools in some areas put out school supply lists, and typically they offer a guide to what is important to purchase. It is often a good guide, and sticking to it avoids getting sidetracked into buying unnecessary things, and possibly not even get the right things at all. Schools which offer school supply lists will typically mail out school supply lists, but these are also easy to misplace. If so, try to contact the school (school staff will usually be onsite the week before school starts) or look at their official website. Many schools now provide a downloadable list straight from their website. Some schools actually prefer that students do not bring in outside school supplies. For example, your child's kindergarten teacher may not want just one child to have access to sparkly crayons. Consider whether this is a list of requirements or just suggestions. Some schools make suggestions on school supplies, but it is not actually required. Other schools or classes really do require students to bring in certain items. If you are unsure, contact the school. Consult retail store school supply lists with skepticism. Retail stores are there to sell you things, and sometime offer lists suggesting what students at different ages need. While not necessarily a bad guide, they are also not trying to save you money, either. Sometimes there is a general list, and sometimes a list specific to your particular child's teacher or class. For instance, the school may suggest binders, but your child's teacher requests a set of yellow, red, and blue folders. An art class may suggest buying a certain set of art supplies. For example, a digital photography class may suggest a type of digital camera plus a certain a type of software package for a computer at home. Decide in advance how you will respond to requests for extra items from your children. Back-to-school shopping is a prime time for whining and begging. You could allow one extra item only, or tell your child that any items outside the required list are to be paid for out of your child's own money. Can you shop solo? Some children are very particular about back-to-school shopping, and love the ritual. However, many others could care less. If your student is happy to let you do the decision-making, consider doing the shopping by yourself; you may be able to avoid impulse buying--bringing children along tends to increase impulse buys. You may also be able to shop quicker, or more slowly and thoughtfully, or at more stores to take advantage of sales. Set a budget for school shopping. Knowing in advance how much you can afford on supplies will keep everyone's minds focused on the limits to spending. Try withdrawing only that amount of cash budgeting for back-to-school shopping. This often helps adults and children alike be more aware of how much is being spent--credit or debit purchases tend to be harder to keep track of. Have your children involved in this process so that they can understand the process of budgeting. Another possibility is giving your student a \"mini budget\" for a particular item or type of item. How much will depend on the child's age and ability. For instance, giving your 1st grade student $3 to choose washable markers. This can help kids learn about how to work within a budget, make decisions, and responsibility. Check the weekly store sale advertisements. Have your child help you find the best prices in catalogs and online. This can be a source of responsible fun for each child to find the best coupon or deal on their needed items, as well as serve as an unstructured lesson in financial responsibility. Things to keep in mind include:\nSome stores have a \"loss leader\" category. These are items are sold at a loss in order to lure you into the store, hoping you will shop further there. Of course, you are not under any obligation to buy anything else, so you can take advantage of the store in this way. If you shop for the items on special on a weekly basis, over a period of several weeks, you can accumulate many of the items on the list at a sale price. You may end up repeatedly going to the store, however. Note that specialist stationery stores can sometimes be the most expensive place to source your supplies. If you need something specific and/or high quality, that may well be the place to go. However, for most school supplies you do not need the highest quality. Shop around to compare prices and ask for discounts if you have seen items cheaper at another store. Many stores offer price matching; however, don't expect full-service stores to match discounter prices, and don't expect discount store employees to offer personalized service. To save money, you should expect to provide your own \"customer service.\" Look for upcoming tax-free shopping days to add to your discount. Tax free sales days or weekends can provide big discounts where offered. (This is more common in the United States and Canada.) As well as cutting out catalog coupons, print out downloadable coupons or deals that you can only get online. The effort to search through relevant sites is well worth it, as you will find coupons that can be printed, cut out and taken along to the store for discounts. Browse through a variety of dollar stores, department stores, stationery stores, and large stores, for the best deals on pencils, pens, notebooks, and other items. This sounds like a lot of work (and it can be) but this can often be done while shopping for other items throughout the summer. Avoid paying for name-brand things when you do not need to. Generics and store brands are usually for many items, such as pens, pencils, erasers, and the like. But skimping on certain items will cost more in the long run. For example, a cheaply made backpack will likely fall apart by winter break. Investing in a high quality brand may save a lot of money in the long run. For items such as these, make sure that what you get is good enough to use and sturdy enough to last. Team up with other local parents. Use your group buying power to purchase school supplies in bulk at reduced cost. Split the supplies up between you. This is extremely helpful if the children are in the same class. It may also eliminate the whine, \"But all my friends get this or that (expensive) thing.\" when the reality, everyone will have the same brand thing. This is especially helpful if a parent has a membership at a store like Costco, where buying in bulk can save a lot of money. In rural or remote areas, this may also be a wise approach. It may save money for all the parents to go in on one large order, and have it shipped to your location. Speak up if costs are out of control. Parents are generally expected to buy school supplies such as backpacks, sneakers, lunch boxes, and binders. But sometimes, too much may be passed off as expenses for parents to foot the bill. Sometimes, this can put parents in an awkward position, especially low-income ones. This could be a concern to bring up with with the principal, the teachers, the school board, the PTA, or perhaps other parents in your child's classroom or school. Note that for outside activities the school does not have to provide equipment and materials. For example, your daughter may need to purchase her own lacrosse equipment. Your twins may have to rent or buy tubas to join marching band. The senior trip to the national capitol will be unlikely to be free. Teachers may not appreciate how the well-meaning lesson or field trip affects parents financially. Other parents may also be silently suffering trying to figure out how to pay for an expensive field trip, outing, or materials for a lesson. But be polite, honest, and try to assume the best. Being confrontational and angry is likely to sour the relationship between you and the teacher. Talk to your student's teacher about field trip costs. Teachers try very hard to make sure no child cannot go to a field trip due to a family's income. Brainstorm ways to bring costs down. For instance, perhaps a bake sale, car wash, or other  school fundraiser to defray costs for the class trip. Look at reconditioned or last season's options for more expensive items such as laptops or sports gear. If a laptop is required, this is a big expense item. You can reduce the purchase costs by purchasing a reconditioned laptop from a reliable supplier, looking at older models on special, or using a hand-me-down model from another family member who no longer needs it. Try to avoid borrowing a laptop in case it gets damaged or lost, and consider insuring it. Make use of the tax-free sales days when purchasing laptops, desktops, flash drives, and other electronic items for school. You can save thousands. Think about trading in old equipment for new or reconditioned. This can be really useful for sports or music gear. Ask your local sports or music store if they have such a system in place, or if they know of a club or other place that can help. Or check out trading bulletins or online sites for other options. Try some less obvious places. There are some other supply sources that you might not have considered that are worth checking out:\nTry your local thrift store or charity shop. Rummage through the supplies that they do have. Backpacks are a commonly donated item in many thrift stores. Many stores will also have rulers, pencils, pens, calculators, organizers, alarm clocks, and other common household items. These stores also might have furniture such as desks and office chairs. If you let them know you are looking for school supplies, and are a regular customer they might be able to keep some back for you. Look through online auctions. This includes sites like eBay. People sell all sort of items,  from glue sticks, to gym shoes, to computers. Do not forget to check the craft section for things like scissors, glue, and bulk items being cleared out. As with all online auctions, be sure to factor in any shipping. Wait until school starts, if you want. The first week or so of school usually does not actually need that much equipment. By waiting, you may be able to buy these ones until the stores start to move their back-to-school stock into the clearance bins at discounted prices. Very often, the first week students do not need most of the supplies requested. If you can find out which supplies will not be needed until later in the school year, you can put off buying until then. Many stores will start reducing stock as early as a week after school has gone back, so you might not have long to wait. However, by waiting, you risk stores selling out of product or simply not having the style or type you want. Also, you child might be unhappy to have to put off getting supplies. Some students really love the thrill of getting back to school items. For some kids, not having new school supplies might make him or her feel left out, marginalized, or to look like \"the poor kid\". Finding Free School Supplies Ask other friends and family members what they have that they do not need anymore. Start at home with older brothers and sisters, then ask grandparents, aunts and uncles, cousins, friends, and so forth. Specific requests, asked nicely, can sometimes yield great results. You may be doing them a favor--sometimes people have quite a stash of items that are too good to get rid of, but also do not want to just throw out. Also consider people who have access to get items inexpensively. Maybe your cousin who works at a store has a 20% employee discount, and would be happy to help you get a great price on items there. Try websites that post free items. Check your local Freecycle.org website for items people are giving away for free. You can also make requests, if necessary. Craigslist.org is also a site in which people in a local area sell items (typically inexpensively) or even for free. Also check websites which are community-based. For instance, in Vermont, USA there is frontporchforum.com, which has bulletin postings based on one's town. If you work somewhere that is getting rid of its stationery supplies (such as for a change in logo or address), ask your boss if the spare, unwanted items can be donated to the school. Paper, envelopes, 3-ring binders, folders, and more can be re-used without having to buy new. Warning: never take stationery or other office supplies from work without asking, though, or you could lose your job for stealing. Usually offices are happy to no have to throw away office supplies, and may even qualify for a tax write-off. Ask for free promotional giveaway items. Businesses will often have free notepads, pens, pencils, sticky notes, and water bottles at various events or in-store. Although you are unlikely to get \"big ticket\" items this way, these items are free! Handling Getting School Supplies When You Are Low-Income Inquire about help with school supplies if you're low income. Ask your child's school for information on any community programs that are distributing free school supplies. Typically this is requires a family to already be identified as low-income. However, even if you do not qualify for some reason, school staff may be able to point you to resources for the community in general. Try talking to the teacher. Teachers are usually aware that for some families, school supplies are a real financial hardship. He or she can often help you out--but only if you speak up. For example, faculty in schools often have \"lost and found\" items put aside from last year for those in need. Or even donations from different organizations. Teachers will often have an extra supply of items for students. A savvy middle school math teacher will have multiple calculators squirreled away for kids who do not have access to one. Many teachers in the United States pay for school supplies from their own pockets, often because they know some families simply cannot afford to. Talk to your school principal about the school joining the National Association for the Exchange of Industrial Resources (USA) or a similar organization in your country. These organizations collect overstocked donations from businesses and redistribute them to nonprofit organizations, like schools. Recycling and \"Upcyling\" School Supplies Consider reusing your child's supplies. Check the backpack and supplies to see if they are in good shape. If they are, they can be reused instead of being replaced. If you think that you/your child's binder is in good shape, check the rings, the pockets, how well it opens and closes and durability. Skim through the notebooks, if they haven't written a lot then if you can, rip out the pages you/your child have written on. Glue sticks will probably last a good few years so check all glue sticks and see how much glue is in them and if they function well (if you can twist them up and down easily). Scissors are probably still good but the finger holes might be too small. If you/your child has a good pencil box/case, then you can always reuse it. If there is a good amount of \"clean\" sticky notes (not stained by dust and/or pencil markings), then they can also be reused. Recycle and reuse where possible. Before you even consider shopping, see what you already have. Consider reusing and recycling where possible:\nGo through last year's supplies and salvage what is still good to use. Clean, mend, and redecorate as necessary.What do you have on hand already? Does your child really need a new backpack if he is fine with the one he has already? Cover all books in recycled paper. Brown paper bags are free in many stores, and still the \"old school\" choice. Wash, clean, and stitch up any tears or holes in backpacks, lunch bags, etc. to give them another year's use. Fun patches may be a way to make a backpack look customized, rather than just mended. Note however, that trying to reuse old reusable lunch bags from last school year may not be a good idea. Fabric, plastic, and cooler-type lunch containers can harbor mold and bacteria, so reuse them only as long as they can be cleaned thoroughly. Make sure your child's backpack is still suitable. A backpack used since fourth grade may no longer be appropriate for a child going into the 6th or 7th grade. Starting in middle school, students typically have a lot more stuff to carry with them, and the backpack will need to be big and sturdy enough. Make your own pencil cases, laptop cases, backpacks, etc., using materials already available at home. Many of these items will be as sturdy as the commercial equivalents, and sometimes better. Decorate plain (but less expensive) supplies for a personalized touch. Make boring binders, folders, and notebooks more exciting by adding embellishments using markers, stickers, scrap fabric and paper, etc. This can be a big part of the fun of getting the supplies ready to go. Middle school and high school students should label binders and notebooks clearly with class names (History, German, Algebra, etc.) as well as one's personal name--if the notebook is lost on the bus it is more likely to get to your student if there is a name on it. If uniforms are required, use the school's used uniform distribution system. Most schools with uniforms will have a uniform reuse system in place, and the clothing will be in good condition. Textbooks can be very expensive, so search for second-hand. If you have to purchase a textbook, or a copy of a certain book, costs can rise rapidly. New textbooks and books are typically the most expensive, but used books cost a lot less. Check Amazon.com for used books. This is a worldwide market for textbooks, books, and more of all kids, and you can save a lot of money. Pay attention to the edition. If your professor asks for the 6th edition, often the 5th edition is almost identical, and a fraction of the price. Sometimes editions really are different, but more often or not changes are minor. Sometimes books are available through your local library. Even if it is not available in your town, inter-library loan may be able to get the work to you for free. The one problem is if someone mid-semester puts a hold on your book. See if your school's library has a copy of the textbook required. Many schools actually have the textbooks available. However, they may sometimes not be allowed out of the library or have other restrictions.",
    "sentences": [
        " School Supply Shopping Tactics If your school has a list of school supplies, stick to it.",
        "Schools in some areas put out school supply lists, and typically they offer a guide to what is important to purchase.",
        "It is often a good guide, and sticking to it avoids getting sidetracked into buying unnecessary things, and possibly not even get the right things at all.",
        "Schools which offer school supply lists will typically mail out school supply lists, but these are also easy to misplace.",
        "If so, try to contact the school (school staff will usually be onsite the week before school starts) or look at their official website.",
        "Many schools now provide a downloadable list straight from their website.",
        "Some schools actually prefer that students do not bring in outside school supplies.",
        "For example, your child's kindergarten teacher may not want just one child to have access to sparkly crayons.",
        "Consider whether this is a list of requirements or just suggestions.",
        "Some schools make suggestions on school supplies, but it is not actually required.",
        "Other schools or classes really do require students to bring in certain items.",
        "If you are unsure, contact the school.",
        "Consult retail store school supply lists with skepticism.",
        "Retail stores are there to sell you things, and sometime offer lists suggesting what students at different ages need.",
        "While not necessarily a bad guide, they are also not trying to save you money, either.",
        "Sometimes there is a general list, and sometimes a list specific to your particular child's teacher or class.",
        "For instance, the school may suggest binders, but your child's teacher requests a set of yellow, red, and blue folders.",
        "An art class may suggest buying a certain set of art supplies.",
        "For example, a digital photography class may suggest a type of digital camera plus a certain a type of software package for a computer at home.",
        "Decide in advance how you will respond to requests for extra items from your children.",
        "Back-to-school shopping is a prime time for whining and begging.",
        "You could allow one extra item only, or tell your child that any items outside the required list are to be paid for out of your child's own money.",
        "Can you shop solo?",
        "Some children are very particular about back-to-school shopping, and love the ritual.",
        "However, many others could care less.",
        "If your student is happy to let you do the decision-making, consider doing the shopping by yourself; you may be able to avoid impulse buying--bringing children along tends to increase impulse buys.",
        "You may also be able to shop quicker, or more slowly and thoughtfully, or at more stores to take advantage of sales.",
        "Set a budget for school shopping.",
        "Knowing in advance how much you can afford on supplies will keep everyone's minds focused on the limits to spending.",
        "Try withdrawing only that amount of cash budgeting for back-to-school shopping.",
        "This often helps adults and children alike be more aware of how much is being spent--credit or debit purchases tend to be harder to keep track of.",
        "Have your children involved in this process so that they can understand the process of budgeting.",
        "Another possibility is giving your student a \"mini budget\" for a particular item or type of item.",
        "How much will depend on the child's age and ability.",
        "For instance, giving your 1st grade student $3 to choose washable markers.",
        "This can help kids learn about how to work within a budget, make decisions, and responsibility.",
        "Check the weekly store sale advertisements.",
        "Have your child help you find the best prices in catalogs and online.",
        "This can be a source of responsible fun for each child to find the best coupon or deal on their needed items, as well as serve as an unstructured lesson in financial responsibility.",
        "Things to keep in mind include:\nSome stores have a \"loss leader\" category.",
        "These are items are sold at a loss in order to lure you into the store, hoping you will shop further there.",
        "Of course, you are not under any obligation to buy anything else, so you can take advantage of the store in this way.",
        "If you shop for the items on special on a weekly basis, over a period of several weeks, you can accumulate many of the items on the list at a sale price.",
        "You may end up repeatedly going to the store, however.",
        "Note that specialist stationery stores can sometimes be the most expensive place to source your supplies.",
        "If you need something specific and/or high quality, that may well be the place to go.",
        "However, for most school supplies you do not need the highest quality.",
        "Shop around to compare prices and ask for discounts if you have seen items cheaper at another store.",
        "Many stores offer price matching; however, don't expect full-service stores to match discounter prices, and don't expect discount store employees to offer personalized service.",
        "To save money, you should expect to provide your own \"customer service.\"",
        "Look for upcoming tax-free shopping days to add to your discount.",
        "Tax free sales days or weekends can provide big discounts where offered.",
        "(This is more common in the United States and Canada.)",
        "As well as cutting out catalog coupons, print out downloadable coupons or deals that you can only get online.",
        "The effort to search through relevant sites is well worth it, as you will find coupons that can be printed, cut out and taken along to the store for discounts.",
        "Browse through a variety of dollar stores, department stores, stationery stores, and large stores, for the best deals on pencils, pens, notebooks, and other items.",
        "This sounds like a lot of work (and it can be) but this can often be done while shopping for other items throughout the summer.",
        "Avoid paying for name-brand things when you do not need to.",
        "Generics and store brands are usually for many items, such as pens, pencils, erasers, and the like.",
        "But skimping on certain items will cost more in the long run.",
        "For example, a cheaply made backpack will likely fall apart by winter break.",
        "Investing in a high quality brand may save a lot of money in the long run.",
        "For items such as these, make sure that what you get is good enough to use and sturdy enough to last.",
        "Team up with other local parents.",
        "Use your group buying power to purchase school supplies in bulk at reduced cost.",
        "Split the supplies up between you.",
        "This is extremely helpful if the children are in the same class.",
        "It may also eliminate the whine, \"But all my friends get this or that (expensive) thing.\"",
        "when the reality, everyone will have the same brand thing.",
        "This is especially helpful if a parent has a membership at a store like Costco, where buying in bulk can save a lot of money.",
        "In rural or remote areas, this may also be a wise approach.",
        "It may save money for all the parents to go in on one large order, and have it shipped to your location.",
        "Speak up if costs are out of control.",
        "Parents are generally expected to buy school supplies such as backpacks, sneakers, lunch boxes, and binders.",
        "But sometimes, too much may be passed off as expenses for parents to foot the bill.",
        "Sometimes, this can put parents in an awkward position, especially low-income ones.",
        "This could be a concern to bring up with with the principal, the teachers, the school board, the PTA, or perhaps other parents in your child's classroom or school.",
        "Note that for outside activities the school does not have to provide equipment and materials.",
        "For example, your daughter may need to purchase her own lacrosse equipment.",
        "Your twins may have to rent or buy tubas to join marching band.",
        "The senior trip to the national capitol will be unlikely to be free.",
        "Teachers may not appreciate how the well-meaning lesson or field trip affects parents financially.",
        "Other parents may also be silently suffering trying to figure out how to pay for an expensive field trip, outing, or materials for a lesson.",
        "But be polite, honest, and try to assume the best.",
        "Being confrontational and angry is likely to sour the relationship between you and the teacher.",
        "Talk to your student's teacher about field trip costs.",
        "Teachers try very hard to make sure no child cannot go to a field trip due to a family's income.",
        "Brainstorm ways to bring costs down.",
        "For instance, perhaps a bake sale, car wash, or other  school fundraiser to defray costs for the class trip.",
        "Look at reconditioned or last season's options for more expensive items such as laptops or sports gear.",
        "If a laptop is required, this is a big expense item.",
        "You can reduce the purchase costs by purchasing a reconditioned laptop from a reliable supplier, looking at older models on special, or using a hand-me-down model from another family member who no longer needs it.",
        "Try to avoid borrowing a laptop in case it gets damaged or lost, and consider insuring it.",
        "Make use of the tax-free sales days when purchasing laptops, desktops, flash drives, and other electronic items for school.",
        "You can save thousands.",
        "Think about trading in old equipment for new or reconditioned.",
        "This can be really useful for sports or music gear.",
        "Ask your local sports or music store if they have such a system in place, or if they know of a club or other place that can help.",
        "Or check out trading bulletins or online sites for other options.",
        "Try some less obvious places.",
        "There are some other supply sources that you might not have considered that are worth checking out:\nTry your local thrift store or charity shop.",
        "Rummage through the supplies that they do have.",
        "Backpacks are a commonly donated item in many thrift stores.",
        "Many stores will also have rulers, pencils, pens, calculators, organizers, alarm clocks, and other common household items.",
        "These stores also might have furniture such as desks and office chairs.",
        "If you let them know you are looking for school supplies, and are a regular customer they might be able to keep some back for you.",
        "Look through online auctions.",
        "This includes sites like eBay.",
        "People sell all sort of items,  from glue sticks, to gym shoes, to computers.",
        "Do not forget to check the craft section for things like scissors, glue, and bulk items being cleared out.",
        "As with all online auctions, be sure to factor in any shipping.",
        "Wait until school starts, if you want.",
        "The first week or so of school usually does not actually need that much equipment.",
        "By waiting, you may be able to buy these ones until the stores start to move their back-to-school stock into the clearance bins at discounted prices.",
        "Very often, the first week students do not need most of the supplies requested.",
        "If you can find out which supplies will not be needed until later in the school year, you can put off buying until then.",
        "Many stores will start reducing stock as early as a week after school has gone back, so you might not have long to wait.",
        "However, by waiting, you risk stores selling out of product or simply not having the style or type you want.",
        "Also, you child might be unhappy to have to put off getting supplies.",
        "Some students really love the thrill of getting back to school items.",
        "For some kids, not having new school supplies might make him or her feel left out, marginalized, or to look like \"the poor kid\".",
        "Finding Free School Supplies Ask other friends and family members what they have that they do not need anymore.",
        "Start at home with older brothers and sisters, then ask grandparents, aunts and uncles, cousins, friends, and so forth.",
        "Specific requests, asked nicely, can sometimes yield great results.",
        "You may be doing them a favor--sometimes people have quite a stash of items that are too good to get rid of, but also do not want to just throw out.",
        "Also consider people who have access to get items inexpensively.",
        "Maybe your cousin who works at a store has a 20% employee discount, and would be happy to help you get a great price on items there.",
        "Try websites that post free items.",
        "Check your local Freecycle.org website for items people are giving away for free.",
        "You can also make requests, if necessary.",
        "Craigslist.org is also a site in which people in a local area sell items (typically inexpensively) or even for free.",
        "Also check websites which are community-based.",
        "For instance, in Vermont, USA there is frontporchforum.com, which has bulletin postings based on one's town.",
        "If you work somewhere that is getting rid of its stationery supplies (such as for a change in logo or address), ask your boss if the spare, unwanted items can be donated to the school.",
        "Paper, envelopes, 3-ring binders, folders, and more can be re-used without having to buy new.",
        "Warning: never take stationery or other office supplies from work without asking, though, or you could lose your job for stealing.",
        "Usually offices are happy to no have to throw away office supplies, and may even qualify for a tax write-off.",
        "Ask for free promotional giveaway items.",
        "Businesses will often have free notepads, pens, pencils, sticky notes, and water bottles at various events or in-store.",
        "Although you are unlikely to get \"big ticket\" items this way, these items are free!",
        "Handling Getting School Supplies When You Are Low-Income Inquire about help with school supplies if you're low income.",
        "Ask your child's school for information on any community programs that are distributing free school supplies.",
        "Typically this is requires a family to already be identified as low-income.",
        "However, even if you do not qualify for some reason, school staff may be able to point you to resources for the community in general.",
        "Try talking to the teacher.",
        "Teachers are usually aware that for some families, school supplies are a real financial hardship.",
        "He or she can often help you out--but only if you speak up.",
        "For example, faculty in schools often have \"lost and found\" items put aside from last year for those in need.",
        "Or even donations from different organizations.",
        "Teachers will often have an extra supply of items for students.",
        "A savvy middle school math teacher will have multiple calculators squirreled away for kids who do not have access to one.",
        "Many teachers in the United States pay for school supplies from their own pockets, often because they know some families simply cannot afford to.",
        "Talk to your school principal about the school joining the National Association for the Exchange of Industrial Resources (USA) or a similar organization in your country.",
        "These organizations collect overstocked donations from businesses and redistribute them to nonprofit organizations, like schools.",
        "Recycling and \"Upcyling\" School Supplies Consider reusing your child's supplies.",
        "Check the backpack and supplies to see if they are in good shape.",
        "If they are, they can be reused instead of being replaced.",
        "If you think that you/your child's binder is in good shape, check the rings, the pockets, how well it opens and closes and durability.",
        "Skim through the notebooks, if they haven't written a lot then if you can, rip out the pages you/your child have written on.",
        "Glue sticks will probably last a good few years so check all glue sticks and see how much glue is in them and if they function well (if you can twist them up and down easily).",
        "Scissors are probably still good but the finger holes might be too small.",
        "If you/your child has a good pencil box/case, then you can always reuse it.",
        "If there is a good amount of \"clean\" sticky notes (not stained by dust and/or pencil markings), then they can also be reused.",
        "Recycle and reuse where possible.",
        "Before you even consider shopping, see what you already have.",
        "Consider reusing and recycling where possible:\nGo through last year's supplies and salvage what is still good to use.",
        "Clean, mend, and redecorate as necessary.What do you have on hand already?",
        "Does your child really need a new backpack if he is fine with the one he has already?",
        "Cover all books in recycled paper.",
        "Brown paper bags are free in many stores, and still the \"old school\" choice.",
        "Wash, clean, and stitch up any tears or holes in backpacks, lunch bags, etc.",
        "to give them another year's use.",
        "Fun patches may be a way to make a backpack look customized, rather than just mended.",
        "Note however, that trying to reuse old reusable lunch bags from last school year may not be a good idea.",
        "Fabric, plastic, and cooler-type lunch containers can harbor mold and bacteria, so reuse them only as long as they can be cleaned thoroughly.",
        "Make sure your child's backpack is still suitable.",
        "A backpack used since fourth grade may no longer be appropriate for a child going into the 6th or 7th grade.",
        "Starting in middle school, students typically have a lot more stuff to carry with them, and the backpack will need to be big and sturdy enough.",
        "Make your own pencil cases, laptop cases, backpacks, etc., using materials already available at home.",
        "Many of these items will be as sturdy as the commercial equivalents, and sometimes better.",
        "Decorate plain (but less expensive) supplies for a personalized touch.",
        "Make boring binders, folders, and notebooks more exciting by adding embellishments using markers, stickers, scrap fabric and paper, etc.",
        "This can be a big part of the fun of getting the supplies ready to go.",
        "Middle school and high school students should label binders and notebooks clearly with class names (History, German, Algebra, etc.)",
        "as well as one's personal name--if the notebook is lost on the bus it is more likely to get to your student if there is a name on it.",
        "If uniforms are required, use the school's used uniform distribution system.",
        "Most schools with uniforms will have a uniform reuse system in place, and the clothing will be in good condition.",
        "Textbooks can be very expensive, so search for second-hand.",
        "If you have to purchase a textbook, or a copy of a certain book, costs can rise rapidly.",
        "New textbooks and books are typically the most expensive, but used books cost a lot less.",
        "Check Amazon.com for used books.",
        "This is a worldwide market for textbooks, books, and more of all kids, and you can save a lot of money.",
        "Pay attention to the edition.",
        "If your professor asks for the 6th edition, often the 5th edition is almost identical, and a fraction of the price.",
        "Sometimes editions really are different, but more often or not changes are minor.",
        "Sometimes books are available through your local library.",
        "Even if it is not available in your town, inter-library loan may be able to get the work to you for free.",
        "The one problem is if someone mid-semester puts a hold on your book.",
        "See if your school's library has a copy of the textbook required.",
        "Many schools actually have the textbooks available.",
        "However, they may sometimes not be allowed out of the library or have other restrictions."
    ]
}