{
    "title": "How to Store Beer",
    "url": "https://www.wikihow.com/Store-Beer",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Alcoholic Drinks",
        "Beer and Cider"
    ],
    "steps": [
        {
            "headline": "Store beer in the correct position.",
            "description": "Just like wine, there is a right way and a not-so-good way to store bottles of beer that you're keeping for longer. Stand beer upright instead of putting it on its side during storage – even brewers like Chimay recommend this over side storage. This will ensure that the yeast (sediment) settles at the bottom of the beer bottle, rather than leaving a yeast ring or watermark on the side that won't ever settle or mix in. Also, modern corks don't tend to dry out or soak up air, so that's not a problem when storing beer and not a reason for side bottle storage (particularly since the beer touching the cork over a long period of time can actually taint the taste of the beer). And the best reason for storing beer upright is that it oxidizes less, thereby ensuring it keeps longer!"
        },
        {
            "headline": "Store beer away from light.",
            "description": "Choose a dim or dark location for beer storage, as ultra-violet and even blue light soon spoil beer, causing it to be \"light struck\" and to go \"skunked\", meaning that it tastes pretty much like something a skunk might produce. Green and especially brown bottles help beer from becoming light struck, which risks giving the brew a skunky taste. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/26\\/Store-Beer-Step-2Bullet1.jpg\\/v4-460px-Store-Beer-Step-2Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/26\\/Store-Beer-Step-2Bullet1.jpg\\/v4-760px-Store-Beer-Step-2Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        },
        {
            "headline": "Get the storage temperature right.",
            "description": "Heat spoils beer over time, so beer is best kept at cool but not frozen temperatures. Although some people enjoy freezing their beer prior to consuming it, frozen beer cells never quite return to the way they used to be and so the beer won't taste as good. Suitable storage places include a beer cellar or the refrigerator, although long-term storage in a refrigerator is not recommended for collectible beers you plan on keeping a very long time, as the dehydrating environment of the refrigerator will eventually impact the cork. The right storage temperature for beer is dependent on the type of beer, so use this handy list as a guide:\nMost beers benefit from being stored at a temperature around 50ºF to 55ºF (10°C-12.8°C). Be sure to keep the temperature constant. Strong, higher alcohol content beers (barleywines, triples, dark ales) benefit from a temperature around 55ºF to 60ºF (12.8°C-15.5°C), which happens to be room temperature. Standard, mid-range alcohol content ales (bitters, IPAs, lambics, stouts, doppelbocks, etc.) benefit from a storage temperature around 50ºF to 55ºF (10°C-12.8°C), which is cellar temperature. Lighter alcohol content beers (lagers, pilsners, wheat beers, milds, low-cal, etc.) benefit from a storage temperature around 45ºF to 50ºF (7.2°C-10°C), which is the refrigerated temperature. Unless you have a dedicated beer cellar or fridge, the best compromise for storage is the 50ºF to 55ºF (10°C-12.8°C) temperature range. Too little storage space? Drink it soon!"
        },
        {
            "headline": "Know how long you can store beer for, especially if you're seeking to age the beer.",
            "description": "Different types of beers have different use by dates owing to which brewing process was used and whether or not the beer was made for fast consumption or for longer-term keeping or aging. While there will often be a use-by date on beer sold in large commercial quantities, not all brewers will have a good idea of how long their brews can be aged for, and the possibility ranges from 6-8 months to 25 years, dependent on brand, storage methods, and quality of the beer. In other words, unless the brewer provides aging recommendations for the beer in question, you simply have to give it a go. If you're intending to store beer as a collector rather than for simple home consumption, there will definitely be some trial and error involved and it's best to approach it with a sense of exploration and fun; unlike expensive wines, at least if the beer is disgusting after storing it a bit too long, you haven't thrown away a lot of money! In general, American beer can be stored from four to six months, while imported beers can be stored up to a year. Obviously, check the use-by date as one indicator and use this rule of thumb with caution and skepticism dependent on your own trial and error testing. Specialist beers made for longer keeping will often make this clear as part of the marketing; indeed, some brews don't even start to develop the flavors intended by the brewer for 2 to 5 years or so. Ask the retailer for advice if you can't see anything on the label. Beers over 7 percent alcohol tend to fare better for aging purposes. Restore yourself after tasting a bad beer from storage by following it straight up with a good new beer. You'll soon get over the experience!"
        },
        {
            "headline": "Consider keeping records of beer you've drunk straight after purchase and beer that has been stored.",
            "description": "Always seek to buy at least two bottles of each type of beer destined for storage. Drink one and make notes on its taste, flavor range, texture and depth, and head quality. Then, do the same when you finally have the stored beer and compare them to see what changes have occurred during the storage period. Has the beer improved or worsened with storage time? Over time you should be able to make some good guesses as to what will store well over time and be improved for storage."
        },
        {
            "headline": "Drink opened beer and don't even try storing it.",
            "description": "The carbonation will evaporate and you'll have awful flat beer even if it's only the next day. If you can't drink it, use it in the kitchen or elsewhere. There are some great uses for unused, open beer including:\nMake beer bread\nMake beer bread with oats\nMake English fish and chips with beer batter\nCook deep fried beer\nMake beer battered fried vegetables\n\nMake your hair soft with beer. Get Rid of Garden Slugs"
        }
    ],
    "tyn": [
        "Refrigerator and/or beer cellar (preferably a dedicated refrigerator if storing a lot of beer for a long time)",
        "A quick read of the beer labels and expiry dates for more information about storage suitability and needs",
        "Beer"
    ],
    "text": " Store beer in the correct position. Just like wine, there is a right way and a not-so-good way to store bottles of beer that you're keeping for longer. Stand beer upright instead of putting it on its side during storage – even brewers like Chimay recommend this over side storage. This will ensure that the yeast (sediment) settles at the bottom of the beer bottle, rather than leaving a yeast ring or watermark on the side that won't ever settle or mix in. Also, modern corks don't tend to dry out or soak up air, so that's not a problem when storing beer and not a reason for side bottle storage (particularly since the beer touching the cork over a long period of time can actually taint the taste of the beer). And the best reason for storing beer upright is that it oxidizes less, thereby ensuring it keeps longer! Store beer away from light. Choose a dim or dark location for beer storage, as ultra-violet and even blue light soon spoil beer, causing it to be \"light struck\" and to go \"skunked\", meaning that it tastes pretty much like something a skunk might produce. Green and especially brown bottles help beer from becoming light struck, which risks giving the brew a skunky taste. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/26\\/Store-Beer-Step-2Bullet1.jpg\\/v4-460px-Store-Beer-Step-2Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/26\\/Store-Beer-Step-2Bullet1.jpg\\/v4-760px-Store-Beer-Step-2Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Get the storage temperature right. Heat spoils beer over time, so beer is best kept at cool but not frozen temperatures. Although some people enjoy freezing their beer prior to consuming it, frozen beer cells never quite return to the way they used to be and so the beer won't taste as good. Suitable storage places include a beer cellar or the refrigerator, although long-term storage in a refrigerator is not recommended for collectible beers you plan on keeping a very long time, as the dehydrating environment of the refrigerator will eventually impact the cork. The right storage temperature for beer is dependent on the type of beer, so use this handy list as a guide:\nMost beers benefit from being stored at a temperature around 50ºF to 55ºF (10°C-12.8°C). Be sure to keep the temperature constant. Strong, higher alcohol content beers (barleywines, triples, dark ales) benefit from a temperature around 55ºF to 60ºF (12.8°C-15.5°C), which happens to be room temperature. Standard, mid-range alcohol content ales (bitters, IPAs, lambics, stouts, doppelbocks, etc.) benefit from a storage temperature around 50ºF to 55ºF (10°C-12.8°C), which is cellar temperature. Lighter alcohol content beers (lagers, pilsners, wheat beers, milds, low-cal, etc.) benefit from a storage temperature around 45ºF to 50ºF (7.2°C-10°C), which is the refrigerated temperature. Unless you have a dedicated beer cellar or fridge, the best compromise for storage is the 50ºF to 55ºF (10°C-12.8°C) temperature range. Too little storage space? Drink it soon! Know how long you can store beer for, especially if you're seeking to age the beer. Different types of beers have different use by dates owing to which brewing process was used and whether or not the beer was made for fast consumption or for longer-term keeping or aging. While there will often be a use-by date on beer sold in large commercial quantities, not all brewers will have a good idea of how long their brews can be aged for, and the possibility ranges from 6-8 months to 25 years, dependent on brand, storage methods, and quality of the beer. In other words, unless the brewer provides aging recommendations for the beer in question, you simply have to give it a go. If you're intending to store beer as a collector rather than for simple home consumption, there will definitely be some trial and error involved and it's best to approach it with a sense of exploration and fun; unlike expensive wines, at least if the beer is disgusting after storing it a bit too long, you haven't thrown away a lot of money! In general, American beer can be stored from four to six months, while imported beers can be stored up to a year. Obviously, check the use-by date as one indicator and use this rule of thumb with caution and skepticism dependent on your own trial and error testing. Specialist beers made for longer keeping will often make this clear as part of the marketing; indeed, some brews don't even start to develop the flavors intended by the brewer for 2 to 5 years or so. Ask the retailer for advice if you can't see anything on the label. Beers over 7 percent alcohol tend to fare better for aging purposes. Restore yourself after tasting a bad beer from storage by following it straight up with a good new beer. You'll soon get over the experience! Consider keeping records of beer you've drunk straight after purchase and beer that has been stored. Always seek to buy at least two bottles of each type of beer destined for storage. Drink one and make notes on its taste, flavor range, texture and depth, and head quality. Then, do the same when you finally have the stored beer and compare them to see what changes have occurred during the storage period. Has the beer improved or worsened with storage time? Over time you should be able to make some good guesses as to what will store well over time and be improved for storage. Drink opened beer and don't even try storing it. The carbonation will evaporate and you'll have awful flat beer even if it's only the next day. If you can't drink it, use it in the kitchen or elsewhere. There are some great uses for unused, open beer including:\nMake beer bread\nMake beer bread with oats\nMake English fish and chips with beer batter\nCook deep fried beer\nMake beer battered fried vegetables\n\nMake your hair soft with beer. Get Rid of Garden Slugs",
    "sentences": [
        " Store beer in the correct position.",
        "Just like wine, there is a right way and a not-so-good way to store bottles of beer that you're keeping for longer.",
        "Stand beer upright instead of putting it on its side during storage – even brewers like Chimay recommend this over side storage.",
        "This will ensure that the yeast (sediment) settles at the bottom of the beer bottle, rather than leaving a yeast ring or watermark on the side that won't ever settle or mix in.",
        "Also, modern corks don't tend to dry out or soak up air, so that's not a problem when storing beer and not a reason for side bottle storage (particularly since the beer touching the cork over a long period of time can actually taint the taste of the beer).",
        "And the best reason for storing beer upright is that it oxidizes less, thereby ensuring it keeps longer!",
        "Store beer away from light.",
        "Choose a dim or dark location for beer storage, as ultra-violet and even blue light soon spoil beer, causing it to be \"light struck\" and to go \"skunked\", meaning that it tastes pretty much like something a skunk might produce.",
        "Green and especially brown bottles help beer from becoming light struck, which risks giving the brew a skunky taste.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/26\\/Store-Beer-Step-2Bullet1.jpg\\/v4-460px-Store-Beer-Step-2Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/26\\/Store-Beer-Step-2Bullet1.jpg\\/v4-760px-Store-Beer-Step-2Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Get the storage temperature right.",
        "Heat spoils beer over time, so beer is best kept at cool but not frozen temperatures.",
        "Although some people enjoy freezing their beer prior to consuming it, frozen beer cells never quite return to the way they used to be and so the beer won't taste as good.",
        "Suitable storage places include a beer cellar or the refrigerator, although long-term storage in a refrigerator is not recommended for collectible beers you plan on keeping a very long time, as the dehydrating environment of the refrigerator will eventually impact the cork.",
        "The right storage temperature for beer is dependent on the type of beer, so use this handy list as a guide:\nMost beers benefit from being stored at a temperature around 50ºF to 55ºF (10°C-12.8°C).",
        "Be sure to keep the temperature constant.",
        "Strong, higher alcohol content beers (barleywines, triples, dark ales) benefit from a temperature around 55ºF to 60ºF (12.8°C-15.5°C), which happens to be room temperature.",
        "Standard, mid-range alcohol content ales (bitters, IPAs, lambics, stouts, doppelbocks, etc.)",
        "benefit from a storage temperature around 50ºF to 55ºF (10°C-12.8°C), which is cellar temperature.",
        "Lighter alcohol content beers (lagers, pilsners, wheat beers, milds, low-cal, etc.)",
        "benefit from a storage temperature around 45ºF to 50ºF (7.2°C-10°C), which is the refrigerated temperature.",
        "Unless you have a dedicated beer cellar or fridge, the best compromise for storage is the 50ºF to 55ºF (10°C-12.8°C) temperature range.",
        "Too little storage space?",
        "Drink it soon!",
        "Know how long you can store beer for, especially if you're seeking to age the beer.",
        "Different types of beers have different use by dates owing to which brewing process was used and whether or not the beer was made for fast consumption or for longer-term keeping or aging.",
        "While there will often be a use-by date on beer sold in large commercial quantities, not all brewers will have a good idea of how long their brews can be aged for, and the possibility ranges from 6-8 months to 25 years, dependent on brand, storage methods, and quality of the beer.",
        "In other words, unless the brewer provides aging recommendations for the beer in question, you simply have to give it a go.",
        "If you're intending to store beer as a collector rather than for simple home consumption, there will definitely be some trial and error involved and it's best to approach it with a sense of exploration and fun; unlike expensive wines, at least if the beer is disgusting after storing it a bit too long, you haven't thrown away a lot of money!",
        "In general, American beer can be stored from four to six months, while imported beers can be stored up to a year.",
        "Obviously, check the use-by date as one indicator and use this rule of thumb with caution and skepticism dependent on your own trial and error testing.",
        "Specialist beers made for longer keeping will often make this clear as part of the marketing; indeed, some brews don't even start to develop the flavors intended by the brewer for 2 to 5 years or so.",
        "Ask the retailer for advice if you can't see anything on the label.",
        "Beers over 7 percent alcohol tend to fare better for aging purposes.",
        "Restore yourself after tasting a bad beer from storage by following it straight up with a good new beer.",
        "You'll soon get over the experience!",
        "Consider keeping records of beer you've drunk straight after purchase and beer that has been stored.",
        "Always seek to buy at least two bottles of each type of beer destined for storage.",
        "Drink one and make notes on its taste, flavor range, texture and depth, and head quality.",
        "Then, do the same when you finally have the stored beer and compare them to see what changes have occurred during the storage period.",
        "Has the beer improved or worsened with storage time?",
        "Over time you should be able to make some good guesses as to what will store well over time and be improved for storage.",
        "Drink opened beer and don't even try storing it.",
        "The carbonation will evaporate and you'll have awful flat beer even if it's only the next day.",
        "If you can't drink it, use it in the kitchen or elsewhere.",
        "There are some great uses for unused, open beer including:\nMake beer bread\nMake beer bread with oats\nMake English fish and chips with beer batter\nCook deep fried beer\nMake beer battered fried vegetables\n\nMake your hair soft with beer.",
        "Get Rid of Garden Slugs"
    ]
}