{
    "title": "How to Grill Gizzards",
    "url": "https://www.wikihow.com/Grill-Gizzards",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes"
    ],
    "methods": [
        {
            "name": "Making Gizzard and Pepper Kebabs",
            "steps": [
                {
                    "headline": "Combine the oil, garlic, sauce, sugar, vinegar, and tomato sauce.",
                    "description": "Pour ⁄2 cup (120 ml) of oil into a large bowl along with 1 teaspoon (4.9 ml) of vinegar and 1 cup (225 g) of tomato sauce. Stir in 1 sliced garlic clove, ⁄2 cup (120 ml) of Worcestershire sauce and 4 tablespoons (50 g) of dark brown sugar until the marinade is combined. You can use olive, coconut, or vegetable oil. Try using white or apple cider vinegar for the marinade."
                },
                {
                    "headline": "Clean 1 ⁄4 pounds (570 g) of chicken gizzards.",
                    "description": "Rinse any blood or debris off of the gizzards and set them on a cutting board. Cut each gizzard in half lengthwise and then rinse out the centers to remove debris. Pull away and discard the tough yellow lining from each gizzard. You'll need to use your fingers to rub the debris free from the gizzards as you rinse."
                },
                {
                    "headline": "Stir in the gizzards and refrigerate them for 45 to 60 minutes.",
                    "description": "Put the cleaned gizzards into the bowl with the marinade. Stir to coat them with the mixture and then cover the bowl with plastic wrap. Refrigerate the gizzards in the marinade so they soften and become flavorful."
                },
                {
                    "headline": "Soak the skewers in water for at least 15 minutes.",
                    "description": "Place 14 to 15 bamboo or wooden skewers into a long shallow dish. Cover the skewers with water and leave them to soak at room temperature while you prepare the peppers and the grill. Soaking the skewers will ensure they don't burn when you put them on the grill."
                },
                {
                    "headline": "Chop 4 bell peppers.",
                    "description": "Rinse 2 yellow and 2 red peppers. Trim the stems and discard the seeds from the center of each pepper. Then use a sharp knife to cut each pepper into 2 in (5 cm) chunks. If you prefer, you can also use orange or green bell peppers."
                },
                {
                    "headline": "Heat a gas or charcoal grill to high.",
                    "description": "Turn a gas grill to high or fill a chimney with briquettes. Light the briquettes and dump them in the center of the grill once they're hot and ashy."
                },
                {
                    "headline": "Thread the gizzards and peppers on the skewers.",
                    "description": "Remove the gizzards from the marinade and drain the water from the skewers. Slide 1 gizzard onto the skewer and then thread 1 to 2 pieces of pepper. Continue to alternate threading gizzards with peppers. You should be able to make 14 to 16 kebabs."
                },
                {
                    "headline": "Put the kebabs on the grill and brush them with the marinade.",
                    "description": "Arrange the kebabs on the hot grill and use a basting brush to coat them with the marinade. Keep the lid off of the grill so you can turn the kebabs frequently."
                },
                {
                    "headline": "Grill the kebabs for 12 to 15 minutes.",
                    "description": "Set a timer for 12 to 15 minutes and turn the kebabs every few minutes so the gizzards cook evenly. The gizzards should look slightly crisp around the edges and the peppers will char. To ensure the gizzards have finished cooking, insert an instant-read meat thermometer. They should reach 165 °F (74 °C)."
                },
                {
                    "headline": "Remove and serve the gizzard kebabs.",
                    "description": "Use tongs to transfer the kebabs to a serving platter. Consider serving them with boiled or grilled sweet corn and salad. Refrigerate the leftover gizzard kebabs in an airtight container for up to 3 to 4 days."
                }
            ]
        },
        {
            "name": "Grilling Filipino Gizzards (Balon–Balonan)",
            "steps": [
                {
                    "headline": "Clean 1.1 pounds (500 g) of chicken gizzards.",
                    "description": "Rinse away blood and debris before putting the gizzards on a cutting board. Slice each gizzard in half lengthwise and then rinse out the centers to get rid of debris. Pull off and discard the tough yellow lining from each gizzard. Loosen the debris by rubbing your fingers over the gizzards as you rinse."
                },
                {
                    "headline": "Soak the gizzards in ⁄2 cup (120 ml) of vinegar for 10 minutes.",
                    "description": "Put the gizzards in a bowl and pour the vinegar over them. Leave them to rest for 10 minutes. Then drain the gizzards and rinse them with water."
                },
                {
                    "headline": "Mix the gizzards with water, salt, pepper, ginger, garlic, shallot, and bay leaf.",
                    "description": "Cover the gizzards with enough water so they're covered. Stir in 2 teaspoons (11 g) of salt, 1/2 teaspoon (1.5 g) of whole peppercorns, a ⁄2 inch (1.3 cm) piece of ginger, 2 cloves of garlic, 1 shallot, and 1 bay leaf. The amount of water you'll need will depend on the size of your pot."
                },
                {
                    "headline": "Cover and simmer the gizzards for 60 to 90 minutes.",
                    "description": "Turn the burner to high so the water comes to a boil. Then turn the burner down to medium or medium-low so the water bubbles gently. Cover the pot and simmer the gizzards until they soften to your liking. If the pot looks like it's going to boil dry, pour in 1 cup (240 ml) of water."
                },
                {
                    "headline": "Cool and cut the gizzards if necessary.",
                    "description": "Turn off the burner and set a strainer in the sink. Slowly pour the gizzards into the strainer to drain away the water. Leave the gizzards to cool in the strainer until they're comfortable to handle. Then cut them into bite-sized pieces. If you prefer, you could leave the gizzards in larger pieces."
                },
                {
                    "headline": "Soak the skewers in water for at least 15 minutes.",
                    "description": "Put 12 to 15 bamboo or wooden skewers into a long shallow dish. Then pour enough water to cover the skewers completely and let them soak while you finish preparing the gizzards. Soaking the skewers will keep them from catching fire on the grill."
                },
                {
                    "headline": "Heat a gas grill or charcoal grill to high.",
                    "description": "If you're using a gas grill, turn it to high. If you're using a charcoal grill, fill a chimney with briquettes and light them. When the coals become hot and slightly ashy, dump them in the center of the grill."
                },
                {
                    "headline": "Thread the gizzards onto the soaked skewers.",
                    "description": "Drain the water from the skewers and slide the drained gizzards onto them. You should be able to make 12 to 15 kebabs."
                },
                {
                    "headline": "Combine the ketchup, Sriracha, mustard, and honey in a small bowl.",
                    "description": "Measure 2 tablespoons (34 g) of ketchup, 2 tablespoons (34 g) of Sriracha sauce, 1/4 cup (62 g) of mustard, and 1/4 cup (85 g) of honey into a bowl. Use a spoon or whisk to combine the sauce."
                },
                {
                    "headline": "Grill the gizzards for 4 minutes and turn them once.",
                    "description": "Put the gizzards on the grill and brush them with the sauce. Turn the gizzards about halfway through the cooking time so they grill evenly. Brush them with more sauce if you'd like."
                },
                {
                    "headline": "Remove and serve the Filipino gizzards.",
                    "description": "Use tongs to transfer the grilled gizzards to a serving plate. Serve the Filipino gizzards immediately along with rice, noodles, or a salad. You can store leftover gizzards in an airtight container in the refrigerator for up to 3 to 4 days."
                }
            ]
        }
    ],
    "tyn": [
        "Gizzard and Pepper Kebabs",
        "Measuring cups and spoons",
        "Knife and cutting board",
        "Large bowl",
        "Spoon",
        "Gas or charcoal grill",
        "Tongs",
        "Serving platter",
        "Plastic wrap",
        "14 to 16 bamboo or wooden skewers",
        "Long shallow dish",
        "Basting brush",
        "Instant-read meat thermometer",
        "Filipino Grilled Gizzards (Balon–Balonan)",
        "12 to 15 bamboo or wooden skewers",
        "Bowl",
        "Pot",
        "Strainer",
        "Small bowl",
        "Serving plate"
    ],
    "text": " Making Gizzard and Pepper Kebabs Combine the oil, garlic, sauce, sugar, vinegar, and tomato sauce. Pour ⁄2 cup (120 ml) of oil into a large bowl along with 1 teaspoon (4.9 ml) of vinegar and 1 cup (225 g) of tomato sauce. Stir in 1 sliced garlic clove, ⁄2 cup (120 ml) of Worcestershire sauce and 4 tablespoons (50 g) of dark brown sugar until the marinade is combined. You can use olive, coconut, or vegetable oil. Try using white or apple cider vinegar for the marinade. Clean 1 ⁄4 pounds (570 g) of chicken gizzards. Rinse any blood or debris off of the gizzards and set them on a cutting board. Cut each gizzard in half lengthwise and then rinse out the centers to remove debris. Pull away and discard the tough yellow lining from each gizzard. You'll need to use your fingers to rub the debris free from the gizzards as you rinse. Stir in the gizzards and refrigerate them for 45 to 60 minutes. Put the cleaned gizzards into the bowl with the marinade. Stir to coat them with the mixture and then cover the bowl with plastic wrap. Refrigerate the gizzards in the marinade so they soften and become flavorful. Soak the skewers in water for at least 15 minutes. Place 14 to 15 bamboo or wooden skewers into a long shallow dish. Cover the skewers with water and leave them to soak at room temperature while you prepare the peppers and the grill. Soaking the skewers will ensure they don't burn when you put them on the grill. Chop 4 bell peppers. Rinse 2 yellow and 2 red peppers. Trim the stems and discard the seeds from the center of each pepper. Then use a sharp knife to cut each pepper into 2 in (5 cm) chunks. If you prefer, you can also use orange or green bell peppers. Heat a gas or charcoal grill to high. Turn a gas grill to high or fill a chimney with briquettes. Light the briquettes and dump them in the center of the grill once they're hot and ashy. Thread the gizzards and peppers on the skewers. Remove the gizzards from the marinade and drain the water from the skewers. Slide 1 gizzard onto the skewer and then thread 1 to 2 pieces of pepper. Continue to alternate threading gizzards with peppers. You should be able to make 14 to 16 kebabs. Put the kebabs on the grill and brush them with the marinade. Arrange the kebabs on the hot grill and use a basting brush to coat them with the marinade. Keep the lid off of the grill so you can turn the kebabs frequently. Grill the kebabs for 12 to 15 minutes. Set a timer for 12 to 15 minutes and turn the kebabs every few minutes so the gizzards cook evenly. The gizzards should look slightly crisp around the edges and the peppers will char. To ensure the gizzards have finished cooking, insert an instant-read meat thermometer. They should reach 165 °F (74 °C). Remove and serve the gizzard kebabs. Use tongs to transfer the kebabs to a serving platter. Consider serving them with boiled or grilled sweet corn and salad. Refrigerate the leftover gizzard kebabs in an airtight container for up to 3 to 4 days. Grilling Filipino Gizzards (Balon–Balonan) Clean 1.1 pounds (500 g) of chicken gizzards. Rinse away blood and debris before putting the gizzards on a cutting board. Slice each gizzard in half lengthwise and then rinse out the centers to get rid of debris. Pull off and discard the tough yellow lining from each gizzard. Loosen the debris by rubbing your fingers over the gizzards as you rinse. Soak the gizzards in ⁄2 cup (120 ml) of vinegar for 10 minutes. Put the gizzards in a bowl and pour the vinegar over them. Leave them to rest for 10 minutes. Then drain the gizzards and rinse them with water. Mix the gizzards with water, salt, pepper, ginger, garlic, shallot, and bay leaf. Cover the gizzards with enough water so they're covered. Stir in 2 teaspoons (11 g) of salt, 1/2 teaspoon (1.5 g) of whole peppercorns, a ⁄2 inch (1.3 cm) piece of ginger, 2 cloves of garlic, 1 shallot, and 1 bay leaf. The amount of water you'll need will depend on the size of your pot. Cover and simmer the gizzards for 60 to 90 minutes. Turn the burner to high so the water comes to a boil. Then turn the burner down to medium or medium-low so the water bubbles gently. Cover the pot and simmer the gizzards until they soften to your liking. If the pot looks like it's going to boil dry, pour in 1 cup (240 ml) of water. Cool and cut the gizzards if necessary. Turn off the burner and set a strainer in the sink. Slowly pour the gizzards into the strainer to drain away the water. Leave the gizzards to cool in the strainer until they're comfortable to handle. Then cut them into bite-sized pieces. If you prefer, you could leave the gizzards in larger pieces. Soak the skewers in water for at least 15 minutes. Put 12 to 15 bamboo or wooden skewers into a long shallow dish. Then pour enough water to cover the skewers completely and let them soak while you finish preparing the gizzards. Soaking the skewers will keep them from catching fire on the grill. Heat a gas grill or charcoal grill to high. If you're using a gas grill, turn it to high. If you're using a charcoal grill, fill a chimney with briquettes and light them. When the coals become hot and slightly ashy, dump them in the center of the grill. Thread the gizzards onto the soaked skewers. Drain the water from the skewers and slide the drained gizzards onto them. You should be able to make 12 to 15 kebabs. Combine the ketchup, Sriracha, mustard, and honey in a small bowl. Measure 2 tablespoons (34 g) of ketchup, 2 tablespoons (34 g) of Sriracha sauce, 1/4 cup (62 g) of mustard, and 1/4 cup (85 g) of honey into a bowl. Use a spoon or whisk to combine the sauce. Grill the gizzards for 4 minutes and turn them once. Put the gizzards on the grill and brush them with the sauce. Turn the gizzards about halfway through the cooking time so they grill evenly. Brush them with more sauce if you'd like. Remove and serve the Filipino gizzards. Use tongs to transfer the grilled gizzards to a serving plate. Serve the Filipino gizzards immediately along with rice, noodles, or a salad. You can store leftover gizzards in an airtight container in the refrigerator for up to 3 to 4 days.",
    "sentences": [
        " Making Gizzard and Pepper Kebabs Combine the oil, garlic, sauce, sugar, vinegar, and tomato sauce.",
        "Pour ⁄2 cup (120 ml) of oil into a large bowl along with 1 teaspoon (4.9 ml) of vinegar and 1 cup (225 g) of tomato sauce.",
        "Stir in 1 sliced garlic clove, ⁄2 cup (120 ml) of Worcestershire sauce and 4 tablespoons (50 g) of dark brown sugar until the marinade is combined.",
        "You can use olive, coconut, or vegetable oil.",
        "Try using white or apple cider vinegar for the marinade.",
        "Clean 1 ⁄4 pounds (570 g) of chicken gizzards.",
        "Rinse any blood or debris off of the gizzards and set them on a cutting board.",
        "Cut each gizzard in half lengthwise and then rinse out the centers to remove debris.",
        "Pull away and discard the tough yellow lining from each gizzard.",
        "You'll need to use your fingers to rub the debris free from the gizzards as you rinse.",
        "Stir in the gizzards and refrigerate them for 45 to 60 minutes.",
        "Put the cleaned gizzards into the bowl with the marinade.",
        "Stir to coat them with the mixture and then cover the bowl with plastic wrap.",
        "Refrigerate the gizzards in the marinade so they soften and become flavorful.",
        "Soak the skewers in water for at least 15 minutes.",
        "Place 14 to 15 bamboo or wooden skewers into a long shallow dish.",
        "Cover the skewers with water and leave them to soak at room temperature while you prepare the peppers and the grill.",
        "Soaking the skewers will ensure they don't burn when you put them on the grill.",
        "Chop 4 bell peppers.",
        "Rinse 2 yellow and 2 red peppers.",
        "Trim the stems and discard the seeds from the center of each pepper.",
        "Then use a sharp knife to cut each pepper into 2 in (5 cm) chunks.",
        "If you prefer, you can also use orange or green bell peppers.",
        "Heat a gas or charcoal grill to high.",
        "Turn a gas grill to high or fill a chimney with briquettes.",
        "Light the briquettes and dump them in the center of the grill once they're hot and ashy.",
        "Thread the gizzards and peppers on the skewers.",
        "Remove the gizzards from the marinade and drain the water from the skewers.",
        "Slide 1 gizzard onto the skewer and then thread 1 to 2 pieces of pepper.",
        "Continue to alternate threading gizzards with peppers.",
        "You should be able to make 14 to 16 kebabs.",
        "Put the kebabs on the grill and brush them with the marinade.",
        "Arrange the kebabs on the hot grill and use a basting brush to coat them with the marinade.",
        "Keep the lid off of the grill so you can turn the kebabs frequently.",
        "Grill the kebabs for 12 to 15 minutes.",
        "Set a timer for 12 to 15 minutes and turn the kebabs every few minutes so the gizzards cook evenly.",
        "The gizzards should look slightly crisp around the edges and the peppers will char.",
        "To ensure the gizzards have finished cooking, insert an instant-read meat thermometer.",
        "They should reach 165 °F (74 °C).",
        "Remove and serve the gizzard kebabs.",
        "Use tongs to transfer the kebabs to a serving platter.",
        "Consider serving them with boiled or grilled sweet corn and salad.",
        "Refrigerate the leftover gizzard kebabs in an airtight container for up to 3 to 4 days.",
        "Grilling Filipino Gizzards (Balon–Balonan) Clean 1.1 pounds (500 g) of chicken gizzards.",
        "Rinse away blood and debris before putting the gizzards on a cutting board.",
        "Slice each gizzard in half lengthwise and then rinse out the centers to get rid of debris.",
        "Pull off and discard the tough yellow lining from each gizzard.",
        "Loosen the debris by rubbing your fingers over the gizzards as you rinse.",
        "Soak the gizzards in ⁄2 cup (120 ml) of vinegar for 10 minutes.",
        "Put the gizzards in a bowl and pour the vinegar over them.",
        "Leave them to rest for 10 minutes.",
        "Then drain the gizzards and rinse them with water.",
        "Mix the gizzards with water, salt, pepper, ginger, garlic, shallot, and bay leaf.",
        "Cover the gizzards with enough water so they're covered.",
        "Stir in 2 teaspoons (11 g) of salt, 1/2 teaspoon (1.5 g) of whole peppercorns, a ⁄2 inch (1.3 cm) piece of ginger, 2 cloves of garlic, 1 shallot, and 1 bay leaf.",
        "The amount of water you'll need will depend on the size of your pot.",
        "Cover and simmer the gizzards for 60 to 90 minutes.",
        "Turn the burner to high so the water comes to a boil.",
        "Then turn the burner down to medium or medium-low so the water bubbles gently.",
        "Cover the pot and simmer the gizzards until they soften to your liking.",
        "If the pot looks like it's going to boil dry, pour in 1 cup (240 ml) of water.",
        "Cool and cut the gizzards if necessary.",
        "Turn off the burner and set a strainer in the sink.",
        "Slowly pour the gizzards into the strainer to drain away the water.",
        "Leave the gizzards to cool in the strainer until they're comfortable to handle.",
        "Then cut them into bite-sized pieces.",
        "If you prefer, you could leave the gizzards in larger pieces.",
        "Soak the skewers in water for at least 15 minutes.",
        "Put 12 to 15 bamboo or wooden skewers into a long shallow dish.",
        "Then pour enough water to cover the skewers completely and let them soak while you finish preparing the gizzards.",
        "Soaking the skewers will keep them from catching fire on the grill.",
        "Heat a gas grill or charcoal grill to high.",
        "If you're using a gas grill, turn it to high.",
        "If you're using a charcoal grill, fill a chimney with briquettes and light them.",
        "When the coals become hot and slightly ashy, dump them in the center of the grill.",
        "Thread the gizzards onto the soaked skewers.",
        "Drain the water from the skewers and slide the drained gizzards onto them.",
        "You should be able to make 12 to 15 kebabs.",
        "Combine the ketchup, Sriracha, mustard, and honey in a small bowl.",
        "Measure 2 tablespoons (34 g) of ketchup, 2 tablespoons (34 g) of Sriracha sauce, 1/4 cup (62 g) of mustard, and 1/4 cup (85 g) of honey into a bowl.",
        "Use a spoon or whisk to combine the sauce.",
        "Grill the gizzards for 4 minutes and turn them once.",
        "Put the gizzards on the grill and brush them with the sauce.",
        "Turn the gizzards about halfway through the cooking time so they grill evenly.",
        "Brush them with more sauce if you'd like.",
        "Remove and serve the Filipino gizzards.",
        "Use tongs to transfer the grilled gizzards to a serving plate.",
        "Serve the Filipino gizzards immediately along with rice, noodles, or a salad.",
        "You can store leftover gizzards in an airtight container in the refrigerator for up to 3 to 4 days."
    ]
}